{
  "id": "0320178b55ec4f91b54637d0b4bbae50",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.getrichslowly.org/retirement-planning-guide/",
      "Title": "Free retirement planning guide from Vanguard Get Rich Slowly",
      "Selection": "Free retirement planning guide from Vanguard\n\n posted by J.D. Roth on 24 April 2018  Leave a Comment \n\nVanguard, the mutual fund company, recently published a free retirement planning guide for folks like me who aren’t interested in hiring a professional financial advisor. Vanguard’s Roadmap to Financial Security is a 32-page document intended to provide DIY investors with a framework for decision-making in retirement.\n\nHere’s an excerpt from the intro to this retirement planning guide:\n\nRetirement is complex. In the face of often competing goals and numerous risks, the choices can be overwhelming, leaving many retirees unsure of where to begin. To help balance the many decisions to be made, we have constructed a retirement planning framework that allows retirees to capture their unique priorities and use their financial resources in a way that best aligns with achieving their goals and mitigating their risks.\n\nLike me, Vanguard believes that retirement planning starts by setting goals. What do you want to get out of life? In the case of retirement, how much do you want to spend on basic living expenses? How much do you want to have set aside for “contingencies”? How much do you want to spend on fun? How much do you want to leave after you die?\n\nNext, Vanguard’s retirement planning guide spends six pages exploring the risks of retirement and how to mitigate them. According to Vanguard, there are five primary risks in retirement:\n\nMarket risk, the possibility of losing purchasing power due to movements in the financial markets.\n\nHealth risk, a combination of your physical condition and your ability to pay for needed care.\n\nLongevity and mortality risk, which are two sides of the same coin: living longer than expected, or dying sooner than anticipated.\n\nEvent risk, those unexpected occurrences that cost big bucks.\n\nTax and policy risk, the odds that governmental and economic forces will have an impact on your retirement planning.\n\nThe next stop on Vanguard’s retirement planning roadmap is assessing your financial resources. How much have you saved? Do you have access to private pensions or annuities? What kind of insurance do you have? What’s your asset allocation? How will you spend your money in retirement? Will you work during retirement? (There are those who would argue that if you’re working, you’re not retired. I disagree. As we discussed a few weeks ago, there’s no single definition of retirement, and only one definition involves not working.)\n\nThe Vanguard retirement planning guide spends some time talking about home equity and how it relates to wealth. This is a fascinating subject, something GRS readers often discuss in the comments, and something that comes up all of the time at various early retirement events I attend. Most retirees hold a high percentage of their wealth in home equity. Should this value be considered when evaluating your net worth? When making plans for retirement spending? It’s an interesting question that we’ll have to explore further in the future.\n\nThe final stop on Vanguard’s retirement roadmap is developing a plan. After you’ve set goals, evaluated risks, and assessed your assets, it’s time to pull all of this info together to create a financial strategy.\n\n\n\n\n“There’s no universal formula for building the optimal retirement plan,” Vanguard writes. “The right mix of resources should be tailored to each household or individual. It should take into account the relative importance of competing goals and the risks that a retiree may be susceptible or sensitive to.”\n\nThe ultimate aim, says this retirement planning guide, is to obtain financial security, to know financial peace during your golden years.\n\nVanguard’s Roadmap to Financial Security isn’t complex and it’s not earth-shattering. It’s a simple and useful framework for retirement planning. If, like me, you do most of your own financial planning, I suspect you’ll find it thought-provoking.\n\n[via The Oblivious Investor]\n\n\n\n",
      "Folder": "Feedly",
      "Timestamp": "1524876752",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.474927Z"
}