{
  "id": "0387a3ef76e94fc2beb98756b36b45aa",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/policy-and-politics/2016/12/6/13797404/opportunities-parents-children-immigrants-education-salaries",
      "Title": "Not everyone gets more opportunities than their parents. But the children of immigrants do. Vox - All",
      "Selection": "Even though some studies have indicated that recent immigrants and their children have struggled to make their lives better in the US, the Census has recently found (using 2013 data) that upward mobility still exists.\n\nChildren of immigrants are more likely to be college educated, have better paying jobs, and are less likely to live in poverty than their parents. \n\nThat said, these material gains aren’t equally enjoyed by all newcomers or spread equally across generations. Women, in particular, are at a severe disadvantage. \n\nImmigrants are less likely to have a high school degree than the general population, but their children lead in educational achievement\n\nThe overwhelming majority of Americans now graduate from high school. According to the latest Census count, 88 percent of people 25 years and older have a high school diploma or an equivalent degree.\n \nHowever, only 72 percent of first-generation immigrants are high school graduates and even fewer have graduated from college (30 percent). \n\nBut what first-generation immigrants lack in education, their children more than make up. The Census found that 91 percent of second-generation Americans graduated from high school, which is higher than the national average.\n\nWhat’s more, second-generation Americans are far more likely to have graduated from college and earned a master’s degree than other Americans, too:\n\nThat said, when we look at third-generation or later Americans, educational gains are no longer substantially above average. But this kind of stabilization between second- and third-generation Americans is fairly normal.\n \nResearchers Brian Duncan and Stephen Trejo found in their 2015 assessment that the children of the first-generation immigrants experience the most substantial gains, with very little socioeconomic advantage passed between second-generation parents and their children.\n\nDuncan and Trejo argue that this happens because a smaller education gap exists between second-generation parents and their children. What’s more, Americanizing influences that benefited the second generation — growing up speaking English, attending US schools — are no longer new experiences for their children; rather, they are now the norm.\n\nImmigrants are more likely to perform low-skilled, underpaid work, but their children and grandchildren aren’t\n\nNearly 80 percent of the US’s office jobs and management positions are held by third and later generation Americans. By comparison, first-generation Americans are disproportionately likely to hold lower-income jobs:\n\nFor instance, for every five workers in farming, fishing, and forestry, at least two are first-generation immigrants. And in construction and service jobs, first generation immigrants make up nearly a quarter. Overall, first generation immigrants make up a fraction of the total working population: 16.4 percent.\n\nIn 2012, the median household income for first-generation Americans was $45,475, compared with $51,291 for the second generation and $51,853 for the third and later generation. \n\nDespite the positive gains income across generations, there was one negative trend: men making more than women.\n\nIn the first generation, men made 16 percent more than women. But by the time Americans reached the third and later generation, men make 28 percent more on average. So it seems that the American Dream may still be more accessible to some than others.\n",
      "Folder": "Feedly",
      "Timestamp": "1481081030",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.684735Z"
}