{
  "id": "03f02ac353a44551b0d21a1b1efe6fea",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.fangraphs.com/blogs/top-21-prospects-chicago-white-sox/",
      "Title": "Top 21 Prospects Chicago White Sox FanGraphs Baseball",
      "Selection": "Below is an analysis of the prospects in the Chicago White Sox farm system. Scouting reports are compiled with information provided by industry sources as well as from my own observations. The KATOH statistical projections, probable-outcome graphs, and (further down) Mahalanobis comps have been provided by Chris Mitchell. For more information on the 20-80 scouting scale by which all of my prospect content is governed you can click here. For further explanation of the merits and drawbacks of Future Value, read this. -Eric Longenhagen\n\nThe KATOH projection system uses minor-league data and Baseball America prospect rankings to forecast future performance in the major leagues. For each player, KATOH produces a WAR forecast for his first six years in the major leagues. There are drawbacks to scouting the stat line, so take these projections with a grain of salt. Due to their purely objective nature, the projections here can be useful in identifying prospects who might be overlooked or overrated. Due to sample-size concerns, only players with at least 200 minor-league plate appearances or batters faced last season have received projections. -Chris Mitchell\n\nOther lists: NL West (ARI, COL, LAD, SD, SF), AL Central (MIN, CLE)\n\nWhite Sox Top Prospects\n\nRk\n\nName\n\nAge\n\nHighest Level\n\nPosition\n\nETA\n\nFV\n\n1\n\nZack Collins\n\n21\n\nA+\n\nC\n\n2018\n\n50\n\n2\n\nCarson Fulmer\n\n22\n\nMLB\n\nRHP\n\n2017\n\n50\n\n3\n\nZack Burdi\n\n21\n\nAAA\n\nRHP\n\n2017\n\n50\n\n4\n\nAlec Hansen\n\n22\n\nA\n\nRHP\n\n2020\n\n45\n\n5\n\nSpencer Adams\n\n20\n\nAA\n\nRHP\n\n2019\n\n45\n\n6\n\nJordan Stephens\n\n24\n\nA+\n\nRHP\n\n2019\n\n40\n\n7\n\nCharlie Tilson\n\n23\n\nMLB\n\nOF\n\n2017\n\n40\n\n8\n\nJameson Fisher\n\n22\n\nR\n\nLF\n\n2019\n\n40\n\n9\n\nBernardo Flores\n\n21\n\nR\n\nLHP\n\n2020\n\n40\n\n10\n\nAlex Call\n\n22\n\nA\n\nOF\n\n2020\n\n40\n\n11\n\nTrey Michalczewski\n\n21\n\nAA\n\n3B\n\n2019\n\n40\n\n12\n\nJake Peter\n\n23\n\nAAA\n\nINF\n\n2017\n\n40\n\n13\n\nLuis Martinez\n\n21\n\nR\n\nRHP\n\n2020\n\n40\n\n14\n\nAdam Engel\n\n24\n\nAAA\n\nCF\n\n2017\n\n40\n\n15\n\nLuis Curbelo\n\n19\n\nR\n\n3B\n\n2021\n\n40\n\n16\n\nJacob May\n\n24\n\nAAA\n\nCF\n\n2017\n\n40\n\n17\n\nMichael Ynoa\n\n25\n\nMLB\n\nRHP\n\n2017\n\n40\n\n18\n\nBrian Clark\n\n23\n\nAAA\n\nLHP\n\n2017\n\n40\n\n19\n\nJordan Guerrero\n\n22\n\nAA\n\nLHP\n\n2019\n\n40\n\n20\n\nChris Beck\n\n26\n\nMLB\n\nRHP\n\n2017\n\n40\n\n21\n\nTyler Danish\n\n22\n\nMLB\n\nRHP\n\n2017\n\n40\n\n50 FV Prospects\n\n1. Zack Collins, C\n\nVideo\n\nDrafted: 1st Round, 2016 from Miami\n\nAge\n\n22\n\nHeight\n\n6’3\n\nWeight\n\n220\n\nBat/Throw\n\nL/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/40\n\n60/60\n\n40/60\n\n30/20\n\n40/45\n\n50/50\n\nRelevant/Interesting Metrics\nPosted .544 OBP at Miami in 2016.\n\nScouting Report\nA trusted scout has repeated to me ad nauseum that context is an essential variable to consider when evaluating catchers, particularly those who have played long seasons. Collins looked bad behind the plate in the Fall League. He was slow, immobile, and had issues receiving the ball. He was also wrapping up a season that had begun in February and included 66% more games than he’d played at Miami as a sophomore — all while catching an entirely new staff of pitchers. As such, it seems prudent to ingest what we saw in the AFL with a pillar of salt and lean more heavily on what amateur scouts saw from him this spring.\n\nReviews coming out of Coral Gables weren’t uniformly gushing, but more positive than what I saw during the Fall. Even if his defense was still comfortably below average for a catcher, scouts with a history of seeing Collins were at least encouraged by the steps he had taken between his sophomore and junior years. His arm strength is average, and Chicago is working to get him out of his crouch faster so it plays that way. His receiving and ball-blocking have both improved. Those willing to extrapolate from this spring’s developments think Collins can be passable as a defensive catcher.\n\nIf Collins can’t remain at catcher, he still has a power/approacsh combination that could profile at first base or as a DH. He has terrific plate discipline and breaking-ball recognition and runs deep counts. His plus raw power forces pitchers to nibble and Collins takes full advantage of this, lying in wait for something to destroy once he’s worked the count into his favor. Collins finished his junior year at Miami with a .544 OBP. That was good enough for second in Division-I behind only Jameson Fisher, whom Chicago drafted three rounds later. The power plays from pole to pole and Collins creates lift consistently with a lofty, uppercut bat path and has plus bat speed.\n\nCollins does swing and miss a bit due to excessive movement in his hands as he sets up his swing. He might only top out as an average hitter, but I think he’ll still get to the power consistently because of the swing path and approach.\n\nI count myself among those who are skeptical about Collins’ chances of catching and he’s a bit riskier than most high-end college draftees because his fall on the defensive spectrum should he have to move is obviously extreme. Even if he’s only catching part-time, there’s extra value in that. He has a chance to be an above average everyday player, more than that if he can somehow become an average defensive catcher.\n\n2. Carson Fulmer, RHP\n\nVideo\n\nDrafted: 1st Round, 2015 from Vanderbilt\n\nAge\n\n23\n\nHeight\n\n6’0\n\nWeight\n\n195\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCutter\n\nCommand\n\n55/60\n\n50/55\n\n55/60\n\n50/55\n\n35/45\n\nRelevant/Interesting Metrics\nRecorded 51 walks in 87 Double-A innings.\n\nScouting Report\nArguably the most polarizing draft prospect of the decade, Carson Fulmer and his control/command issues sparked great debate during the spring of 2015. If you were concerned about Fulmer’s long-term ability to throw strikes and regarded him as a reliever, he was likely a late-first-round prospect for you, at best. If you thought Fulmer would throw enough strikes to start, he and his bevy of plus pitches profiled as a slam-dunk top-10 pick. Fulmer was ranked fifth overall on Kiley McDaniel’s draft board at this very website and 43rd on Keith Law’s draft board over at ESPN.\n\nWe’re a year and a half removed from that draft (Fulmer went eighth overall), Carson Fulmer has debuted in the big leagues, and yet the debate remains unresolved. There are still those who believe Fulmer will eventually throw enough strikes to start and those who think he’s destined for a high-leverage bullpen role.\n\nFulmer’s first season in pro ball was rife with wildness. His 12% walk rate was higher than any qualified MLB starter’s in 2016. His delivery, which he struggles to repeat, is explosive, violent and features a pretty brutal head whack. But significantly altering one of the more unique deliveries in baseball risks robbing Fulmer of the stuff that’s gotten him this far. We saw signs of how Fulmer and the White Sox are dealing with this wildness and with an inherently wild delivery.\n\nFirst, Fulmer is using his cutter more often and earlier in counts to try to induce weak contact and operate more efficiently. The cutter is average right now, mostly 88-91, but arguably has more projection than I’ve placed on it, especially if its usage remains a focus for Fulmer moving forward. Fulmer has also recently altered his changeup grip to try to increase velo separation from his fastball. The change was often 86-87 with some arm-side movement but lacking dive. Fulmer’s arm speed and nascent feel for creating movement allow it to project as a plus pitch for me.\n\nTwo aspects of Fulmer’s repertoire took a step backward in 2016. His average fastball velo sat down around 93, a bit beneath where it was in college. He was 93-94 for me at the Futures Game and was topping out around 95 in relief appearances this season. The White Sox made a late-season adjustment hopping to add plane to Fulmer’s otherwise flat fastball. He averaged 2200 rpms on the heater in the big leagues. Also notable: Fulmer’s curveball was less consistent in 2016 than it was in college. He struggled to get on top of it with regularity to create the depth needed to compete in the strike zone. When he was burying it beneath the zone it was fine.\n\nSeveral aspects of Fulmer’s arsenal were under construction last year and that alone is reason for continued patience with the prospect. He still has a No. 3 starter’s upside if he can harness his stuff, but it’s already quite clear that a path to that kind of value requires adjustments. Not everyone thinks that’s a good idea, and some would rather see the Vanderbilt iteration of Fulmer pitching in a multi-inning relief role where he can be wild and creative but still produce more value than a one-inning reliever — even a high-leverage one. That one-inning relief role is probably his floor, and Fulmer has already been to the big leagues, so he’s a relatively low-risk prospect in general — even if there’s still great risk that he’s not a starter.\n\nKATOH+ Projection for first six years: 1.2 WAR\n\n3. Zack Burdi, RHP\n\nVideo\n\nDrafted: 1st Round, 2016 from Louisville\n\nAge\n\n22\n\nHeight\n\n6’3\n\nWeight\n\n210\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n80/80\n\n50/60\n\n50/60\n\n35/40\n\nRelevant/Interesting Metrics\nHas recorded 51 strikeouts in 38 pro innings.\n\nScouting Report\nIf you watch the linked video of Burdi’s first pro appearance, you’ll hear players from the Mariners’ and White Sox’ AZL clubs giggling and marveling at the radar-gun readings Burdi is producing during warmups. Many of the first phrases learned by Latin American teenagers after coming to the U.S. are (unsurprisingly) related to baseball and you can hear them being deployed as Burdi gets loose.\n\nBurdi’s fastball was 98-100 in that outing and typically sits in the 96-100 range, even when he’s dialing down to throw a strike. The White Sox have had him focusing on the tempo of his delivery in hopes that it will help him maintain more mechanical consistency and throw more strikes. His control is currently below average.\n\nDespite lackluster command, Burdi could probably pitch in the big leagues right now. It’s an elite fastball and his slider, which varies in shape and comes in anywhere between 86-92 mph, flashes plus and shows hilarious length for how hard it is. His changeup also flashes plus and has great arm-side movement despite upper-80s velocity.\n\nThis repertoire plays as a starter (of course, it’d be foolish to assume Burdi’s stuff would be as explosive if he were to be stretched out), but Burdi’s command issues have him ticketed for relief. He reached Triple-A last year and, barring injury, is very likely to debut in the big leagues in 2017. I have a 50 FV on him, which means I think he’ll be worth roughly two wins annually. Only 20 relievers produced 1.5 WAR or more in 2016.\n\n45 FV Prospects\n\n4. Alec Hansen, RHP\n\nVideo\n\nDrafted: 2nd Round, 2016 from Oklahoma\n\nAge\n\n22\n\nHeight\n\n6’7\n\nWeight\n\n236\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\n60/70\n\n55/60\n\n50/55\n\n40/45\n\n30/45\n\nRelevant/Interesting Metrics\nRecorded 185 strikeouts, 96 walks in 145 career innings at Oklahoma.\n\nScouting Report\nHansen was viewed as a candidate for the top overall pick in the 2016 draft heading into his junior year despite strike-throwing issues as a sophomore. He was even more inconsistent in 2016 and had some starts pushed back due to various ailments — and still also had issues throwing strikes. I was at Hansen’s start against UCLA in March, his best at OU, where he was sitting 91-96, touching 98, and generally throwing strikes. He flashed a plus slider. Every bit of what had been so intriguing to teams the spring before was still in there, Hansen just didn’t show it very often as a junior and he fell into the second round as a result.\n\nHansen began to show improvements as soon as he took to a professional mound, and he dominated the low levels of the minors with overpowering stuff the way a college power pitcher is supposed to. His fastball will climb into the upper 90s and back down into the 92-94 range later in starts. He has some drop and drive to his delivery but still generates downhill plane because of his height. Chicago worked to break his hands earlier and prevent arm drag. His slider, a late-breaking 85-88 mph dart, projects to plus. When I saw Hansen’s first pro appearance, he was working more frequently with his curveball, currently average, with moderate depth and bite. It should at least be an effective change of pace and will help Hansen negotiate opposing lineups multiple times, but some scouts think it will be his best secondary.\n\nHansen’s changeup is way behind right now because he very rarely got himself into changeup counts in college. He shows some nascent feel for it, but it’s clearly below average, and its development is heavily dependent on Hansen’s future ability to throw strikes.\n\nThe volatile nature of Hansen’s health, stuff and performance makes him incredibly risky for a college draftee, but the upside here is obviously huge. He could be a No. 2 starter if everything comes together, and the chances of that occurring are much better now than they were in April. Don’t believe for one second that Hansen’s floor is a high-leverage reliever, though: there’s a chance the control issues remain so troublesome that he never gets there at all. For now, though, Chicago clearly acquired a player with a ceiling much higher than is typical for the 49th pick in the draft and had him trending in the right direction with just a few months of competent instruction.\n\nKATOH+ Projection for first six years: 5.5 WAR\n\n5. Spencer Adams, RHP\n\nVideo\n\nDrafted: 2nd Round, 2014 from White County HS (GA)\n\nAge\n\n21\n\nHeight\n\n6’3\n\nWeight\n\n171\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n40/45\n\n50/60\n\n40/50\n\n50/60\n\nRelevant/Interesting Metrics\nStrikeout rate dropped to just 11.3% at Double-A.\n\nScouting Report\nI’m a sucker for projectable, multi-sport high-school pitchers and Adams fit that bill as a Georgia prep righty/baskeballer in the 2014 draft. Adams was touching 96 with his fastball in high school while also flashing a plus slider. In three pro seasons since signing, Adams has climbed to Double-A and has had success despite seeing his velocity tick down into the 88-92 range under a heavier pro workload. Some also think the slider has gone backward. Whatever the case, his delivery is easy and repeatable and Adams pounds the strike zone with consistency.\n\nAdams’ safe, early-loaded arm action isn’t the kind typically associated with big velocity. His frame remains thin and projectable and there might be a bit more velocity coming. His deep, two-plane-breaking slider, 80-84 mph, is consistently average and still projects to plus. Not all scouts are sold on the changeup projection. He maintains his fastball arm speed, but the pitch lacks movement and Adams’ arm action isn’t projection-friendly. He’s athletic, and athletes develop, and I suspect (with this particular organization in mind) that we’ll see a fourth pitch added here in the next few years.\n\nI think Adams projects as a sinker/slider mid-rotation starter. He has some inning-eater traits, too. Yes, his velocity has backed up since signing, but he’s been quite healthy, just missing time this year with an ankle injury.\n\nKATOH+ Projection for first six years: 4.2 WAR\n\n40 FV Prospects\n\n6. Jordan Stephens, RHP\n\nDrafted: 5th Round, 2015 from Rice\n\nAge\n\n24\n\nHeight\n\n6’1\n\nWeight\n\n185\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\n55/55\n\n50/50\n\n55/60\n\n40/45\n\n45/50\n\nRelevant/Interesting Metrics\nThrew 141 innings in 2016 after throwing only 78 in 2015.\n\nScouting Report\nStephens had Tommy John in 2014, had an accelerated rehab, and then was back in 2015 before making 11 starts ahead of the draft. He lasted until the fifth round despite success as Rice because of the injury history and a delivery that might point to a future in the bullpen.\n\nStephens made 27 healthy starts this year, his first full pro season, and threw 141 innings. He made a majority of his starts on a full five days rest, and a few on six or seven days rest. He held his stuff throughout the season and had his best two outings in late August.\n\nStephens sits in the low 90s as a starter, touching 94 on occasion, and he’ll sit 93-96 in abbreviated outings. His fastball lacks plane but has ride and arm-side movement. Stephens’ best secondary pitch is his uniquely shaped curveball, which has a sharp, roller-coaster hump. Stephens pitches up in the zone with both of these. He has an average slider and a below-average changeup that will flash movement but isn’t usually located well. Again, Stephens likes to work up in the zone and is fighting that proclivity when he throws the changeup.\n\nStephens doesn’t have pinpoint command, and probably never will, but lives in and around the zone enough to start, even if he’s a little inefficient. Scouts are worried, however, about Stephens’ size and a lack of use of the lower half in the delivery. Those things, coupled with the injury history, have many thinking Stephens is a bullpen piece. This past season was evidence to the contrary. Stephens projects as a No. 4 or 5 starter if his changeup comes along or if he finds a different way to deal with left-handed hitters. He’s a two-pitch reliever if he doesn’t.\n\nKATOH+ Projection for first six years: 3.8 WAR\n\n7. Charlie Tilson, OF\n\nVideo\n\nDrafted: 2nd Round, 2011 from New Trier HS (IL)\n\nAge\n\n24\n\nHeight\n\n5’11\n\nWeight\n\n175\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n50/60\n\n30/30\n\n30/30\n\n70/70\n\n50/55\n\n45/45\n\nRelevant/Interesting Metrics\nSlashed .282/.345/.407 at Triple-A before trade to White Sox.\n\nScouting Report\nTilson swiped seven bases in three days at the Area Code Games in 2010. St. Louis selected him in the second round of the 2011 draft and gave him $1.275 million to bypass what would’ve been a very talented Illinois roster and head for pro ball. He missed all of 2012 while recovering from surgery to repair a separated (non-throwing) shoulder. As such, Tilson’s pro career only really began at age 20 and he showed no ill-effects from the long layoff. He was hitting .282/.345/.407 at Triple-A before the Cardinals traded him to Chicago for Zach Duke. Tilson was promoted to Chicago immediately following the deal and tore a hamstring in his first game.\n\nTilson was a 70 runner before the injury and his speed played a significant role in his overall skill set. It allowed him to pass in center field, get the most out of his bat-to-ball skills, and do damage on the bases. We won’t know if he’s retained it until next spring.\n\nWhen healthy, Tilson has just average bat speed, no leverage in his swing, and very rarely extends enough to really punish the baseball, resulting in 30-grade game power. But he tracks well, has great eye-hand coordination, and still generates strong contact. His arm is fringe average and fits best in center and left. His ability to play center field while making a lot of contact is probably enough to win him a major-league roster spot, but unless his defense in center greatly outpaces present projections, he only profiles as a bench outfielder or below-average regular.\n\nKATOH+ Projection for first six years: 4.9 WAR\n\n8. Jameson Fisher, LF\n\nDrafted: 4th Round, 2016 from SE LA\n\nAge\n\n23\n\nHeight\n\n6’2\n\nWeight\n\n200\n\nBat/Throw\n\nL/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n40/60\n\n45/45\n\n30/40\n\n45/40\n\n40/50\n\n40/40\n\nRelevant/Interesting Metrics\nHit .424 at Southeast Louisiana this year.\n\nScouting Report\nFisher raked as a sophomore at Southeastern Louisiana, but a shoulder injury, which required surgery, moved him out from behind the plate and forced him to miss his junior year. As a redshirt junior, Fisher hit .424 and led all of Division-I baseball with a .558 OBP.\n\nFisher didn’t last until the fourth round accidentally, though. The combination of his injury history, his lack of position, and the comparatively weak competition of the Southland Conference all caused some hesitation among onlookers. He continued to hit in pro ball, though, and looked great both in the Pioneer League and instructs. Fisher looks like a potential plus hitter. He recognizes breaking balls early and makes in-flight adjustments to them. He tracks pitches well, has good hand-eye, plus bat speed, and a bat path that produces line-drive contact.\n\nFisher’s in-game power output lacks much projection. He’s a pull-heavy line-drive hitter and doesn’t often sell out for power. His body has some room for added mass but his approach, if it goes unchanged, probably only allows for 12-15 homers at peak.\n\nFisher is limited to left field because of him arm strength, which puts an awful lot of pressure on his bat. The average outfielder hit .257/.326/.422 in 2016, something I think is in reach for Fisher, especially if good health and something even close to his college plate discipline have followed him to pro ball. At age 23, he was one of the older draftees from 2016.\n\nKATOH+ Projection for first six years: 0.1 WAR\n\n9. Bernardo Flores, LHP\n\nDrafted: 7th Round, 2016 from USC\n\nAge\n\n21\n\nHeight\n\n6’4\n\nWeight\n\n170\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCutter\n\nCommand\n\n50/55\n\n45/50\n\n45/55\n\n45/50\n\n40/50\n\nRelevant/Interesting Metrics\nHas already recorded more starts in pro ball (11) than during entire collegiate career (8).\n\nScouting Report\nIf not for the way Alec Hansen pitched after signing, Flores would be generating more buzz as the White Sox’ draft coup from 2016. Flores struck out a batter per inning as a sophomore at USC but his velocity was inconsistent as a junior, showing 93-94 some starts and dipping back down to 88-91 in others. He worked more with a cutter in 2016, though it may not be a pitch of focus going forward, and has a projectable four-pitch mix. Flores made more starts in pro ball after he signed than he did in three years at USC, so not only is his arm relatively fresh but his pitches probably feature more projection than one might expect from a typical college arm. He has a good pitcher’s build, pitches with downhill plane, and has feel for a shapely, average curveball and changeup, in addition to the cutter. The changeup was flashing plus in pro ball with great velocity separation from the fastball and arm-side fade. Flores mimics his fastball’s arm speed, as well.\n\nI think, if you’re willing to project on the pitches based on a lack of reps in college, that there’s mid-rotation upside here. The velo fluctuations are concerning, he didn’t blow away rookie-level hitters in 2016, and he’s far from the majors, but I think Flores is one of the most interesting prospects in the system.\n\nKATOH+ Projection for first six years: 0.9 WAR\n\n10. Alex Call, OF\n\nDrafted: 3rd Round, 2016 from Ball St\n\nAge\n\n22\n\nHeight\n\n5’11\n\nWeight\n\n185\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/50\n\n40/45\n\n30/45\n\n55/55\n\n40/45\n\n55/55\n\nRelevant/Interesting Metrics\nLed D-I in total bases at the end of the regular season.\n\nScouting Report\nCall makes hard contact thanks to a good combination of strength, bat speed and inelegant barrel control. He sprays hard contact to all fields and led Division-I baseball in total bases during the 2016 regular season, but he projects as more of an average hitter with fringe game power. He raked in the rookie-level Pioneer League after signing and then moved to Low-A, where he continued to hit but saw a huge shift in his peripheral — a bit of a concern, considering some scouts thought his offensive output as a junior was partially due to weak competition. In seven games against Ole Miss, Oregon State, Miami and LSU in 2016, he hit .230 with a .333 OBP. He has plus-plus makeup.\n\nCall played right field at Ball State in deference to speedy Matt Eppers but saw time in center in pro ball. He’s a 55 runner and could be passable there with reps. Call has an above-average arm and is a likely fourth outfielder with a chance to be a low-end regular, if he somehow either becomes truly average in center field or plus-plus in a corner with reps.\n\nKATOH+ Projection for first six years: 0.7 WAR\n\n11. Trey Michalczewski, 3B\n\nDrafted: 7th Round, 2013 from Jenks HS (OK)\n\nAge\n\n22\n\nHeight\n\n6’3\n\nWeight\n\n210\n\nBat/Throw\n\nS/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/45\n\n50/55\n\n30/40\n\n40/40\n\n45/50\n\n50/50\n\nRelevant/Interesting Metrics\nRecorded .678 OPS at Double-A. Was also just 21 years old, though.\n\nScouting Report\nA good athlete with a great baseball body and gorgeous swing from both sides of the plate, Michalczewski has struggled with upper-level stuff. Scouts think the swing is grooved, especially from the left side, and think a lack of bat control is a potential harbinger of doom for upper-level hitting. He has improved the way he transfers his weight as a left-handed hitter and will show above-average raw power in batting practice from both sides of the plate. In games, his bat isn’t in the hitting zone very long, and the swing path leads to more ground balls than airborne contact, limiting his power output. At just 21, Michalczewski has the time and athleticism to make some adjustments and tap into that power. He’ll need to either do that or improve his ability to make contact if he wants to profile at a corner-infield spot. He has promising defensive footwork and sets himself up nicely to make strong accurate throws, which allows him to extract everything from his average arm.\n\nThere’s an outside chance Michalczewski becomes an average everyday player and, even as a likely repeater of Double-A next year, he has time to develop the host of traits he’ll need to play every day in the majors. The more likely outcome here is that of a high-end four-corners bench bat, but even that outcome will require some tweaks and development over the next few years.\n\nKATOH+ Projection for first six years: 1.3 WAR\n\n12. Jake Peter, INF\n\nVideo\n\nDrafted: 7th Round, 2014 from Creighton\n\nAge\n\n24\n\nHeight\n\n6’1\n\nWeight\n\n185\n\nBat/Throw\n\nL/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n50/55\n\n40/40\n\n20/30\n\n50/40\n\n45/50\n\n50/50\n\nRelevant/Interesting Metrics\nRecorded .378 OBP in first half of the season at Double-A before promotion.\n\nScouting Report\nPeter tracks pitches well, has good bat control, and a simple, low-maintenance swing that produces lots of contact. He lacks the bat speed and mechanical elements of power that he’d need to profile at the positions he’s capable of playing full time. Peter plays all over. He saw time at every infield position, left and right field in 2016. He fits best at the corners and is fine at second base. He profiles as a bat-first utility man. Peter pitched early in his career at Creighton but had arm issues in college that led to a transition to full-time hitting. He’s an average runner.\n\nKATOH+ Projection for first six years: 1.6 WAR\n\n13. Luis Martinez, RHP\n\nSigned: July 2nd Period, 2011 from Venezuela\n\nAge\n\n21\n\nHeight\n\n6’6\n\nWeight\n\n190\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n55/60\n\n45/50\n\n40/55\n\n40/45\n\nRelevant/Interesting Metrics\nRecorded 141 strikeouts in 137 innings at Low-A.\n\nScouting Report\nA narrow and lanky 6-foot-6, Martinez’s fastball sits in the low 90s and will touch 95 with movement. His slider is average, flashing above, and Martinez made strides with his changeup this season. He has issues repeating his arm slot (not uncommon for a young arm this size), which negatively impacts the consistency of his secondaries and his ability to throw strikes. He had Tommy John and missed all of 2012 and 2013. Obviously the medical resume adds to the risk profile here, but missing two years of in-game pitching also means that, at 21, there’s still plenty of pitch projection remaining. There’s a chance Martinez ends up in a bullpen, but he also has a shot to be a No. 4 or 5 starter if things come together. He inched closer to that reality in 2016.\n\nKATOH+ Projection for first six years: 1.6 WAR\n\n14. Adam Engel, CF\n\nDrafted: 19th Round, 2013 from Louisville\n\nAge\n\n25\n\nHeight\n\n6’2\n\nWeight\n\n210\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n40/50\n\n45/45\n\n20/30\n\n80/80\n\n60/60\n\n40/40\n\nRelevant/Interesting Metrics\nStruck out in 31% of plate appearances at Triple-A.\n\nScouting Report\nEngel is a baseball rat with tremendous speed and leaping ability that make him a potential plus defender in center field. He has experience in left field going back to college and is already plus there. His arm strength limits him to those two positions, ideally, but he’s obviously fast enough to play rangy, plus defense in right independent of arm strength.\n\nOffensively, Engel’s linear swing produces lots of ground balls and very little in-game power. While he has solid-average bat speed, Engel’s swing can get long, causing tardiness. Scouts are skeptical about his bat control and think poor feel for the barrel leads to some of the ground balls and pop ups Engel frequently produces.\n\nIt’s unlikely that Engel’s slash-and-run tendencies will continue to play in the big leagues, where pitchers and defenses are better equipped to deal with them. He projects as a fourth or fifth outfielder and pinch-runner.\n\nKATOH+ Projection for first six years: 3.1 WAR\n\n15. Luis Curbelo, 3B\n\nVideo\n\nDrafted: 6th Round, 2016 from Cocoa HS (FL)\n\nAge\n\n19\n\nHeight\n\n6’1\n\nWeight\n\n185\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n20/40\n\n55/60\n\n20/50\n\n50/40\n\n40/60\n\n50/55\n\nRelevant/Interesting Metrics\nNone, raw teenager in Rookie-level ball.\n\nScouting Report\nI saw Luis Curbelo take batting practice and infield at the PG All-American Game last year and thought he’d end up going early in the first round. He was fluid, athletic, had great footwork and projectable arm strength that I thought would be worthy of the infield’s left side with some alterations to the arm action. Curbelo also took one of the more explosive BPs at the event, showing above-average in-game power potential if everything clicked.\n\nBut Curbelo’s timing at the dish is raw and his breaking-ball recognition is poor. He didn’t play well during his senior season the following spring, had what was thought to be a strong commitment to Miami, and he ultimately fell to the sixth round as a result. He did get a significant over-slot bonus ($700,000).\n\nCurbelo badly needs reps, but all of the physical tools for impact are there. He’s an average runner but will likely slow down as he fills out, and he projects defensively to third base. He has the physical tools to be plus there in time. He saw reps at second and short in 2016. Curbelo projects to plus raw pull power. He has a natural and graceful, but explosive, swing during batting practice that creates fence-threatening contact with regularity. In games, the bat isn’t in the zone very long and Curbelo’s feel for the barrel and his balance are both poor. The gap between what he might be (a good defensive third baseman that hits 18-plus homers annually) and now is a yawning chasm. He could be an above average everyday player and also might never see Double-A.\n\n16. Jacob May, CF\n\nDrafted: 3rd Round, 2013 from Coastal Carolina\n\nAge\n\n25\n\nHeight\n\n5’10\n\nWeight\n\n180\n\nBat/Throw\n\nS/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n40/50\n\n30/30\n\n20/30\n\n70/70\n\n50/55\n\n40/40\n\nRelevant/Interesting Metrics\nProduced .346 BABIP in Triple-A.\n\nScouting Report\nMay is a plus-plus runner whose speed plays in center field, where he’s an average defender despite middling instincts for the position. He has a 40 arm. May’s swing is similar from both sides of the plate. Some scouts like how simple May’s hands are and think May’s best chance at offensive success are to keep things as quiet as possible to put the ball in play and run. Others think the stiffness in May’s hands not only makes it hard for him to get the bat head out and punish the baseball but also prevents him from getting to fastballs on the inner half. He’s likely maxing out with an average hit tool and 20 or 30 game power. It’s not enough to play every day but fine for a fourth or fifth outfielder. May has outstanding makeup and is quite likely to yield some kind of big-league value.\n\nKATOH+ Projection for first six years: 1.7 WAR\n\n17. Michael Ynoa, RHP\n\nSigned: July 2nd Period, 2008 from Dominican Republic\n\nAge\n\n25\n\nHeight\n\n6’7\n\nWeight\n\n210\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\n60/60\n\n50/50\n\n40/40\n\n40/45\n\n40/40\n\nRelevant/Interesting Metrics\nRecorded average perceived fastball velocity of 95 mph, per Statcast.\n\nScouting Report\nYnoa’s 2008 signing bonus was the most an international amateur had received up to that point. He’d experienced injuries and strike-throwing issues throughout his career before finally landing in a middle-relief role with Chicago. Ynoa sits 93-96 and struggles with his release, leading to wildness. He complements it, primarily, with an upper-80s slider that is above average on pure movement/velo but plays down because Ynoa spikes so many of them. He also throws a low-80s curveball and a rare changeup. If he can compete around the strike zone he’s a solid middle-relief arm, but there’s a chance he doesn’t throw enough strikes to be more than up-and-down bullpen help.\n\n18. Brian Clark, LHP\n\nDrafted: 9th Round, 2014 from Kent St.\n\nAge\n\n24\n\nHeight\n\n6’3\n\nWeight\n\n225\n\nBat/Throw\n\nR/L\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n60/60\n\n50/55\n\n40/40\n\n50/60\n\nRelevant/Interesting Metrics\nRecorded just 4% walk rate at Double-A.\n\nScouting Report\nClark throws a very heavy low-90s fastball and average slider that flashes above. He throws a ton of strikes and locates well enough to get by against righties with just the two viable pitches. There was once a question about whether Clark’s stuff would play at upper levels, but hitters keep pounding the ball into the ground as Clark climbs the minor-league ladder, and the defenses behind him are only getting better. He’s a fairly safe middle-relief prospect despite having just dipped his toes into Double-A.\n\nKATOH+ Projection for first six years: 0.3 WAR\n\n19. Jordan Guerrero, LHP\n\nDrafted: 15th Round, 2012 from Moorpark HS (CA)\n\nAge\n\n23\n\nHeight\n\n6’3\n\nWeight\n\n195\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCommand\n\n45/50\n\n40/45\n\n50/60\n\n40/50\n\nRelevant/Interesting Metrics\nWalk rate increased from 5.6% in 2016 to 12.2% in 2016.\n\nScouting Report\nGuerrero broke out in 2015 after he dealt with shoulder issues during his first two pro seasons and pitched with a limited workload in his third. Double-A hitters were more able to deal with Guerrero’s solid-average stuff and he began to shy away from his fastball, instead leaning more heavily on his changeup, which he’d sometimes throw three or four times in a row. It’s a good changeup, potentially plus, with solid downward fade, but this approach was mostly unsuccessful and Guerrero’s walk and strikeout rates both went backward in 2016. He’s had some issues with velocity fluctuation but mostly sits in the upper 80s or low 90s and will occasionally touch as high as 94. His measureables indicate projection, but the frame is narrow and this might be all there is as far as velocity is concerned. He shows glimpses of an average curveball but it lacks consistent depth right now. Guerrero has adjustments to make but still has a chance to be a back-end starter.\n\nKATOH+ Projection for first six years: 0.7 WAR\n\n20. Chris Beck, RHP\n\nVideo\n\nDrafted: 2nd Round, 2012 from Georgia Southern\n\nAge\n\n26\n\nHeight\n\n6’3\n\nWeight\n\n210\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n60/60\n\n55/55\n\n40/45\n\n45/50\n\nRelevant/Interesting Metrics\nRecorded 4.20 ERA at Triple-A Charlotte.\n\nScouting Report\nMost scouts see Beck as a middle-relief arm now that he’s got an elbow surgery under his belt. He’ll sit 92-95 and touch 96 out of the bullpen with varying amounts of sink. His mid-80s slider has more depth to it than most sliders in that velocity band, but its effectiveness can be limited by how early it breaks. It’s an above-average pitch. Beck’s changeup, 87-91, is below average and functions more like a two-seamer than a bat-missing change, inducing weak contact from lefties.\n\nKATOH+ Projection for first six years: 0.8 WAR\n\n21. Tyler Danish, RHP\n\nVideo\n\nDrafted: 2nd Round, 2013 from Durant HS (FL)\n\nAge\n\n22\n\nHeight\n\n6’0\n\nWeight\n\n205\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n45/45\n\n50/55\n\n50/55\n\n45/50\n\nRelevant/Interesting Metrics\nAllowed .382 BABIP at Triple-A.\n\nScouting Report\nDanish’s velocity has taken a step back and he made his major-league debut this season with a moving fastball sitting in the 89-93 range. The fastball (and all of Danish’s pitches, really) play up a bit due to the funk and deception in his delivery, but that delivery can prevent him from throwing a starter-worthy ratio of strikes. When he’s locating, Danish will run his fastball off the hip off left-handed hitters, throws his slider for strikes, and keep his changeup down in the zone. He has outings where he looks like a potential back-end starter.\n\nBut too often Danish loses the handle on his eccentric delivery and struggles not only to locate but to create consistent movement on his pitches. Scouts who have seen Danish going back to high school think the slider has tacked back a half grade and they don’t see a pitch that will consistently miss bats. Danish looks more like a middle reliever now. It could allow his stuff to play up in bursts and is more forgiving to his wildness.\n\nKATOH+ Projection for first six years: 1.3 WAR\n\n*****\n\nNoteworthy Mahalanobis Comps for 40+ FV Prospects\n\nRank\n\nPlayer\n\nMost Noteworthy Comp\n\n2\n\nCarson Fulmer\n\nGlen Perkins\n\n4\n\nAlec Hansen\n\nJoe Blanton\n\n5\n\nSpencer Adams\n\nMark Buehrle\n\n6\n\nJordan Stephens\n\nBrian Lawrence\n\n7\n\nCharlie Tilson\n\nAustin Jackson\n\n8\n\nJameson Fisher\n\nPedro Swann\n\n9\n\nBernardo Flores\n\nMark Watson\n\n10\n\nAlex Call\n\nMatt Murton\n\n11\n\nTrey Michalczewski\n\nMatt Tuiasosopo\n\n12\n\nJake Peter\n\nCasey McGehee\n\n13\n\nLuis Martinez\n\nDavid Hernandez\n\n14\n\nAdam Engel\n\nRandy Winn\n\n16\n\nJacob May\n\nGary Matthews Jr.\n\n18\n\nBrian Clark\n\nChris Spurling\n\n19\n\nJordan Guerrero\n\nJake Westbrook\n\n20\n\nChris Beck\n\nMickey Callaway\n\n21\n\nTyler Danish\n\nBrad Bergesen\n\n*****\n\nOther Prospects of Note (In Order of Preference)\n\nAmado Nunez, INF, 0.1 KATOH+ WAR – Nunez signed for just shy of $1 million back in 2014 and turns 19 in October. His body has matured quite a bit over the last year or so, and he’s increasingly likely to move off of shortstop. I’ve gotten several 30- to 40-grade run times from Nunez, and I don’t think the range for shortstop is going to be there. His footwork, athleticism and arm strength are all fine, though, and he could be an above-average defender at third base. Offensively, Nunez’s hands have life through contact. His wrists are loose and strong and he can drive the ball to all fields despite poor use of his lower half. The swing and overall approach to hitting are both raw, but I think Nunez has the physical tools to do some damage with the bat if that stuff gets ironed out.\n\nJohan Cruz, SS, 0.7 KATOH+ – An average runner with enough range for shortstop and a plus arm, Cruz also has a good feel for the strike zone and projectable frame that might allow him enough offensive viability to play every day. Cruz has also been constantly injured, however, and hasn’t had played more than 66 games in a season during his entire four-year pro career.\n\nMicker Adolfo, OF, 0.5 KATOH+ – Adolfo has some of the most impressive physical tools in the system and a prototypical right fielder profile with plus raw power, arm strength and an unkempt approach that completely undercuts his ability to perform in games. He’s had issues staying healthy (though some injuries have been of a freakish nature) and hasn’t hit at all in three pro seasons.\n\nThad Lowry, RHP, 3.1 KATOH+ – Lowry has a heavy low-90s fastball and an above-average slider. He lacks a viable changeup, which has been troublesome against left-handed hitting. The issue is compounded by his low arm slot. There’s still a path for Lowry to become a sinker/slider fifth starter because he throws so many strikes, but the stuff is limiting.\n\nDanny Hayes, 1B, 1.3 KATOH+ – Hayes has added a big, smooth leg kick to his swing and it’s helped him create better rotation with his hips and tap into more in-game power. That power, paired with Hayes’ already excellent strike-zone awareness, led to big numbers at Triple-A and much more power than Hayes had ever produced. He has above-average raw power and his uppercut swing allows it to play in games, but the swing path and aggressive stride led to excessive swing and miss in the AFL. Hayes is 26.\n\nYosmer Solorzano, RHP, 2.3 KATOH+ – A pitchability righty with some projection, Soloranzo sits 88-91 with good feel for a curveball and changeup. He could be a back-end starter with middling across-the-board stuff and above-average command.\n\nJhoandro Alfaro, C – Though not as explosive as his older brother Jorge, Jhoandro has some similar traits: a good catcher’s body, some natural raw power and enough arm strength and defensive acumen to stick behind the plate. I had him popping 1.97-2.02 during extended spring training. He’s raw and the power doesn’t play in games at all.\n\nCorey Zangari, 1B, 0.4 KATOH+ – Zangari was somehow named to the 2015 AZL All-Star team as a third baseman despite having never played there that season. He’s a big, first-base-only kid with above-average raw power and a chance to hit enough that it plays. He was pushed to the Sally League after two months in the Pioneer League and really struggled, hitting just .166 at Kannapolis. He has above-average raw power but very little projection remaining on the body. Instead, Zangari will need to spend the next several years working on the consistency of his contact and keeping his mature body in check.\n\nLouie Lechich, LHP – A converted outfielder, Lechich was 88-92 with an above-average changeup during Fall League. He’s athletic, but he doesn’t have a viable breaking ball right now and scouts think he’d need one to fill a relief role.\n\nAaron Schnurbusch, OF, 0.2 KATOH+ – Schnurbusch is a grinder type with a huge 6-foot-5, 235-pound frame. He generates power through strength more than bat speed, is an average runner, has a plus arm, an idea of the strike zone, and keeps things simple enough at the plate that he might hit, too. Scouts wonder how viable the bat path is, but there are tools here, much better tools than typically last until the 28th round. Even if Schunrbusch never becomes a big leaguer, he’s firmly on our radar and was a terrific find that late in the draft.\n\nCourtney Hawkins, OF, 0.0 KATOH+ – Hawkins still has some raw power but has continued to deal with injuries and his numbers went backward across the board as he repeated Double-A. He remains young for the levels at which he’s played, but the book is starting to close here and Hawkins, who physically looks like he’s in his early 30s, was bad in the Fall League. He will be off this list entirely if he doesn’t hit next year.\n\nOmar Narvaez, C, 1.1 KATOH+ – Narvaez has a simple, compact approach at the plate and makes a lot of contact, albeit mediocre contact, to all fields. He has below-average bat speed and produces little power. Narvaez is a solid receiver and game-caller but has a below-average arm. He popped between 2.06 and 2.09 for me this year. He projects as a low-end backup or up-and-down catcher.\n\nJuan Minaya, RHP, 0.8 KATOH+ – Minaya sits 93-95 with some ride and, while he lacks pinpoint command, throws an average amount of strikes. His short, mid-80s slider is average and he’ll occasionally show a below average, low-80s curveball. He’s a fringe middle-relief arm at age 26.\n\nZach Thompson, RHP, 1.8 KATOH+ – A huge 6-foot-7 righty with low-90s velo, Thompson will touch 94 and flash an above-average curveball, but his strike-throwing remains inconsistent. He’s 23 and hasn’t pitched above A-ball.\n\nRobin Leyer, RHP, 0.7 KATOH+ – A good-bodied Dominican righty, Leyer sits 93-95 and will show you 96, with a 40 slider, fringe change, and 30 control.\n\nCistulli’s GuySelected by Carson Cistulli from any player who received less than a 40 FV.\n\nMatt Cooper, RHP, 3.9 KATOH+\n\nCooper appeared among the author’s Fringe Five list once during the 2016 season, but that was due much more to Cooper’s unbridled dominance of opposing batters in the Carolina League rather than any indications that his stuff would actually translate to the majors. Over 13 starts at High-A Winston-Salem, Cooper produced strikeout and walk rates of 31.1% and 6.9%, respectively, in 77.2 innings. At 24, though, he was also old for the league. And he was a former senior sign out of Hawaii. And he was throwing a fastball that mostly sat in the high 80s.\n\nFollowing a promotion to Double-A in June, Cooper preserved the basic complexion of his strikeout and walk numbers (29.4% and 7.5 %, respectively, in 41.0 innings) while also sitting more in the 91-93 range, according to Future Sox. Which, that’s promising. The giant caveat is that he produced those velocity numbers in relief. A second caveat to that first caveat, however, is that he was frequently working in multi-inning stints. So there’s a possible reality, in other words, in which Cooper is able to preserve his newfound velocity while working in starter-length appearances. It’s not a probable reality, but it’s more probable than one might expect given Cooper’s pedigree.\n\n*****\n\nSystem Overview\n\nThis system is thin on impact up top and, while Collins and Fulmer especially have a chance to become high-end regulars, they both have uncertain developmental variables that will play a huge role in determining their ultimate role. If you look at my projected ETA for the prospects in this group, you’ll see that about half of them are predicted either to debut or exceed rookie eligibility next year. Even if the White Sox don’t make a concerted effort to rebuild this offseason, this list is going to look very different a year from now. This is one of the bottom few systems in baseball at the moment, but there are a few reasons for that. First, this club has graduated Carlos Rodon and Tim Anderson from the minors over the past couple years. While neither are considered prospects anymore, they certainly aren’t fully developed as big leaguers. They also didn’t have a second- or third-round pick in the 2015 draft. This system would do well to get younger in general, and Chicago has a great chance to do that with the 12th overall pick in a 2017 draft that appears likely to offer considerable talent at the top of it. This organization is also a well-executed Chris Sale trade away from having a suddenly strong system.",
      "Folder": "Feedly",
      "Timestamp": "1480982817",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.746317Z"
}