{
  "id": "04021cb82abc47ffa43297844c3386eb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://theringer.com/space-jam-oral-history-michael-jordan-bugs-bunny-493bc91a0b9c",
      "Title": "The Completely and Totally True Oral History of ‘Space Jam’ The Ringer - Medium",
      "Selection": "I Believe I Can Fly: The Oral History of ‘Space Jam’\n\nWell, not really\n\n“Thanks, guys. You got a lot of … a lot of … well, whatever it is, you got a lot of it.” — Michael Jordan, Space Jam\n\nSpace Jam, which turns 20 years old this November, is about a collection of famous cartoon characters who find themselves at the precipice of being enslaved by the monsters inhabiting an alien planet. Bugs Bunny, the de facto leader of the Looney Tunes, arranges a basketball game against their would-be captors. If the Tunes win, the aliens return home empty-handed. If the Tunes lose, they become the property of Mr. Swackhammer, an egg-shaped villain who runs a fledgling theme park on a distant planet. (The Tunes will work in his theme park as new attractions.)\n\nTo tilt the game in their favor, the aliens steal the talent of several superstar NBA players (and Shawn Bradley). In response, Bugs arranges for Michael Jordan to join the Tunes’ team. It’s a ridiculous movie and also a perfect movie that has done more than just survive the test of time; it has endured it, and even been strengthened by it. Larry Bird is in it. Jim Rome is in it. An alien shows his dick to a stadium full of people. A cat gets a hole shot through his chest. There’s a lot going on. But how did it all happen? How did this movie get made? And almost not get made?\n\nThis is the oral history of Space Jam.\n\n[Editor’s note: This is a completely satirical exercise and does not reflect the views of the filmmakers, actors, athletes, and cartoon characters depicted herein.]\n\nChapter I.“Get Bugs. If we get Bugs, the rest will follow.”\n\nEnsemble movies pose a unique challenge. Getting several marquee names to work on a project together is no small task. Fortunately, Joe Pytka, who directed Space Jam, and Ivan Reitman, one of the film’s producers, had someone on their side with a little bit of experience in just that sort of thing.\n\nJoe Pytka: I really had no idea how to even start signing people up. You’ve got this script and you see that you need over 15 of the most famous cartoon characters of all time to make it work and it’s just a really overwhelming situation. And were that not enough, you also have to figure out a way to sign up several of the most famous NBA players, too. It was very overwhelming.\n\nAllow the Ringer (Fictional) Playbook to explain how that big backdoor cut from ‘White Men Can’t Jump’ happened.\nIvan Reitman: So you’re like, “How do I do this? Where do I start? What’s the game plan?” I was really stressed out about it. The movie doesn’t work without all the right pieces. You can’t just jumble any ol’ things together and expect it to work. You think Ocean’s Eleven works without Brad Pitt or George Clooney or Matt Damon or Don Cheadle and on and on? Each one of those pieces was vital, even the nerdy tech guy. If any one of those people doesn’t get signed up, the movie just doesn’t work. Imagine Ocean’s Eleven with Hugh Jackman instead of Clooney. It’s a different movie.\n\nPytka: We had our list. We knew we wanted Bugs, Daffy, Porky, etc. We knew we wanted Charles Barkley, Larry Johnson, Muggsy Bogues, etc. In total, it was like 25 or so roles we were trying to fill. That’s a lot of fucking roles. And each one has to be perfect? Come on. I didn’t know what to do. I didn’t know how to do it. Thank god for Michael.\n\nMichael Jordan: I’d been through a similar situation with the Dream Team back in ’92. You’re trying to gather together all of these very talented individuals who have a bunch of other things they’d rather do, so you need a starting point. I told Pytka, “Get Bugs. If we get Bugs, the rest will follow.” So that’s what they did.\n\nBugs Bunny: I’d heard about the movie. I’d talked to my agent about it. They were looking at a few different people for it. Denzel [Washington] was auditioning for Danny DeVito’s part originally. [DeVito voiced Mr. Swackhammer.] That’s what I’d heard, anyway. I was really excited about working with him. I loved him in Malcolm X. So when I heard that he was gonna be a part of Space Jam, I knew I wanted to be involved. I told my agent, “Get me on this movie.”\n\nReitman: That’s a trick I’d learned a long time ago. Any time I had a movie, I’d tell the director to float it out there that we were having Denzel audition. Everyone looks up to Denzel. Even early in his career it was like that. He just has this presence. “Oh shit, Denzel might be in it? Let me get signed on before I miss out.” That’s how I got Stallone to do Stop! Or My Mom Will Shoot in 1992. We told his agent that Denzel was auditioning for the part of Stallone’s dad. Originally it was called Stop! Or My Dad Will Shoot. After we got Stallone signed on, we changed it to Mom. He was pretty pissed. But what are you gonna do? That’s show business.\n\nPytka: So we floated that out there and let it sit for a while. Then we made the call. Bugs jumped right in. It was great. And Mike was right. After we had Bugs attached to it, everyone else fell in line. Daffy, Porky, Foghorn Leghorn, Marvin the Martian, the Tasmanian Devil, Wile E. Coyote, the grandma, Tweety. We were just signing up name after name after name. It was so exciting. Early on, it felt clear that we were gonna do something special.\n\nJordan: The NBA players were easy. They told me who they wanted — it was Barkley, Patrick Ewing, Muggsy, LJ, and a few cameos by some others. I said, “Hey, guys. Let’s get Shawn Bradley.” I thought it’d be funny. I didn’t think they were really gonna do it! I was just joking around. Next thing I know, here comes Bradley walking onto the lot. Have you ever seen Shawn Bradley in regular clothes? It’s the funniest shit you ever saw. It looks like when you hang clothes on a hanger.\n\nTasmanian Devil: We gave Shawn so much shit, man. Every day he was on the set it was like a straight-up Shawn Bradley roast. The best one was one day Daffy told Shawn that he looked like if Shaquille O’Neal’s skeleton had escaped from his body and was running free. I laughed so fucking hard at that one. Poor Shawn. He was a good sport about it, though. He took it all in stride.\n\nShawn Bradley: Taz is rude.\n\nChapter II.“I mean, if you sat me down me down like, ‘Foghorn, one of the Toons in here is speciesist. Guess who.’ I never would’ve guessed Porky.”\n\nWith the cast set, the producers were excited to get everybody together for a table read. What happened was far more intense than anyone had anticipated, and nearly derailed Space Jam before a single scene had even been shot.\n\nFoghorn Leghorn: We’re reading through the scripts, right? We’re on the Warner Bros. lot in some room. Everyone’s sitting around a big table. It’s just regular stuff. There’s sandwiches. It’s a great time. Anyway, we’re all there and we’re all very excited and we’re going over lines from the scene right after halftime, where the Toons come out all fired up and start scoring a bunch of points. It’s a fun part.\n\nSo we’re saying the lines and there’s one little quick line where Sylvester has to say …\n\nSylvester the Cat: “Going up.” That’s the line. I’ll never forget it. It’s two words in a scene that’s, like, two seconds total, but I’ll never forget it.\n\nFoghorn: Me neither.\n\nMarvin the Martian: Whenever I land one of these types of ensemble jobs, I’m always curious to see how everyone’s going to get along when you first get together and start going through things. I’ve been on sets where things were smooth and great and everybody got along perfect. I’ve been on others where you knew real quick that things were gonna be a fucking disaster. It was clear pretty quickly that some of the people on Space Jam weren’t going to get along.\n\nSylvester: In the scene, we were supposed to form a three-person ladder lifting me up to dunk the ball. It was supposed to be Foghorn at the bottom, then Porky in the middle, then me at the top. We all stack up and then as I’m on my way up to dunk I say, “Going up.” Well, if you watch the scene closely, you see that it’s Porky who ended up at the top. You can also see how frustrated I look about it.\n\nWarner Bros.\nFoghorn: We were positioned originally by size. I mean, look at us. Sly’s a little guy, I’m a big guy. Porky, sizewise, he’s the middle point, so it made sense that the director would have him in the middle. But so we get to that part and Porky — outta nowhere — he just fucking loses it. He explodes. “Why do I have to be in the middle? I’m Porky fucking Pig!” Things like that. And at first I thought, OK, I mean, he’s got a point. He is Porky Pig. I thought he was making a fuss because he’s this big star. And that makes sense. You expect that. The guy had been in the business for 60 years by that point. It’d be silly for me to expect him to not have an ego. But it wasn’t that. It wasn’t that at all.\n\n[Porky Pig declined to participate in this story.]\n\nPepe Le Pew: It was ugly.\n\nFoghorn: I say, I say, “Porks, baby, we ain’t stacking up by star power. Everyone knows you’re the man. Everyone knows you’re the top dude. This is just a size thing. I’m big, you’re medium, Sly’s small. That’s all it is.” I’m trying to explain the situation to him, right? And, again, I thought this was just one of those dick-measuring contests. But it wasn’t.\n\nMarvin: The thing you have to remember about Porky is he’s an old-school dude. He started working back in the 1930s. Things were … different back then.\n\nSylvester: He starts shouting all of this stuff about … look, I don’t want to say the exact things he was saying, but I will say that it was some real intolerant stuff.\n\nFoghorn: Fuck that. I’ll say it. I don’t care. He’s shouting about how he’s not letting some cat sit on his shoulders, that it’s pigs who sit on the shoulders of cats, not cats who sit on the shoulders of pigs. “I’m not propping up that cat! That cat props me up!” Things like that. And he’s literally pointing his finger right at Sly while he’s saying it, too. It was just an ugly, ugly scene. And we’re all sitting there like, “Oh my god.”\n\nPepe: We were stunned. All of us. It’s literally our first day together and you’re like, “Hold on. Porky Pig is speciesist?!” Speciesism is a big issue. I’m looking around the room and we got birds, we got bunnies. We got a coyote, we got a Tasmanian devil, we got a duck. I’m a skunk! It’s like, “Who else does he feel this way about?” There was a town hall scene later in the movie and they had me sit next to Porky, and it was real uncomfortable. Porky made a big fuss there about how he had to be in the first row with his hillbilly homies and also how he wouldn’t sit on the same side of the room as Sylvester.\n\nWarner Bros.\nFoghorn: Oh shit, that’s right. I’d forgotten about the town hall scene. Porky was legit advocating for segregation in that scene. He said I could sit on his side because I “had an accent [he] could trust” because I’m from the South.\n\nPatrick Ewing: I knew real fast that I didn’t want to be too involved with Hollywood after what I saw that day.\n\nMarvin: Nobody expected that kind of behavior on set. At least not from Porky, anyway.\n\nFoghorn: I mean, if you sat me down me down like, “Foghorn, one of the Toons in here is speciesist. Guess who.” I never would’ve guessed Porky.\n\nSylvester [to Foghorn]: Who would you have guessed?\n\nFoghorn: Oh, Elmer Fudd, easy. It’s not even a question.\n\n[Everyone laughs.]\n\nSylvester: Porky just wouldn’t let it go. “You can kiss my pig ass if you think I’m propping up that cat, or any cat!” I mean, he’s at full volume. And it’s super testy. Nobody knows what to do.\n\nFoghorn: Sylvester is a better person than me.\n\nSylvester: I just wanted it to be over. I’m like, “Look, it’s not that big of a deal. Porky can be on the top. Just let him do it. It’s fine.” And Porky’s like, “Let me? LET me? Listen here, you cat bastard … ” And the director’s trying to calm him down. Honestly, I felt like socking him right in his pig nose. But what’s that gonna solve? Then he gets to go home and tell his pig family that he was attacked by a cat? No, I’m not playing into that. So I just let it go.\n\nMarvin: Nobody really talked to Porky too much after that.\n\nChapter III.“Cartoon cocaine is just as addictive as real cocaine.”\n\nEveryone was curious to see how the humans and the cartoon characters would interact with one another. Thankfully, aside from Porky, everything went smoother than anyone had hoped. At least until Elmer and Jordan clashed.\n\nCharles Barkley: Those guys are so much fun, man. Listen, let me tell you something: Those guys can party, whoa boy. I’ll never forget one of the times I was there, I heard this noise coming from the back of one of the rooms. I kept hearing it, over and over again. I walk back there and it’s Tweety and Sylvester. Did you know they get along in real life? Because they do. They’re good friends.\n\nBut so I hear the noise and I go back there and I see them, and Tweety has this $100 bill rolled up and I couldn’t believe it. He was snorting cartoon cocaine off a little tiny cartoon mirror while Sylvester played cartoon Sega Genesis. I said, “What the fuck?!” Tweety looked up, and looked me right in the eye. He said, “Chuck, listen when I tell you this: Cartoon cocaine is just as addictive as real cocaine.” That little bird was cool as shit. I still don’t know if it’s a boy bird or a girl bird, though. I saw Tweety do stuff on set that made me think he was a guy, but also stuff that made me think she was a girl. I don’t know. Doesn’t matter. Great hang, either way.\n\nMuggsy Bogues: I really enjoyed my time on set. There were a few people I really connected with. Lola Bunny and I had a real great connection.\n\nLola Bunny: Muggsy kept hanging around my trailer. It was sweet until it wasn’t. I’ve been dealing with that my whole career.\n\nWarner Bros.\nPepe: People ask me all the time, “What’s the most memorable thing about having worked on Space Jam?” And the answer is never what they think it’s going to be, because the answer is: seeing an alien’s dick. During the second half of our game against the Monstars, one of them — the big Charles Barkley one — ended up naked from the waist down after Sylvester used a fishing pole to snatch his shorts off of him. I thought we were just gonna green-screen that part, because that’s what we did for most of the movie. But the director was like, “No. This has to be real. We have to make this as real as possible.” So that part really happened. That poor dude really had to show his dick to a stadium full of people. So of course that’s the most memorable thing. I’d seen Jordan a million times on TV. I’d never seen an alien dick, though.\n\nWayne Knight: One of the most exciting days was when all the Looney Tunes got to meet up with Michael. A lot of people were expecting Michael to be a jerk. That’s just the reputation that he had. But he was really great. He’s very charming, very outgoing. He made everyone feel real comfortable, he put everyone at ease. Well, almost everyone.\n\nReitman: The only real trouble anyone had with Jordan was one day he and Elmer Fudd got into it real bad over a bet that Mike wouldn’t pay on.\n\nElmer Fudd: I’d rather not talk about that.\n\nJordan: We were playing guts. You know guts? It’s a card game. You’re basically just trying to make the best three-card hand you can. Anyway, he gets into me for $10-$15K, something like that. And he’s really laying into me about it. Like, it ain’t just normal trash talk. I understand normal trash talk. That’s totally fine. And it started out that way. “Ooh, I’ma take that Nike money”; “I got some new Jordan Rules for you, Mike. Rule 1: fuck you.” Things like that. Which, again, those are fine. But then it turned venomous. He was saying things about my family. Truly hurtful things. Things where, like, if you’re in a room and you’re watching two guys go at it and one guy says something like this to the other guy then everyone in the room just sort of goes quiet.\n\nBill Murray: Of course I remember that day. Elmer was saying some nasty stuff to MJ. The worst of it was after MJ had lost again and he was down maybe $8,000 by that point. Now, Michael Jordan’s one of the richest people in the country. $8,000 is nothing to him. But Elmer uses the opportunity to take a real cheap shot at MJ. Michael loses, then Elmer says [REDACTED FOR DECENCY].\n\nLarry Bird: I couldn’t believe he said it! Michael was near tears. So was I, to be perfectly honest.\n\nLola: My jaw hit the floor. Literally. I’m a cartoon, so it can do that.\n\nJordan: You know when something’s gone too far. He was going too far. So he’s yelling these things at me, and I tell him, “Look, you gotta tone it down.” And he just kept going. So when it was time to pay him I just told him to fuck off. He’s 3 feet tall, you know what I’m saying? What’s he gonna do? I still don’t understand why he was so mad.\n\nBugs: Oh, I know exactly why Elmer was mad. All the Looney Tunes did. Did you know that Space Jam actually started as a commercial? Michael and I shot it to run during the Super Bowl one year and his agent took it and used it as a way to do the movie. But so during the commercial, there’s a part where I have to play some guys in basketball. Michael shows up and he’s my partner. When he shows up, the guys I was supposed to play all gasp. And MJ says something like, “Who were you expecting? Elmer Fudd?” Elmer didn’t appreciate that. That’s why he was so mad at Mike. Stuff like that, he never lets it go. He’s a real hot head. I mean, he’s been trying to shoot me for decades.\n\nReitman: Minus the Elmer-Jordan thing, filming went pretty smoothly. It was a 95 percent great experience.\n\nChapter IV.“That’s all, folks.”\n\nWith filming wrapped and approaching release, the cast and crew went their separate ways. Little did they know that Space Jam would go on to become the highest-grossing basketball movie of all time and an undeniable part of the canon.\n\nBugs: You know, you work and you work and you work on a thing and you don’t really know what it’s gonna do. You hope it’ll do well, but you can never really say for sure.\n\nPytka: We were all scared. Nobody knew what to think when it was coming out.\n\nFoghorn: The thing I remember the most about the movie being over is that Michael kept trying to tell everyone that the last play of the game — that stretch dunk thing he does — he kept trying to tell everyone that he’d really done that. He swore up and down that it wasn’t special effects. I said, “Michael, you really expect me to believe that you stretched your arm 40 feet long and dunked it from half court? You for real expect me to believe that?” He said, “You’re a giant cartoon chicken and you speak English.” I guess he had a point.\n\nSylvester: I loved working on Space Jam. It remains the only movie I’ve ever done. A lot of people think it’s because of the Porky Pig thing. It’s not. I really loved working on Space Jam. If they actually end up doing part two, I hope they call me.\n\nTweety: I can’t say that I don’t wish I had more lines in it, but I also can’t say that watching it age into folkloric status hasn’t been incredibly fulfilling.\n\nShawn Bradley: I just wish people had been nicer to me.\n\nReitman: When you make a movie, you hope for three things. You hope that it’s good. You hope that people like it. And, above all else, you hope that it makes you a ton of fucking money. We did all three.\n",
      "Folder": "Feedly",
      "Timestamp": "1476374642",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.770380Z"
}