{
  "id": "05ffe764e5564e18948a6ca24fbd06cf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1102505/the-businesses-amazon-is-most-likely-to-struggle-to-take-over/",
      "Title": "These are the businesses still immune to Amazon Quartz",
      "Selection": "It feels like nothing is safe from Amazon.\n\nOn Friday (Oct. 13) Bloomberg reported that Amazon was getting into sportswear. The company signed on a vendor that produces clothing for Gap, Uniqlo, and Kohl’s to make private-label athletic wear for Amazon. The news sent a shiver through the market, with shares of athleisure brand Lululemon and sportswear maker Under Armour closing the day at 2.2% and 1.8% down, respectively.\n\nAmazon began to build its business empire by taking on the book industry and, over the last two decades, has expanded to e-commerce, shipping, logistics, cloud storage, and voice-enabled personal assistants (hi, Alexa). Amazon owns a whole collection of secret brands. Meal-kit company Blue Apron convulsed in July when Amazon registered a US trademark for its own “prepared food kits.” Groceries are nervously eyeing its recent $13.4 billion purchase of Whole Foods. But there are still some businesses Amazon will find difficult to disrupt.\n\nDollar stores\n\nLast month, Morgan Stanley Research surveyed investors at its “Amazon Disruption Symposium,” asking which consumer sectors the survey-takers thought would take the longest for Amazon to “materially disrupt.” The most popular choice was dollar stores.\n\n(Morgan Stanley)\n\nDollar stores cater to people who are extremely price sensitive. Unlike Amazon, which exists almost entirely online as far as consumers are concerned, dollar-store chains do best with a dense network of physical stores. Morgan Stanley calls them a “fill-in shopping destination.”\n\n(Morgan Stanley)\n\nAmazon offers a world of consumer goods in two days or less through its Prime membership, but that still requires an initial purchase of $99 (or $10.99 a month, if you choose a monthly instead of annual subscription). The typical dollar-store customer spends less than $10 in a single trip. Even outside the super-price-sensitive demographic, most shoppers still make decisions based on (1) convenience and (2) value. Dollar stores excel at both.\n\nAuto parts\n\nInvestors also believe auto parts, a $50 billion market, is relatively safe from Amazon. Shares of US auto-parts retailers sank in January on news that Amazon had cut deals with the largest auto-parts makers in the country and was looking at regional distributors. Amazon also now offers same-day delivery on auto parts in 40 major US cities at prices that undercut competitors like O’Reilly and AutoZone.\n\nThat said, auto parts is not really about extreme price sensitivity; it’s business built on the demand for extreme immediacy. Do-it-yourself customers who need to repair their cars might not want to wait around for even a day or two to have a part shipped to them. Amazon also doesn’t have the ties to local dealerships that shoppers often need to make their purchases. Beyond that, traditional auto-parts retailers offer tools and advice from seasoned professionals that customers may find it hard to get from Amazon. “Those are the conversations that you don’t get online,” AutoZone spokesman Ray Pohlman told Automotive News in February.\n\nHome improvement and home furnishings\n\nLike auto parts, home improvement is a business that requires both immediacy and human expertise. Ikea has begun to recognize this: the company recently purchased on-demand services startup TaskRabbit, likely to bolster its delivery and furniture-assembly offerings for US customers. (Prior to the Ikea purchase, the most popular task on TaskRabbit was assembling Ikea furniture.)\n\nAmazon attempted to break into home improvement in late 2014 with Amazon Local Services, a marketplace for contracting service professionals like plumbers and electricians. Amazon renamed the platform Amazon Home Services the following year and launched it more broadly, with normal handyman offerings plus oddities like goat grazing and singing performances. Still, it never really caught on.\n\nAs for home furnishings, Amazon’s challenge will be to overcome people’s desire to see and examine these items up close before purchasing. It’s easy to buy something like toilet paper or a book online, sight unseen. But the curtains that will hang from your living-room window—you’re probably going to want to examine those pretty closely before committing.\n\nThat said, even those buying habits may not last forever. Casper, the online mattress startup, broke the long-standing belief that people would never buy their bed from a website, since they couldn’t test it out like they could in a store. And if Amazon can break into sportswear—something most people like to try on—why not home furnishings too?\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1508092587",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.616086Z"
}