{
  "id": "0636d03c649041a5af7fcc37e5fa61ff",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2018/4/17/17249990/southwest-airlines-engine-explosion-passenger-partially-ejected-depressurization",
      "Title": "How it’s possible for a person to be sucked from an airplane mid-flight The Verge",
      "Selection": "When the left engine on Southwest 1380 exploded today, a woman was nearly sucked out of the plane through the broken window next to her, other passengers on the flight told NBC. It sounds impossible, and officials haven’t yet confirmed the reports — but people have been sucked out of damaged airplanes before.\n\nThe Boeing 737’s engine exploded on Tuesday morning while the plane was flying from New York’s LaGuardia Airport to Dallas, forcing the pilot to make an emergency landing in Philadelphia. One passenger died, the National Transportation Safety Board (NTSB) said in a press briefing, and the Philadelphia Fire Department reported several injuries. But NTSB spokesman Keith Holloway told The Verge in an email that he had no information about reports of a passenger being nearly pulled from the jet mid-flight.\n\nWhile fatal aircraft accidents are extremely rare, there have been cases of passengers being sucked from punctured aircraft before, says Thomas Anthony, director of the University of Southern California’s aviation safety and security program. In 1989, for example, a cargo door blew off of United Airlines flight 811 and took part of the fuselage with it: nine passengers were sucked from the plane.\n\nNTSB investigators on scene examining damage to the engine of the Southwest Airlines plane. pic.twitter.com/2dyDzOW8pT\n\n— NTSB_Newsroom (@NTSB_Newsroom) April 18, 2018\n\nThat can happen because the inside of the airplane is pressurized, so people can breathe even as the plane climbs to lower air pressures at higher altitudes. The pressure differences between the inside and the outside of the plane cause suction, Anthony says, which could pull a passenger from a plane if it’s punctured. The higher the plane, the bigger the pressure difference, Anthony says. “Then the more hazardous the condition is. And, certainly, the greater the hole.”\n\nThe Verge spoke with Anthony about cabin pressures, rare but fatal plane accidents, and oxygen masks.\n\nThis interview has been edited for clarity and brevity.\n\nWhat exactly does it mean when a plane depressurizes?\n\nThe term that’s used in the industry is “rapid depressurization.” The point of pressurization of an aircraft is to keep the air inside of the airplane at a level where people can breathe it comfortably. And so, in general, as you increase in altitude, the air pressure [outside] diminishes. So commercial aircraft are kept at a pressure altitude of about 8,000 feet so that people can comfortably breathe the air. When a hole is punctured, then there’s less pressure, there’s less oxygen, and that’s when the oxygen masks come down.\n\nHow does a rapid depressurization occur? Are there specific conditions when a plane is more or less likely to rapidly depressurize?\n\nWell, yes. If there is a puncture to the aluminum skin — or in the case of modern aircraft, composite skin. In the case of intentional acts of unlawful interference against aviation — namely, in the cases where bombs were placed on board aircraft — then the hole in the side of the airplane would be much greater, and, in a few cases, a person has been sucked out of the airplane.\n\nIs it different when depressurization occurs due to a small piercing like a bullet versus a large hole?\n\nYes, it’s different. Let’s say a bullet is shot. That will cause depressurization, but it would not be the same as, let’s say, a structural failure resulting in a large hole. Think about the Aloha Airlines case, where the whole top of the airplane came off. Aloha operated a fleet of aircraft — in this case, 737s — that would go from island to island. You take one tight takeoff, and one landing — so you pressurize the fuselage, and then you depressurize it.\n\nAnd because there were so many takeoffs and landings from one island to another and because it was in a warm and moist environment, there was corrosion in the top skin that formed the fuselage, and actually the top portions of the fuselage peeled back so that it looked like the top of the airplane was completely gone when it landed. There was one fatality of a flight attendant, who was sucked out of the airplane, but an amazing number of people survived that.\n\nWhat’s the safest seat to be sitting in if a plane rapidly depressurizes?\n\nI haven’t given much thought to that, but I think that it all depends on the location of the depressurization. But in general, I would say it would be that seat that is closer to the middle of the airplane, like an aisle seat [because] you’re farther from the side.\n\nHow do you breathe when the plane depressurizes before you put the mask on? Should you try to hold your breath?\n\nNo, you don’t have to hold your breath. There’s still oxygen there. You’re just absorbing less of it. What you have is a usable time of consciousness to pull the [mask] down and put it on. So no, don’t hold your breath. Just act normal, and pull it down and breathe the oxygen.\n\nIs it possible for depressurization to rip the plane apart?\n\nThat question can be answered by the fact that that phenomenon is unknown to us. So if it’s not a “no,” it’s an “approaching no” because, in my profession of studying accidents since the introduction of jet airplanes, this is not something that we have seen. So it’s extremely, extremely unlikely. [With] the Aloha flight, you’ll see that aircraft continued to a safe landing even though the top of the fuselage was gone. That speaks to the structural integrity of the aircraft.\n",
      "Folder": "Feedly",
      "Timestamp": "1524106236",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.479066Z"
}