{
  "id": "06eb0c085fab498cbe5e1dfe9af05d1d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://ritholtz.com/2019/08/winner-takes-all-applies-to-stocks-too/",
      "Title": "Winner Takes All Applies to Stocks, Too The Big Picture",
      "Selection": "Winner-Take-All Phenomenon Rules the Stock Market, Too\nAny gains are attributable to a relative handful of companies.\nBloomberg, July 29, 2019\n\n \n\n \n\n \n\nThe winner-take-all phenomenon is well-documented among sports stars, pop singers, fiction authors, actors and hedge-fund managers — those at the top reap fabulous rewards while everyone else scrapes to get by.\n\nIt turns out the same hold true in the stock market: Just 1.3 percent of the world’s public companies account for all the market gains during the past three decades. Outside the U.S., the gains are even more concentrated, with less than 1% of all equities driving all of the net appreciation in share prices.\n\nThose numbers come from a new study on equities, and how their gains are distributed. Ardent stock pickers who read the paper might find themselves turned into indexers as a result of what they see.\n\nThe lead author of the paper, Hendrik Bessembinder of the Carey School of Business at Arizona State University,1 and the rest of his research team looked at 62,000 global common stocks from 1990 to 2018, and ranked them on a compounded, total-return basis. That period includes two decade-long market expansions, from 1990 to 2000 and 2009 through 2018, as well as two major market crashes in 2000 and 2008. These periods, encompassing bear and bull cycles, make it less likely that the findings are due to anomalies or one-off events.\n\nThe data analysis reveals the net gains for equities can be found in a small group of outliers — and much fewer in number than is commonly thought of by most market participants.\n\nJust five companies — Apple Inc., Microsoft Corp., Amazon.Com Inc., Alphabet Inc. (Google) and Exxon Mobil Corp. — accounted for 8.3% of global net wealth creation. It is hard to imagine a greater example of the winner-take-all distribution — these five companies account for just 0.008% of the total sample set of 62,000 publicly traded companies. Expand that to the top 0.5%, or 306 companies, and they account for 73% of global net wealth creation. The best performing 811 companies (1.33% of the total) accounted for all net global wealth creation.\n\nLet’s translate those percentages into dollar amounts: During that 1990-2018 period, those companies accounted for the entire net stock market appreciation of $44.7 trillion, in excess of Treasury returns. Outside the U.S., less than 1% of international equities generated $16 trillion in capital appreciation, also in excess of Treasury returns.\n\nLess than half of the stocks in the study — 23,905 — had cumulative positive returns. When added to the top gainers, these stocks generated $66.6 trillion of wealth. However, a majority of stocks — 37,195, or 60.9% — were net money losers, subtracting a $21.83 trillion from the total. The total gains of winners minus losers netted out to that $44.7 trillion figure.\n\nConcentration of stock returns was not the original focus of the research; ironically, the study sought to determine how many stocks managed to outperform bonds over shorter time frames. The discovery of the intense market concentration seems to be a happy accident. The researchers found during shorter periods of time, about 56% of U.S. stocks and 61% of international stocks, underperform one-month U.S. Treasury bills. In any given month, only 43.7% of U.S. stocks, and 39.3% of non-U.S. stocks, outperformed the accumulated returns of one-month Treasury bills over the full sample period of 29 years. 2\n\nWe can shrug at that data point: after all, stocks are long-term investments and we really shouldn’t care very much about any given month’s returns. It’s the compounding, especially with dividends re-invested, that investors and savers should be thinking about. Still, this was yet another datapoint I found surprising.\n\nAnother data point is obvious: the longer buy-and-hold investors retained their equities, the greater the outperformance relative to Treasury bills. It is about 1% for any one month on average, about 14% for a year, 95% for a decade and a giant 260% for the 29-year sample period.\n\nThis isn’t necessarily all bad news for active investors; some of the data could be encouraging or even useful to stock pickers. One revelation might be that active managers should consider focusing less on being stock pickers, and more on being “stock-unpickers” — in other words, avoiding the dogs. Identifying the characteristics of those 37,195 long-term money-losers — what quantitative characteristics do they share that could be screened out — might be useful. This is a common practice for quants, but the sheer number of money-losing stocks makes one wonder if that approach is being fully exploited. If screens could eliminate some of the long-term losers, it might not only improve returns, but could help to justify fees higher than simple indexing.\n\nOthers might interpret the study as revealing yet another advantage of indexing: Not only are low costs and beta (market-matching performance) an indexing given, but the research suggests that investors who index broadly may be more likely to hold the rare and outsized winners that drive much of the market gains over time.\n\n___________\n\n1. Bessembinder is also the managing editor of the Journal of Financial and Quantitative Analysis, a position he’s held since 2003\n\n2. The authors’ note: “The finding that most stocks underperform US Treasury bills does not contradict the evidence (see, for example, Dimson, Marsh, and Staunton, 2002) that returns to broad stock markets handily outperform returns on Treasury instruments.”\n\n~~~\n\nI originally published this at Bloomberg, July 29, 2019. All of my Bloomberg columns can be found here and here.  \n\n \n\nThe post Winner Takes All Applies to Stocks, Too appeared first on The Big Picture.\n",
      "Folder": "Feedly",
      "Timestamp": "1564701653",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.384842Z"
}