{
  "id": "073010783aff4aefb36a33339b052b29",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/14451-why-the-best-sushi-isn-t-fresh-and-5-other-tips-from-one-of-new-york-s-best-sushi-chefs",
      "Title": "Why the Best Sushi isn't Fresh (and 5 Other Tips from One of New York's Best Sushi Chefs) Food52",
      "Selection": "Daisuke Nakazawa throws four tiger shrimp onto the counter of De Gustibus, a culinary school tucked into the activewear department on the eighth floor of Macy's flagship store.\n\nAs the shrimp writhe, a woman in the front row jumps back in her seat and Nakazawa instructs us to repeat after him: \"Sayonara!\" Before we, the attendees of his sushi demonstration, can respond, Nakazawa lets out an almost satantical laugh and proceeds to pop each head off the live shrimp in rapid succession before filleting the recently deceased and placing them on a burial mound of rice.\n\nHaving worked as an apprentice of Jiro Ono—yes, the one who Dreams of Sushi—Nakazawa, who now has his own reputable restaurant in the West Village, Sushi Nakazawa, is considered to be one of New York's most respected sushi chefs—shrimp tricks and all.\n\nHere are five tips he shared for preparing—and eating—sushi (including his personal favorite piece):\n\n1. The best sushi isn't necessarily fresh (in fact it was likely frozen).Because of the ubiquity of fishy friends like worms, Nakazawa said a recent New York City law requires that all fish served raw must first be flash-frozen before it's defrosted and served to kill potential parasites. As a result, the 500-pound tuna Nakazawa buys are kept in the freezer until they're used up within two to three days. So when purchasing fish for sushi, check with a fish monger you trust that your fish has been flash-frozen and hasn't been cross-contaminated with fish intended for cooking (and keep in mind that sushi-grade is a term that can be applied to any fish—regardless of freshness).\n\n2. The next best thing to wasabi root is Japanese mustard.\nIf you can't get ahold of the root itself, Nakazawa suggests Japanese mustard, which unlike French and American mustards which can include vinegars and other additives, is just crushed mustard seed and water. Nakazawa said, \"It's what Japanese chefs used before wasabi.\"\n\nMore: Make your pickled ginger from scratch—it's easier than you think.\n\n3. The rice matters as much as the fish does.\nRice is every bit as important as the fish on top of it—rice comprises the majority of each bite of sushi. Nakazawa and his mentor Jiro are known to minutely adjust the portions of rice per sushi piece based on the size of the person they're serving it to (they'll also take note of if the person eating is right- or left-handed then serve accordingly, if you were questioning their attention to detail). \n\nAs for the rice itself, Nakazawa uses Tamaki Rice, then adds in mirin, vinegar, salt, and sugar to make it a little more flavorful and enhance the umami of the fish. While he couldn't give the exact proportion of sauce additions for a single serving of rice (\"I have no idea—I do it for so many people!\"), the best way to know for yourself is to experiment until you hit the right mark.\n\n  \n\n4. And so does the soy sauce.\nRather than using straight soy sauce, Nakazawa alters his by adding ingredients that lend it more umami, like bonito and kombu, the same sea vegetable that's used to flavor dashi, a traditional Japanese broth.\n\nMore: Everything you need to know about kombu and other types of seaweed (and how to use them!).\n\n5. Even fish scraps have their place.\nWhile sashimi and pieces of sushi use the best cuts of the fish, Nakazawa doesn't let any of the fish go to waste. The \"scraps,\" as he referred to them, go into hand rolls (he loves Spicy Tuna hand rolls), or to the lucky staff at Sushi Nakazawa. He said, \"Every night, somebody gets to eat the face of the fish.\" We'll be right over.\n\n   \n\n6. Even the best sushi chefs eat California rolls.\nSome would cringe at even including the word \"California\" in an article about sushi (we hear ya), but Chef Nakazawa has no qualms about the crab, cucumber, and avocado concoction. While he's far from serving it on his own menu, he said he's no stranger to the ready-made California rolls at Gourmet Garage, a large grocery store in the West Village. (If he could have one piece of sushi though, it would be a fatty sardine.) Other dishes he eats after work? \"The pizza across the street,\" and Five Guys. Oh, and his favorite ramen in the city is Ramen-Ya in the West Village—he hates to cook.\n\nWhat are your favorite tips for eating sushi? Do you prefer to leave your rolls behind the counter? Tell us in the comments below!\n\nPhoto of rice by Bobbi Lin; all other photos by James Ransom\n",
      "Folder": "Feedly",
      "Timestamp": "1445603942",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.829623Z"
}