{
  "id": "076eb982a17348e29da277e9471cee5b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theatlantic.com/notes/2016/08/the-university-of-chicago-letter/498110/",
      "Title": "The University of Chicago Letter Alumni Respond The Atlantic - Business",
      "Selection": "Over the past week, my alma mater has been all over my (and probably your) news feed. The general dramatic headline: There will not be safe spaces or trigger warnings at the University of Chicago, according to a letter sent by John Ellison, dean of students at the university, to incoming freshmen. The letter immediately became a dot on the timeline of the ongoing national debate on campus politics, political correctness, and academic freedom—the media narrative being that an administration takes a stand on free speech and academic freedom, and that’s followed swiftly by support and pushback from students, experts, and pundits.\n\nI went to the University of Chicago for undergrad in the early 2000s. I studied economics and sociology, and I have very fond memories of the school’s peculiar culture: the way students laughed off the bitter winters, the way pulling all-nighters at the library (shoutout to the A-level) was cool, the super weird school traditions like Scavhunt—so strange that The New Yorker once devoted nearly 4,000 words to it. It’s a place where people knowingly enrolled even though they’ve been told it’s a place “where fun comes to die.” I think we took pride in the image that we were young people who wanted to participate in school that was intellectually rigorous (the “life of the mind”), where a class about Nabokov’s Lolita or Foucault’s History of Sexuality were so popular it was hard to find a seat, where education was its own end, and everyone was a bit odd in their own way.\n\nI think my peers and I worried that culture (beloved by us) was starting to fade when I graduated in 2007: The school had switched from the UnCommon App to the Common App. The school started to rise in rankings, which was favorable for alumni job-wise, but we worried that it was at the cost of the school’s identity and the students it would attract. The University of Chicago is about hard classes, but it’s also about community.  \n\nIn New York, where I live now, alumni are often close-knit friend groups—my spouse regularly laments that he knows more alumni from the U of C than his own university—that meet up regularly to have discussions not dissimilar to classes. (It’s also interesting to note that some 20 percent of U of C alumni end up in academia.) With Ellison’s letter, we all pondered what it’s going to mean, and we did that together online.\n\nThis week, I’m going to highlight some of the interesting discussions I’ve seen on social media and responses from the University of Chicago community. My colleague Alia Wong will join me in discussing these comments from students and alumni who share deep connections to the school and each other. For them, Ellison’s letter is personal, in contrast to the way the national debate on campus politics can sometimes feel removed.\n\nFrom one alum, Laura Oppenheimer:\n\nI take an inordinate amount of pride in how hard I worked as a student at the U of C. My courses were not dumbed down, no one held my hand, and I was expected to read, grapple with, and discuss everything—ranging from Plato and Marx, to Four Hours in My Lai and Night. The reading was difficult, and frequently, so was the subject matter.\n\nWhat I wish Ellison had said was, “as students at the University of Chicago, you will be expected to read, study and discuss many types of work, including work that may be upsetting, or work you may disagree with. This is part of a rigorous, academic education.”\n\nInstead, he issued a blanket statement that the school doesn't give trigger warnings, which are something that serve to protect those who may have PTSD due to past trauma. To me, despite the way trigger warnings have been co-opted by overly sensitive college students, this was a misstep.\n\nI applaud the ethos, but I wish the administration had refined the message and made it about free speech and academic discourse, focusing more on the message it was trying to deliver, and less on grabbing a moment in the spotlight.\n\nFrom another alum:\n\nAs a 2006 graduate, I have to say I completely support Ellison’s letter 100 percent.  It really surprised me a lot because I didn’t expect the University to go that far in support of true free speech, since free speech is not very popular these days, especially on college campuses.  But I am very glad (and proud) that the University took such a position.  I hope that they stick to it.  (Though as an aside, I also wonder how many people are hearing about the University for the very first time because of this letter—and to what extent that is a good thing or a bad thing.)\n\nA particularly insightful Facebook post from another alum:\n\nI don’t think it would be a stretch to call University of Chicago a school of intellectual hard knocks. This has always been the unarticulated social contract of matriculating at U of C—the place that attracts kids who proudly don T-shirts emblazoned with the motto “Where Fun Comes to Die,” and [where] the one-day winter break is unofficially known as “Suicide Prevention Day.” … But a wholesale dismissal of “trigger warnings” and “safe spaces” as flimsy excuses for coddled millennials to continue lives of comfort, puppies, and play-doh (not Plato! sorry/had to) is simultaneously a refusal to acknowledge an extremely problematic stance on student mental health.\n\nClinical depression is not a prerequisite in the life of the mind, and being re-traumatized by class material does not facilitate “freedom of inquiry and expression” but, quite to the contrary, precludes and damages a fruitful learning process. To make students uncomfortable, to create friction and tension in the classroom, lecture hall, auditorium, etc.—these are invaluable pedagogical tools. Asking students to exacerbate existing pain, trauma, or mental disturbance or enter spaces where they feel endangered or ashamed does absolutely nothing for the honorable pursuit of knowledge-production. ...\n\nMy problem with the letter is not that it raises the issues of “trigger warnings” and “safe spaces” as dubious, but the unnecessarily harsh tone it takes. There is an underlying bad-faith assumption that incoming freshmen (legal adults, I might add) will not be able, of their own accord, to determine what may or may not be traumatic for them. Traumatic. Not disturbing, not unsettling. Traumatic. Trauma is a medically-vetted, psychological condition, and the fact that the letter gives it absolutely no credence gives the impression to incoming undergraduates that their mental health is not an issue that needs or warrants any attention whatsoever. …\n\nWe should put pressure upon the concept of “trigger warnings\" and “safe spaces,” yes. We should be vigilant about the ways these accommodative practices are abused. But to completely dismiss these pedagogical caveats as new-fangled psychobabble hooha is not only retrograde, it is contra to the aims of an administration that ostensibly seeks a more diverse population of students.\n\nFree expression and inquiry can by its very nature only occur in spaces where all individuals understand themselves to be equally free. Hostile and punitive classroom environments do not facilitate this goal. We should be debating and complicating the ideas of “trigger warnings” and \"safe spaces,” not dismissing them.\n\nIf you’re a former or current student at the University of Chicago with an opinion on Ellison’s letter, or you disagree with some of the points that I’ve included here, please send a note to hello@theatlantic.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1472599344",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.782001Z"
}