{
  "id": "088789c4cd2641b795e917be14664d11",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1570685/can-fashion-brands-like-hm-ever-be-ethical/",
      "Title": "Can cheap fashion ever be ethical Quartz",
      "Selection": "The global fashion industry has a problem.\n\nAs it has criss-crossed the world in search of ever-cheaper places to manufacture its clothing, the stories of worker abuses that have followed remain depressingly similar: Violence, brutally long hours, dangerous conditions, and pay that amounts to poverty wages continue to surface.\n\nLast year, at one Indian factory supplying a number of well-known brands, workers said they were viciously beaten for daring to join a union. Earlier this year researchers for an aid group found that garment workers in Bangladesh and Vietnam making clothes for big international labels were paid so little they couldn’t adequately feed themselves. A new report found that female garment workers in Vietnam face “systemic” sexual harassment and violence at work.\n\nThese are just some of the recent examples. In 2013, the industry became a global symbol of worker exploitation when the Rana Plaza factory complex collapsed on the outskirts of Dhaka in Bangladesh, killing around 1,134 people and ranking as one of the worst industrial disasters in history.\n\nThe massive and deadly factory collapse at Rana Plaza.\n\nJust over two decades ago, a small collection of workers’ rights groups, trade unions, British retailers, and others joined together to take action on the poor pay and labor conditions that countless workers in global supply chains endure. The organization they ultimately formed, the Ethical Trading Initiative (ETI), has since founded programs in countries around the world, partnered with other advocacy groups, and elicited commitments from brands large and small—including some of the world’s biggest fashion labels—to try to improve workers’ lives.\n\nBut while it has done a lot of good, it hasn’t been able to eradicate the problems that led to its creation. “Last year was our 20th anniversary, and in many ways, we haven’t seen the kind of progress that we’d like to see,” says Martin Buttle, ETI’s strategic lead on general merchandise and business models. “We’ve seen the same stories and same kind of problems reoccur in various different sourcing countries since when we started working in this field.”\n\nIn fashion—particularly the low-cost, high-volume sort—this has certainly been the case. And after two decades working to solve these problems, the group felt the need to reassess its approach as it prepares to set its strategy for the next few years. The group has always focused on brands’ business practices, but it has recognized the need to take a step back and look at the whole premise the industry operates on. “I think we’ve been increasingly conscious that the business model is part of the issue,” Buttle says.\n\nThe ETI commissioned a team of authors, including professors at the business schools of King’s College London and the University of Warwick, to examine the connection between business models in fashion and food and labor standards in the supply chains of those industries. The new report, “Business Model and Labour Standards: Making the Connection,” argues that the model of producing giant volumes of clothing at the highest speed and lowest cost, through a flexible and opaque global supply chain, has been a key contributor to the hazardous conditions, labor abuses, and low wages that workers face in the industry.\n\nAll the factory inspections that brands carry out on their suppliers, all their corporate social responsibility (CSR) programs, and the millions they spend on them, may help to improve conditions, but only in limited ways. They’re effectively treating symptoms rather than the disease.\n\nTo really make sure workers aren’t routinely exploited in countries around the world, individual fixes won’t solve the problem. The whole business model needs to change.\n\nFashion’s common ground\n\nThere isn’t really just one business model in fashion, even within the low-cost clothing sector. Zara works differently from Walmart: The former emphasizes constant, smaller deliveries of new styles to keep up with trends; the latter relies on selling higher volumes of more basic items. Even so, there’s a lot these brands share in terms of how they get their clothing made. The ETI report centers on these common ways of operating, since those are at the nexus of the relationship between the brands, factory owners, and workers. And that’s where the roots of the industry’s problems lie.\n\nFirst off, very few brands own the factories that make their clothes. They outsource the work to independent producers, usually in countries where labor is cheap. Their supply chains also tend to be highly flexible, in that they can change the factories they source from without too much disruption. Lastly, they’re continually trying to make clothes faster, as they work to keep pace with customers who are moving at the pace of social media.\n\nTrends can come and go in a matter of weeks now. If it takes a brand a few months to design, manufacture, and ship clothing, it can miss its chance to cash in. Shoppers reward the fastest brands, offering them the best value for their investment in manufacturing.\n\nTo make all the inexpensive fashion that brands pack into stores and websites, they have come to rely on a complex network of contractors and subcontractors that can be nearly impossible to monitor and regulate. They are constantly assessing how to produce their clothes in the most cost-efficient way possible. They get quotes from factories in different countries, sometimes using middlemen who know where to find the best deals, and go with the ones that offer that best mix of price, speed, and quality. Or they set draconian terms that factories in need of the work may be reluctant to reject. As the ETI report frames it, clothing brands “have become adept at dissecting the supply chain and looking for pockets of ‘value’ that can be ring-fenced and negotiated downwards.”\n\nBut the longer and more dispersed the supply chain becomes, the harder it is to keep an eye on everything happening within it. The intense pressure to keep prices low and churn out clothes quickly pushes the suppliers themselves to outsource work, and the brand at one end of the supply chain can lose control over what’s happening at the other end.\n\n View this post on Instagram\n\n Fleece coats are a key item this season. The black one is a always a good choice #zaranewin Tap to shop!\n\nA post shared by  ZARA Official (@zara) on Jan 17, 2019 at 6:09am PST\n\nIncentive to cut corners\n\nThese factors lead to serious problems beyond wages. In countries where industry isn’t well-regulated, factory owners may cut corners on safety, failing to install proper fire doors, or skipping important upgrades.\n\nBrands can also fail to give their suppliers enough lead time to produce their orders, or may suddenly demand larger quantities or add other changes. This leads to factory owners forcing staff to work overtime without extra pay, or finding other ways to get the work done. The ETI’s report cites the combination of these factors and the lack of visibility across the supply chain, saying it “influences the adoption of unethical practices by suppliers.”\n\nHuman Rights Watch (HRW), an advocacy group dedicated to uncovering abuses around the world, just released its own report on the garment industry. Like ETI, it concludes that brands’ purchasing practices—meaning how they place orders with manufacturers—are driving labor violations: “Low purchase prices and shorter times for manufacturing products, coupled with poor forecasting, unfair penalties, and poor payment terms, exacerbate risks for labor abuses in factories,” it states.\n\nEven the most robust corporate social responsibility efforts are undermined in this cycle. “Often, bad purchasing practices directly undermine efforts brands are making to try to ensure rights-respecting conditions in the factories that produce their wares,” HRW points out. “Many brands demand their suppliers maintain rights-respecting workplaces, but then incentivize them to do the opposite.”\n\nWorkers in Myanmar and Cambodia, for example, saw their production targets increased significantly when the country raised the minimum wage. The workers got paid more, HRW reports, but the factories then demanded more. Workers could be denied basic rights such as bathroom breaks.\n\nA garment factory in Myanmar.\n\nPerhaps the worst instances of underpayment, worker abuses, and dangerous conditions occur in the unauthorized subcontracting sector. The factory a brand contracted with might subcontract out work to another factory when it has accepted an order and then finds itself unable to fill it as fast as promised. Or it may even take the order knowing it can’t complete it in time, just because it doesn’t want to say no and risk the brand going elsewhere with its business.\n\nThese subcontracting factories are less likely to be registered with the governments of their countries, and may operate outside of any regulation or oversight. The facilities that collapsed at Rana Plaza, for example, housed subcontractors producing for large international brands, such as Benetton.\n\nBrands may ban vendors from subcontracting, but the demands they make and conditions they impose still set the stage for it. HRW spoke to one sourcing expert with more than 30 years in the garment industry, who explained, “If a brand says [to a factory] they are going to order 150,000 pieces and then at the time of actually placing the order, turn around and ask for 250,000 pieces, then you are going to have OT [overtime] or subcontracting.”\n\nThe authors of the ETI report note that, based on their research in Bangladesh, brand sourcing managers and middlemen are often aware of the production limits of factories. And if they place orders that exceed them anyway, “they invite sub-contracting with ‘eyes wide shut.'”\n\nHow we got here\n\nThe global supply chain of the fashion industry is relatively new. Up through the 19th century, ready-made clothing that a person could buy off a rack was mostly an alien concept, as Grace Rogers Cooper wrote in her history of the sewing machine. For the most part, those with the means got their clothes made to order from tailors or seamstresses, and those who didn’t made their own, or wore hand-me-downs. In the US, until about the 1830s ready-made garments were almost exclusively for sailors about to ship out to sea.\n\nBut in cities in such as New York, as incomes rose and a steady rush of immigrants and others flooded in, a market emerged for convenient ready-made clothes. As more people jumped into the business, prices fell. The invention of a practical sewing machine only spurred the process. In 1860, the New York Times compared it to the “domestic” equivalent of the telegraph or reaper. Slowly, clothing manufacture was industrializing, and affordable fashion for the masses becoming a reality.\n\nAs the industry grew, so did pressure to make things more cheaply. “There was always outsourcing in the industry,” says Doug Miller, an emeritus professor of workers’ rights and fashion at the University of Northumbria. In the US, for example, manufacturing started to migrate “away from the urban centers into Pennsylvania and beyond in the Southern states,” he notes.\n\nMiller calls clothing manufacturers “footloose,” because it’s fairly cheap to move production around. To sew clothing doesn’t require a prohibitive amount of specialized knowledge or equipment. “Once you had improvements in transport and communication,” he says, “it just was a matter of time before it went international.”\n\nThat process took off in the late 1960s and 1970s, as businesses that once manufactured clothing started outsourcing the work to cheaper destinations such as Hong Kong, Korea, Malaysia, and Taiwan, as well as Central America and the Caribbean. When wages rose in those locales, they turned to Southeast Asian countries such as Vietnam, Bangladesh, and Turkey.\n\nAnd of course, to mainland China: In 1979, it started a process of economic reforms that would transform it in the decades that followed from a poor backwater that subsisted on farming to an export-oriented economy (pdf) that would grow into the largest producer of clothing in the world.\n\nThere were still companies such as Levi’s that owned the factories where they made their clothes, but they were losing ground. Even Levi’s eventually outsourced its production. In wealthier countries, textile mills and garment factories fought the outsourcing, and governments, in an effort to protect local industry, put restraints on how much clothing, and what types, they would allow in from developing countries. It wasn’t enough. Even with the barriers, production flowed to countries that offered labor costs no industrialized economy could compete with.\n\nGarment workers in New York protest the influx of clothing imports from overseas in 1977.\n\nAs author Elizabeth Cline detailed in her book, Overdressed: The shockingly high cost of cheap fashion, giant garment factories employing thousands of people in low-wage nations sprang up to fulfill the massive orders of Western labels. Companies such as Gap and Nike were among the pioneers, coming up with products and marketing campaigns to whip up demand which they satisfied with an avalanche of products made through outsourced production, keeping costs low and margins high.\n\nThis model is still in use today, only it has gotten much faster. And it has had economic consequences in wealthier countries too. In the advanced capitalist economies of the 1950s and 1960s, there was a “virtuous circle of production and consumption,” according to the authors of ETI report. As real wages rose for workers producing goods, their purchasing power increased, lifting the demand for goods. Prices rose, too, but wages kept up, while the desire for more products fueled a cycle of more employment and higher wages to make them. It sometimes required workers getting those increases through collective bargaining, but the model generally worked.\n\nWhen these jobs moved overseas, that virtuous cycle ceased to exist, according to the ETI:\n\nGlobal Supply Chains have broken this model. They have separated spatially those who produce the goods and those who consume the goods. To deliver lower priced goods, separation of consumers from producers is necessary. Buyers threaten to relocate or actually relocate should wage costs rise. As such, the model is the opposite of the virtuous circle as it seeks out workers who do not have a reasonable prospect of being able to consume the type of goods which they produce.\n\nIn theory, free trade should make the situation advantageous to all, freeing up workers in the advanced economies to do better jobs and giving the workers in the developing nations jobs that will lead eventually to higher wages and living standards. But free trade doesn’t always work in practice the way it does in theory. Particularly for countries such as Vietnam, Cambodia, Bangladesh, Myanmar, and others, cheap labor has been perhaps the top competitive advantage when it comes to attracting the fashion and footwear industries. For these countries to remain attractive to international brands, their wages may have to remain low.\n\nIn the US, meanwhile, shoppers are spending a diminishing share of their disposable income on clothing, even as they stuff their closets with more of it. Clothing prices have been deflating compared to retail overall, and brands keep looking for ever-cheaper ways to fill the demand.\n\nConstant downward price pressure\n\nThe ideal sourcing destinations globally, not by coincidence, are the ones that offer the best mix of price, speed, and quality, though brands prioritize each of those factors differently.\n\nA label that wants to fill its stores in Europe with, say, a newly hot style of shirt may opt to make it in Turkey or Morocco (even at a higher cost than in Southeast Asia), since it can get it from idea to store shelf weeks sooner. Zara does much of its production near Europe for this reason, and as the need for brands to produce faster grows, more may start looking to countries nearer the markets they sell in. China, meanwhile, remains by far the world’s largest clothing exporter, even though prices have been rising there for years, because it has built up an unmatched infrastructure that, for now at least, still allows the quality and efficiency of its manufacturing to offset the added expense.\n\nEven so, price arguably carries a disproportionate amount of weight when brands balance out these factors. As a business, high-volume, low-cost fashion has narrow margins, so even a small additional expense to make something like a t-shirt can have a big impact on a brand’s profits when it’s making tens of thousands or hundreds of thousands of them.\n\nShockingly low wages and abundant labor are part of the reason Bangladesh has grown into the world’s second-largest clothing exporter—with the EU as its main export destination. For brands, Buttle says, cost “is definitely a very significant driver…There’s a reason they’re all sourcing from countries with the lowest labor costs, and where labor regulations are weakly enforced.”\n\nA factory that supplies H&M in Kandal province, Cambodia.\n\nBrands, though, aren’t the ones setting the wages directly. David Sävman, head of production at H&M, which is an ETI member, says it’s a common misconception that brands decide what garment workers get paid. Again, they don’t own the factories. It’s the local industry and government that determine wages, and a worker’s pay doesn’t change according to which brand she’s sewing for.\n\nThat’s not to say, however, that there’s no correlation between wages and what a consumer ultimately pays. “On a single order, there would be no connection between worker wage and final garment price,” Sävman says. “But on a total of how a market develops, yes.”\n\nWhile the brands are all competing to get their clothes in front of shoppers as fast as they can at the lowest possible price, the factories are in competition too. They need to get orders from the brands to make money themselves, so the factory owners offer the best prices they can manage, at the fastest turnaround times. To make a profit, they have to keep their own costs low, so they pay the lowest wages they can.\n\nAnd then there are the workers. To sew clothing quickly and correctly all day long requires a tremendous amount of skill, but it’s not the same sort required for writing computer code or designing high-end electronics. It’s often developed through repetition, not formal education, so factories may treat garment workers as interchangeable. They can also be some of the most disadvantaged people in a community, making them even more vulnerable to exploitation and abuse.\n\nThe majority of garment workers are women. In Vietnam, Cambodia, and Bangladesh, for example, at least 80% of garment workers are estimated to be female. Like everyone else in the supply chain, they’re in competition too for jobs that can be vital to their families’ survival. Out of necessity, they may suffer inadequate pay, sexual harassment, and other abuses, simply because low wages are better than no wages.\n\nCombined, these dynamics allow brands to pay less and less for their clothes. One analysis last year by Mark Anner, director of Penn State University’s Center for Global Workers’ Rights, found that brands are generally paying less (pdf) to make a pair of cotton trousers in Bangladesh for export to the US than they were before the Rana Plaza disaster. And if brands are paying less, it’s harder to pay workers more.\n\nThe collective-action dilemma\n\nDespite their pledges to better regulate their supply chains, and despite the customer outcry they face every time they get bad press, well-known multinational labels continue to have their garments turn up at factories accused of abusing workers.\n\nH&M in particular has been outspoken about its ethical and sustainability initiatives, and the need for change. Sävman says he generally concurs with the ETI’s assessment, but also believes ethical purchasing practices can be good for business. The company, he explains, is in the midst of adapting its sourcing, trying to “minimize the cons” while maintaining the model overall. In 2013, for instance, it launched a five-year pilot program that saw it partner with some of its major suppliers in Bangladesh and Cambodia. Among its goals, including some related to environmental sustainability, was getting worker pay up to a living wage, meaning one that covers their needs and those of their families, with some money left over for spending or saving.\n\nBut the company admits that while wages have increased, it still has work to do. The Clean Clothes Campaign, an alliance of trade unions and non-governmental organizations that advocates for workers in the garment industry, has lately harangued H&M for failing to live up to its promise. H&M’s reply has been that there’s “no silver bullet” to achieve a fair living wage for workers, and that it will take a dedicated, industry-wide effort to make it happen.\n\nThousands of Bangladeshi garment workers on the outskirts of Dhaka protested for better wages in January.\n\nDorothée Baumann-Pauly, research director at NYU’s Stern Center for Business and Human Rights, which has done its own investigations into the problems of the garment industry, believes the brands have a sincere interest in establishing decent working conditions. “There are a lot of admirable CSR activities including auditing and capacity building and training, even training for improved industrial relations,” she says. Even so, it’s “business as usual,” she points out, “plus specific activities that then try to compensate for what business models are causing.”\n\nSo why hasn’t there been more change? One possibility is that brands keep trying to fix systemic problems through unilateral projects, when what appears to be needed is collective, industry-wide reform. That’s easier said than done when any move that raises prices or reduces the speed of an individual brand puts it at a competitive disadvantage.\n\nThe authors of the ETI report describe it as a “collective action dilemma.” It’s a situation in which everyone would be better off cooperating, but their conflicting interests prevent it. “In such situations, individual action will continually fail to address underlying problems as each actor in the chain has an incentive to focus on lower costs and drive down labour standards and wages,” the report says.\n\nKalpona Akter, an activist for workers’ rights and chief executive of the Bangladesh Centre for Workers Solidarity, takes a more skeptical of brands’ motivations, saying they were forced to make visible efforts in the wake of disasters such as Rana Plaza to save their images. “They didn’t do that voluntarily,” she told me in an interview this past November, when she was speaking at Business of Fashion’s Voices conference. “They had been pressured, and our people had to be killed to let them do whatever they’ve done in terms of improving safety.”\n\nAkter said that foreign fashion brands continue to wield a great deal of power in Bangladesh. If they really wanted to, she argues, they could use their tremendous financial leverage to pressure both factory owners and the government to bring about change.\n\nWhy governments allow it to happen\n\nIn theory, the governments in countries that are big garment exporters could step in to ensure that their citizens are paid and treated fairly, whatever demands foreign companies may make. Except that they’re in competition too, in a sense, because their economies may rely on the export industries, giving them an incentive to keep wages low in their own countries.\n\nBangladesh is an extreme case. Clothing has come to account for more than 83% of its exports over the past three decades. And many government officials themselves have investments in the garment industry.\n\n“The government of Bangladesh—and many of the countries that host the global garment industry—considers low wages to be a comparable advantage and … cheap labor to be something that is their right to kind of exploit,” explained Sarah Fox, the former special representative for international labor affairs at the US Department of State, at a summit last April on the industry’s progress since Rana Plaza.\n\nFox also pointed out that Bangladesh’s government had made it harder for workers to unionize, creating bureaucratic obstacles such as demanding that 30% of workers in a factory join a union for it to be recognized. Bodies such as the International Labour Organization and Human Rights Watch have deemed that percentage unreasonably high.\n\nA few months ago, when tens of thousands of Bangladeshi garment workers took to the streets to protest the government’s failure to raise the minimum wage to the levels they demanded, police squelched the demonstrations with rubber bullets, tear gas, and water cannons. The Worker Rights Consortium, an independent monitor of labor rights, called it the most extensive repression (pdf) it had documented in two decades of work in Bangladesh, and pointed to the government and apparel factory owners as responsible.\n\nWhile in the past, workers’ movements have been galvanized and gained popular support after industrial disasters, Bangladeshi garment workers after Rana Plaza found themselves with little leverage to exert. If governments view workers as commodities, and brands can quite easily move to other factories—or even other countries—to make their clothes, they lack the power to force changes in their working conditions.\n\nPolice in Bangladesh chase protesters who in January took to the streets to demand higher wages.\n\nIt’s not as simple as people in power exploiting those without it, though. Governments in low-wage countries also see a national benefit in attracting foreign brands with low prices. Bangladesh’s garment industry, exploitative as it may be, has been instrumental in reducing poverty and fueling the country’s startling economic growth. Researchers and unions often note that garment workers want more work, not less. They’d just like to be paid better for it.\n\nBoth the benefits and struggles workers endure in these sprawling, pressurized supply chains are direct consequences of foreign brands looking across the globe for inexpensive sources of labor. It’s free trade at work, in all its complexity, as the authors of the ETI report note: “On the one hand, the mechanisms driving competitiveness have brought jobs, unprecedented economic growth, and opportunities to places like Bangladesh, China, Myanmar and South Africa,” they write. “On the other hand, the same mechanisms also make work exploitative and precarious.”\n\nThe authors quote a senior corporate social responsibility manager on the conundrum: “Let’s be honest. It’s called capitalism!”\n\nThe path to development\n\nThere’s an argument that the low wages and exploitative conditions workers in developing nations face in industries such as the garment business are just temporary, and are actually a sort of stepping stone to a future of rising incomes and standards of living. The shining example of this process is China.\n\nThe country attracted foreign customers with its abundant labor and low costs, kept down in part through lax regulation of labor and environmental standards. It used those foreign investments and its large domestic savings (pdf) to increase its economic productivity and foster the growth of more advanced jobs, making more complex products. Wages rose, giving rise to a consumer class that has mushroomed. In 2019, the country that makes most of the world’s clothes is now poised to overtake the US as the biggest market for them, while clothing and footwear companies are looking for cheaper alternatives to make their products.\n\nCities such as Shenzhen are nothing like they were even a few decades ago.\n\nThe garment industry offers an entry point to building the manufacturing base to spur this process, since clothes are a relatively simple product to start making. So are the conditions in countries such as Bangladesh and Vietnam just part of this road to economic development?\n\n“That’s the million-dollar question, isn’t it?” ETI’s Buttle says. “In some ways you can look at China and say, ‘Well, actually they have managed to develop.'”\n\nBangladesh, for all the problems that still exist in its garment industry, is better off today than it was a few decades ago. But, Buttle notes, China’s economy wasn’t nearly so dependent on garments as Bangladesh is, and even if it is getting richer as a whole, that doesn’t mean garment workers are receiving their fair share of the benefits. “There’s an elite group who maybe are benefitting more than the mass of the workers,” he says.\n\nNYU’s Baumann-Pauly separately points out that the garment industries around Southeast Asia haven’t really followed China in graduating to making more complex items, such as electronics, that justify higher wages. “They’re doing the same basic garments that they did 10 years ago, most of them at least,” she says of factories in Bangladesh. “Then it’s difficult to pay higher classes and higher wages, and so they’re pretty much stuck.”\n\nBesides, even if low-wage industries can lead to development, workers need not be mistreated along the way. There’s really no good justification for the dreadful conditions that persist.\n\nTo ensure workers are properly protected, paid, and able to attain some sort of advancement through the garment industry will probably require brands and others to come up with alternative models that disrupt, in part or whole, the “cheap, flexible, and fast” regime that characterizes much of fashion’s supply chains. (The same is likely true, incidentally, if the fashion industry intends to reduce the tremendous strain it is placing on the environment.) There isn’t one clear path forward, but big stakeholders have been experimenting with different ways of doing things.\n\nFactories in Ethiopia are rising as a new sourcing destination for clothing brands.\n\nA collective-action solution\n\nThe ETI points to collective-action agreements as one option. They let brands pool resources, allowing them to accomplish together what no one brand could do on its own. They also let them use their collected leverage over suppliers to make sure they pay their workers well and maintain a safe working environment. Lastly, they spread the economic costs, making them easier to bear. Cost is always a stumbling block: “Who’s going to pay?” is the perennial question asked in any effort to improve conditions and raise wages.\n\nH&M’s Sävman and Jenny Fagerlin, the company’s sustainability manager for global production, believe this kind of industry-wide agreement offers maybe the best path to reform. One notable example is ACT, which stands for Action, Collaboration, Transformation, and has brought together brands and trade unions in an effort to raise garment wages in factories in Cambodia, Turkey, and Myanmar. By having a number of powerful companies in agreement, it reduces the price competition between them that drives down wages, theoretically making it more feasible for factories to pay wages high enough for workers to support themselves and their families. ACT also promotes workers organizing—a condition experts believe to be necessary for real change—and Fagerlin says it helps move away from a transactional relationship between brands and their suppliers.\n\nThe most prominent case of this type of agreement is the Accord, the joint effort by brands and trade unions that formed after the Rana Plaza tragedy to share the work of inspecting and fixing factories in Bangladesh’s garment industry. While arguably flawed, it has accomplished much of the work it set out to do in the factories it targeted, though factory owners and Bangladesh’s government are currently trying to push it out.\n\nAnother promising approach is to have brands treat the factories that make their clothes as long-term partners, rather than temporary contractors. “In its most advanced form, such a partnership creates supply chain interdependency,” the ETI report says. “Supply chain interdependency overcomes the problem of being non-committal to suppliers, shifting of commercial risk to supplier, a ‘hit & run’ approach and flexibility of changing suppliers ‘like your shirt.'”\n\nBaumann-Pauly is currently studying a company that is sourcing from Ethiopia, which is rising rapidly as a low-cost destination (paywall) for making clothes. It made a five-year commitment to work with its suppliers and help them improve their productivity. At this stage she can’t name the company, but she explains, “They know that in the first couple of years they will not make money from those suppliers, but they want to get them there. And so it’s an entirely different business model, saying, ‘We’re in a partnership. We accept losses at the beginning of this partnership. But we think we can do this together, raise productivity, and then get us to a point where we both make money.'”\n\nOther options for changing the system include looking to governments to intervene, or relying on the demands from ethical consumers who resolve to withhold their dollars from brands that don’t reform. But Buttle points out that neither is a realistic path to change. “If you’re provided with a cheap garment, most people are just going to buy it without thinking about it,” he says. “There are, I think, more consumers who are asking these questions, and more conscious of these kinds of issues. But at the same time, we shouldn’t put too much of the emphasis on the consumer to do the work for the brands.”\n\nShoppers fill a Uniqlo store in Paris, France.\n\nThe global garment trade may yet see a major upheaval in the decades ahead, not coming from labor movements but because of automation. Fashion has been slow developing robots that can handle stitching stretchy, pliable fabrics, in part because it has had an endless pool of cheap labor to draw on, but it may only be a matter of time. The International Labour Organization has warned that workers in the apparel and footwear industries, particularly in Southeast Asia, are at risk of being displaced in the millions, and that governments should begin investing in preparing workers for higher value manufacturing\n\nThe good news, both Buttle and Baumann-Pauly say, is that brands are really beginning to question how they do business at a fundamental level. The hope is a new approach will emerge and take hold that really does improve the lives of the millions of garment workers cutting and sewing the clothes, shoes, and other items that people in rich countries such as the US buy, wear, and discard so casually.\n\nThe big aspiration for the new and growing garment industry in Ethiopia, for instance, is that it can avoid the problems that have plagued the industry in countries such as Bangladesh. The Hawassa Industrial Park, inaugurated in 2016 as the largest industrial park in Africa, has new buildings and a modern sewage system. The government there sees it as a key component in its plan to transform Ethiopia into a manufacturing economy, and even though pay was low when it opened, workers were optimistic about the opportunities it might offer. PVH Corp., owner of the Tommy Hilfiger and Calvin Klein brands, is one of the companies that is producing its clothes there, and has been honored by the US State Department for its responsible conduct in Ethiopia.\n\nBut already the story is starting to sound familiar: Complaints have surfaced that the pay in Ethiopia’s nascent garment industry isn’t enough to live on. A recent survey suggests the great majority of workers don’t earn a living wage. In March, workers went on strike to protest the inadequate pay and poor conditions. As new reports of labor abuses have cropped up, PVH Corp. has vowed to investigate.",
      "Folder": "Feedly",
      "Timestamp": "1556453999",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.377786Z"
}