{
  "id": "08d4fe94be304c7180b83ccaf5f84284",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/790574/growing-up-poor-taught-me-to-recognize-the-false-premise-of-the-american-dream/",
      "Title": "Growing up poor taught me to recognize the false premise of the American Dream Quartz",
      "Selection": "Last month, on my way to a friend’s new apartment in San Francisco, I listened to an episode of Malcolm Gladwell’s Revisionist History podcast called “Carlos Doesn’t Remember.” I quickly found myself in tears. The protagonist’s story was my story; it was my co-founder’s story; and it may be your story, too.\n\nThe protagonist of the episode, Carlos, is a smart, hard-working high school sophomore from a poor part of Los Angeles. Growing up, he was fortunate enough to get into a program called YES to help kids like Carlos get a scholarship to an elite private school. It sounds like he’s got his ticket out, but it’s never that simple. You don’t just leave behind where you came from because you get a scholarship to a good school.\n\nCarlos’ story highlighted a problem that I’ve experienced but was never able to articulate. Scholarships are supposed to be an equalizer — and we as a society should continue to make education more affordable and scholarships available . But the real battles that underprivileged kids face can be much more insidious and intangible.\n\nWhat it means to be “good enough”\n\nI grew up in East Oakland as the youngest son of Teochew-Vietnamese immigrants. School was always easy for me. I never really felt challenged all throughout elementary school. Amidst the droves of teacher strikes and substitute teachers, the truly dedicated teachers of Oakland’s Maxwell Park Elementary School were few and far between. But in fifth grade, I was fortunate enough to be taught by Mrs. Harris, who changed the course of my life forever.\n\nRight away, I knew that Mrs. Harris was special. She cared deeply about her students and went to great efforts for us. On weekends, she invited students to her house for lunch. Using her own money, she gave away trinkets to those who did well on assignments. And during one of the parent-teacher conferences, she did something unthinkable and so incredible that I didn’t fully comprehend its impact until years later. She begged my parents to have me apply to private middle schools to get me out of the failing Oakland public schools.\n\n My parents thought of education as uniform and binary — you either went to school or you didn’t.  My parents, who don’t speak much English, did not understand what was happening. They didn’t know what a private school was, let alone why anyone would pay for school when there was free public education. Neither graduated from high school before fleeing from Vietnam to America with my eldest brother in tow. While they valued education for their children, they thought of education as uniform and binary — you either went to school or you didn’t. And as long as their kids went to school, that was good enough.\n\nIf it had been up to my parents, nothing would have happened. But Mrs. Harris was hell-bent on making sure that I would have this opportunity for a better education. Every day, she would ask me, “So have you started applying yet?” After weeks of hounding my parents and patiently extolling the importance of improving my education, Mrs. Harris, my brother, and most of my 16 aunts and uncles managed to convince my parents to look into this private school idea.\n\nThanks to their efforts, I ended up applying to the prestigious Head-Royce School in Oakland, taking the admissions test, and getting accepted, but I didn’t attend. Instead, I ended up going to the local public middle school because my parents and I had failed to turn in the financial aid forms before the deadline. It took a village to push my parents to apply to Head-Royce, but there wasn’t anyone around to help us with something as mundane yet essential as filling out the financial aid forms on time. There probably were people who could have helped us, but my parents didn’t want to bother anyone by asking for help. That was their immigrant mindset: you shut up, work hard, and definitely don’t burden others.\n\n Growing up, I never really thought that we were poor, or at least I didn’t understand what that meant. I remember getting a voicemail from the head of admissions at Head-Royce, asking if I still wanted to enroll despite the lack of financial aid. Growing up, I never really thought that we were poor, or at least I didn’t understand what that meant. The words “federally-assisted lunch program” actually made me feel special since I got free lunches at school. But once I found out that the school’s tuition cost more than my parents made in a year, I suddenly realized that there was a world beyond what I had known. Before applying, I had no idea that Head-Royce or private schools even existed, but now that I had a window into that world, it felt like the window had been boarded over, shutting me out.\n\nHere’s the crazy part — I internalized this whole process to mean that I wasn’t good enough for Head-Royce. I had taken a shot at the big leagues, trying to get into a better school, and I had been rejected. I wasn’t smart enough. I hadn’t worked hard enough. I wasn’t enough. If the school had really wanted me, they would have given me a scholarship. I felt awful and ashamed. I didn’t tell Mrs. Harris what happened; she had believed in me, and I let her down. I wasn’t good enough.\n\nSecond chances\n\nI might have given up on myself, but Mrs. Harris refused to give up on me. When she found out that I didn’t get into Head-Royce, she went to work on a back-up plan. We tried to get into a better public middle school in the wealthy part of Oakland, but nothing came of our efforts. Undeterred, Mrs. Harris contacted and pushed to get me into the Heads Up summer program, which offered free classes at Head-Royce for underserved kids.\n\nI remember sixth grade feeling like a lost year. I can’t remember any of the teachers’ names. I just have memories of the English teacher who the kids made cry and the substitute math teacher who yelled at me when I corrected him on how to do long division—never mind why a sixth grade classroom was being taught long division. But I had been given hope. During summer classes at Heads Up, I felt challenged academically for the first time ever and really started to love school. That newfound appreciation for education also rubbed off on my parents — they somehow saved up enough from their minimum wage jobs to pay for a math tutor whose house I went to twice a week that year. Mrs. Harris changed everything. I hope she’s reading this, since I don’t think I ever even said thank you. Thank you.\n\n Once you see a way out, you become laser-focused on that opportunity.  I applied again to Head-Royce, this time for seventh grade. We applied for financial aid as soon as it opened up and had several people check over the forms to make sure everything looked right. Thanks to the generosity of the Malone Family Foundation, I received a financial aid package that allowed me to attend Head-Royce. Head-Royce felt like paradise. Everyone there was smart and loved to learn. The coursework was actually challenging. I loved it.\n\nEven so, I never felt like I fit in. I never, ever told anyone about what had happened when I had previously applied to Head-Royce—it remained a huge, shameful, dirty secret. I don’t think I ever got over that feeling that I wasn’t good enough, though it certainly motivated to me to work my butt off.\n\nI never graduated from the Heads Up program. After enrolling at Head-Royce, I still spent my summers in Heads Up classes and attended the monthly meetings that continued through ninth grade, but I eventually stopped going. I remember Mr. McCoy and Mrs. Gee, who ran the program, being disappointed in me.\n\nAs a high school freshman, I couldn’t quite explain to them why I dropped out: I just didn’t want to be there anymore. Years later, I realized that it was because I was ashamed. Way back in fifth grade, Heads Up didn’t feel like an opportunity — it felt like a consolation prize for not actually getting to go to Head-Royce. And after I enrolled at Head-Royce, I was very self-conscious about going to Heads Up meetings. I didn’t want to brag about how great my new school was. I think part of me also wanted to erase the fact that I was in Heads Up because I just wanted to fit in at Head-Royce. I remember making it a point to never mention to any of my classmates at Head-Royce that I was a “Heads Up kid” because I had once heard someone describe it as charity for poor public school kids.\n\n Given the long odds we beat to get here, our world feels very fragile. Isn’t that crazy? Somehow, despite everything, I had been fortunate enough to be a part of the Heads Up program and then attend Head-Royce on a full scholarship from grades seven through twelve. But rather than talk about any of it, I tried to hide or forget everything. Partly I was ashamed, but I was also motivated by something else Gladwell points out: survival instinct. Once you see a way out, an opportunity for what he terms capitalization, the ability to reach our potential in a meritocratic society, you become laser-focused on that opportunity. It doesn’t matter whether it’s a scholastic or sports scholarship, or a less traditional path. Being poor, you cannot afford to mess up the opportunity that comes along. You don’t take it for granted because you understand you’re playing by someone else’s rules.\n\nEven today, my co-founder, Ricky, and I often feel like that. Given the long odds we beat to get here, our world feels very fragile; at any moment, the clock could strike midnight. We’ve encouraged each other to talk more openly about these feelings, in an effort to strengthen and reinforce the reality of what we’ve built.\n\nAs Gladwell points out, capitalization is generally only possible when you have a champion who can not only show you the way, but help carry you there. Mrs. Harris was that hero for me. She made opportunities happen for me, and she persisted when things hit unexpected road blocks. But not every kid is lucky enough to have a Mrs. Harris.Remembering that, and thinking about how many underprivileged kids must be experiencing this on a daily basis, is why Carlos’s story brought me to tears.\n\nWe as a society need to do more to not only find these lost diamonds in the rough, but to dig them up, champion their cause, and push open doors for them, like Mrs. Harris did for me. We always need more teachers like her, but this isn’t just a call for champions. I believe that in order to level the playing field for underprivileged, minority or other disadvantaged groups, providing opportunities is not enough. We need to start talking openly about the differences in background, mindset, and opportunities that persist even after you attempt to level the field.\n\n We need to start thinking about diversity in tech less as a pipeline and more as a leaky funnel.  When discussing diversity, people often bring up the idea of a pipeline, where the focus is on bringing in as many qualified, underrepresented or underprivileged candidates as possible. But perhaps we should start thinking about it as less of a pipeline and more of a leaky funnel.\n\nThe fact is, when you grow up poor or disadvantaged, there are innumerable places where you might drop off before you get your chance at capitalization, at a better life. As Gladwell points out, many of the brightest students in Carlos’s hometown end up gang-affiliated as early as the eighth grade, long before free SAT prep courses, scholarships, and admissions officers can open up doors for them. We have to do more to ensure that the underserved know what opportunities are available to them and help them through every step of realizing those opportunities.\n\nIn the face of adversity, you have far fewer chances, far less margin for error. I cannot speak on behalf of people of color or women in tech, but I would imagine they experience similar drop-offs in the funnel due to discrimination. The oversights and slights you internalize over the course of many, many years make the rare opportunities you find even rarer and leave you unable to capitalize on what’s left. If we want to start to spot and seal the cracks and leaks that leave people behind, we need to begin the dialogue on unseen inequalities and unexpected drop-offs.\n\nTo everyone who has experienced this—who has felt like they don’t belong or aren’t good enough—the world needs to hear your story. Only then can we begin to create a society that gives current and future underdogs a better chance at a better life.\n\nThanks to Mrs. Harris, Barbara Gee, Howard McCoy, Crystal Land, Peter Reinke, the Malone Family, my brother Peter, my parents, and countless other teachers and people who saw potential in me when I was too young to understand all that they were doing for me and without whom I wouldn’t be here today writing this post.\n\nThe original version of this post appeared on Medium. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1474808242",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.773576Z"
}