{
  "id": "08fc699e663442028d4d70af03596ba3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/949498/jenna-lyons-is-leaving-j-crew-but-the-jenna-lyons-era-of-american-fashion-is-not-over/",
      "Title": "Jenna Lyons is leaving J.Crew. Long live Jenna Lyons Quartz",
      "Selection": "The world of fashion is filled with comings and goings. Nowadays, it’s common for a creative director to spend a few years with one label, before moving on to another. Who’s designing at Dior now? And what of Valentino? For everyday American women—even those who love to get dressed—the answer isn’t relevant.\n\nBut most could name the creative force behind J.Crew: Jenna Lyons. Which is why yesterday, when my phone dinged with a message from a colleague: “Did you see this?” and a link to the news that Lyons would be leaving J.Crew, after 26 years rising through the company’s ranks to the role of president and creative director—second only to CEO Mickey Drexler—it felt, almost laughably, like a moment I might look back on: “Where were you when you found out Jenna was leaving?” (I was, no kidding, at the Trevi Fountain in Rome, wearing my navy J.Crew menswear-style wool jacket. This brand is always with us.)\n\nJenna Lyons (center) for years was the face of J.Crew.\n\nJ.Crew is a company that many people, myself included, feel a deeply personal connection with. As a high-schooler in St. Louis, MO in the 1990s, I would wait for the catalogue and turn down the corners of pages showing the barn jackets, rugby shirts, and roll-neck sweaters I longed for. Twenty years later, I repeatedly lamented that a favorite piece from that era—a simple, scoopback one-piece swimsuit—was impossible to find. At the time, J.Crew was making headlines by directly responding to customer feedback, and my editor at The Cut encouraged me to write an open letter to Lyons. The Cut published my letter, and Lyons’ reply landed swiftly in my inbox, alluding to a possible return of the style the following summer: “I really do appreciate your letter—could never have described that swimsuit better and it is a great reminder to us all that we still have some relics from our past collections that are worth revisiting.”\n\nThe following summer, the swimsuit was resurrected, with fanfare. The outpouring of tweets, emails, and texts I received from gushing and grateful fellow fans of the scoop-back tank suit was overwhelming. Jenna Lyons made me a hero. (Truth told, I suspect she might have had plans to resurrect that swimsuit regardless.)\n\nIt was my first glimpse behind the scenes at Jenna Lyon’s J.Crew—a place more progressive, playful, and fashion-forward than the J.Crew of my childhood, though its preppy spirit remained very much intact. I returned there last February, when I was invited to participate in a cast of non-professional models in the brand’s Fall 2017 show. A few days before, I arrived to J.Crew’s offices for my fitting. There, I found oldies piping through the speakers, and racks upon racks of rainbow-ordered tweeds, furs, sweaters, and plaids.\n\nMy outfit—or “look,” in industry parlance—had already been selected and hung waiting for me: medium-wash blue jeans, a striped wrap blouse, a slate velvet blazer, and a vibrant red wool coat. I put it all on, and Somsack Sikhounmuong—then head of womenswear, and now the chief design officer—and Gayle Spannaus, J.Crew’s longtime superstar stylist, worked in tandem with Lyons. I was drowning in layers, so I first removed the red coat. Wrong move; Lyons could see we needed the color. The blazer came off, and when I went to put my arm through the red coat’s sleeve, Lyons stopped me and tossed it over my shoulders instead. A silk foulard scarf appeared, and I stepped into a pair of plaid block heels. Spannaus advised skipping a bra come show day: It’s better to see a human breast than a bra, she said. Lyons told me not to bother with a manicure.\n\n“We want you to look like you,” she said, snugging the coat around my shoulders.\n\nOne could easily see Lyons’ departure as the end of an era. But the mark she left goes far beyond J.Crew, or even fashion. Jenna Lyons’ impact is about style and attitude as much as it is about clothing. To watch her work—or to read about it—is to see the way she empowers those around her, whether by making the resurrection of a classic swimsuit seem like it was your genius idea, or emboldening women to treat leopard spots as a neutral, menswear as womenswear, and pajamas as clothes.\n\nLyons will stay on at J.Crew as a creative advisor through the end of the year, but please let’s not eulogize the Jenna Lyons era of American fashion. As far as I’m concerned, it’s far from over. Lyons has left us with loads of lessons: Perfect is boring; socks and bras are overrated; stripes are underrated; if you’re super-formal on the bottom (ie: ballgown skirt) go more casual up top. And above all, getting dressed should be fun, and make you feel like you.\n\nI suspect Lyons’ very qualified cohorts at J.Crew will be channeling their “inner Jenna” for years to come—asking themselves “What would Jenna do?” (WWJD)—just as I did yesterday at a vintage store in Rome, when I fell in love with a lusciously soft wool checked blazer that was just a smidge too big for me.\n\nI pulled my arms out of the sleeves, and tossed it over my shoulders instead.\n",
      "Folder": "Feedly",
      "Timestamp": "1491311731",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.616187Z"
}