{
  "id": "0993368db4b94426a0dcc82b425d05e1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2017/12/24/16801334/google-maps-justin-obeirne-cartographer-apple-waymo",
      "Title": "This cartographer’s deep dive into Google Maps is fascinating The Verge",
      "Selection": "Most people who use Google Maps do so without much attention to detail. We just need the directions, the right subway route, or the name of that good sushi place. We don’t spend too much time pondering how Google got so good at mapping the world, and what decisions and choices were made along the way that have made it the go-to navigational tool of our time. \n\nJustin O’Beirne pays attention to these types of details. He’s a cartographer who helped contribute to Apple Maps. So we should trust him when he explains — in depth — about what makes Google Maps so superior to any other mapping service. \n\nwhat makes Google Maps so superior\n\nThis week, he published a fascinating essay that explains the concept of the “Google Maps’ Moat.” By this, he means the layers of data surrounding Google Maps that basically makes it basically impossible for Apple or any competitor to ever catch up. “Google has gathered so much data, in so many areas, that it’s now crunching it together and creating features that Apple can’t make — surrounding Google Maps with a moat of time,” he writes. “It makes you wonder how long back Google was planning all of this—and what it’s planning next...”\n\nO’Beirne starts out by marveling at the level of detail available in Google Maps for even extremely small towns, such as the one where he grew up in rural Illinois. He highlights how Google, unlike Apple, is able to display the shapes of individual buildings and even smaller structures like tool sheds and mobile homes. These minute details can be found even in towns with populations in the double-digits. He uses this to lament the corresponding lack of detail in Apple Maps. \n\nHe charts the history of Google’s efforts to add buildings large and small, highlighting the search giant’s announcement from 2012 that they were “algorithmically created by taking aerial imagery and using computer vision techniques to render the building shapes.” So in addition to getting a first-person street view of your route, you can zoom outward to seeing a computer-rendered model of the surrounding area for contextual information such as the shapes and sizes of buildings.\n\n“How long until Google has every structure on Earth?”\n\nHe concludes that aerial imagery from satellites has outpaced Google’s famous Street View vehicles in the amount of data used to create these vivid tableaus. And he asks an important question: “[H]ow long until Google has every structure on Earth?”\n\nThen things get interesting. O’Beirne introduces us to two researchers, Rachelle Annechino and Yo-Shang Cheng, who observed that people often describe the layout of their city as it relates to “main drags” or “commercial corridors.” He then goes on to describe Google’s unique approach to highlighting these “Areas of Interest” (AOI). About a year ago, these “main drags” began showing up in Google Maps as clusters of orange buildings. Google communicates these “Areas of Interest” to its users through a specific orange shading, but with a level of detail that is truly stunning. \n\nO’Beirne writes (emphasis his):\n\nThis suggests that Google took its buildings and crunched them against its places. In other words, Google appears to be creating these orange buildings by matching its building and place datasets together[.]\n\n[...]\n\nSo Google seems to be creating AOIs out of its building and place data. But what’s most interesting is that Google’s building and place data are themselves extracted from other Google Maps features.\n\n[...]\n\nIn other words, Google’s buildings are byproducts of its Satellite/Aerial imagery. And some of Google’s places are byproducts of its Street View imagery...so this makes AOIs a byproduct of byproducts. \n\nThis is bonkers, isn’t it? Google is creating data out of data.\n\nThis leads O’Beirne to draw some pretty interesting conclusions. If Google has mapped all the buildings and knows precisely what businesses and points of interest are located within, then perhaps the search giant can install augmented reality windshields in its self-driving cars that tell you everything you need to know about adjacent structures. As you’re driving through a city — or being driven, rather — Google Maps can use its accumulated data to pinpoint buildings where you have an upcoming appointment, for example. \n\nAnother possibility is a ride-hailing service more accurate than Uber. An essay by The Verge’s editor-in-chief Nilay Patel makes a cameo in O’Beirne’s story to highlight the difficulty faced by ride-hailing apps like Uber and Lyft in pinpointing exact pickup and drop-off locations. Uber and Lyft drivers already use Google Maps and Google-owned Waze in such high volumes that both ride-hail services threw up their hands and integrated Google’s exceptional navigation tools into their own apps. \n\nO’Beirne fails to mention Google’s own ride-hail ambitions. Waymo, the self-driving division of Google parent Alphabet, is developing its own ride-hail app in anticipation of launching a commercial self-driving mobility service next year. And Waze has been piloting a car-pooling service in California for the past year. \n\nIt’s clear that Google has its sights set on the lucrative ride-hailing market. And with a powerful tool like Google Maps in its arsenal, it could have its leg up over its more established players. \n",
      "Folder": "Feedly",
      "Timestamp": "1514134038",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.559459Z"
}