{
  "id": "0a621eb55de540d38fe0d78775e405bf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/best-ways-to-use-membership-rewards/",
      "Title": "The Best Ways to Use 100,000 Membership Rewards Points The Points Guy",
      "Selection": "Increased welcome bonuses on popular travel rewards credit cards are a great way to earn a quick infusion of points or miles, and The Business Platinum® Card from American Express OPEN is currently offering just that, with a welcome bonus of up to 100,000 points. It’s also relatively common to see similar offers on the personal Platinum Card® from American Express through the CardMatch tool. If you’ve recently received (or are working towards) this welcome bonus, keep reading! Today I’ll go through some of the best ways to redeem your 100,000 Membership Rewards points.\n\nIt’s important to note that the following redemptions all involve transferring your points to one of the program’s 17 airline partners or 2 hotel partners, as this is typically the best way to redeem your Membership Rewards for maximum value. While you can use points directly for travel through the Amex Travel site, this generally won’t get you as much value as you’ll get through partner programs. While transferring does involve extra steps and you’re subject to some variable transfer times, it’s often worth the effort.\n\nIn addition, the Membership Rewards program requires you to link your various frequent flyer accounts with your Membership Rewards account before you initiate a transfer. Here’s how to do this:\n\nLogin to your account at americanexpress.com.\n\nClick on your Membership Rewards-earning card (if necessary), then click on Explore Rewards\n\nClick on the Transfer Points option, then click View All\n\nClick on the partner whose account you want to link\n\nSelect a card holder, verify your card details, enter the corresponding program’s account number, then click Link Account\n\nFrom there you’ll receive a confirmation that the link was successful and will be redirected to the Transfer Points page to complete the transaction:\n\nHowever, be sure you’ve checked award availability before transferring, since you can’t change your mind after the fact. Once a transfer has been initiated, it’s final!\n\nAnother note: you’ll need to pay a small fee whenever you transfer points into a US program like Delta SkyMiles or JetBlue TrueBlue, which will offset the federal excise tax that American Express must pay when you transfer points. But don’t be alarmed; it’s only $0.0006 (or six hundredths of 1 cent) per point and is capped at $99. You’re even given the option to use points to cover the expense, but I strongly encourage you to just pay for it, as you’ll only get a redemption value of 0.5 cents per point.\n\nSo with those details out of the way, what are some of the best ways to use 100,000 points?\n\n1. Up to Four Round-Trip Economy Flights to Hawaii\n\nIf Hawaii is on your list of dream destinations, the Membership Rewards program has you covered.\n\nThe first option is a popular one for many travelers: booking award flights to Hawaii. The Aloha State isn’t always easy to reach using points or miles, but the Membership Rewards program gives you a few great options. The first is for West Coast residents. By transferring points to British Airways, you can utilize the carrier’s distance-based award chart to book round-trip award flights to the islands for just 25,000 Avios. The gateways that fall within this band include nonstop flights from Los Angeles (LAX) and Phoenix (PHX) on American as well as nonstop flights from Seattle (SEA), Portland (PDX), San Diego (SAN), Oakland (OAK) and even Bellingham, Washington (BLI) on Alaska Airlines. Just be aware that you must call to redeem your Avios on Alaska-operated flights, and you may currently need to call for American ones as well, especially if you don’t want to utilize this irritating workaround.\n\nIf you don’t live on the West Coast, don’t fret! You can still get to Hawaii by transferring your Membership Rewards points to Air France/KLM’s Flying Blue program and redeeming them on Delta-operated flights. Flying Blue recently revamped its program and award prices are all over the map, so it’s impossible to predict exactly what awards will cost when redeeming this way. But we’ve found economy flights from New York (JFK) to Hawaii for as low as 35,000 miles round-trip, so it’s definitely an option under the right circumstances. Just be sure to check availability beforehand, as Delta doesn’t always release a ton of award seats.\n\n2. Round-Trip Business Class Ticket to Japan\n\nA round-trip ticket to Japan from the US is within your reach with 100,000 Membership Rewards points.\n\nIf you’d rather cross the entire Pacific Ocean and do so in style, consider transferring your Membership Rewards points to Virgin Atlantic. The London-based carrier isn’t part of a major alliance, instead partnering with various airlines and releasing different redemption schemes for each. But one of the more lucrative ones is on ANA. For just 90,000 miles, you can fly round-trip from Canada or the western US to Japan in business class. The price is just slightly higher (95,000 miles) for the central and eastern US, which includes New York and Washington, DC (IAD), and also applies to flights from Europe.\n\nHowever, it’s critical to note that you can’t book one-way award tickets on ANA through Flying Club, so you must find round-trip availability. This is where ExpertFlyer can come in handy, as you can set alerts for a variety of dates and then call to book as soon as you’re notified that seats have opened up.\n\n3. Up to Three Round-Trip Tickets to Spain\n\nIberia business class is a great option for your 100,000 Membership Rewards points, though you could get up to three round-trip economy flights as well!\n\nAnother lucrative transfer partner of the Membership Rewards program is Iberia. Like British Airways (its corporate cousin), the carrier uses Avios as its currency and follows a distance-based award chart. However, for flights on its own metal, you aren’t subject to the horrendous taxes and fees that you’d pay booking through British Airways.\n\nOne sweet spot is for East Coast residents: a round-trip, off-peak economy award ticket from either New York or Boston (BOS) to Madrid (MAD) would set you back just 34,000 Avios, which means you’d be able to get three of these award tickets with your haul of points. (Yes, that would technically be 102,000 Membership Rewards points. However, since you’d need to spend some money to earn the welcome bonus on either the personal or business Amex Platinum, I’m comfortable including it.)\n\nIf you’re looking to fly to Madrid from Miami (MIA), Chicago (ORD) or even Los Angeles (LAX), you can actually score round-trip economy award tickets for just 42,500 miles apiece, so you and a friend or spouse can get to Spain in this fashion. And if you’re feeling like traveling in style, a round-trip business class award ticket from these gateways to Madrid will be just 85,000 Avios. That’s a steal for transatlantic business class!\n\n4. Up to 25 One-Way Short-Haul Flights\n\nEarlier I noted a “sweet spot” redemption by transferring your Membership Rewards points to British Airways and redeeming them through the carrier’s distance-based award chart to get from the West Coast to Hawaii. While 25,000 Avios for that round-trip ticket can be a great value, you can also get tremendous value by looking at short haul flights.\n\nThrough the Executive Club program, British Airways or partner flights outside of North America that cover less than 651 miles in length are just 4,500 Avios apiece. In addition, if you book on the carrier’s own metal or that of Iberia or Aer Lingus and travel on off-peak dates, you’d only need 4,000 Avios! This can be a terrific redemption out of Oneworld hub airports, as these flights can be quite expensive (though be sure to check the cost of a paid ticket to make sure you’re getting a good value).\n\nAs an example or how far this can take you, here’s a map that shows the destinations within 651 miles of Tokyo (NRT), one of Japan Airlines’ main hubs:\n\nAs you can see, you could take virtually any flight within Japan and pay just 4,500 Avios each way!\n\nIn addition, you can take flights that are 1,151 miles or less in distance for just 7,500 Avios in each direction, giving you the option of booking six of these round-trip tickets with the Membership Rewards points you’d earn from the Amex Business Platinum.\n\n5. Round-Trip Business Class (or Maybe Even First) to Europe or Southern South America\n\nAnother transfer partner of American Express Membership Rewards is Etihad Guest. While you likely won’t get much value transferring your points to Etihad and redeeming for flights on its own metal, there are some terrific redemption options on partner airlines. One of my favorites involves American — if you can find availability to either Europe or Southern South America (including Argentina, Chile and most of Brazil), you can book a round-trip flight for just 100,000 Etihad Guest miles. American would charge 115,000 AAdvantage miles for the same award.\n\nIn addition, reports indicate that Etihad applies the same pricing on these flights for both business and first class, so if you can find a seat in the “Z” fare class (American’s saver level first class inventory) on any of these routes, you should be able to book it for just 50,000 Etihad Guest miles each way. The only potential drawback is that you must call to book these, but the same story linked above has complete details on Etihad’s new-and-improved Serbian call center.\n\n100,000 miles for round-trip, long-haul business class is quite good. Getting that exact same price for first class is truly spectacular.\n\nBottom Line\n\nThe Amex Business Platinum card’s welcome bonus is a great way to unlock incredible redemptions.\n\nThe Membership Rewards program can give its members a ton of value, especially when you utilize its diverse set of transfer partners. By transferring your points to these airlines, you can extend their value far beyond the 1 cent per point that you can get for booking flights directly. If you’re set to score 100,000 points from either the Business Platinum card or the personal Platinum card, hopefully this post has given you some inspiration to start planning your next trip.\n",
      "Folder": "Feedly",
      "Timestamp": "1528592477",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.497543Z"
}