{
  "id": "0acbf37199e746668ed51b16078e546c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/science-and-health/2017/7/14/15882210/solar-eclipse-2017-us-posters",
      "Title": "These gorgeous posters of national parks will make you excited for the solar eclipse Vox - All",
      "Selection": "There’s still time to plan a trip to watch the rare solar eclipse, which will cut across the US on August 21. And if you want to experience it in some of the most beautiful spots in the country, you’re in luck: There are 20 national parks and nine national trails in the path of the totality.​ \n\nArtist and educator Tyler Nordgren, a professor of physics and astronomy at the University of Redlands in California​, saw an opportunity to use the National Parks to educate people about space science. \n\nAnd so he decided to put his artistic talent to use for the upcoming solar eclipse. His posters are inspired by the art used in midcentury Works Progress Administration materials. (Check out these WPA-style posters from the Department of Energy celebrating the US energy revolution.) And they’re pretty cool.\n\nTyler Nordgren\nTyler Nordgren\nTyler Nordgren\nNordgren first starting drawing professionally when he made the illustration for the cover of his book. He once teamed up with the NPS on a poster campaign to “See the Milky Way” where “Half the park is after dark” — a slogan he came up with on his own. \n\nYou can read his artist’s statement here. \n\nTyler Nordgren \nMost of the US will see a partial eclipse on August 21. If you want the full experience, you'll need to be within the 60-mile-wide path of the totality — when the sky goes dark for a few minutes in the middle of the day. Luckily, NASA has mapped out the best places to be for this sight in August.\n\nAs for Nordgren, he'll be watching the eclipse from right outside the main headquarters of John Day Fossil Beds National Monument in Oregon. While the location will be great for viewing, Nordgren told me via email, the state has a lot to get ready for. \n\n“The state is very worried about the possibility of 100,000 people descending on that sparsely populated part of the state, getting in massive 8-hour long traffic jams, and having some newbie-camper in the forest accidentally starting a major forest fire that traps tens of thousands,” he writes. “So it could be great, or it could be a major apocalypse, in which case, maybe the ancients will have been right about eclipses all along. Fortunately, Oregon officials are hoping for the best but planning for the worst.”\n\nIf you’re not up for braving the eclipse-catching crowds in the path of the totality, you’ll still be able to catch a partial eclipse from anywhere in the US. ",
      "Folder": "Feedly",
      "Timestamp": "1500060512",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.652613Z"
}