{
  "id": "0b1e4abad8684bafaeeb121bfc7667ab",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://theringer.com/searching-for-every-mlb-teams-andrew-miller-6aeed2476810",
      "Title": "Searching for Every MLB Team’s Andrew Miller The Ringer - Medium",
      "Selection": "How to Baseball\n\nIt Might Be Miller Time at a Ballpark Near You\n\nAndrew Miller’s unconventional usage gave Cleveland an enviable edge last season and left numerous MLB teams searching for their own Miller-type. How many clubs intend to deploy a flexible facsimile this spring? We asked.\n\n(Getty Images/Ringer illustration)\n\nBaseball has always been a numbers game, but players and teams are getting smarter than ever — and fans are, too. Throughout The Ringer’s 2017 MLB preview, in a series we’re calling “How to Baseball,” our experts will explore the developments that stand to change the way the game is played and consumed. We’ve never known more, and while knowledge is power, it’s also a wellspring of questions. We hope to answer some of them — and to remind you all to bunt wisely.\n\nThe more one reads about Indians fireman Andrew Miller, the more one suspects that being unselfish about saves, entering games at make-or-break moments, and alternating between warming up early or late must be the easy part of life as a precedent-setting reliever. The hard part is probably having to talk about the above.\n\nMiller’s unique usage as a shutdown, multi-inning arm straight out of the ’70s has made him a popular interview target for writers in search of baseball’s latest trends. When I was working on a story late last August about Miller’s work with Cleveland, an Indians PR person told me Miller wouldn’t be available to talk about his unorthodox usage because he’d already been asked about it so many times by local media members. (Instead, I talked to Terry Francona, who’d probably been asked just as often.) That was, again, in August, more than a month before the playoffs drew 10 times the attention to Miller’s exploits; we can only imagine how many more times Miller has been bombarded with bullpen questions since then. That’s the hidden cost of becoming a trailblazer: People want to talk to you, and every one of them wants a fresh quote on a stale subject.\n\nEarlier this month, Miller was quoted in a Nick Cafardo feature for the Boston Globe called, “Why Andrew Miller could represent the future of relief pitching.” At first, Miller downplays the idea thatbaseball may be “trending back toward the late-game, multi-inning relief ace,” calling the response to his playoff performance “a lot … made out of a little.” But then Cafardo coaxes a quote that seems to support the thesis.\n\n“I think we’re going to see the multiple-innings reliever,” Miller says. “I don’t know how long it will take, we might be five years away from the 40-appearance, 80-inning reliever or something like that, but I can see it happening.”\n\nCould it possibly be happening as soon as this spring? As Miller mentions to Cafardo, teams might have more success getting minor league bullpen guys to break free of their bonds than they would big leaguers with long-established routines. But the memory of Miller’s October run, and the urge to emulate it, will never be stronger than now.\n\nSince the workhorse ’70s, both innings pitched per relief appearance and the percentage of relief appearances lasting two innings or more have continued a decline that began immediately after baseball began, sinking most precipitously after the popularization of the Eckersley-La Russa cookie-cutter closer in the late ’80s and early ’90s.\n\nIn recent years, though, both rates have leveled off: Relievers have averaged about one inning per appearance, with roughly 10 percent of appearances lasting two-plus-innings. If Miller and Cafardo are right, that plateau could be a prelude to an upturn.\n\nBaseball’s go-to public stat providers haven’t processed spring training data in a way that would allow us to look for longer average outings this year than in spring trainings past, but there are some anecdotal indicators that suggest something afoot. On a podcast last week, Sun Sentinel Marlins beat writer Tim Healey told me and Jeff Sullivan that “unconventional use” of the bullpen is something Don Mattingly’s team “talked about throughout the offseason,” partly as a means of compensating for a thin starting staff. Healey also mentioned that the Marlins “see [David Phelps] as their Andrew Miller–type.” Which made me wonder: How many “Miller-types” are there?\n\nThe 20 Baseball Players You Need to Watch in 2017From Francisco Lindor to Manny Machado, these guys play the game the right way — the entertaining waytheringer.com\n\nTo find out, I surveyed one or more beat writers from each of the 28 other non-Indians teams and asked them if there’s a particular pitcher on the club that they cover who’s gotten buzz in camp about being a flexible, multi-inning reliever in the Miller mold — in role, if not necessarily results. (Miller’s stuff and stats are even rarer than his willingness to work without a predictable pattern.)\n\nThe table below contains the survey results. If the writer reported that the club does have at least one pitcher who’s likely to start the season in a Miller-like role, I listed him in the first column. If the team has a pitcher (or pitchers) who might eventually slide into a role that in some way mirrors Miller’s (in the writer’s estimation), I filled in the second column. If both columns are blank, either the team follows strict inning assignments or its bullpen is still too unsettled to say whether there’s a wannabe Miller lurking somewhere inside.\n\nThis table is just a snapshot of where teams stand as Opening Day approaches. Most teams’ bullpens will reshape themselves significantly over the next six months, as injuries strike, prospects are promoted, and pitchers excel or struggle. After all, when last season started, the only Andrew Miller on the Indians was the SVP of strategy and business analytics. The one we’ve been talking about was a conventional late-inning reliever closing (and subsequently setting up) for the Yankees.\n\nAll told, about a third of teams (including the Indians) have a pitcher who’s currently slated to approximate a Miller-like role, although not necessarily in direct response to Miller’s heroics last year.\n\nPhelps may be the most Miller-like of all, drawing explicit comparisons from Mattingly, who’s called him “kind of our Andrew Miller.” Pitching almost exclusively in relief last year, Phelps saw his velocity spike almost 3.5 mph, with a correspondingly large increase in strikeout rate. Although he averaged just barely more than an inning per appearance out of the pen, he entered games as early as the fourth and as late as the ninth. Mattingly has described his position on the 2017 team as a “defined, undefined role” in which his task could be “a couple innings, it could be closing a game out — anywhere in there depending on where our [bullpen is] at.” Although Phelps still hoped to rejoin the rotation last spring, he’s said that he’s content this time to reprise the role that Miller made sexy.\n\nThe Rebirth of Baseball’s Great CommunicatorCleveland’s Terry Francona is innovating — and eating — like never beforetheringer.com\n\nThe Astros’ Devenski is an actual example of the almost mythical 40-appearance, 80-inning reliever Miller invoked in his quote to Cafardo. Their origin stories don’t look much alike: Miller, a sixth overall draft pick, was once ranked the 10th-best prospect in baseball by Baseball America; Devenski, a 771st overall pick, never made a top 100 and was left unprotected in the Rule 5 draft. Yet as a 25-year-old rookie last season with no prior experience above Double-A, Devenski was one of the best pitchers in baseball on a per-inning basis. As Sullivan has observed, only Clayton Kershaw and Kyle Hendricks recorded better park- and league-adjusted ERAs.\n\nDevenski, who finished fourth in rookie of the year voting, made 43 appearances out of the pen, totaling 83.2 innings. That made him the first 40-something/80-something bullpen pitcher since White Sox reliever Tony Peña, a sub-replacement pitcher in 2010. Devenski ditched his curve for an increasingly nasty slider as the season wore on, and his fastball played up in the pen, where he’ll likely remain unless the Astros suffer enough injuries for him to be pressed into service as a starter.\n\nIt’s not only new blood getting in on the act. Shortly after the World Series ended — and days after a prescient Viva El Birdos blog post entitled “Trevor Rosenthal as Andrew Miller” — Cardinals manager Mike Matheny called deposed closer Trevor Rosenthal to tell him to prepare to stretch out for more extended outings, and GM John Mozeliak told Derrick Goold that “it makes sense to have people prepared to do more than just a one-inning stint.”\n\nNor is Miller-like experimentation limited to competitive teams. Union-Tribune Padres beat writer Dennis Lin says that Padres reliever Brad Hand “has been talked about” as a candidate to mimic the Miller role. Conveniently, Hand, who led all relievers in innings and appearances last season, throws a close replica of Miller’s slider. Meanwhile, the Reds came into camp with a long-gestating plan to use former starters Raisel Iglesias and Michael Lorenzen as “alternating, multi-inning closers” who’d pile up even more outings than Miller and Cleveland quasi-closer Cody Allen. The plan has hit some hurdles — Iglesias has missed much of March after falling in the shower, and Lorenzen has pitched poorly enough that he might wish he’d slipped too — but even if it doesn’t pan out, the Reds had the desire to do something different.\n\nIn Arlington, multiple innings are in the air, although there’s no designated fireman. “It seems like [Jeff] Banister is testing the waters on a lot of guys doing [the Miller role],” says Levi Weaver, who covers the Rangers for WFAA, via direct message. “It feels like it’s less making one guy that guy, and — aside from [Sam] Dyson — pushing that versatility aspect as a bullpen-wide trait.” Matt Bush and Keone Kela have had a few multiple-inning outings this spring, which leads Weaver to believe that is “something Banister is intrigued by.” Even Angels manager Mike Scioscia, who usually prefers rigid roles, has eschewed them this spring in favor of flexibility, although some of his multi-inning options — Bud Norris comes to mind — might not be great fits for even one inning of work. Meanwhile, in Washington, Blake Treinen could still be a conventional closer, but as The Washington Post’s Chelsea Janes says, “I think if he isn’t the closer, it will be because they want to make him Miller-y.”\n\nIn some cases, perhaps, we’re seeing what we want or expect to: After Miller mania, anything out of the ordinary can look like revolution. As Miller told Cafardo, no pitcher could withstand the workload he endured in October (19.1 innings in 15 team games) over the full summer schedule, so a reversal of the long-term, league-wide trend in the regular season is likely to come slowly, if at all. Still, there are some stirrings on the bullpen flexibility front this spring. We’ll soon see whether they last long enough to move the major league needle.\n",
      "Folder": "Feedly",
      "Timestamp": "1490704570",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.617472Z"
}