{
  "id": "0bd1ead7dc72467d80d6b33652f18621",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.boardingarea.com/2018/07/17/wow-get-those-bose-for-a-net-27-sorta-or-tons-of-other-deals-amplified/",
      "Title": "[Expired] WOW Get those Bose for a net ~$27 (sorta). Or tons of other deals amplified. Frequent Miler",
      "Selection": "Sorry, this deal is no longer available.  Do you want to be alerted about new deals as they’re published?  Click here to subscribe to Frequent Miler's Quick Deals.\n\nTalk about saving the best for last: if you still have the ability to get 20% via either of the 2 Amex Membership Rewards promotions, you can get a monster deal. I can’t take credit for this discovery — a reader commented on my post from late last night / early this morning, and it seemed good enough to share as all of the best Amazon deals can be maximized for a further discount by adding an Amazon gift card to make up the difference between the “original” price and $500, thereby netting a full $100 discount.\n\nAs an example, let’s look at the Apple version of the Bose noise-cancelling headphones that we posted last night. As you can see, the “original” price is $279 (the “price” under the list price):\n\nAs we noted last night, the 20% off that you can get by paying with 1 Amex Membership Rewards point (if you aren’t eligible for that promotion, see the section titled “Second 20% off promo” below) is taking 20% off of the original $279 and subtracting it from the sale price of $125.\n\n20% of $279 = $55.80\n$125 (sale price) – $55.80 = $69.20\n\nAnd that’s how it comes up in the cart:\n\nHowever, reader Larry figured out how to make this deal much hotter. Remember that the 20% off promo works on an order size up to $500 — you can get a max discount of $100. As Amazon is figuring the discount based on the “original” price of the headphones, Larry figured out that if you add an Amazon gift card worth the difference between the original price and $500, you’ll get a total discount of $100.\n\nIn other words, $500 (max order for discount) – $279 (original price of headphones) = $221. If you add a $221 Amazon gift card to your card, you’ll get a total of $100 off. Start off by adding the headphones (Apple version) to your cart plus a $221 Amazon gift card.\n\nThis is what your cart will look like.\n\nWhen you go to checkout and apply at least 1 Membership Rewards point either using the original promotion or the new promotion (more below), this is what your total will look like:\n\nThat’s a total of $247.99. For $247.99, you get:\n\nA $221 Amazon gift card\n\nthe Bose QuietComfort 25 Acoustic Noise Cancelling Headphones\n\nAnd if you stack with the Quick Deal that Stephen posted earlier (See: New Amazon Amex Offer: Earn 3x Membership Rewards), you’ll also earn 744 Membership Rewards points. Now that’s a steal. If you were to value the Amazon Gift Card at face value, that would mean a net cost of $27 for the headphones. An Amazon gift card isn’t the same as cash that can be spent anywhere, but if you’re an Amazon Prime member, I’m sure it’s pretty close in value to you.\n\nThat same technique works on tons of other items. Here is the Sonos One with a total of $301 in gift cards ($50 as part of the bundle + $251 added to hit the $500 mark) for $353.91.\n\nThat speaker alone normally sells for $199. Getting that plus $301 in gift cards for $353 is an awesome deal.\n\nThis works for tons of the other good deals we’ve posted. As a reminder, here are some of them. Do the math on adding a gift card to the “original prices” crossed out below to hit $500 and trigger the full $100 discount. Some of them become really awesome — though note that some may no longer be available.\n\nOculus Rift + Touch Virtual Reality System: Original price $399 Prime Day sale price: $349 Final price: $269.20\n\nRobot Roomba 671 Robot Vacuum With Wi-Fi: Original price $349.99 Prime Day sale price: $229.99 Final price: $159.99 with inflated 20% off (We have another 600-series model. My wife loves it. I hate the noise it makes when I’m trying to write….so we got a second one — before this sale \n\nRing Video Doorbell Pro, Works with Alexa: Original price $249 Prime Day sale price: $174 Final sale price: $124.20 with inflated 20% off (noted last night that my parents have a Ring doorbell that I gave them as a gift and they love it as there is no peep hole in their front door and they like to see who is there even when they aren’t home)\n\nInstant Pot DUO60 6 Qt 7-In-1 Multi-Use Programmable Cooker: Original price $99.95 Prime Day sale price: $58.99 Final sale price $39.00\n\nCoravin Model Limited Edition Wine Preservation System: Original price $304.97 Prime Day sale price: $174 Final sale price: $113.90 (This is an interesting device that allows you to “access” your wine without popping the cork. I own one of these (resold a quantity of them). It’s not perfect, but it’s not bad. As I was typing this, I got up to pour a glass from a bottle I first tapped about two weeks ago and it tastes perfectly good. I haven’t gotten the claimed months out of a bottle, but neither am I storing in the correct conditions. At this price, I think it’s worth it if you prefer not to drink an entire bottle in one sitting. This is a better price than what I was stacking when I was reselling them).\n\nSegway miniPRO Smart Self Balancing Transporter 2018 Edition, 12.5 Mile Range, 10 MPH of Top Speed, 10.5-Inch Pneumatic Air Filled Tires, Mobile App Control, Customizable LED Lights: Original price $499.99 Prime Day Sale Price $399.99 Final Price: $299.99 (I own one of these and one of the Xiaomi-branded Ninebot. They are a ton of fun. We ride them on an old rail trail and they handle the bumps just fine and we live in the mountains and they handle hills without an issue. When our son really won’t fall asleep for a nap, my wife puts him in the stroller and pushes him down the rail trail with this and he falls asleep almost without fail. The Segway-branded version at $299.99 is a very good deal.).\n\nLG V35 ThinQ – 64 GB – Unlocked (AT&T/T-Mobile/Verizon) – Aurora Black: Original price: $899.99 Prime Day sale price: $599.99 Final price $499.99\n\nAll-new Sonos One with 50 Dollar Amazon Gift Card – Smart Speaker with Alexa voice control built-in: Original price $249 Prime Day Sale Price $199 Final price: $149.20\n\nThere are lots of other possibilities.\n\nSecond 20% off promo\n\nAs we reported last night, Dan’s Deals notes that there is a second Amex promotion for 20% off that is separate from the one we wrote about a week ago. This one requires you to pay with at least 1 Membership Rewards point and add coupon code AMEXSWP20PD. Word is that this deal may work for people who maxed out the previous 20% off promo and/or may work for those who weren’t targeted for that one. There’s no guarantee — but it’s worth a shot.\n\nBottom line\n\nIf you are still eligible for either of these promotions and you value Amazon gift cards anywhere near cash, adding a gift card to hit the max discount looks like the best deal yet. Thanks to reader Larry for pointing this one out!\n\nEarn Miles Without Flying: START HERE\t\n\nThe post [Expired] WOW: Get those Bose for a net ~$27 (sorta). Or tons of other deals amplified. appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1532154203",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.453537Z"
}