{
  "id": "0c9e715d5fcf4fccaf75740531afa125",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2017/7/3/15915368/john-roberts-graduation-speech",
      "Title": "Justice John Roberts’s graduation speech is a quiet rebuke to Trump Vox - All",
      "Selection": "While the president of the United States was busy tweeting memes and insulting television personalities this weekend, a video circulated showing the chief justice of the US Supreme Court, John Roberts, encouraging a new generation of young men to be humble and generous.\n\nAs the commencement speaker at his son Jack’s ninth-grade graduation at the Cardigan Mountain School in rural New Hampshire last month, Roberts delivered a humorous speech, telling the new graduates that life would inevitably throw a number of curveballs their way.\n\nHow each boy responded would be a measure of who they are as people, he added.\n\n“I wish you bad luck, from time to time, so that you will be conscious of the role of chance in life and understand that your success is not completely deserved, and the failure of others is not completely deserved either,” Roberts said. “And when you lose, as you will from time to time, I hope every now and then that your opponent will gloat over your failure, as a way to understand the importance of sportsmanship. I hope you’ll be ignored, so you understand the importance of listening to others, and I hope you will have just enough pain to learn compassion.”\n\nRoberts told the graduates that they just gotten through the easiest parts of their lives. And while the road ahead would not be as easy, it would be full of moments to learn from, he said.\n\n“Whether I wish these things or not, they’re going to happen,” he said. “And whether you benefit from them or not will depend upon the ability to see the message in your misfortunes.”\n\nRoberts’s speech quickly won accolades for its focus on humility, with Robert Barnes at the Washington Post saying the chief’s justice’s commencement speech was more important than any decision he had handed down from the bench this year.\n\nLA Times editorial writer and former Supreme Court reporter Michael McGough drew a sharp distinction between the speech and the recent antics of President Trump.\n\n“Much of what Roberts said could also plausibly come from the mouth of a president — but not, unfortunately, this one,” McGough wrote.\n\nCardigan Mountain is an all-male junior prep school with an annual tuition costing about as much as that of most universities. But Roberts used his address to remind students that their privileged position comes with a recognition, and responsibility.\n\n“You are also privileged young men, and if you weren’t privileged when you came here, you are now, because you have been here,” he said. “My advice is don’t act like it.”\n\nAs students made their way to their new high schools, Roberts encouraged them to introduce themselves to the staff there, especially “to the person who is raking the leaves, shoveling the snow, or emptying the trash. Learn their name, and call them by their name during your time at school.”\n\nHe told graduates to say hello to everyone they meet, even if they thought it awkward to start out with — and to write their old teachers at Cardigan handmade thank-you notes.\n\nRoberts dispensed a lot of advice throughout his 15-minute speech, but there was one area where he admitted he couldn’t be helpful.\n\n“Most of you will be going to a school with girls. I have no advice for you,” he said, to laughter and applause.\n",
      "Folder": "Feedly",
      "Timestamp": "1499109760",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.656965Z"
}