{
  "id": "0ccce9f1cbae46fba6260eb700691491",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://quartzy.qz.com/1258190/the-top-100-books-americans-love-the-most/",
      "Title": "The 100 novels Americans love the most, based on a survey of thousands Quartz",
      "Selection": "In 2018, Michael Wolff’s Fire and Fury and James Comey’s A Higher Loyalty have captured US readers with juicy insights into the Trump White House. But what books bring Americans deep, blithe pleasure?\n\nStarting in May, PBS will run a series called The Great American Read, in which journalist Meredith Vieira traverses the country to interview people about their favorite novels. PBS will also run a nationwide survey starting May 22, in which Americans can vote as many times as they’d like for their favorite title among a list of 100.\n\nTo make the top 100 list, polling company YouGov asked a representative sample of 7,366 Americans to answer the question, “What is your most-loved novel?” The surveys returned a list of 700 individual titles, which editors culled, limiting it to novels, one title per author, and books published in the US in English.\n\nBased on our count, about half of the books in the top 100 list are considered classics or are books you might see on an American high school curriculum. More than 80 authors on the list are white, and just under 70 are men. Around 60 of the authors are American.\n\nAbout a quarter are books written for kids or teens, and three-quarters have been made into a movie or TV show. Five titles are Christian fiction, and five could be considered dystopian novels. Around 15 are sci-fi or fantasy, and two titles could be considered romances.\n\nHere’s the full list of 100, in alphabetical order going by book title:\n\n1984, by George Orwell\n\nA Confederacy of Dunces, by John Kennedy Toole\n\nA Game of Thrones, by George R. R. Martin\n\nA Prayer for Owen Meany, by John Irving\n\nA Separate Peace, by John Knowles\n\nA Tree Grows in Brooklyn, by Betty Smith\n\nThe Adventures of Tom Sawyer, by Mark Twain\n\nThe Alchemist, by Paulo Coelho\n\nAlex Cross Mysteries (series), by James Patterson\n\nAlice’s Adventures in Wonderland, by Lewis Carroll\n\nAmericanah, by Chimamanda Ngozi Adichie\n\nAnd then There Were None, by Agatha Christie\n\nAnne of Green Gables, by Lucy Maud Montgomery\n\nAnother Country, by James Baldwin\n\nAtlas Shrugged, by Ayn Rand\n\nBeloved, by Toni Morrison\n\nBless Me, Ultima, by Rudolfo Anaya\n\nThe Book Thief, by Markus Zusak\n\nThe Brief Wondrous Life of Oscar Wao, by Junot Díaz\n\nThe Call of the Wild, by Jack London\n\nCatch-22, by Joseph Heller\n\nThe Catcher in the Rye, by J.D.Salinger\n\nCharlotte’s Web, by E.B. White\n\nThe Chronicles of Narnia (series), by C.S. Lewis\n\nThe Clan of the Cave Bear, by Jean M. Auel\n\nThe Coldest Winter Ever, by Sister Souljah\n\nThe Color Purple, by Alice Walker\n\nThe Count of Monte Cristo, by Alexandre Dumas\n\nCrime and Punishment, by Fyodor Dostoyevsky\n\nThe Curious Incident of the Dog in the Night-Time, by Mark Haddon\n\nThe Da Vinci Code, by Dan Brown\n\nDon Quixote, by Miguel de Cervantes\n\nDoña Barbara, by Rómulo Gallegos\n\nDune, by Frank Herbert\n\nFifty Shades of Grey, by E.L. James\n\nFlowers in the Attic, by V. C. Andrews\n\nFoundation, by Isaac Asimov\n\nFrankenstein, by Mary Shelley\n\nGhost, by Jason Reynolds\n\nGilead, by Marilynne Robinson\n\nThe Giver, by Lois Lowry\n\nThe Godfather, by Mario Puzo\n\nGone Girl, by Gillian Flynn\n\nGone with the Wind, by Margaret Mitchell\n\nThe Grapes of Wrath, by John Steinbeck\n\nGreat Expectations, by Charles Dickens\n\nThe Great Gatsby, by F. Scott Fitzgerald\n\nGulliver’s Travels, by Jonathan Swift\n\nThe Handmaid’s Tale, by Margaret Atwood\n\nHarry Potter (series), by J.K. Rowling\n\nHatchet, by Gary Paulsen\n\nHeart of Darkness, by Joseph Conrad\n\nThe Help, by Kathryn Stockett\n\nThe Hitchhiker’s Guide to the Galaxy, by Douglas Adams\n\nThe Hunger Games, by Suzanne Collins\n\nThe Hunt for Red October, by Tom Clancy\n\nThe Intuitionist, by Colson Whitehead\n\nInvisible Man, by Ralph Ellison\n\nJane Eyre, by Charlotte Brontë\n\nThe Joy Luck Club, by Amy Tan\n\nJurassic Park, by Michael Crichton\n\nLeft Behind, by Tim LaHaye and Jerry B. Jenkins\n\nThe Little Prince, by Antoine de Saint-Exupéry\n\nLittle Women, by Louise May Alcott\n\nLonesome Dove, by Larry McMurtry\n\nLooking for Alaska, by John Green\n\nThe Lord of the Rings (series), by J.R.R. Tolkien\n\nThe Lovely Bones, by Alice Sebold\n\nThe Martian, by Andy Weir\n\nMemoirs of a Geisha, by Arthur Golden\n\nMind Invaders, by Dave Hunt\n\nMoby Dick, by Herman Melville\n\nThe Notebook, by Nicholas Sparks\n\nOne Hundred Years of Solitude, by Gabriel García Márquez\n\nOutlander, by Diana Gabaldon\n\nThe Outsiders, by S.E. Hinton\n\nThe Picture of Dorian Gray, by Oscar Wilde\n\nThe Pilgrim’s Progress, by John Bunyan\n\nThe Pillars of the Earth, by Ken Follett\n\nPride and Prejudice, by Jane Austen\n\nReady Player One, by Ernest Cline\n\nRebecca, by Daphne du Maurier\n\nThe Shack, by William P. Young\n\nSiddhartha, by Hermann Hesse\n\nThe Sirens of Titan, by Kurt Vonnegut\n\nThe Stand, by Stephen King\n\nThe Sun Also Rises, by Ernest Hemingway\n\nSwan Song, by Robert R. McCammon\n\nTales of the City, by Armistead Maupin\n\nTheir Eyes Were Watching God, by Zora Neale Hurston\n\nThings Fall Apart, by Chinua Achebe\n\nThis Present Darkness, by Frank E. Peretti\n\nTo Kill a Mockingbird, by Harper Lee\n\nTwilight, by Stephenie Meyer\n\nWar and Peace, by Leo Tolstoy\n\nWatchers, by Dean Koontz\n\nThe Wheel of Time (series), by Robert Jordan\n\nWhere the Red Fern Grows, by Wilson Rawls\n\nWhite Teeth, by Zadie Smith\n\nWuthering Heights, by Emily Brontë\n",
      "Folder": "Feedly",
      "Timestamp": "1524434593",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.516178Z"
}