{
  "id": "0daabb6ec9924e61bf9c84163b5911f1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2017/10/2/16347446/microsoft-xbox-one-x-design-sony-playstation-4-pro-console-generations",
      "Title": "How Microsoft built the world’s most powerful game console The Verge",
      "Selection": "When designer Bryan Sparks explains the inspiration for the look and feel of the modern Xbox, he says he and his team went back to 1968, when a certain landmark Stanley Kubrick film hit theaters and changed how the world saw science fiction. “We had this vision in our minds of a monolith,” Sparks says, referencing the black, slab-like machine of extraterrestrial origin in 2001: A Space Odyssey. “In the movie, every time you see the monolith, it signifies this point of advancement.”\n\nAn industrial designer by trade, Sparks has long hair and a penchant for t-shirts, jeans, and sneakers in the workplace. Couple that with his tall wiry frame and he looks more like a professional skateboarder than the aesthetic mastermind behind Microsoft’s gaming hardware. The way he sees it, the signature look of last year’s gleaming white Xbox One S spoke to that idea of technological progress. It’s a look that the design team knew they had to keep when they designed the new, much more powerful Xbox One X, even more of a monolith with its matte black finish. Still, what Microsoft didn’t want “was for this to be a big block,” Sparks adds.\n\n“We had this vision in our minds of a monolith.”\n\nWhen discussing how he and his team designed the Xbox One X, Sparks says the process revolved around one pivotal benchmark. The new console had to be compact, more so than any comparable PC. In fact, it would need to be even smaller than the Xbox One S, itself a slim version of the original Xbox One. There was one big issue: the new console wouldn’t just have to be smaller, it also needed to be 40 percent more powerful.\n\nTo tell the story of how its Xbox team accomplished such a feat, Microsoft invited us up to its Redmond, Washington headquarters to give an inside look at the design process behind the Xbox One X. But the company was also willing to go beyond the question of how and into the question of why — why make such a device, and why now?\n\n Photo by Tyler Pina / The Verge\n\nIt’s a familiar arrangement. Since 2013, with the less-than-stellar Xbox One launch, Microsoft has sold the media, and by extension the public, on a message of redemption. Eager to explain its course corrections and transparent in acknowledging where it went wrong, Microsoft executives have in the past laid bare the corporate strategies behind its biggest gambles, like the (now failed) attempt at using the Xbox One as a Trojan horse for the living room and the more recent merging of its Xbox and Windows platforms. Starting in June of 2016, the company has seemingly gone all in on yet another promise: that the next Xbox console might be the last, at least as we think of console hardware generations today.\n\nThe Xbox One X, formerly known as Project Scorpio and arriving November 7th for $499, comes with what sounds like a simple pitch: to create the most powerful game console ever made. But that pitch becomes much more complicated when you take into account the industry the new console will live in. The device is an improvement, but it does not offer the same type of leap consumers saw when gaming jumped from 2D to 3D, from 64 bits to 128 bits, or from standard definition to high definition. Instead, the One X offers 4K gaming at higher frame rates, so long as you have a capable television set and so long as the game you’re playing has been optimized to take advantage of the new horsepower. It will not, as some fans had longingly hoped, play Steam games or run a full version of Windows 10.\n\nXbox One X is the first console in Microsoft’s history to straddle two hardware generations\n\nMore importantly, this new Xbox will be first in the history of Microsoft’s gaming business to straddle the line between an existing generation and a new one. Prior mid-cycle console upgrades have added more storage or sported a new, slimmer design. But the console business has always waited roughly six to seven years before completely starting from scratch with a new chip architecture, inevitably rendering older games unplayable on the new hardware. With the Xbox One X and Sony’s similar PlayStation 4 Pro, both of which are designed to play their entire respective libraries at various levels of fidelity and efficiency, we’re entering uncharted territory.\n\nThe question now is what these mid-cycle upgrades mean for consoles. Do they mark a move away from the current business model, toward something closer resembling the PC? Or are we seeing a more permanent constriction in the upgrade cycle that will turn a game console into something more akin to the smartphone — a device you upgrade wholesale every few years to a newer, faster model that still manages to run most older software?\n\nMicrosoft’s answer? Let’s wait and see.\n\n“I think people misinterpreted some of what we said when we announced Project Scorpio about thinking beyond console generations,” says Albert Penello, Microsoft’s senior director of console marketing. Penello says he doesn’t think console generations, moments that mark big increases in performance, will go away. “I think that will exist in a form that is just different than it is today. Today, the devices are somewhat disposable.” It’s everything else — your games, your circle of friends — that should, in theory, remain constant. That’s a philosophy Microsoft is investing in heavily, with its backwards compatibility and Xbox Play Anywhere initiatives.\n\nYet for the company, even more is on the line with the success of the One X. After Microsoft fumbled the launch of the Xbox One, focusing more on entertainment than core games, Sony’s PlayStation 4 has been outselling it nearly two to one. Microsoft’s new device may be the most powerful console ever made, but if it can’t help close that gap, all that added power could be wasted on a player base that’s increasingly looking to play elsewhere. Then there’s the PC, perhaps the biggest existential threat to the One X, because it already plays most exclusive Xbox games while remaining more powerful than anything Microsoft or Sony produce for the living room.\n\nMicrosoft is willing to talk about the what and the why of the new hardware. But there’s an even more important question: who exactly is the Xbox One X for?\n\n Photo by Tyler Pina / The Verge\n\nOn a cloudless and sunny August day, Microsoft representatives welcome me and a group of other journalists into Building 87 at the company’s Redmond headquarters. The facility is a former on-site records warehouse that has since been converted into a hardware development and prototyping hub. It’s where the Zune MP3 player was designed and developed and where the Surface was first born as a massive tabletop touchscreen display.\n\nBuilding 87 is maze-like, with winding halls and the occasional glass trophy case full of historic Xbox memorabilia. Deeper inside is a cavernous series of rooms containing everything from full-color 3D printers to precision water jet machines to injection mold makers. It’s an industrial designer’s playground and a paradise for the tinkerers and engineers now responsible for both the Xbox and Microsoft’s Surface business.\n\nBuilding 87 is an industrial designer’s playground and a paradise for engineers and tinkerers\n\nIt’s here that Microsoft conceived what would become the Xbox One X, and the Xbox One S before it. We’re standing in what Leo Del Castillo, Microsoft's general manager of Xbox hardware, calls the “campfire,” which is a collection of desks sporting massive computer monitors that sits in the middle of Building 87’s many hardware labs and prototyping stations. Just behind us is a wall of glass separating the workstations from numerous rows of gigantic machines capable of turning a virtual CAD file into a physical object in a matter of hours, a process that used to take Microsoft weeks when it was still known exclusively as a software maker.\n\n“What ends up looking like a very clean design requires very, very complex tooling and manufacturing processes,” explains Del Castillo, who’s been a Microsoft employee for more than 22 years and was part of the team formed back in 1999 to develop the original Xbox. With a finely trimmed goatee and an engineer’s precision when he speaks about products, Del Castillo is very much the older, more buttoned-up foil to Sparks and his design team. But the two say they play off one another in instrumental ways, with Sparks’ team pushing the envelope to the maximum of what Del Castillo’s group can engineer.\n\n Industrial designer Bryan Sparks, middle, explains the challenges of developing the Xbox One X alongside general manager of hardware Leo Del Castillo, left. Photo by Tyler Pina / The Verge\n\nThe Scorpio engine, the heart of the new Xbox One X, is an integrated 8-core AMD Jaguar processor, the same architecture as the original Xbox One. That means the new box can still play games developed four years ago, for older and less powerful hardware. Yet it’s that same souped up chip, coupled with a generous extra helping of on-board memory, that makes the One X capable of performing more than four times the number of calculations per second than the original Xbox One.\n\nNone of this should mean all that much to the end consumer, but it does result in a system capable of rendering games at 4K resolution and 60 frames per second — the golden standard by which most high-end gaming experiences are now measured. It’s that standard that Del Castillo and Sparks were tasked with hitting, all while fitting that power bump into a box slimmer than the Xbox One S.\n\nThe team, knowing they already had a hit on their hands with last year’s Xbox redesign, decided to reengineer the entire internal layout of the console to accommodate the new components. It started with Del Castillo and the other engineers’ decision to take the entire motherboard, flip it upside down, and stick to the ceiling of the chassis, freeing up a healthy amount of space on the bottom. “From a design standpoint, moving the motherboard on top means that we wouldn’t need any venting on that top face, which allows us to keep that clean, unbroken monolithic form,” Sparks says. It also meant the device could keep its signature “overhang,” an aesthetic choice of Spark’s design team wherein the top of the chassis is slightly longer than its bottom.\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\n Photo by Tyler Pina / The Verge\n\nFrom there, Del Castillo’s team decided to free up even more space by stacking the Xbox One X’s hard disc drive and optical disc drive on top of one another. This allowed them to retain the integrated power supply of the One S, itself adding only a small increase in size. That meant consumers wouldn’t need one of those hideous, industrial-looking bricks that have plagued previous iterations of the Xbox.\n\nThere was another, more crucial need for all this extra space. While the components that would be giving the Xbox One X its added horsepower were not all that much larger than before, the electrical output definitely would be. “This is the most powerful processor,” Del Castillo says, “and it uses quite a bit of electrical power.\n\n“The whole system is about twice the power of an Xbox One S. Virtually all of that turns into heat.”\n\nThe team couldn’t use the Xbox’s existing cooling rig, which would add too much height given the power requirements of the Scorpio engine. So they decided to use what’s known as a vapor chamber heat sink, which is a cooling mechanism typically reserved for high-end graphics cards and servers. Unlike a standard liquid cooling system, which pumps water through tubes, a vapor chamber uses a minimal amount of deionized water sealed in a vacuum. That drastically lowers the boiling point of the liquid, allowing the system to take advantage of phase changes as the water transforms into gas and back again, moving heat along the way.\n\n“We believe this is the first time this has been used in a consumer electronics product at the kinds of volumes we’ll be using it,” Del Castillo says. “Now you’re moving heat both in the form of changes in temperature and changes in phase. That allows heat to move from these hot components to these radiator fins much more efficiently, with much less temperature drop. That allows this device to be more efficient at converting that heat into the airstream.\n\n Photo by Tyler Pina / The Verge\n\nWhile the new variety of heat sink would control how air moved through the system, the One X still required a more novel way of exhausting it all. Sparks and the design team presented a number of different methods to try and minimize the visible venting patterns, none of which jibed with Del Castillo’s “engineering realities.” So, with the help of Microsoft’s in-house thermal engineering division, based out of Silicon Valley, the design group simulated airflow using a number of different proposed venting patterns and configurations.\n\nThey ultimately decided to miniaturize the circular pinhole-style venting pattern of the One S, but with the perforations only along the sides of the upper house. That resulted in a fine mesh venting pattern that would leave the upper housing’s unibody enclosure completely clean, save the Xbox logo and lettering in the upper left corner.\n\nMicrosoft used the color Infinite Black to contrast with Robot White\n\nTo round it all out, Sparks says the industrial design team turned to color as the finishing touch. The Xbox One S was introduced alongside a new, pristine finish Microsoft called “Robot White.” The One X would have to be different, in a pronounced and declarative fashion. Sparks says black made the most sense. “We looked at lots of different options, lots of different combinations of colors,” Sparks says. “Where we landed was creating our own color we call Infinite Black, which is a really deep, rich, neutral black.” While “Infinite Black” certainly sounds like (and is) marketing hyperbole, the color does have a throwback aesthetic, evoking an earlier era when a new game console’s understated plainness seemed a byproduct of its raw, exciting capabilities.\n\nThis combination of design and engineering innovations, mixed with the aesthetic choices and constraints the team imposed on itself, helped the group achieve their goal of building the most powerful game console ever. But no amount of technical specifications, custom color schemes, or heat sink physics explanations can help the Xbox One X outsell the competition. To do that, Microsoft needs a narrative, one that explains why it made a 4K console in the first place and what it means for the future of games.\n\nThat’s where Phil Spencer comes in.\n\n Photo by Tyler Pina / The Verge\n\nThe launch of the original Xbox One is a sore moment for Microsoft, something Xbox division head Phil Spencer looks back on with a twisted expression somewhere between remorse and frustration. “The hardware team coming through the launch of the Xbox One took more criticism for certain decisions than they should have,” Spencer tells me, sitting in a conference room at the on-site offices of Forza Motorsport maker Turn 10 Studios. “The hardware team that built [the Xbox One] S and the hardware team that built [the Xbox One] X is the same hardware team. It’s the same individuals that have been on Xbox for a long time.”\n\nSpencer is referencing Microsoft’s gamble to position the Xbox One as an entertainment hub, instead of a game machine, back in 2013. Coupled with a misguided policy shift around requiring the device connect to the internet regularly, Microsoft had kicked a particularly vicious hornets nest in the game community. It also priced the Xbox One $100 more than Sony’s PlayStation 4, because of the bundled second-generation Kinect motion camera. Fans were incensed. Spencer, a 26-year veteran of the company when he took the reins of the Xbox business in 2014, has spent the last three years working to rebuild the brand.\n\nMicrosoft has struggled with big Xbox exclusives these past two years\n\nThat process has involved making both a lot of hard choices and, at times, promises that have proved more empty than full. The Kinect has since been unbundled from the Xbox and sidelined. Spencer, who now answers directly to Microsoft CEO Satya Nadella, has made an effort to sell Windows 10 as a companion, and not a competitor, to the Xbox brand. Yet the latter has suffered when it comes to a core selling point of the game console: exclusivity. In a year when Sony has had huge exclusive hit after another — Nier: Automata and Horizon Zero Dawn, to name a couple — Microsoft has struggled to own a big tentpole game release of its own.\n\nReCore and Quantum Break are unlikely to see sequels, while Halo Wars 2 and Gears of War 4 feel like late-stage entries for aging franchises. The company canceled Fable Legends and Scalebound earlier this year. Making matters worse, the Xbox One X won’t have a big game to accompany its launch after the delay of Crackdown 3. Instead, Microsoft is banking on post-release 4K upgrades for Forza Motorsport 7 and Middle-earth: Shadow of War.\n\nDespite these hurdles, Spencer, who turns 50 next year, seems physically incapable of exhibiting stress. His youthful demeanor — punctuated by a stocky build, clean-shaven face, and an unchanging swoop of brown hair — makes him an outlier among the more corporate, suite-and-tie world of gaming’s executive leadership. (He also happens to have an impressive collection of gaming t-shirts he likes to don under unbuttoned blazers.) It’s with that image that Spencer has assumed the role of both the friendly messenger and crafty architect of the back-to-basics philosophy that has guided Xbox’s comeback strategy. For him, it’s been making it all about the games in every conceivable fashion, to scrub the launch of the Xbox One from our collective memory.\n\n“This generation in general has struggled a bit in describing what the transition was about,” Spencer says, referring to the opaque jump from the Xbox 360 and PS3 era. “I always go back to when we launched 360 and the SD to HD transition was happening for people. It was easy to look at it an Xbox 360 and and say, ‘Oh, it’s an HD console.’”\n\nSpencer thinks 4K can be impact in ways the jump to the original Xbox One was not\n\nSpencer thinks 4K can be impactful in ways the jump to the original Xbox One was not. Even though the industry may not technically be exiting one generation and entering a new one, 4K might have the momentum needed to bring consumers onboard, especially if it can make Xbox the more attractive platform to play third-party games in the absence of big-name exclusives. Panello, Xbox’s marketing director, is quick to remind me that half of all TVs sold this year will be 4K ready. “In a few years, it will be 100 percent of TVs,” Panello says. But it’s an open question what 4K gaming means to most players, many of which don’t know what it even looks like or how it compares to what they have today.\n\nSpencer admits that we’re probably never going to see the jumps in progress we saw in earlier generations, when each new piece of hardware delivered exponential increases in computing power and developers were constantly reinventing nearly every single aspect of game design. Take, for instance, the jump from two dimensions to three.\n\n“That was different gameplay that showed up when things went from 2D to 3D,” he says. We’re unlikely to see new gameplay innovations delivered by technological advances — that’s more the job of smart design and novel software implementation these days. But, Spencer adds, “as you get closer to reality, the smaller differences actually matter more in your head.” Because 4K is that much closer to photorealism, he explains, consumers should notice each incremental step toward that end goal of simulating the real world.\n\n Forza Motorsport 7, from Microsoft-owned Turn 10 Studios, will play at 4K / 60 frames per second on Xbox One X. Microsoft is positioning the game as a powerful example of what the new console is capable of. Image: Microsoft\n\nAs for whether that particular number of pixels is enough to sell pricer hardware, Spencer is confident it will matter to the right kind of customer, even if that group starts out as niche. He points to the $150 Xbox Elite controller, which he says had its fair share of critics who claimed it would be asinine to try and sell a luxury good to a mainstream console audience. But then “we couldn’t make enough of them,” he points out. “It doesn’t mean everyone should go in and buy an Elite controller. This [Xbox One X] is an opportunity for somebody who says, ‘You know, I want the absolute best in console games.’”\n\nI bring up the smartphone because it seems like the most apt comparison, especially as Apple gears up to sell the world an $1,000 iPhone also carrying the “X” signifer. Spencer doesn’t think consoles will go the way of smartphones, primarily because the console business model involves selling one device at thin margins and making up the revenue in software sales as the cost of components goes down over time. But Spencer is also hesitant to use the same language he once did when, just a year and half ago, he told an audience at an event in San Francisco that the idea of console generations might disappear in favor of a PC-style model.\n\nMicrosoft was looking at ways to keep pace with graphics cards and smartphones\n\n“We used to say that the average lifespan of a TV was seven years or until the tube broke. Now, people are swapping phones every other year… people are getting more used to churning through devices around them,” Spencer says. “We were looking at our model and saying, ‘Okay, is there a way for us to keep the console as up to date as graphics cards and phones and other things and not have it fall behind.”\n\nWhile Microsoft may not be interested in selling you an Xbox quite as frequently as Apple sells the iPhone, the console business certainly feels as if it’s looking to the smartphone for inspiration. No two aspects of Microsoft’s strategy exemplify that more than Xbox Play Anywhere and backwards compatibility.\n\nXbox Play Anywhere, based on the idea that both the PC and the Xbox run a unified version of Windows 10, ensures that players can take the experience of playing a game with them across screens and hardware types. Backwards compatibility ensures that there’s an ever-increasing library of games that can be played across generations, regardless of the silicon powering the box plugged into your TV. These aren’t new ideas; Microsoft has been harping on them for more than a year now, and it’s still unclear whether they'll truly take off in the way the company hopes. But they still carry the promise of a brighter, more accessible future, one only Microsoft seems intent on shooting for.\n\n Photo by Tyler Pina / The Verge\n\n“I’ve always felt that the demise of a console generation, when it goes away, land locks a bunch of content that is really hard to go play. You don’t have to deal with an iPhone 8 that can’t play things on the iPhone 6,” Spencer says. Just like buying a new smartphone doesn’t mean you no longer have access to Google Maps or Snapchat, Spencer says buying a new game console shouldn’t cut you off from using certain software.\n\nThe far-off answer to that might be game streaming services, where a game is run locally from a server farm somewhere remote and streamed over the internet to your TV. “If you look further out, is that a destination that we’re going to land on, I do think at some point — maybe it’s 20 years, maybe it’s 5 years, I don’t know — but there’s going to be this switch point,” he says, “where people feel like performance fidelity and other things fit in that world. Today, that’s hard with 4K.”\n\n“Price will always be a very important factor in what console a majority of people choose.”\n\nFor now, Spencer is comfortable with the leap Microsoft is taking with the Xbox One X, especially because it gives consumers two price points to consider with meaningful differences. “Price will always be a very important factor in what console a majority of people choose,” he says. “I want to give people choice because to me, gaming is incredibly important. It’s something I do almost every day. That’s not a value judgement on people who say, ‘I like FIFA, I like Madden, I want to go play LEGO Batman with my kids.’ I’m not making a value judgment on their choices, it’s just how gaming fits into their life.”\n\nIf that person were to ask whether they should go buy an Xbox One X, Spencer has a simple answer: no, the One S is probably just fine. “I think the [One] S console is a great entry-level console for people,” Spencer says. The One X, on the other hand, will likely define this generation in terms of power and performance.\n\n“I don’t think there’s a question of whether it’s the most powerful console. People might say, ‘Okay, can I really feel it? Is it going to matter to me?’” Spencer adds. “I can say to me it matters. When I’m at home playing — and that’s the honest truth, I’ve had my Scorpio dev kit sitting there — I’ve been playing, I feel it in load times. I can feel it, I can see it, and it matters to me.”\n\nFor Microsoft, a testimonial like that from Spencer, a former intern plucked from its internal game development arm to run the entire Xbox business, is about as strong as it gets.\n",
      "Folder": "Feedly",
      "Timestamp": "1506953924",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.542636Z"
}