{
  "id": "0db3366c93f843ecbc5bfb498e59cecf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/future-perfect/21728843/best-charities-donate-giving-tuesday",
      "Title": "These are the charities where your money will do the most good Vox - All",
      "Selection": "Photos: Getty Images, Photoillustration: Javier Zarracina/Vox\n\nYou can save lives with your giving. Here’s how.\n\nGiving to charity is great, not just for the recipients but for the givers, too.\n\nBut it can be intimidating to know how to pick the best charity, especially when there are thousands of worthy causes to choose from, and especially when the world’s in the midst of a massive pandemic and economic calamity that’s causing huge pain and suffering at home and abroad. These past few months, we’ve written on how to think through where to give and how to help address our rolling crises.\n\nAs we approach Giving Tuesday, I thought it might be helpful to update our annual guide to giving. Think of this not just as a rundown of charity recommendations, but as a broader guide to thinking about how to give. Here are a few simple tips for Giving Tuesday 2020 that can help.\n\n1) Check in with charity recommenders\n\nIt's of course possible to research charity options yourself, but it's probably better to outsource that labor to a careful, methodologically rigorous charity recommender like GiveWell. (Charity Navigator and Guidestar by Candid can be useful resources too, but they have traditionally avoided ranking charities or assessing which do the most good for the lowest cost. Charity Navigator is taking some initial steps to attempt the latter, however.)\n\nGiveWell currently lists nine top charities. Its recommendation, if you find it hard to choose among the nine, is to donate to the GiveWell Maximum Impact Fund, which goes directly to their top charities based on GiveWell’s assessment of where the money is most helpful given groups’ funding needs.\n\n“Basically, it’s the best way for a donor to take advantage of our up-to-date research, as we’re continually assessing and reprioritizing our top charities’ needs,” GiveWell research analyst Catherine Hollander told me. “We also think it’s a great fit for recurring donors since it allows each future gift to be used to support the highest-value projects we can find at that time.”\n\nMalaria Consortium, which helps distribute preventative antimalarial medication to children (a program known as “seasonal malaria chemoprevention”)\n\nAgainst Malaria Foundation, which buys and distributes insecticidal bed nets, primarily in sub-Saharan Africa but also in Papua New Guinea\n\nHelen Keller International, which provides technical assistance to, advocates for, and funds vitamin A supplementation programs in sub-Saharan Africa, which reduce child mortality\n\nNew Incentives, which offers cash to families in Nigeria conditional on childhood vaccinations\n\nEvidence Action’s Deworm the World Initiative, The END Fund, Sightsavers, and SCI Foundation, which all work on deworming programs to prevent parasitic infections.\n\nGiveDirectly, which directly distributes donations to poor people in Kenya and Uganda, to spend as they see fit.\n\nGiveWell chose those charities based on how much good additional donations would do, not necessarily how good the groups are overall; in other words, these are organizations that can put new funding to use, rather than sitting on it.\n\nGiveWell takes that factor seriously. In 2013, it revoked its recommendation of Against Malaria on the grounds that the charity had not spent enough of the money it already raised. In 2014, GiveWell judged that Against Malaria once again had room for more funding, and restored it on the recommendation list. So you can expect Against Malaria, and the other recommended charities, to spend anything you donate effectively and reasonably promptly.\n\nThe group also takes disconfirming research seriously. In 2017, it recommended Evidence Action’s No Lean Season, which offers no-interest loans to farmers in Bangladesh during the “lean season” between planting rice and harvesting it; the loans are conditional on a family member temporarily moving to a city or other area for short-term work. But a subsequent randomized evaluation found that the program didn’t actually spur people to migrate or increase their incomes, and GiveWell and Evidence Action then agreed that it should no longer be a top charity; Evidence Action stopped soliciting funds for it and later shut it down.\n\n(Disclosure: GiveWell is an advertiser on Vox podcasts; I was an admirer and follower of their work well before Vox existed, and their advertising plays no part in these recommendations.)\n\n2) Pick charities with research-based strategies\n\nGiveWell's recommendations rely heavily on both evaluations done by charitable organizations and existing research literature on the kind of intervention the charities are trying to conduct.\n\nFor example, its recommendations of SCI, Sightsavers, the END Fund, and Deworm the World are based on research suggesting that providing children with deworming treatments could improve educational, economic, and other outcomes.\n\nResearch from the Poverty Action Lab at MIT suggests that giving away insecticidal bednets — as the Against Malaria Foundation does — is vastly more effective than charging even small amounts for them.\n\nAnd while cash certainly has its limits, hundreds of studies have found largely positive effects for the kind of cash transfers that GiveDirectly distributes.\n\n3) If you want to maximize your donation’s impact, give abroad\n\n Against Malaria Foundation\n\nWomen in Dedza, Malawi, carry antimalarial bednets.\n\nIt's really hard to adequately express how much richer developed nations like the US are than developing ones like Kenya, Uganda, and other countries targeted by GiveWell's most effective charities.\n\nWe still have extreme poverty, in the living-on-$2-a-day sense, but it's comparatively pretty rare and hard to target effectively. The poorest Americans also have access to health care and education systems that, while obviously inferior compared to rich Americans, are far superior to those of developing countries. Giving to charities domestically is admirable, of course, but if you want to get the most bang for your buck in terms of saving lives, reducing illness, or improving overall well-being, you're going to want to give abroad.\n\nYears ago, GiveWell actually looked into a number of US charities, like the Nurse-Family Partnership program for infants, the KIPP chain of charter schools, and the HOPE job-training program. It found that all were highly effective but were far more cost-intensive than the best foreign charities. KIPP and the Nurse-Family Partnership cost more than $10,000 per child served, while deworming programs like SCI's and Deworm the World's generally cost between $0.25 and $1 per child treated.\n\nThis is true even as the US is going through a historically brutal pandemic. The rest of the world is, too, and the disease and lockdowns it sparked have had especially devastating effects on poor countries, to the extent that 2020 was likely the first year in decades when global poverty increased. The pandemic has also taxed health systems in low-income countries, putting pressure on programs designed to fend off other diseases like malaria. Donations to anti-malaria, anti-worm, (non-Covid) vaccination, and Vitamin A supplementation programs like the ones recommended by GiveWell can help cushion that blow.\n\nAlternatively, you could consider giving to non-humans. Animal charities, especially those engaged in corporate pressure campaigns to better the treatment of farm animals, chickens in particular, can be effective in improving animal welfare. The charity evaluations in this area are much younger and less methodologically rigorous than GiveWell's, but Animal Charity Evaluators has named four animal groups that may be effective causes for donations:\n\nThe Humane League specializes in corporate campaigns to improve farm standards. It has achieved big victories in eliminating the culling of baby chicks and getting food service companies like Kroger and Sodexo to only use cage-free eggs, and is now pushing for better standards for chickens raised for their meat.\n\nThe Good Food Institute promotes plant-based and cultured meat alternatives to animal-based foods.\n\nThe Albert Schweitzer Foundation conducts corporate campaigns in Germany and Poland and is unusual in advocating for farmed fish as well as chickens and mammals.\n\nWild Animal Initiative, which studies the lived experience of animals living in the wild and researches ways to ease their suffering\n\n4) If you do give locally, you can still consider impact\n\nFor years I would advocate to friends that they donate abroad, or to animal-specific charities, since their donation was likelier to have a concrete near-term impact there than in a human-based US charity, given how much money it costs to meaningfully help a resident of a rich country.\n\nBut I usually got a lot of pushback. People want to give to their specific communities, or particular causes they’re passionate about for personal reasons (like curing a disease that killed a loved one, for instance). And they often want to use charity as a way to connect with broader trends in the news — by, say, donating to help provide representation for immigrant children on the US-Mexico border.\n\nFor years I didn’t have much to say to that, other than to add that it’s of course fine to give to your community and personal causes; this guide is mostly meant to offer alternate suggestions if you don’t have existing philanthropic interests and are curious for ways to help.\n\nBut a lot has happened in 2019 and 2020 to make donations of that kind easier. In 2019, the group ImpactMatters, co-founded by social entrepreneur Elijah Goldberg and economist Dean Karlan, launched, and attempted to quantify the bang-for-the-buck provided by charities in several sectors. But whereas GiveWell is pretty opinionated about cause areas — it pushes hard toward charities that save lives or dramatically improve financial well-being — ImpactMatters isn’t. ImpactMatters has since been acquired by Charity Navigator, which has begun incorporating ImpactMatters’ methodology into its own charity profiles.\n\nSo you can specify that your goal is, say, to provide a night of shelter for a person experiencing homelessness, and Charity Navigator/ImpactMatters will provide you with a menu of nonprofits and their cost-per-night-of-housing. Fellowship Deliverance Ministries in Georgia, for instance, is estimated to provide a night of shelter for $2 per person. You can also narrow down by where you want to give: Here’s a list of San Francisco-specific charities that ImpactMatters compiled, for instance.\n\nImpactMatters is barely over a year old and its incarnation as part of Charity Navigator is even younger. Its premiere sparked a bit of concern in some corners of the philanthropy world. Julia Coffman, director of the Center for Evaluation Innovation, had a thoughtful critique on Twitter, arguing that trying to quantify impact like this is “too reductionist” and that “cost-effectiveness in relation to impact penalizes orgs that expend $ addressing systemic and structural factors that affect both their clients’ needs and their ability to deliver services in a cost-effective way.”\n\nThat’s fair — giving for societal change is really hard to do and even harder to evaluate. The causal inference behind Charity Navigator and ImpactMatters’ estimates is also necessarily limited; they can’t run whole experiments to evaluate the cost-effectiveness of every single charity, so instead they build detailed models to try to approximate an estimate of each charity’s impact (here’s their methodology for emergency shelters for people experiencing homelessness, for instance).\n\nThese are productive conversations to be having that can inform the future of giving. In the meantime, for a certain set of donors, Charity Navigator and ImpactMatters offer a useful tool that might point them in the direction of nonprofits they hadn’t known about previously, and which are doing good in their specific areas.\n\n5) Consider meta-charities\n\nAnother option is giving to groups like GiveWell, Innovations for Poverty Action, the Life You Can Save, Giving What We Can, and 80,000 Hours that evaluate development approaches/charities and encourage effective giving. Suppose that every dollar given to Giving What We Can — which encourages people to pledge to donate at least 10 percent of their income until retirement — results in $1.20 in donations to the Against Malaria Foundation. If that's the case, then you should give to Giving What We Can until the marginal effect on donations to Against Malaria hits $1 or lower.\n\n\"If they can turn a dollar of donations into substantially more than a dollar of increased donations to effective charities, isn't that the best use of my money?\" asks Jeff Kaufman, a software developer who with his wife, the fantastic effective altruism activist and organizer Julia Wise, gives about half his income to effective charities and meta-charities.\n\n6) Saving lives isn't everything\n\n Stephen Davies/Uniformed Services University of the Health Sciences\n\nTwo Schistosoma mansoni, one of the parasites that causes schistosomiasis (which SCI combats). Schistosomiasis is not usually lethal, but it can permanently harm children’s development and growth.\n\nIf you only care about reducing early mortality and giving people more years to live, then you should give all your donations to the Malaria Consortium, Helen Keller International or the Against Malaria Foundation. Malaria is a frequently fatal disease, and cost-effective interventions to reduce malaria infection are a great way to save lives. Similarly, Vitamin A supplementation, like HKI does, is an effective way of reducing child mortality, as is vaccination (as promoted by New Incentives).\n\nBut the rest of the charities GiveWell recommends don't mainly focus on reducing mortality. Quality of life matters, too. Parasitic infections hamper children's development and education, which can have negative consequences lasting decades. Having increased access to cash may not extend the life of a GiveDirectly recipient, but it does make life considerably more pleasant.\n\n7) Don't give to a big charity\n\nYou'll notice that all of the charities GiveWell recommends are reasonably small, and some big names are absent. That's not an accident. In general, charity effectiveness evaluators are skeptical of large relief organizations, for a number of reasons.\n\nLarge organizations tend to be less transparent about where their money goes and also likelier to direct money to disaster relief efforts, which are usually less cost-effective, in general, than public health programs. \"Overall, our impression is that your donation to these organizations is very hard to trace, but will likely supplement an agenda of extremely diverse programming, driven largely by governments and other very large funders,\" writes GiveWell co-founder Holden Karnofsky.\n\n8) Maybe just give money directly to poor people\n\n GiveDirectly\n\nGiveDirectly uses the M-PESA system for mobile cash transfers.\n\nFor years, one of my primary charities was GiveDirectly, which is the only cause outside public health to get GiveWell's top rating, and, to my knowledge, the only charity devoted to unconditional cash transfers. I gave to them partly because there's a large body of research on the benefits of cash transfers, which I find quite compelling.\n\n(I have ceased donating to them since Future Perfect started and instead give to GiveWell’s top charities bucket, as a way to avoid conflicts of interest as I write more about charity. I view the GiveWell option as equivalent to investing in index funds to avoid any bias as a business reporter.)\n\nBut I donated to GiveDirectly mostly because I didn’t trust myself to know what the world's poorest people need most. I've been profoundly lucky to never experience the kind of extreme poverty that billions of people worldwide have to endure. I have no idea what I would spend a cash transfer from GiveDirectly on if I were living on less than $2 a day in Uganda. Would I buy a bednet? Maybe! Or maybe I'd buy an iron roof. Or school tuition for loved ones. Or cattle.\n\nBut you know who does have a good sense of the needs of poor people in Uganda? Poor people in Uganda. They have a very good idea of what they need. Do they sometimes misjudge their spending priorities? Certainly; so do we all. And bednets and deworming treatments appear to be underpurchased relative to the actual need for them. But generally, you should only give something other than cash if you are confident you know the recipients' needs better than they do. With the exception of bednets — which really do seem underprovided when they're just put up for sale rather than given away for free — I'm not confident of that. So I gave cash.\n\nAs the World Bank's Jishnu Das once put it, \"'Does giving cash work well' is a well-defined question only if you are willing to say that 'well' is something that WE, the donors, want to define for families whom we have never met and whose living circumstances we have probably never spent a day, let alone a lifetime, in.\" If you're not willing to say that, then you should strongly consider giving cash.\n\n9) Give what you can (though if you can spare it, pledging to give 10 percent of your income would be fantastic)\n\nOne of the hardest problems in philanthropy is deciding how much to donate.\n\nThere are some people who argue the correct answer, unless you’re near the end of your life, is nothing: you should, on this view, not give to charity during your career, and instead save as much of your money as possible and donate it when you die (my colleague Kelsey Piper explains why this is probably not a good approach).\n\nAnother approach is to “earn to give”: take a high-paying job, typically in finance or tech, and give away a huge share of your earnings, like 40 to 50 percent.\n\nI wrote about people who do this back in 2013, and I know that many of the people I profiled still earn-to-give; for them, at least, this is a sustainable option. It’s a really good career option if you like working in finance and tech, but frankly it’s not the best option for most people, and there are a lot of amazing jobs — in scientific research, in the private sector, in direct charity or nonprofit or government work — where the typical person can do more good than they could by using their career as a mechanism through which to generate donation money.\n\nSo I suggest a more moderate course. I’ve signed the Giving What We Can pledge, which commits members to donating 10 percent of their annual income to highly effective charities. That is a totally reasonable number, comparable to alms in many religions, that requires relatively minimal sacrifice relative to what earn-to-give people do. (Here’s an interview I did with Toby Ord, who started the pledge.)\n\nEven if 10 percent is too much for you, though, don’t despair. Giving $1 is better than giving $0. Perhaps the most important thing is to just get into the groove of donating, to make it a habit. I use direct deposit on my paychecks to make most of my charitable contributions, just so it’s extremely automatic and hard for me to avoid doing. Going from not giving to giving a little, regularly, is a huge positive step.\n\nSign up for the Future Perfect newsletter. Twice a week, you’ll get a roundup of ideas and solutions for tackling our biggest challenges: improving public health, decreasing human and animal suffering, easing catastrophic risks, and — to put it simply — getting better at doing good.\n",
      "Folder": "Feedly",
      "Timestamp": "1606795734",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.269764Z"
}