{
  "id": "0e580e20bc0244b489fd0efd1626b454",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://blogs.fangraphs.com/top-32-prospects-chicago-white-sox/",
      "Title": "Top 32 Prospects Chicago White Sox FanGraphs Baseball",
      "Selection": "Below is an analysis of the prospects in the farm system of the Chicago White Sox. Scouting reports were compiled with information provided by industry sources as well as my own observations. As there was no minor league season in 2020, there are some instances where no new information was gleaned about a player. Players whose write-ups have not been altered begin by telling you so. For the others, the blurb ends with an indication of where the player played in 2020, which in turn likely informed the changes to their report. As always, I’ve leaned more heavily on sources from outside the org than within for reasons of objectivity. Because outside scouts were not allowed at the alternate sites, I’ve primarily focused on data from there. Ltommyastly, in effort to more clearly indicate relievers’ anticipated roles, you’ll see two reliever designations, both in lists and on The Board: MIRP, or multi-inning relief pitcher, and SIRP, or single-inning relief pitcher.\n\nFor more information on the 20-80 scouting scale by which all of our prospect content is governed, you can click here. For further explanation of Future Value’s merits and drawbacks, read Future Value.\n\nAll of the numbered prospects here also appear on The Board, a resource the site offers featuring sortable scouting information for every organization. It can be found here.\n\nTop Prospects Team Lists\n\n20212020\n\nAL\n\nBAL\n\nCHW\n\nHOU\n\nBOS\n\nCLE\n\nLAA\n\nNYY\n\nDET\n\nOAK\n\nTBR\n\nKCR\n\nSEA\n\nTOR\n\nMIN\n\nTEX\n\nNL\n\nATL\n\nCHC\n\nARI\n\nMIA\n\nCIN\n\nCOL\n\nNYM\n\nMIL\n\nLAD\n\nPHI\n\nPIT\n\nSDP\n\nWSN\n\nSTL\n\nSFG\n\nAL\n\nBAL\n\nCHW\n\nHOU\n\nBOS\n\nCLE\n\nLAA\n\nNYY\n\nDET\n\nOAK\n\nTBR\n\nKCR\n\nSEA\n\nTOR\n\nMIN\n\nTEX\n\nNL\n\nATL\n\nCHC\n\nARI\n\nMIA\n\nCIN\n\nCOL\n\nNYM\n\nMIL\n\nLAD\n\nPHI\n\nPIT\n\nSDP\n\nWSN\n\nSTL\n\nSFG\n\nWhite Sox Top Prospects\n\nRk\n\nName\n\nAge\n\nHighest Level\n\nPosition\n\nETA\n\nFV\n\n1\n\nAndrew Vaughn\n\n22.7\n\nA+\n\n1B\n\n2021\n\n60\n\n2\n\nMichael Kopech\n\n24.6\n\nMLB\n\nSP\n\n2021\n\n55\n\n3\n\nNick Madrigal\n\n23.8\n\nMLB\n\n2B\n\n2021\n\n55\n\n4\n\nGarrett Crochet\n\n21.5\n\nMLB\n\nSIRP\n\n2021\n\n50\n\n5\n\nJared Kelley\n\n19.2\n\nR\n\nSP\n\n2025\n\n45\n\n6\n\nZack Burdi\n\n25.8\n\nMLB\n\nSIRP\n\n2021\n\n40+\n\n7\n\nBenyamin Bailey\n\n19.3\n\nR\n\nRF\n\n2024\n\n40+\n\n8\n\nJose Rodriguez\n\n19.6\n\nR\n\nSS\n\n2023\n\n40+\n\n9\n\nMicker Adolfo\n\n24.3\n\nAA\n\nDH\n\n2021\n\n40+\n\n10\n\nMatthew Thompson\n\n20.4\n\nR\n\nSP\n\n2024\n\n40\n\n11\n\nAndrew Dalquist\n\n20.1\n\nR\n\nSP\n\n2024\n\n40\n\n12\n\nJonathan Stiever\n\n23.6\n\nMLB\n\nSP\n\n2021\n\n40\n\n13\n\nBryan Ramos\n\n18.8\n\nR\n\n3B\n\n2023\n\n40\n\n14\n\nYermin Mercedes\n\n27.8\n\nMLB\n\nDH\n\n2021\n\n40\n\n15\n\nLuis Gonzalez\n\n25.3\n\nMLB\n\nRF\n\n2021\n\n40\n\n16\n\nBlake Rutherford\n\n23.6\n\nAA\n\nLF\n\n2021\n\n40\n\n17\n\nYolbert Sanchez\n\n23.8\n\nR\n\nSS\n\n2025\n\n40\n\n18\n\nKade McClure\n\n24.9\n\nA+\n\nMIRP\n\n2022\n\n40\n\n19\n\nLenyn Sosa\n\n20.9\n\nA\n\n2B\n\n2022\n\n40\n\n20\n\nSeby Zavala\n\n27.3\n\nMLB\n\nC\n\n2021\n\n40\n\n21\n\nJames Beard\n\n20.2\n\nR\n\nCF\n\n2024\n\n40\n\n22\n\nTyler Johnson\n\n25.3\n\nAA\n\nSIRP\n\n2020\n\n40\n\n23\n\nGavin Sheets\n\n24.7\n\nAA\n\n1B\n\n2020\n\n40\n\n24\n\nHunter Schryver\n\n25.7\n\nAAA\n\nSIRP\n\n2022\n\n35+\n\n25\n\nCaleb Freeman\n\n22.8\n\nA\n\nSIRP\n\n2023\n\n35+\n\n26\n\nLency Delgado\n\n21.5\n\nR\n\n3B\n\n2023\n\n35+\n\n27\n\nJimmy Lambert\n\n26.1\n\nMLB\n\nSIRP\n\n2020\n\n35+\n\n28\n\nBailey Horn\n\n22.9\n\nR\n\nMIRP\n\n2023\n\n35+\n\n29\n\nBryce Bush\n\n21.0\n\nA\n\nRF\n\n2022\n\n35+\n\n30\n\nDJ Gladney\n\n19.4\n\nR\n\n3B\n\n2024\n\n35+\n\n31\n\nLuis Mieses\n\n20.6\n\nR\n\nCF\n\n2022\n\n35+\n\n32\n\nJake Burger\n\n24.7\n\nA\n\n1B\n\n2021\n\n35+\n\nReading Options\n\nDetail Level\n\nData Only\n\nFull\n\nPosition Filter\n\nAll\n\nAll\n\nC\n\n1B\n\n2B\n\nSS\n\n3B\n\nOF\n\nLF\n\nCF\n\nRF\n\nLHP\n\nRHP\n\n60 FV Prospects\n\n1. Andrew Vaughn, 1B\n\nVideo\n\nDrafted: 1st Round, 2019 from Cal (CHW)\n\nAge\n\n22.7\n\nHeight\n\n5′ 11″\n\nWeight\n\n210\n\nBat / Thr\n\nR / R\n\nFV\n\n60\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n55/70\n\n60/60\n\n50/60\n\n30/30\n\n40/40\n\n45\n\nVaughn spent 2020 at the unscoutable alternate site, but his most telling at-bats were all very visible as they’re the ones he took off big league pitching, first during spring training and then during Chicago’s intrasquad preparation for the season. He hit .259/.394/.444 in the spring off of admittedly diluted pitching, then grinded out long, tough at-bats during the summer tune-up against a staff that would turn out to be quite good. He’s also one of the more decorated college hitters ever, slashing .374/.495/.688 at Cal.\n\nHe’s very likely to clear the high offensive bar at first base. He’s not a great feet-and-hands athlete on the infield but Vaughn’s swing is pretty athletic, and sweet. He doesn’t chase and seems to have a narrow early-count approach focused on pitches he can crush. He’s less able to damage well-executed breaking stuff away from him, but he often spoils those pitches or puts them in play and, again, typically doesn’t offer at them until he has to. There’s a clearer path to the big leagues for Vaughn now that Edwin Encarnacion and Nomar Mazara are no longer on the roster (I talk more about this in the System Overview), and he’ll likely play in the big leagues in 2021. He continues to project as an All-Star first baseman. (Alternate site)\n\n55 FV Prospects\n\n2. Michael Kopech, SP\n\nVideo\n\nDrafted: 1st Round, 2014 from Mt. Pleasant HS (TX) (BOS)\n\nAge\n\n24.6\n\nHeight\n\n6′ 3″\n\nWeight\n\n205\n\nBat / Thr\n\nR / R\n\nFV\n\n55\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n70/70\n\n55/60\n\n50/55\n\n40/45\n\n40/45\n\n94-98 / 101\n\nIt sometimes feels foolish to “wait for things to click” with very talented but frustrating (and perhaps flawed) prospects, but that’s what it seemed like was actually happening for Kopech just before he blew out his elbow late in 2018. The surgery’s timing meant Kopech lost all of the 2019 regular season and began rehabbing in a game environment during Fall Instructional League. His first bolt was 99 mph. He settled in at 96-99, and threw several plus sliders. Kopech made his spring 2020 debut on March 10 and threw 11 pitches, six of which were 100 mph or more. It was his only inning of 2020, as Spring Training was shut down soon after, and Kopech would later opt out of the season amid the pandemic and other meaningful off-field considerations. As such, his evaluation is the same.\n\nKopech’s trademark heat and slider give him late-inning potential even if he can’t start, an outcome that seems more likely during the early part of his big league career now that he’s missed two seasons and may take time to build up an innings load. He’ll be able to start if he can command that slider to the back foot of left-handed hitters; he needs to have an out-pitch against lefties and some sort of viable third pitch, which I think will more likely be a second breaking ball than a split or a changeup. If he can do that, I think he’s a 3-to-4 WAR starter. (At-home dev)\n\n3. Nick Madrigal, 2B\n\nVideo\n\nDrafted: 1st Round, 2018 from Oregon State (CHW)\n\nAge\n\n23.8\n\nHeight\n\n5′ 7″\n\nWeight\n\n165\n\nBat / Thr\n\nR / R\n\nFV\n\n55\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n60/70\n\n35/35\n\n30/30\n\n60/60\n\n60/60\n\n50\n\nBecause he missed time with a separated shoulder (both of Madrigal’s major injuries — this one and a fractured wrist in college — were suffered sliding into a base), Madrigal didn’t play enough big league baseball to lose rookie eligibility, but he did play enough to generate a relevant amount of data. After posting the lowest swinging strike rate in all of the minor leagues in 2019, he had the third-lowest swinging strike rate in the big leagues in 2020 at 3.3%. The players who surround him on that leaderboard — Luis Arraez, Eric Sogard, and David Fletcher — are all similar offensive players who make elite rates of contact but have almost no power. More precisely, Madrigal is most like Arraez because of how opposite-field oriented their contact is. If you prorate Fletcher and Arraez’s performance over the past few years, they’re pretty well above-average players, and Madrigal is a better defensive player than Arraez and is a wash with Fletcher at second. I just think this reinforces the industry’s long-standing eyeball evaluation that even though he’s quite small and is not going to hit for power, Madrigal is a very good player. (Alternate site, MLB)\n\n50 FV Prospects\n\n4. Garrett Crochet, SIRP\n\nDrafted: 1st Round, 2020 from Tennessee (CHW)\n\nAge\n\n21.5\n\nHeight\n\n6′ 6″\n\nWeight\n\n218\n\nBat / Thr\n\nL / L\n\nFV\n\n50\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\nSits/Tops\n\n80/80\n\n65/70\n\n30/40\n\n30/40\n\n99-101 / 102\n\nCrochet spent most of his college career in the bullpen, making just one pre-draft start in 2020 after missing the first few weeks of the college season with what the Volunteers claimed was shoulder soreness. (Major league teams were skeptical of that explanation and thought his absence had to do with an off-the-field matter.) In that lone appearance this spring, Crochet threw 3.1 innings and was absolutely electric, touching 99 with his fastball while flashing a 70-grade slider. How teams valued him leading up to the draft (the relief risk, the injury or makeup issues) was highly variable. Their confidence seemed to be determined by who in the org had seen him and when (many teams weren’t able to get a decision-maker to see him in person in 2020), but those that focused on his pitch data, which was shared among all the teams, thought he had among the best raw stuff in the entire draft class and was one of the few pitchers available who might pitch at the top of a rotation or in the back of a bullpen. Crochet was also among the high-octane college pitchers thought capable of going straight to the big leagues in a relief role, something more broadly considered by clubs due to the structure of the 2020 player pool. Out of Burl Carraway, Clayton Beeter, etc., only Crochet actually did.\n\nAfter he tuned up at the alternate site for about two months, Crochet was added to the 40-man and sent to the big leagues in mid-September. He pitched six innings in five relief appearances, walked no one (though he was pretty wild if you put on the tape), allowed just three hits and no runs, and struck out eight big leaguers. He made the White Sox playoff roster but left his first career postseason outing with a flexor strain, which ended his season. He’s healthy now, training and throwing at the team’s complex in Arizona. Because he barely threw in 2020, he’s likely to be on a strict innings limit in 2021. The club is going to try to thread the needle here and use Crochet in a relief role while still trying to develop him as a long-term starter. Players in this situation tend to wind up in the bullpen, and that’s where I have Crochet projected based on his strike-throwing limitations, independent of his shortened developmental timeline. (Alternate site, MLB)\n\n45 FV Prospects\n\n5. Jared Kelley, SP\n\nVideo\n\nDrafted: 2nd Round, 2020 from Refugio HS (TX) (CHW)\n\nAge\n\n19.2\n\nHeight\n\n6′ 2″\n\nWeight\n\n225\n\nBat / Thr\n\nR / R\n\nFV\n\n45\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n55/60\n\n40/45\n\n60/70\n\n25/50\n\n92-96 / 99\n\nKelley goes right at hitters with upper-90s gas and has a disappearing changeup. His curveball is occasionally average but more often is below, and as breaking ball spin is seen as an attribute a pitching prospect either has or doesn’t, the ceiling on that pitch is likely limited. If the curveball, or some other breaking ball, can become average, then Kelley can be a mid-rotation starter. If not, he has late-inning relief stuff. Kelley is also a bigger, heavier kid without a modicum of positive physical projection left unless you’re a proponent of “reverse projection,” where you project on a player based on the assumption that they’ll improve their conditioning in pro ball. This has happened with Forrest Whitley, Bo Bichette, and others. Even if this were to occur here, though, I’m not sure it will make a difference in the area of import, which for Kelley is his breaking ball quality. (Alternate site, Fall Instructional League)\n\n40+ FV Prospects\n\n6. Zack Burdi, SIRP\n\nVideo\n\nDrafted: 1st Round, 2016 from Louisville (CHW)\n\nAge\n\n25.8\n\nHeight\n\n6′ 3″\n\nWeight\n\n210\n\nBat / Thr\n\nR / R\n\nFV\n\n40+\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\nSits/Tops\n\n65/65\n\n55/55\n\n55/55\n\n30/35\n\n96-98 / 100\n\nIt’s been a long, slow ascent for Burdi after his post-surgery velocity tanked into the low-90s (he had TJ in 2017). Once parked in the 97-102 range, he was living 90-92 early on in the 2018 Fall League and was shut down with fatigue. In 2019, he was back in the 94-97 range, topping out at 99, then sat 96-99 and touched 100 during his 2020 big league debut. Burdi was knocked around in a limited major league jaunt and his velocity slowly declined (though always remained good) during that stretch. Just based on his — and perhaps unfairly, his brother’s — injury history, I think the industry will always value Burdi a little lower than his talent, which is that of a late-inning reliever.\n\nIt’s odd and perhaps a bit of a yellow flag that he was hit so hard in 2020, but I’m still betting on the combination of velocity and two good secondary pitches and project Burdi as a third bullpen banana. His slider is short and cuttery but it’s really hard, in the 88-92 mph range, and it has biting two-plane movement when it’s located right. His low-90s changeup also has bat-missing tail. All three pitches are capable of missing bats, Burdi just needs to execute more consistently. During his big league action this year, I noticed he’d alter his position on the rubber depending on the handedness of the opposing hitter. I don’t know how long Burdi has been doing that or if it’s a thing he’s yet comfortable with, so perhaps he experienced a learning/feel curve in 2020. (Alternate site, MLB)\n\n7. Benyamin Bailey, RF\n\nSigned: July 2nd Period, 2018 from Panama (CHW)\n\nAge\n\n19.3\n\nHeight\n\n6′ 4″\n\nWeight\n\n215\n\nBat / Thr\n\nR / R\n\nFV\n\n40+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n25/50\n\n50/60\n\n20/55\n\n45/30\n\n30/45\n\n50\n\nBailey put up a ridiculous 2019 stats in the DSL, walking more than he struck out en route to a .324/.477/.454 line. He was a good bit more physical than most of his peers in that league, listed at a sturdy 6-foot-4, 215 pounds. But he was also a bit raw from a baseball standpoint though he still had success in general, and with his swing decisions in particular. He did not have the opportunity to come stateside until Fall Instructional League 2020 and his name is one of the first out of scouts’ mouths when you ask them about who they liked from Chicago’s Autumn group.\n\nHe has overt power projection because of his frame, though with the added strength and power comes a corner-only profile. Scouts talk about Bailey’s likely eventual size as if he’s going to be built like Franmil Reyes, so there’s a chance he flirts with a DH-only defensive outcome. Regardless of whether he ends up in an outfield corner or without a real position, Bailey is going to have to hit. For a long-levered player who has less in-game experience than most who are the age of a college freshman, Bailey’s feel for the barrel is pretty good. He’s now had success against both same-aged but more experienced players in the DSL and against an Instructional League pitching pool that was unusually advanced due to a lack of minor league season. Without a valuable defensive role to fall back on, Bailey is a high-variance prospect who’ll either hit enough to play every day or not. He’s one of few prospects in the system who has that sort of ceiling at all and his bat-to-ball skills are better than all of the others. Were he a domestic prospect, Bailey would be the sort who goes in the third round of the draft. (Fall Instructional League)\n\n8. Jose Rodriguez, SS\n\nSigned: July 2nd Period, 2017 from Dominican Republic (CHW)\n\nAge\n\n19.6\n\nHeight\n\n5′ 11″\n\nWeight\n\n175\n\nBat / Thr\n\nR / R\n\nFV\n\n40+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n25/60\n\n45/45\n\n20/40\n\n55/55\n\n40/50\n\n50\n\nRodriguez can hit. He manipulates the bat head’s depth and direction to get the sweet spot to pitches all over the zone. He loads his hands pretty deep, but because he’s such a short-levered guy, Rodriguez is still able to catch velocity despite this. He’s clearly gotten stronger and twitchier during the last year and showed up to Fall Instructional League looking more muscular and mature than in 2019. I think he’s an athletic fit on the middle infield though he perhaps doesn’t have quiet the arm for shortstop. That may have come with the added strength but I did not see this group in the Fall. I’d like to see him be more selective, but the combination of feel to hit and defensive projection give Sanchez a shot to be a consistent, role-playing middle infielder of some kind. He has an outside shot at being a regular if he can continue to become more physical. The trajectory he’s on in this regard has already surpassed what I expected after seeing him in the AZL last year. (Fall Instructional League)\n\n9. Micker Adolfo, DH\n\nVideo\n\nSigned: July 2nd Period, 2013 from Dominican Republic (CHW)\n\nAge\n\n24.3\n\nHeight\n\n6′ 4″\n\nWeight\n\n255\n\nBat / Thr\n\nR / R\n\nFV\n\n40+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/35\n\n70/70\n\n50/60\n\n40/40\n\n40/40\n\n50\n\nAdolfo spent all of 2020 shrouded by the alternate site. He was assigned to Estrellas Orientales in the Dominican Winter League just before the initial publication of Chicago’s list but hasn’t played enough there to justify re-evaluation, so his report remains the same. Adolfo has been around for so long that even though he’s missed a lot of time due to injury, we have a pretty good idea of what he is. Here’s the rundown: Adolfo missed most of 2015 due to a gruesome leg fracture, broke his hamate a month into 2016, played through an elbow injury that required Tommy John in 2018, then missed most of 2019 due to arthoscopic surgery on that same elbow, before being limited to the alt site for 2020. Amid these long stretches of inactivity, Adolfo got big and buff (he nows tips the scales at a listed 255 pounds) but also pretty stiff, and while the White Sox have maintained that they’d like him to play the outfield, he’s one of several heavy-footed DH types on the 40-man.\n\nAdolfo has the raw power to clear that (or any) offensive bar, but he’s had strikeout issues throughout his career and except for the last few injury-riddled seasons (small sample alert), he’s been a hedonistic free swinger. He’s run close to an 11% walk rate in his last 550 plate appearances, which is double the rate he posted from 2014 to 2017. It would give him a better chance of playing a consistent role if that increase in patience is real and sustains. The power gives Adolfo a chance to have some 2019 Jorge Soler type seasons while his whiffs make him a high variance hitter likely to have several replacement-level campaigns as well. He’s in the White Sox mix for a power bench bat and occasional DH. (Alternate site, LIDOM)\n\n40 FV Prospects\n\n10. Matthew Thompson, SP\n\nDrafted: 2nd Round, 2019 from Cypress Ranch HS (TX) (CHW)\n\nAge\n\n20.4\n\nHeight\n\n6′ 3″\n\nWeight\n\n184\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n45/55\n\n45/55\n\n40/50\n\n30/45\n\n91-94 / 96\n\nThompson’s velocity has varied dating back to high school, when he’d let it rip in the mid-90s during short showcase outings, but then was back down in the upper-80s the following spring (which is part of why he fell in the 2019 draft). That variability has followed him into pro ball where, even during a fairly brief instructs run in the Fall, Thompson’s fastball was either up to 95 or 96, or living in the 90-92 range depending on when he was seen. (This was well after he was added to the 60-man player pool in early-August, so he’d had time to get ramped up for the Fall.) Perhaps mechanical changes, aiming to simplify Thompson’s delivery and make it more consistent, are at work; his delivery is super smooth but he didn’t repeat it consistently as an amateur. Regardless, he remains a good long-term pitching prospect who has enough physical projection left to allow us to dream on him routinely throwing hard. He just hasn’t had the opportunity to cut it loose and prove he can do it over a full season of pro starter’s innings yet. His FV remains the same as last year. (Alternate site, Fall Instructional League)\n\n11. Andrew Dalquist, SP\n\nVideo\n\nDrafted: 2nd Round, 2019 from Redondo Union HS (CA) (CHW)\n\nAge\n\n20.1\n\nHeight\n\n6′ 2″\n\nWeight\n\n170\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n40/45\n\n40/50\n\n45/55\n\n40/50\n\n35/55\n\n91-93 / 95\n\nMy pre-draft reports on Dalquist suggested he was a relatively advanced strike-thrower, as is typical for a SoCal high school arm, with a shapely curveball and a short arm action suitable for changeup projection. That’s mostly held true more than a year after he was drafted, except I saw more release point variability (as if to vary the shape of his breaking ball) and a longer arm action (which makes me less likely to project heavily on the changeup) than was described in my amateur notes. But again, Dalquist’s report remains similar to last offseason’s write-up. He’s well-balanced over the rubber and has advanced fastball and breaking ball control. He’ll likely end up with two viable breaking balls even if the changeup doesn’t develop, which will be fine for thwarting lefties so long as they’re located well, which they project to be. Because Dalquist is of narrow build, he doesn’t have the fastball projection of most other, recently-drafted pitchers (especially since he’s already 20) and projects toward the back of a rotation. (Alternate site, Fall Instructional League)\n\n12. Jonathan Stiever, SP\n\nDrafted: 5th Round, 2018 from Indiana (CHW)\n\nAge\n\n23.6\n\nHeight\n\n6′ 2″\n\nWeight\n\n205\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n40/45\n\n45/50\n\n45/45\n\n50/55\n\n45/55\n\n90-94 / 95\n\nDuring 2019 spring training and the early part of that season, Stiever’s fastball sat in the 89-92 range. As the temperature climbed, so too did Stiever’s velocity, and he started pounding the zone with 92-95, peaking at 97. In a season split between Low- and Hi-A, Stiever struck out 154 hitters and walked just 27 in 145 innings and became one of the org’s better starting pitching prospects. Then he was shut down with forearm soreness toward the end of 2020’s original spring training and didn’t re-emerge until September, when the team called him up from the alternate site to make a few September starts, which was instructive because we got to see his velocity coming off of the forearm soreness that ended his spring. He sat 91-94, which is a little below his peak 2019 breakout when he would touch those 6’s and 7’s. His changeup looked better, though, and it was a stabilizing force during a jittery first start.\n\nHe’ll need to locate his slider more consistently for it to be effective, and the same goes for his heater if it’s going to live around 93 rather than well into the mid-90s. Stiever also incorporated his secondary stuff more often in his second outing. That’s probably the long-term strategy if this is where his fastball velocity is going to live, but both his breaking ball and fastball spin were down about 200 rpm each compared to the 2019 minor league data I have. Based on his 2020 look, Stiever is a 40 FV backend starter. If he reclaims his 2019 velocity, he’s a 45 FV, but that year is the one that, based on his career norms, appears to be the outlier right now. (Alternate site, MLB)\n\n13. Bryan Ramos, 3B\n\nSigned: July 2nd Period, 2018 from Cuba (CHW)\n\nAge\n\n18.8\n\nHeight\n\n6′ 2″\n\nWeight\n\n190\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n20/50\n\n50/55\n\n25/50\n\n50/45\n\n40/50\n\n60\n\nEven in a year without minor league performance to support it, scouts still think Ramos’ feel to hit and general offensive comfortability are ahead of that of the other physical, teenage hitters in this system. He is also the most reliable defensive infielder of this group and I consider him likely to stay at third base, though it’s worth noting that there’s growing variability on both sides of that prediction, as the Sox have experimented with him at second, while one scout who saw him in the Fall think teenagers this size almost always move to first base or the outfield corners.\n\nIndeed, for his age, Ramos is already a sizable guy. Perhaps tricked by the way his fire engine red batting gloves stood out against Chicago’s black and gray instructs threads, I thought he had the most explosive hands of that group, and I like how bold his stride is, even though some of his swings are reckless. Ultimately, he’s a risky corner prospect a long way from the big leagues. (Fall Instructional League)\n\n14. Yermin Mercedes, DH\n\nSigned: July 2nd Period, 2010 from Dominican Republic (WSN)\n\nAge\n\n27.8\n\nHeight\n\n5′ 11″\n\nWeight\n\n225\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n55/55\n\n60/60\n\n50/50\n\n30/30\n\n20/20\n\n45\n\nThe effervescent Mercedes’ long, circuitous path to the big leagues culminated in just one 2020 plate appearance, but he remains in the White Sox mix to play a situational, bat-only bench or part-time role in the immediate future. I wrote last year that Mercedes is built such that he looks ripped and fat at the same time, and if you’ve been watching him catch for Licey in the Dominican Winter League, you can see he’s begun to trend toward the latter. It doesn’t matter all that much though because, anticipated rule changes or not, he can’t catch, nor can he really play first base. Instead, his is a DH-only profile with serious strength, bat speed, and hand-eye coordination that might enable him to play a valuable situational role if he can overcome a propensity to chase. It’s not as if the Yermínator lacks any kind of approach. With two strikes, he ditches his huge leg kick and focuses on putting the ball in play with just his hands and wrists, and he often still hits the ball hard like this because he’s so strong.\n\nPerhaps he’ll have some trade value once baseball moves to a universal designated hitter but I tend to think Mercedes’ epicurean sensibilities at the plate would undermine his ability to play every day. Instead, I think if he’s deployed in situations where the opposing pitcher can’t pitch around him and has to throw strikes, he’ll be a very, very dangerous late-game hitter. How the org decides to prioritize his opportunities versus Adolfo’s, Zack Collins‘ and others might be up to the new manager. (Alternate site, MLB (barely), LIDOM)\n\n15. Luis Gonzalez, RF\n\nDrafted: 3rd Round, 2017 from New Mexico (CHW)\n\nAge\n\n25.3\n\nHeight\n\n6′ 1″\n\nWeight\n\n185\n\nBat / Thr\n\nL / L\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n50/55\n\n45/45\n\n30/30\n\n55/55\n\n45/50\n\n50\n\nGonzalez and Rutherford are stacked next to one another yet again because, aside from the lone at-bat Gonzalez got during the 2020 big league season, both were sequestered at the alternate site in Schaumberg, IL all year and were wholly unscoutable. Both of their reports are unchanged. I prefer Gonzalez because I think his shorter swing enables him to make more consistent contact. He stands way off the dish, which creates some quality-of-contact limitations on pitches away from him in exchange for an ability to open up and turn on inside pitches with authority. It’s an approach that’s typically shiftable, but Gonzalez is also a good bunter and runs well to combat this. I think he has more big league utility than Rutherford because of these secondary skills, even though Rutherford has more power. (Alternate site)\n\n16. Blake Rutherford, LF\n\nDrafted: 1st Round, 2016 from Chaminade Prep HS (CA) (NYY)\n\nAge\n\n23.6\n\nHeight\n\n6′ 3″\n\nWeight\n\n210\n\nBat / Thr\n\nL / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n40/45\n\n50/50\n\n45/50\n\n50/50\n\n50/50\n\n40\n\nThe White Sox limit who from their org is allowed to speak with the media about prospects, so you’ve likely read this elsewhere since it’s the company line: Chicago is trying to get Rutherford to pull the ball more. Because he was only at the alt site all year, there’s really no way of knowing how this has gone. I’ve been watching Rutherford since his junior year of high school and he has always had a gorgeous low-ball swing that at times is suited for him slicing pitches away from him to the opposite field. I was as enamored with Rutherford’s swing and big frame during his prep days as anyone, but my thinking around swings like this has changed, even if Rutherford’s report hasn’t. I’ve never seen him really impact a ball that he hasn’t gotten fully extended on, and I don’t see a way of getting him to pull more without losing that that extension. Anecdotally, longer-swinged hitters seem to be better at hitting breaking balls and offspeed stuff than fastballs, and perhaps as baseball shifts toward a pitching approach that throws more breaking balls, hitters like Rutherford will actually be in a metagame position to succeed, but I’m skeptical. I still think the hopeful outcome here is for a lefty platoon bat. (Alternate site)\n\n17. Yolbert Sanchez, SS\n\nVideo\n\nSigned: July 2nd Period, 2019 from Cuba (CHW)\n\nAge\n\n23.8\n\nHeight\n\n6′ 2″\n\nWeight\n\n190\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/45\n\n45/45\n\n30/35\n\n60/60\n\n50/55\n\n60\n\nVisa issues kept Sanchez in the DSL for all of 2019, which meant that at age 22, he was squaring off against live pitching that was often four or five years younger than he was. It meant having to scrutinize, and perhaps dismiss, Sanchez’ strong .297/.386/.441 line, while his underlying TrackMan data (a major league-average 88 mph mean exit velo, with only 25% of balls in play hit over 95 mph) reinforced the international scouting opinion that Sanchez is probably more of a utility player than a potential everyday guy due to a lack of power. The Fall Instructional League look in 2020, Sanchez’s first stateside action, was similar, though he has been strength training in Miami and is getting pretty big. We won’t know if that has yielded stock-boosting power in games until he hopefully faces age-appropriate competition in 2021. (Fall Instructional League)\n\n18. Kade McClure, MIRP\n\nDrafted: 6th Round, 2017 from Louisville (CHW)\n\nAge\n\n24.9\n\nHeight\n\n6′ 7″\n\nWeight\n\n230\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nSplitter\n\nCommand\n\nSits/Tops\n\n50/55\n\n50/55\n\n45/50\n\n40/45\n\n45/50\n\n92-94 / 95\n\nMcClure was a priority Rule 5 writeup for scouts in the Fall because he had missed 2018 due to a knee surgery, then pitched well (especially from a strike-throwing perspective) across two A-ball levels in 2019. In the Fall of 2020, he was also throwing harder: up from 89-92 and touching 94 in 2019, McClure was suddenly sitting 92-95 with a host of viable secondary pitches. He looks like a near-ready depth option and perhaps more if his velocity keeps climbing. (Fall Instructional League)\n\n19. Lenyn Sosa, 2B\n\nSigned: July 2nd Period, 2016 from Venezuela (CHW)\n\nAge\n\n20.9\n\nHeight\n\n6′ 0″\n\nWeight\n\n180\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n35/55\n\n45/55\n\n30/45\n\n40/30\n\n30/40\n\n45\n\nI have mixed notes on Sosa’s athleticism and defensive ability, but I like the way his hands work in the box and think he has a good knack for finding the barrel even though he doesn’t have great bat speed, and hitting is the thing I care most about. He had two high-end contact seasons as a 17 and 18-year old in rookie ball (one aided by the Pioneer League’s hitting environment), then had a dud of a 2019 at age 19, then only saw instructs action this Fall. He’ll still be fairly young for Hi-A in 2021. I think he’ll ultimately be the sort of infielder who is only able to play second or third because of good positioning, but I’m interested in seeing what happens to the power output if Sosa trains and tries to hit with that in mind. (Fall Instructional League)\n\n20. Seby Zavala, C\n\nVideo\n\nDrafted: 12th Round, 2015 from San Diego State (CHW)\n\nAge\n\n27.3\n\nHeight\n\n6′ 0″\n\nWeight\n\n215\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/30\n\n55/55\n\n40/45\n\n30/30\n\n50/50\n\n50\n\nSeby spent the year at the alternate site and his report in unchanged, though it’s worth noting that the departure of James McCann and the defensive abilities of those left behind (aside from Yasmani Grandal) make it more likely that he sees big league time in 2021. He’s going to strike out a lot, so much that it will be detrimental to his offensive output relative to the average big leaguer, but that’s true of a lot of backup catchers. Zavala is a viable defensive catcher with above-average raw power, and I think he’d run into as many as 10 homers as a full-season backup. Where he sits amidst a crowded catching situation in Chicago depends on how the org views Mercedes and Collins defensively. He’s likely the third catcher during his option years and someone’s backup once those expire. (Alternate site)\n\n21. James Beard, CF\n\nDrafted: 4th Round, 2019 from Lloyd Star HS (MS) (CHW)\n\nAge\n\n20.2\n\nHeight\n\n6′ 0″\n\nWeight\n\n190\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n20/40\n\n30/40\n\n20/35\n\n80/80\n\n40/70\n\n40\n\nBeard’s report is very similar to last year’s but I’ve upped his FV because while he’s as raw as many of the hitters in the 35+ FV tier, the probability that he remains at an up-the-middle defensive position should create some separation between him and the others. At the same time, this is the sort of player who the year away from seeing pro pitching probably hurts the most, and the kind of player who a shorter draft and a more limited number of minor league roster spots will also hurt. As a hitter, Beard is more like a five o’clock shadow, one of the least-experienced bats to appear on a team’s list this year. But of all the young hitters in this org, he has the greatest chance of staying up the middle because his speed almost guarantees he’ll stay in center field forever. He’s a half-decade dev project with the speed to be a leadoff pest. (Fall Instructional League)\n\n22. Tyler Johnson, SIRP\n\nDrafted: 5th Round, 2017 from South Carolina (CHW)\n\nAge\n\n25.3\n\nHeight\n\n6′ 3″\n\nWeight\n\n205\n\nBat / Thr\n\nR / R\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n60/60\n\n55/55\n\n40/45\n\n30/40\n\n93-95 / 97\n\nJohnson spent the year at the alternate site (he was eventually added to the 40-man roster) and so his report is the same. Because Johnson was hurt for most of the pre-deadline part of the 2019 season he wasn’t widely seen until the Fall League, where he struggled to throw strikes. He is athletically built but doesn’t have an athletic delivery. He has a very casual, very terse stride that cuts him off and forces him to throw across his body. It’s weird and disorienting the first few times you see it, which makes the 93-95 fastballs Johnson throws catch you off guard. He’ll flash a plus breaking ball, but that was also inconsistent in Fall. He’s a 40 FV from a stuff and deception perspective, though industry feedback (the AFL look was bad) mostly had him in the tier beneath this one. (Alternate site)\n\n23. Gavin Sheets, 1B\n\nDrafted: 2nd Round, 2017 from Wake Forest (CHW)\n\nAge\n\n24.7\n\nHeight\n\n6′ 4″\n\nWeight\n\n230\n\nBat / Thr\n\nL / L\n\nFV\n\n40\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n45/50\n\n70/70\n\n45/50\n\n30/30\n\n40/50\n\n40\n\nA player dev employee from a team that saw a lot of the Sox during the Fall echoed the thoughts I’ve had about Sheets’ swing basically since he was drafted: he too often slices down at the baseball, and he can only get to his considerable raw power in certain parts of the strike zone. He does have good bat control and makes mid-flight adjustments to breaking balls, which he has the raw strength to punish even if the timing of his lower half has been compromised. He’s a good hitter, just one I’m skeptical will clear the offensive bar at first base without trading some contact for power, which hasn’t happened yet. He got some run in the outfield during Instructional League, and if he proves capable of playing there then he belongs up in the Gonzalez/Rutherford area. If you stand back and take a bird’s eye view of the profile, this is a 24-year-old who hasn’t slugged over .415 in pro ball yet and now occupies a 40-man spot on a club that has several other hitters just like him. (Fall Instructional League)\n\n35+ FV Prospects\n\n24. Hunter Schryver, SIRP\n\nDrafted: 7th Round, 2017 from Villanova (TBR)\n\nAge\n\n25.7\n\nHeight\n\n6′ 1″\n\nWeight\n\n205\n\nBat / Thr\n\nL / L\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCommand\n\nSits/Tops\n\n60/60\n\n50/50\n\n45/55\n\n90-93 / 94\n\nSchryver was acquired in a small 2018 trade with the Rays then pushed to Double- and Triple-A during his first full season with the Pale Hose, pitching well in Birmingham but not in Charlotte. He was a 2020 non-roster invitee but blew out and needed Tommy John in February, missing the entire season. And yet there was some light industry buzz that he was being talked about as a Rule 5 Draft sleeper because Schyver’s pitch data is superlative in a specific way. Namely, his release point is really, really high (top 20 among minor league lefties in 2019) and yet, because he doesn’t take much of a stride down the mound, his extension is just a shade over five feet, which is very low. His release point is unique due to this combination, and it creates really weird angle on his fastball, which spins a lot relative to its velocity. Conversely, his slider has almost no spin. It’s weird. He’s a sleeper who I expect will be at least an up/down option year reliever. (Injury)\n\n25. Caleb Freeman, SIRP\n\nDrafted: 15th Round, 2019 from Texas Tech (CHW)\n\nAge\n\n22.8\n\nHeight\n\n6′ 1″\n\nWeight\n\n190\n\nBat / Thr\n\nR / R\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nCommand\n\nSits/Tops\n\n55/60\n\n55/60\n\n30/35\n\n92-95 / 97\n\nThere are several Texas Tech relievers who recently entered pro ball with crude arm strength only to suddenly become more interesting, which either indicates pro ball is optimizing something being missed in Lubbock, or that Tech is underscouted. Freeman only threw 16 innings during his junior year for the Red Raiders, and they weren’t very good (he walked 15 guys). After he signed, though, he was excellent. He sat 92-95 and touched 97 in rookie ball and flashed a plus breaking ball. The pandemic made it tough for pro dev take-a-leap guys everywhere to break out. Freeman was working with two different breaking balls in the Fall, but he was a little wild again and he may always be, as his arm action is long. But I’ve got an up/down relief grade on him, which is a good find in round 15. (Fall Instructional League)\n\n26. Lency Delgado, 3B\n\nDrafted: 4th Round, 2018 from Doral Academy Prep (FL) (CHW)\n\nAge\n\n21.5\n\nHeight\n\n6′ 3″\n\nWeight\n\n215\n\nBat / Thr\n\nR / R\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/40\n\n50/55\n\n30/50\n\n50/45\n\n40/50\n\n60\n\nThis applies to Delgado, and Bush, and Gladney behind him: Delgado stands out in his uniform (he’s built like a top-heavy college linebacker, bigger and faster than a lot of same-aged college players in this year’s draft) and is a really explosive guy with considerable raw power. He has a bad approach that limits both the quality and amount of contact he makes. He could really have used a full season of at-bats to try to nurture that, but instead saw pitching that was a stretch for him in the Fall. (Fall Instructional League)\n\n27. Jimmy Lambert, SIRP\n\nDrafted: 5th Round, 2016 from Fresno State (CHW)\n\nAge\n\n26.1\n\nHeight\n\n6′ 2″\n\nWeight\n\n170\n\nBat / Thr\n\nR / R\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\nSits/Tops\n\n45/50\n\n50/55\n\n50/55\n\n50/55\n\n45/50\n\n91-94 / 95\n\nLambert’s strikeout rate exploded from 16% in 2017 to nearly 29% in 2018. The cause? A slight uptick in velocity paired with an arm slot change that has him coming straight over the top, creating more life on his heater; it also creates more vertical action on his breaking stuff. This delivery appears tough to maintain, as Lambert has to contort his body to get to that slot, but he hasn’t been wild since making the change. In 2019, he tore his UCL and needed Tommy John in June. I assumed that would cost him all of 2020, but he went to the Sox alternate site and actually made his big league debut in July of 2020. After just two outings, though, he was again shut down with a forearm strain and put on the 60-day IL. (For The Board, I’m using pitch data I have from 2019 rather than what he generated in a two-inning, perhaps somewhat injured big league sample in 2020.) I still have him projected in an up/down relief role eventually. (Alternate site, MLB)\n\n28. Bailey Horn, MIRP\n\nVideo\n\nDrafted: 5th Round, 2020 from Auburn (CHW)\n\nAge\n\n22.9\n\nHeight\n\n6′ 2″\n\nWeight\n\n217\n\nBat / Thr\n\nL / L\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nCommand\n\nSits/Tops\n\n50/50\n\n50/50\n\n50/55\n\n40/45\n\n90-93 / 96\n\nMy notes on Horn’s Fall exploits aren’t great; a scout told me his fastball was very hittable in the outing they saw. But he had been a consistent “arrow-up” prospect throughout the previous year and a half. He had surgery while at junior college then pitched out of the Auburn bullpen as a draft-eligible sophomore, and his velo climbed the further away from the surgery he got. Horn won a rotation spot in the Fall of 2019 then came out touching 96 as a junior and had four really good starts before the shut down. He’s another up/down relief prospect with two quality breaking balls and could probably stand to use the curveball as a strike-one pitch more than he did in college. (Fall Instructional League)\n\n29. Bryce Bush, RF\n\nDrafted: 33rd Round, 2018 from De La Salle Collegiate HS (MI) (CHW)\n\nAge\n\n21.0\n\nHeight\n\n6′ 0″\n\nWeight\n\n200\n\nBat / Thr\n\nR / R\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/35\n\n55/60\n\n35/55\n\n50/45\n\n30/35\n\n50\n\nA late-round, cold-weather high school flier who signed for $290,000, Bush played in some of the big prep showcases during his final amateur summer and was clearly overmatched against the better pitching. But he put on an absolute show during batting practice and has one of the best raw power projections among potential future Sox. He had a strong pro debut on paper and continued to look good with the bat during the spring of 2019, then struggled during the summer. The general scouting consensus is that Bush will not stay at his current third base and will have to move to an outfield corner or to first, which immediately makes his whiffs troublesome. He’s a high-risk, long-term developmental prospect with some of the louder offensive tools in the system. (Fall Instructional League)\n\n30. DJ Gladney, 3B\n\nDrafted: 16th Round, 2019 from Illiana Christian HS (IL) (CHW)\n\nAge\n\n19.4\n\nHeight\n\n6′ 3″\n\nWeight\n\n200\n\nBat / Thr\n\nR / R\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n20/40\n\n50/60\n\n25/55\n\n40/40\n\n30/40\n\n50\n\nI reposting last year’s comment because I still think it’s relevant: Gladney presents an interesting case for splitting actual age away from other Traits of Maturity in draft models, since he was young for the class in both age and reps (another possible Trait of Maturity), but not physically (a third). He’s a strong guy who strides way open as he tries to pull everything with power, an all-or-nothing approach. Like Bryce Bush before him, Gladney will be tried at third base for a while but may not stay there. He’s a high risk corner power prospect. (Fall Instructional League)\n\n31. Luis Mieses, CF\n\nVideo\n\nSigned: July 2nd Period, 2016 from Dominican Republic (CHW)\n\nAge\n\n20.6\n\nHeight\n\n6′ 3″\n\nWeight\n\n210\n\nBat / Thr\n\nL / L\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/55\n\n50/55\n\n20/50\n\n45/40\n\n45/45\n\n45\n\nPerhaps it’s damning that Mieses was not invited to receive fall instruction in the U.S. but since I have no new information here, good or bad, he remains at the back of the list as a huge-framed young player with rare feel for contact for such a long-limbed hitter. Like others in the system, his approach is bad and could be his undoing. (At-home dev)\n\n32. Jake Burger, 1B\n\nVideo\n\nDrafted: 1st Round, 2017 from Missouri State (CHW)\n\nAge\n\n24.7\n\nHeight\n\n6′ 2″\n\nWeight\n\n210\n\nBat / Thr\n\nR / R\n\nFV\n\n35+\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n35/50\n\n60/60\n\n40/55\n\n30/30\n\n40/45\n\n60\n\nBecause of the pandemic, Burger was facing a third consecutive season without regular reps following two lost to a myriad of severe heel injuries (including two Achilles ruptures) and instead played for the Normal CornBelters in a makeshift league put together after COVID squashed the usual summer wood bat festivities in the Midwest. Burger’s play and Chicago’s late-summer 60-man pool space enabled them to roster him at the alternate site toward the end of the season before he went to instructs in the Fall.\n\nHe’s leaner and more mobile than scouts anticipated, evidence of the work he put in during his unthinkable series of misfortunes. The Sox added him to the 40-man in November. While his story of perseverance is remarkable, and all of baseball is rooting for the guy, who seems like an affable and funny young man, he’s unlikely to make a long-term big league impact. I was on the low end of projecting Burger while he was in college, skeptical of his ability to play third even before all the injuries. Now, his swing path is also a bit of an issue. He should be given an opportunity to claim that bench power bat spot but I think others in the org are more likely to do so. (CarShield Collegiate League, alternate site, Fall Instructional League)\n\nOther Prospects of Note\n\nCatching Depth (and Remillard)\nCarlos Perez, C\nGunnar Troutwine, C\nRicardo Aguilar, C\nZach Remillard, SS\n\nPerez, 23, has good bat-to-ball skills and arm strength but little power. He might be a third catcher. Troutwine is a tough dude with great feel for the strike zone. Aguilar just signed. He’s a converted infielder with a compact frame and contact-oriented approach. Remillard is upper-level depth capable of playing almost every position on the field.\n\nHigh Probability Depth Arms\nKonnor Pilkington, LHP\nAndrew Perez, LHP\nVince Arobio, RHP\nBernardo Flores Jr., LHP\n\nAll of these pitchers are in their mid-20s. Pilkington is an SEC college performance prospect with below average stuff. He’s a sixth starter type. Perez needs to find a breaking ball, but he will touch 95 from the left side and his changeup is plus. Arobio has a high spin, backspinning fastball, too, but his angle is more downhill. He has the best breaking ball of this group. Flores is a four-pitch lefty with good breaking stuff and a 40 fastball.\n\nYounger, Raw Pitching\nFrander Veras, RHP\nDavis Martin, RHP\nYoelvin Silven, RHP\nMcKinley Moore, RHP\nAdisyn Coffey, RHP/3B\nRonaldo Guzman, LHP\n\nVeras is 21 and spent 2019, his first pro season, in the DSL. He was up to 96 there and his changeup has late sinking action at times. Martin is another good Day 3 pick out of Texas Tech. He sits 89-94 and has a plus slider. Silven was up to 95 as a 19-year-old in 2019, and sitting 93 and touching 96 late in 2020. His secondary stuff is below average and the Sox are tinkering with a couple different breaking balls there. Moore is an arm strength-only prospect who actually threw strikes pretty consistently during instructs, which he needs to continue doing as he climbs the ladder. He’s up to 98. Coffey was the team’s underslot 2020 signee so they could fit Kelley into their bonus pool. He was a high school infielder once committed to ASU, ended up at a Midwest JUCO and moved to the mound. He’s been 93-95 in spurts but had a Tommy John two months ago and is now taking BP and groundballs. Guzman is a small-ish 18-year-old lefty who was the youngest player on the Instructional League roster. He struck out a lot of DSL hitters in 2019 even though he only threw in the mid-80s because his fastball has big carry. He’s now into the upper-80s and will have an impact fastball if he can keep throwing harder.\n\nSystem Overview\n\nThe White Sox have graduated top prospects several years running, and their 2020 group was particularly strong. Especially now that they’re pushing in their chips and trading prospects for current big leaguers (Dane Dunning would have been in the 50 FV tier, while Avery Weems would be toward the top of the 40s), this group is starting to thin a little bit, and this list may be artificially deep because I’ve kept some of the young hellion hitting prospects alive here. It’s likely a couple of the toolsy scratch-offs toward the bottom of the list would have struggled during a 2020 season and fallen off, but it’s also possible one or two of them would have broken out in a meaningful way, although I suppose Bailey did during the Fall and that stretch also reinforced the notion that Rodriguez might have a special bat. It’s especially important to this org that the draft be as many rounds as the owners can stomach to fill in some depth at the bottom of the system.\n\nIt’s notable that even the really good prospects in this system have very aggressive approaches, often so aggressive that it undermines their ability to hit. I think virtual reality training would be an interesting fit for this org. The concept of it makes sense: show your hitters dozens of pitches per day, from VR big league pitching, and try to develop pitch recognition skills without needing to have a pitcher there. Some orgs have tried it and seen promising early results but the pandemic wiped out another season to evaluate if it was working.\n\nThe White Sox did not appear to opt in to Fall data sharing with the rest of baseball, as I asked multiple sources to check on some objective information for this list and they found nothing from instructs in their system. Because this is one of the orgs I did not see myself in the Fall, alterations to this list were largely derived from the opinions of scouts I spoke to who saw ball at Camelback Ranch and whatever was gleaned from players’ big league performance.\n",
      "Folder": "Feedly",
      "Timestamp": "1608351016",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.256548Z"
}