{
  "id": "0f54575bfc184a969d99a641eb2b249e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/work/1815719/three-signs-of-a-poor-hiring-process-and-four-ways-to-fix-it/",
      "Title": "Three signs of a poor hiring process—and four ways to fix it Quartz",
      "Selection": "When given the opportunity to establish a process, we’re all biased to advocate for one in which we would be successful ourselves. In hiring, this plays out in two main ways: “A” players build monocultures, hiring people just like them, and “B” players hire “C” players, hiring people who won’t threaten them.\n\nIn other words, top performers too narrowly define what top performance is, and okay performers hire mediocre people; in both cases, they’re making selections that bolster their own position.\n\nThere are several telltale warning signs of a poor hiring process:\n\nUncompelling job descriptions. Test your job posting with people you think would be great in the role—send them the description and ask if they have any feedback. If your ideal person doesn’t read the job description and find it compelling, you have more work to do.\nWeak applicant pools. If your interest level is low, then your option set will be small. It’s also much harder to calibrate from a small inbound applicant pool. Especially for a new role, it’s worth interviewing a lot more people than you want to. Talking to interested people will help you understand the role, expectations, and motivations of your candidates better, while giving you a better window into what you, the hiring manager, can expect.\nHigh withdrawal rates. Do you have a low response rate on emails to potential candidates? You need to revisit the text of the email and the job description. Do people decline to participate in your process? You need to revisit it. Do people decline the offer once made? You need to understand what’s propelling that: role, salary, team, or another factor.\n\nWhat to do?\n\n1. Acknowledge the bias, and let it go\n\nThe first step toward reducing bias is to acknowledge the bias that’s there. Notice how this shows up for you: Are you defensive about some of the potential changes you need to make because you know you wouldn’t do well if you were held to them? Are you overvaluing things that have made you successful? Try and step back and see that the process is just that—a process—not a value judgment on you.\n\n2. Reset your expectations\n\nIt’s quite possible that the skills that were prized or evaluated when you were hired are not the skills that are most needed today. It’s almost certain you’ve learned and grown since then anyway (and if not, maybe that’s the problem you should be looking to solve).\n\nWe tend to either overvalue our own skills or take them for granted. Spend some time thinking about what makes different people effective, and about the hidden work that goes into it. Learn to value and articulate specific actions that lead to specific outcomes.\n\nWhatever the case when you were hired, what is needed for success today? Think about what you want to add to the team and what your current process selects for. Invariably, there is a gap to fill, and the size of the gap implies what you do next. Minor gaps have minor fixes, major gaps require a major rethink.\n\nAs dispassionately as possible, consider what success looks like in this role, and the kind of impact a strong performer could have. Try and differentiate between key skills and learned behaviors. For example, when hiring a senior engineer into a complex code base, an ability to grapple with the complexity is not negotiable. Being able to use Git effectively is key to being successful—but very much learnable on the job, so don’t rule people out on the basis that they have been using another system of software-version control.\n\n3. Articulate definite skills and behaviors, and why they are important\n\nOnce you’ve understood the success factors in different roles, you can identify key skills and behaviors in your job descriptions, and articulate why they are important. Some examples from a recent round of hiring we did for an in-house recruiter:\n\nExperience at scale—operating a scaled process is very different from a low volume process, and requires people to be able to cope with a lot of context switching and navigate potential overwhelm. Whilst in time we may be able to train people up in this and evaluate potential, at this time we need people who have done it before.\n\nInternational experience—we hire internationally and understanding the variabilities of the international job market is key. Resumes are highly localised, expectations and communication vary between cultures. Someone who has only operated in one job market, particularly if only the US, will lack a perspective that is required to be successful.\n\nIt’s important to select for behaviors rather than characteristics. For example, responding well to feedback is a key attribute for a strong hire, as it’s a strong predictor of coachability. We can look for a characteristic commonly associated with this (“this person has a graduate degree, so….”), or, better yet, we can test the behavior (i.e. give them feedback, and see how they respond).\n\n4. Standardize rubrics for more objective evaluation\n\nIn a small-scale process, you can create consistency by having one or two people do things. At scale, this is impossible and rubrics are imperative. However, even at low scale, it’s been demonstrated that standardization leads to fairer outcomes. Having clear things you’re evaluating for helps distinguish charisma from competence, and allows you to get closer to data than gut feeling.\n\nStandardization also helps with calibration. If you look back at previous hiring decisions, what turned out to be a strong predictor of success at the next step or in the role itself? What turned out to be irrelevant? If you haven’t structured your decision-making process, it’s harder for you to learn from it.\n\nWe’ve all made a bad hire—even in the best process, it happens. The instances that are most glaring often come from a fundamental lack of understanding of the role.\n\nThe more you understand what the job entails, the better you can write a compelling job description and evaluate it. It may feel like you don’t have the time because you need to fill that spot yesterday, but nothing will sink more time than having someone on your team who doesn’t have the skills they need to be successful.\n\nCate Huston is an engineering manager at Automattic, where she has led the mobile and Jetpack teams.\n",
      "Folder": "Feedly",
      "Timestamp": "1583906428",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.306808Z"
}