{
  "id": "0fb128475eae48e684f474f7c6369a45",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/19444-this-herby-one-pot-chicken-dinner-has-an-unlikely-hero",
      "Title": "This Herby, One-Pot Chicken Dinner Has an Unlikely Hero Food52",
      "Selection": "The March Bon Appetit’s “Dinner Tonight” column features a spread of recipes by chef Alex Raij. As the owner of four restaurants and mother of two, Alex says her secret to getting dinner on the table is improvisation—grabbing this and grabbing that, working with what she has on hand. She also reveals her secret for succulent chicken thighs: “Humble mayonnaise, which encourages browning.”\n\nI see minimal prep in your future...\nPhoto by Alexandra Stafford\n\nHaving had success with mayonnaise in surprising applications in the past—Gabrielle Hamilton’s genius grilled cheese and chocolate chicory cake, for instance—I needed no more convincing to make Alex’s mayonnaise-slicked chicken. The recipe at its core, moreover, looked simple: Toss potatoes with sliced onion, oil, and water in a roasting pan. Place bone-in, skin-on, mayonnaise-coated (and -marinated, if time permits) chicken thighs on top. Roast at 450º F until the chicken is lightly charred and cooked through.\n\nFor the amount of prep, which amounts to slicing an onion and stirring together two condiments, I’m not sure I’ve ever reaped such a great reward: exceptionally tender chicken and incredibly tasty potatoes flavored with the juices of the meat, the sweet, meltingly tender onions, and the olive oil. I’ve made the dish several times now with a few modifications to account for the ingredients I’ve had on hand and time limitations—not once have I marinated this chicken, and not once has it received anything but rave reviews.\n\nFrom tarragon-y to oven ready...\nPhotos by Alexandra Stafford\n\nThese are the keys to success here:\n\n1. Use smallish potatoes, ideally ones that require no chopping. Small fingerlings (or halved large ones) will work, as will new potatoes or whatever you can find at your market—I’ve been using honey golds. A small potato not only minimizes prep but also ensures it will cook completely through by the time the chicken is done.\n\n2. Monitor the water level: Depending on the size of your pan, you may need to add water to prevent the onions from getting too brown. See notes in the recipe.\n\n3. Finish with herbs: Nothing says spring like tarragon! A showering of fresh herbs—chives, tarragon, parsley, or whatever you like best—just before serving brightens this dish up both color- and flavor-wise.\n\nEffortless chic is a good look.\nPhoto by Alexandra Stafford\n\nI know mayonnaise, for some people, can be a hard sell, but before the inclusion of this ingredient turns you away, first consider what mayonnaise is: an emulsion of oil and egg often with a little lemon or vinegar. It’s harmless! If that’s not enough, know that whatever it is about mayonnaise that offends you—its smell, texture, appearance—dissipates in the oven. And if that’s not enough still, let the promise of a five-minute dinner prep show you the light—the result, I have no doubt, will make mayonnaise a page turner in your book no longer.\n\nOne-Pan Roasted Chicken Thighs with Potatoes and Tarragon\n\nBy Alexandra Stafford\n\n1.5\npounds small potatoes, see notes above\n\n1\nmedium onion, thinly sliced, to yield about a cup\n\n2\ntablespoons olive oil\n\n1/2\ncup water\n\nkosher salt and fresh cracked pepper to taste\n\n1/4\ncup mayonnaise\n\n2\ntablespoons Dijon mustard\n\n4\nbone-in, skin-on chicken thighs\n\na few tablespoons finely chopped herbs, such as tarragon, chives, or parsley\n\nView Full Recipe",
      "Folder": "Feedly",
      "Timestamp": "1491482848",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.691174Z"
}