{
  "id": "0fe70b79c5d84cf987e848d44583ab1c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/the-goods/2019/3/11/18259894/bankruptcy-business-chapter-11-close-stores",
      "Title": "Why businesses that declare bankruptcy don’t always die Vox - All",
      "Selection": "Businesses from American Airlines to American Apparel have filed for Chapter 11. Why haven’t they closed?\n \nBankruptcy leaves the impression of utter failure, and when a company goes bankrupt, it’s easy to assume that it’s dead, may it rest in peace. According to this line of thinking, here’s an alarming tidbit: If you regularly travel by plane, there’s a decent chance you’ve flown with an airline that was bankrupt at the time. United filed for bankruptcy in 2002, followed by Delta in 2005 and American Airlines in 2011.\n\nWhile bankruptcy can result in the liquidation or sale of a company, it also presents an opportunity for it to restructure while continuing to operate, suspend or reconfigure debt payment, and get back on its feet, so to speak. That was the case for United, Delta, and American, which all exited bankruptcy in less than four years. Since 2017, we’ve seen a wave of once-powerful retailers going the same route, like Sears, Mattress Firm, the clothing brand BCBG, and the accessories chain Claire’s.\n\nThe idea of corporate bankruptcy as a reset button is an American invention dating to the 19th century, says Fordham law professor Richard Squire. A boom in the railroad industry had led to over-building, and with too many railroads, some inevitably failed. But these businesses still had value, having invested heavily in laying down rails and building engines and cars. People realized that the cash generated by liquidating these assets — selling them off piece by piece — wouldn’t be as great as the gains from letting the railroads continue to operate.\n\nWith too many railroads, some inevitably failed. But these businesses still had value.\n\n“It didn’t make sense to shut them down, or you would destroy a lot of economic value,” says Squire. \n\nSo the legal world came up with a solution: The troubled railroads wouldn’t get shut down, or at least not entirely, and the creditors to whom money was owed would become the companies’ new shareholders. It was an exchange of equity for debt. Businesses in other industries started doing the same thing, and reorganization eventually came to be known as Chapter 11 of the US Bankruptcy Code. \n\nReorganization in bankruptcy has also become an American export, says Squire, having been picked up in some form by the UK, Italy, Germany, and Singapore, among others. Under American law, the same managers who drove the company into bankruptcy are allowed to continue operating the business, which some observers initially saw as “hiring the fox to guard the hen house.” \n\n“There was a lot of skepticism in the rest of the world about the reorganization process,” says Squire. “But over time jurisdictions increasingly recognized that they were shutting down valuable businesses. If you liquidate a business, everyone loses their jobs. The employees all get fired, suppliers now have nobody to work with. They realized that bankruptcy the way [it was traditionally done] is very disruptive, so maybe we could try something like the American system.”\n\nOn a more philosophical level, the notion of second chances in business seems to come out of a specifically American mindset toward reinvention — or at least an outlook that gels with America’s mythology about itself. It’s the idea that the conditions of one’s birth shouldn’t determine one’s lot in life, that you can come from anywhere and climb your way to the top. \n\nThis optimistic narrative isn’t entirely true, of course, with systemic inequality evident in the growing racial wealth gap and the intersecting gender pay gap. Meanwhile, the Trump administration’s stance on immigration makes clear that where a person was born very much matters to the United States government. (President Trump’s businesses, it bears noting, have filed for Chapter 11 bankruptcy a number of times.)\n\nBy extension, one stumble shouldn’t mean that a retailer must shut down forever. Under that threat of failure, what reasonable person would start a business in the first place?\n\nBankruptcy can play out in a number of ways, from reorganization to liquidation\n\nJust because a retailer can reorganize through bankruptcy doesn’t mean it ought to go that route. Chapter 11 is not meant to provide permanent relief from debt payment, so if a company’s liquidation value is greater than its revenue potential, shutting operations down entirely may very well be the best option. Liquidation is also known as Chapter 7 bankruptcy, in which a court-appointed trustee sells off the retailer’s assets — merchandise and store fixtures, intellectual property, etc. — in order to pay off its creditors in a prescribed order of priority. These are the two chapters used by bankrupt businesses; Chapter 12 is designed for “family farmers” or “family fishermen,” and Chapter 13 is for individuals.\n\nOne of the biggest determinants in whether a company should attempt to restructure is simply whether it has a reason to exist\n\nOne of the biggest determinants in whether a company should liquidate or attempt to restructure is simply whether it has a reason to exist, says Melissa Kibler, a senior managing director at Mackinac Partners who works as an accountant on bankruptcy-induced reorganizations. (Bankruptcy court gets final approval over the reorganization plan, as well as any major business decisions that take place during bankruptcy.) If a company has too many powerful competitors or if it’s in a sector that’s suffering as a whole — as brick-and-mortar retail has been, due to Amazon and the rise of online shopping — the answer may be no.\n\nIt also matters why a company needs to file for bankruptcy. It’s easier to fix a good business that’s taken on too much debt than it is to overhaul one whose sales have declined because customers have lost interest.\n\nWhen Kibler works with a retailer that’s considering filing for bankruptcy, she and the client look at a variety of metrics that indicate whether it’s a viable business and what changes would need to be made to make that the case. They track sales for stores that have been open for at least a year, a number that excludes the inflationary effect of newly opened locations and indicates which direction sales are moving in. They look at individual stores to diagnose their problems: Is it a bad location that doesn’t get much foot traffic? Is the product assortment tailored properly to the local shopper base? Are there too many or too few staffers on the floor? \n\nThese are questions that a retailer should be asking itself all the time, but they’re especially relevant when they’re figuring out a plan of attack for a reorganization, whether that means shutting down underperforming stores or overhauling the product.\n\nReorganization efforts often fail, and a Chapter 11 bankruptcy can end in liquidation of some or all of the company’s assets\n\nWhile Chapter 11 bankruptcy is focused on a company reorganizing and paying off its debt, it has a variety of possible outcomes. Reorganization efforts often fail, and a Chapter 11 bankruptcy can end in liquidation of some or all of the company’s assets. \n\nThis is what happened to Borders Books: Once the country’s second-largest bookseller, it was hit sideways by the rise of Amazon and e-books, and it filed for Chapter 11 bankruptcy protection in February 2011. It was hoping for a buyout by a private equity firm, but the deal fell through, and in an absence of other buyers, the company announced its liquidation plans that July, shuttering its nearly 400 remaining stores. In the fire sale, Borders competitor Barnes & Noble snapped up its intellectual property and database of 48 million customers for $13.9 million.\n\n(Why not just file for Chapter 7 bankruptcy then? Well, liquidation might not have been the hoped-for outcome, but even if it was, Chapter 11 allows management to choose its own liquidation firms and to sell off other assets, like intellectual property. In Chapter 7, everything would be liquidated by an appointed case trustee.)\n\nIndeed, many Chapter 11 cases these days end with a company selling off its intellectual property — in essence, its brand name and assets like its customer database — to a private equity firm or a competitor, especially in the retail world. For Barnes & Noble, it might be enough to make use of Borders’ customer information and let the brand lie fallow, but for other players, the purchase of a retailer’s IP is cause for a reboot.\n\nBankruptcy can end with a brand relaunch under new management\n\nWe’ve seen a number of retailers go bankrupt and relaunch under new management in the past few years. When American Apparel filed for bankruptcy in the fall of 2016, closing all of its stores, Gildan Activewear bought its intellectual property and relaunched it with some tweaks to its infamous marketing style. Nasty Gal was acquired out of bankruptcy by the British fast fashion brand Boohoo in February 2017, though its resuscitation came with complaints of poor customer service.\n\nGildan and Boohoo bought American Apparel and Nasty Gal’s names but none of their existing operations, supply chains, or debt. In essence, the brands looked much the same — if less risqué, in the case of American Apparel — but under the hood, they were totally different. At its clumsiest, this can create a sort of zombie effect, where things just seem off.\n\nIt’s a tough road, though. Ramez Toubassy, the president of brands at Gordon Brothers, describes the valuation of a bankrupt brand’s intellectual property as an art and a science. Gordon Brothers is best known as a liquidator, but Toubassy led its March 2017 acquisition of Wet Seal’s brand name after the mall retailer shut down all of its stores and filed for Chapter 11 bankruptcy protection earlier that year.\n\nIt’s not uncommon for a brand to stumble and file for bankruptcy again — what those in the business jokingly call a “Chapter 22”\n\nWhen a brand name like that goes on the market, Toubassy sets about figuring out where and how long ago its revenue peaked, and how much affinity and awareness the brand has among potential shoppers — indicators of whether it would be worth the time, capital, and risk involved in a relaunch. And he says he’d need to have a clear view of what would be done differently this time around to escape the pitfalls of the past. \n\nIt’s not uncommon for a brand to relaunch out of bankruptcy only to stumble and file for bankruptcy again — what those in the bankruptcy business jokingly call a “Chapter 22.” While Chapters 7 and 13 impose waiting periods for filing a second time, Chapter 11 bankruptcy generally comes with no such rules, and Chapter 22s have become common in the retail world recently, highlighting the challenging nature of the business right now.\n\nIn the case of Wet Seal, Toubassy took notes from the success of the hyper-popular fashion e-commerce site Fashion Nova, which is known for its collaborations with Cardi B, cloning everything the Kardashians wear, and releasing clothing in a mind-melting 24 hours. In September 2017, Toubassy’s team relaunched Wet Seal as a “crowdsourced, fast-fashion e-tailer,” dispensing with the brick-and-mortar business model that helped drag it down the drain and adopting Fashion Nova’s speedy mentality and direct-to-consumer business model. Has it been successful? Well, thus far Wet Seal hasn’t had to file for a “Chapter 33,” having been through the process twice previously.\n\nThere are certain advantages to building a new company around an existing brand name, rather than starting fresh: Though it may have been tarnished somewhat by bankruptcy, customers are already familiar (and, ideally, friendly) with it. But a brand name is also what Toubassy calls “an expiring asset.” Increasingly, firms like Gordon Brothers need to minimize the time between acquisition and relaunch as much as possible: Customers are more distractible than ever and have many brands vying for their attention, and digital commerce means algorithms that deprioritize players not actively in the game.\n\n“I would say if you’re not back up and running with e-commerce in six months, you’d better have a good reason,” Toubassy says.\n\nFor bankrupt retailers, reorganization is increasingly unlikely\n\nThe system that Squire described, one in which a company can restructure via Chapter 11 bankruptcy protection, isn’t a realistic option for many retailers today. That’s in part due to the Bankruptcy Abuse Prevention and Consumer Protection Act (BAPCPA), a 2005 amendment to the US Bankruptcy Code. \n\nPreviously, bankrupt retailers had 60 days to either reject or accept their store leases, but they could ask the court for repeated extensions of that deadline — “often for the full duration of a debtor’s bankruptcy case,” according to the American Bankruptcy Institute. Under BAPCPA, retailers now get a maximum of 210 days (a 120-day deadline, plus a single 90-day extension) to make that decision. No further extensions are granted without the landlord’s consent.\n\nRetailers now have significantly less time to figure out which stores they ought to keep open and which they should close\n\nThis matters because it put a massive time crunch on retailers, which now have significantly less time to figure out which stores they ought to keep open and which they should close. It takes 120 days to organize and run a going-out-of-business sale, says Kibler, effectively giving the retailer a mere 90 days to figure out its store closure strategy. On the flip side, BAPCPA leveled the playing field for landlords: If a bankrupt retailer wants to get out of a store lease, it generally only has to pay between one and three years’ rent, even if it has another nine years left on its contract.\n\nThough Kibler says the restructuring analysis that used to take place during bankruptcy now happens before a company files, this time pressure has contributed to retailers being less likely to reorganize and more prone to liquidate and sell their intellectual property. \n\nIt’s not the only reason, though. As Kibler said, a company needs to have a really good reason to reorganize — a good reason to exist — and the rise of e-commerce has made retailers with massive store presences obsolete. Second chances may be a beloved American ideal, but so is innovation and the growing pains that come with it.\n\nWant more stories from The Goods by Vox? Sign up for our newsletter here. ",
      "Folder": "Feedly",
      "Timestamp": "1552330372",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.389383Z"
}