{
  "id": "0ffda8c5fd2046d78582ae70cc2c23d4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1130324/17-women-have-accused-donald-trump-of-sexual-assault-or-misconduct-its-time-to-revisit-those-stories/",
      "Title": "17 women have accused Donald Trump of sexual misconduct. It’s time to revisit those stories Quartz",
      "Selection": "After a fifth woman accused Roy Moore of sexual misbehavior or assault, US senate majority leader and fellow Republican Mitch McConnell urged the Alabama senate nominee to withdraw, saying, “I believe the women.”\n\nHis visible and vocal stance regarding Moore sharply contrasts with how supporters of Donald Trump have responded to at least 17 women who have accused him of various degrees of sexual harassment, voyeurism, and assault. Their claims against the US president span three decades. During his campaign, Trump vociferously denied each accusation, adding in one instance that the woman in question “would not have been my first choice.”\n\nRepublican leaders spoke out against Trump in October 2016, when an Access Hollywood tape emerged in which Trump can be heard bragging that he could “grab [women] by the pussy.” But they did not defend the women who came forward with assault allegations against Trump, nor did they suggest their claims were credible.\n\nAs the calendar ticked forward to the presidential vote, GOP figures who had briefly distanced themselves from Trump got behind him again. His accusers’ stories faded to the background. The media moved on to other things. Trump was elected.\n\nNow that he has sided with Moore’s accusers, McConnell was asked on Nov. 15 if he believes the women who similarly accused Trump. He would not answer. “Look, we’re talking about the situation in Alabama,” he told reporters. “And I’d be happy to address that if there are any further questions.”\n\nMAGA. (AP Photo/ Evan Vucci)\nThe post-Weinstein world\n\nThough just over a year has passed since the election, the claims against Moore have come to light into a very different world than those raised against Trump. Revelations about movie mogul Harvey Weinstein have prompted a torrent of new allegations, which cost powerful men in entertainment, media, and politics their jobs.\n\nViral hashtag campaigns including #MeToo and #MeAt14 have given thousands of women on social media the opportunity to speak out against the sexual abuse, harassment, and assault they have experienced. Another one, #TrumpToo, has gained new currency.\n\nWelcome home, @RealDonaldTrump! While you were gone we started actually punishing people for sexual harassment so, you know, heads up.\n\n— Stephen Colbert (@StephenAtHome) November 15, 2017\n\nNow may be the time to look at public accusations against Trump again, to view them anew in a rapidly changing political and social climate. Trump has never been charged with a sexual-misconduct crime, and has adamantly denied each claim listed below. But the world’s approach to women who say they have been victimized by sexual misconduct is changing—and so are the consequences for men who are accused.\n\nLanguage also matters. Much of the coverage of the accusations waged against Trump last fall used wording like “groping,” “inappropriate touching,” or “fondling” to describe behavior that could constitute sexual assault. As Laura Bates, author of Everyday Sexism and Girl Up, wrote in the Guardian, using euphemistic language both downplays the severity of the offense being alleged and undercuts the distress felt by the women who came forward.\n\nThree women who have accused Trump of sexual assault or misconduct stand with attorney Gloria Allred at the Women’s March on Washington. (Reuters/James Lawler Duggan)\nBelow are the stories of 17 women who have accused Trump of sexual misconduct. Their allegations have been categorized according to how the US legal system might assess and investigate them.\n\nA note on terminology: The US Justice Department defines sexual assault as “any type of sexual contact or behavior that occurs without the explicit consent of the recipient.” This includes forced sexual intercourse, forcible sodomy, child molestation, incest, fondling, and attempted rape. According to the National Institute of Justice, sexual assault can also include voyeurism, exposure to exhibitionism, and undesired exposure to pornography.\n\nThe 17 named accusers of Donald Trump\n\n1. Jessica Leeds (1980s)\nSexual assault (nonconsensual touching)\n\nJessica Leeds, now 75, told the New York Times (video) last year that Trump assaulted her when she was seated next to him on a flight to New York in the 1980s.\n\nAfter speaking with her for some time, she said, Trump lifted the armrest and began to touch her, grabbing her breasts and trying to put his hand up her skirt.\n\nShe said she did not report the incident to airline staff or the authorities, because she saw that kind of unwanted behavior as commonplace. “We accepted it for years,” she told the Times. “We were taught it was our fault.”\n\nLast month, Leeds told the Washington Post she felt dismayed that Weinstein had been brought down by his accusers, yet Trump remained in office: “It is hard to reconcile that Harvey Weinstein could be brought down with this, and Trump just continues to be the Teflon Don.”\n\n2. Ivana Trump (1989)\nSexual assault (nonconsensual intercourse)\n\nIn a divorce deposition  in 1990, Trump’s first wife, Ivana, described an event in 1989 in which Trump physically assaulted her and then forced himself on her. Details were made public in the 1993 Trump biography “Lost Tycoon: The Many Lives of Donald J. Trump,” by Harry Hurt III, who obtained the sealed deposition and confirmed the account with two of her friends before publishing it.\n\nPer “Lost Tycoon,” Trump was angry with Ivana after he underwent a procedure to eliminate a bald spot by a plastic surgeon she had recommended. He allegedly pulled out some of his wife’s hair and then had sex with her in a way that left her feeling “violated.” In Hurt’s account, she spent the night locked in the bathroom, crying, only to emerge in the morning to have Trump ask her: “Does it hurt?”\n\nTrump has denied the allegations. A statement from Ivana was later added to the first page of “Lost Tycoon,” in which she softens her language, but stands by the substance of the allegation. “During a deposition given by me in connection with my matrimonial case, I stated that my husband had raped me,” the statement said. “[O]n one occasion during 1989, Mr. Trump and I had marital relations in which he behaved very differently toward me than he had during our marriage. As a woman, I felt violated, as the love and tenderness, which he normally exhibited towards me, was absent. I referred to this as a ‘rape,’ but I do not want my words to be interpreted in a literal or criminal sense.”\n\nIn 2015, Michael Cohen, then special counsel at the Trump Organization, now a lawyer and spokesman for the president, incorrectly told the Daily Beast that “you cannot rape your spouse.” (While there was once a “marital rape exemption” in New York, that ended in 1984.)\n\nIvana also revised her original account of the incident in a 2015 statement to CNN:\n\nI have recently read some comments attributed to me from nearly 30 years ago at a time of very high tension during my divorce from Donald. The story is totally without merit. Donald and I are the best of friends and together have raised three children that we love and are very proud of. I have nothing but fondness for Donald and wish him the best of luck on his campaign. Incidentally, I think he would make an incredible president.\n\nIn October, Ivana again spoke favorably of her ex-husband in an interview with CBS News, in which she said they remain in regular contact.\n\n3. Kristin Anderson (1990s)\nSexual assault (nonconsensual touching)\n\nPhotographer Kristin Anderson said she was sitting on a couch with friends at a crowded Manhattan nightclub in the early 1990s when she felt a hand go up her skirt and touch her vagina through her underwear.\n\n“I basically just pushed the hand away, turned and looked, got up off the couch, and we all moved,” she told CNN last year. She said she immediately recognized the perpetrator as Donald Trump.\n\n“He was so distinctive looking—with the hair and the eyebrows. I mean, nobody else has those eyebrows,” she told the Washington Post. She recalled gathering with her friends after the incident and deciding to take their evening elsewhere: “Okay, Donald is gross. We all know he’s gross. Let’s just move on.”\n\n4. Jill Harth (1992)\nSexual assault (nonconsensual touching)\nSexual harassment\n\nJill Harth said she met Trump in 1992 when she was dating one of his business associates, George Houraney. In a 1997 lawsuit (later dropped), Harth said Trump made comments or advances that left her feeling uncomfortable, and ultimately assaulted her. “Trump repeatedly put his hands on plaintiff’s thighs and violated plaintiff’s ‘physical and mental integrity’ by attempting to touch plaintiff’s intimate private parts,” the complaint reads.\n\nThe suit alleges a series of lewd comments and verbal harassment, which culminated in an incident around Jan. 24, 1993, when Harth attended a business meeting at Trump’s Mar-a-Lago club and estate in Palm Beach, Florida. In Harth’s recounting, Trump kept her from leaving and “forcibly removed” her to a bedroom, where he subjected her to “unwanted sexual advances, which included touching of plaintiff’s private parts in an act constituting attempted ‘rape.'”\n\nHarth later dropped the complaint. In 1998, she began a months-long consensual relationship with Trump. When asked by Times columnist Nicolas Kristof why she would agree to date a man she had accused of attempted rape, she said she was in the midst of a divorce and was scared, “thinking, ‘what am I going to do now?”\n\n“When he called me and tried to work on me again, I was thinking maybe I should give this a try, maybe if he’s still working on me, I should give this rich guy a chance,” Harth told Kristof last October.\n\nTrump spokesperson Hope Hicks told Kristof that Trump “denies each and every statement made by Ms. Harth.” At the time, the campaign also released e-mails that they said discredited Harth’s account, including messages in which Harth asks for jobs doing Trump’s hair and makeup.\n\nOver the years, and in Kristof’s column, Harth has stood by her initial claim of harassment and assault. She spoke most recently with the Guardian about her experiences, saying Trump had pulled off “the biggest con possible” in winning the presidency.\n\nSad you had to go through it. My pain is everyday with bastard Trump as President.  No one gets it unless it happens to them. NO one!\n\n— Jill Harth (@jillharth) October 10, 2017\n\n5. Cathy Heller (1997)\nNonconsensual kissing\n\nCathy Heller told the Guardian that in 1997 she was at a Mother’s Day brunch at Mar-a-Lago with her husband, three children, and in-laws when Trump was greeting members. When he arrived at their table, Heller said she reached out for a handshake but “he took my hand, and grabbed me, and went for the lips.” She said she leaned backward to avoid him, almost losing her balance, and again, he “grabbed me and went for my mouth and went for my lips,” she told the Guardian. “He kept me there for a little too long, and then he just walked away.”\n\nSpeaking to the Washington Post after the Weinstein revelations were made public, Heller, now 64, said she wondered whether the fact that the movie producer’s accusers were famous is what held more weight for the general public. “When it’s a celebrity, it has more weight than just someone who he met at Mar-a-Lago or a beauty pageant contestant,” she said. “We’ll see about Trump. It’s never too late.”\n\n6. Temple Taggart McDowell (1997)\nNonconsensual kissing\n\nTemple Taggart McDowell was the 21-year-old representative for Utah in the Miss USA pageant when she said Trump unexpectedly kissed her at a rehearsal.\n\n“He embraced me and gave me a kiss on the lips,” McDowell told NBC last year. Another time, he did the same thing when she was visiting Trump Tower at his invitation, doing so in front of two pageant chaperones and a receptionist, McDowell said. “I would never approach or greet anybody like that unless it was somebody that I had been dating,” she told NBC.\n\n7. Mariah Billado (1997)\nVoyeurism\n\nMiss Vermont Teen USA in the 1997 pageant, Mariah Billado told BuzzFeed News she was shocked when Trump walked in to the dressing room while contestants, some of whom were as young as 15, were getting ready.\n\n“I remember putting on my dress really quick because I was like, ‘Oh my God, there’s a man in here,’” she said, adding she remembered Trump saying something along the lines of: “Don’t worry, ladies, I’ve seen it all before.”\n\n“I was in shock,” Karena Virginia told reporters last year. (Reuters/Carlo Allegri)\n8. Karena Virginia (1998)\nSexual assault (nonconsensual touching)\n\nYoga instructor Karena Virginia said that Trump groped her breast and made misogynistic comments during an encounter in Queens, New York when she was 27.  She said at a press conference last year (video) that she was waiting for a car to take her home after a 1998 US Open tennis match when Trump walked up to her with a small group of men.\n\n“I was surprised when I overheard him talking to the other men about me,” making comments about her legs and appearance, Virginia said. “He then walked up to me and reached out his right arm and grabbed my right arm. Then his hand touched the right side of my breast,” she said. “I was in shock. I flinched. ‘Don’t you know who I am? Don’t you know who I am’—that’s what he said to me. I felt intimidated and I felt powerless.”\n\nVirginia said that she felt ashamed and blamed herself for the encounter for years.\n\n9. Bridget Sullivan (2000)\nVoyeurism\n\nFormer Miss New Hampshire Bridget Sullivan told BuzzFeed News in the spring of 2016 that Trump would come into the dressing rooms backstage at the 2000 Miss USA pageant when contestants were naked, staring at them. “The time that he walked through the dressing rooms was really shocking. We were all naked,” she said.\n\nIn October of last year, CNN unearthed audio of Trump on the Howard Stern radio show in 2005, in which Trump brags about the behavior described by Sullivan. In Trump’s words:\n\n“I’ll tell you the funniest is that before a show, I’ll go backstage and everyone’s getting dressed, and everything else, and you know, no men are anywhere, and I’m allowed to go in because I’m the owner of the pageant and therefore I’m inspecting it.\n\nYou know, I’m inspecting because I want to make sure that everything is good. You know, the dresses. ‘Is everyone okay?’ You know, they’re standing there with no clothes. ‘Is everybody okay?’ And you see these incredible-looking women, and so, I sort of get away with things like that.”\n\nIn his element. (Reuters/Jamie Fine)\n10. Tasha Dixon (2001)\nVoyeurism\n\nFormer Miss Arizona Tasha Dixon, 18 when she competed in the Miss USA pageant, also said Trump subjected her and others to voyeurism.\n\n“Our first introduction to him was when we were at the dress rehearsal and half naked, changing into our bikinis,” Dixon told local media. “He just came strolling right in. There was no second to put a robe on or any sort of clothing or anything. Some girls were topless. Other girls were naked.”\n\nShe said the brazen behavior put the contestants in a deeply uncomfortable spot. In her words:\n\nThe owner comes waltzing in when we were naked or half naked in a very physically vulnerable position, and then to have the pressure of the people that worked for him telling us to go fawn all over him, go walk up to him, talk to him, get his attention.\n\n11. Mindy McGillivray (2003)\nSexual assault (Nonconsensual touching)\n\nOn Jan. 24, 2003, Mindy McGillivray joined her friend, photographer Ken Davidoff, for an assignment at Mar-a-Lago, where a Ray Charles concert was taking place. According to McGillivray’s account in the Palm Beach Post, she was there to keep track of who Davidoff took pictures of.\n\nMcGilligray, then 23, said she was backstage when she felt someone grab her from behind. “I think it’s Ken’s camera bag, that was my first instinct. I turn around and there’s Donald,” she told the Post last year. “He sort of looked away quickly. I quickly turned back, facing Ray Charles, and I’m stunned.”\n\nNot wanting to make a scene, she said she didn’t do anything. Asked by a reporter whether it could have been an accident, McGillivray said she was sure it was not: “This was a pretty good nudge. More of a grab. It was pretty close to the center of my butt. I was startled. I jumped.’’\n\nWhile Davidoff did not witness the alleged assault, he said he believed McGillivray and also spoke to the Post to corroborate her story.\n\n12. Rachel Crooks (2005)\nNonconsensual kissing\n\nRachel Crooks, one of the first women to come forward publicly against Trump last year, was a 22-year-old receptionist working at a real-estate company in Trump Tower when she ran into him outside an elevator in 2005.\n\nAccording to her account in the New York Times, they shook hands. Then Trump did not let go, kissing her cheeks, and then “directly on the mouth.” “It was so inappropriate, Crooks told the Times. “I was so upset that he thought I was so insignificant that he could do that.”\n\n13. Natasha Stoynoff (2005)\nSexual assault (nonconsensual touching and kissing)\n\nIn December, 2005, Natasha Stoynoff was a writer for People magazine, assigned to a story on the first anniversary of Melania and Donald Trump’s wedding. At Mar-a-Lago for a photo shoot and interview, Stoynoff said Trump brought her into a room with the guise of showing her around the estate, then shut the door and began kissing her. “I turned around and within seconds he was pushing me against the wall and forcing his tongue down my throat,” she wrote in the magazine last year. “I was grateful when Trump’s longtime butler burst into the room a minute later, as I tried to unpin myself.”\n\n“My shock began to wear off and was replaced by anger. I kept thinking, Why didn’t I slug him? Why couldn’t I say anything?” she wrote.\n\nSix people came forward to say she had told them of the incident, including the publication’s east-coast news editor, Liz McNeil. “She was very upset and told me how he shoved her against a wall,” McNeil said. “The thing I remember most was how scared she was. I felt I had to protect her.”\n\nTrump’s campaign called Stoynoff’s account a “fictional story.” Charles Hardner, a lawyer for Melania Trump, wrote in a letter to Stoynoff after the People story published that some statements in Stoynoff’s account are “false and completely fictionalized,” and demanded a retraction.\n\nJessica Drake speaks to reporters last year. (Reuters/Kevork Djansezian)\n14. Jessica Drake (2006)\nNonconsensual kissing\n\nAdult-film actress Jessica Drake said she was at a golf tournament in Lake Tahoe at an event for Wicked Pictures in 2016 when she met Trump in the celebrity gift room.\n\nSpeaking to reporters last year (video), she said Trump flirted with her and asked her for her phone number, which she gave him.\n\nDrake said that Trump then invited her up to his suite, and because she did not feel comfortable going alone, two other women joined her. “When we entered the room, he grabbed each of us tightly in a hug, and kissed each one of us without asking permission. He was wearing pajamas. A bodyguard was also present,” Drake said.\n\nTrump denied Drake’s story as “pure fiction,” while referencing her profession as an adult film actress seemingly to undercut her claim. In Trump’s words:\n\nOne said, ‘he grabbed me on the arm.’ And she’s a porn star. You know, this one that came out recently, ‘he grabbed me and he grabbed me on the arm.’ Oh, I’m sure she’s never been grabbed before.\n\n15. Ninni Laaksonen (2006)\nSexual assault (nonconsensual touching)\n\nA model who represented Finland in the Miss Universe competition, Ninni Laaksonen told the Finnish newspaper Ilta-Sanomat in October that Trump had groped her before an appearance on The Late Show with David Letterman in 2006.\n\n“Before the show we were photographed outside the building,” she told the paper, per a translation in the Telegraph. “Trump stood right next to me and suddenly he squeezed my butt. He really grabbed my butt. “I don’t think anybody saw it but I flinched and thought: ‘What is happening?’”\n\nSummer Zervos alleges Trump sexually assaulted her after she appeared on “The Apprentice.” (Reuters/Mike Blake)\n16. Summer Zervos (2007)\nSexual assault (nonconsensual touching and kissing)\n\nSummer Zervos said Trump subjected her to sexual harassment and assault when she tried to consult him as a mentor and potential employer after her appearance on “The Apprentice.”\n\nSpeaking at a press conference last year (video), Zervos said she met Trump in 2007 in New York, when he unexpectedly kissed her on the lips as a greeting, an action that surprised and embarrassed her. Later that year in Los Angeles, she said, he asked to meet for dinner at the Beverly Hills Hotel. When she arrived, she said that rather than being taken to a restaurant, she was led by a security guard to a bungalow with a bedroom.\n\nWhen she entered, she said he kissed her again. When she tried to make conversation instead, he asked her to sit down next to him, which she did. In her telling, Trump then “grabbed my shoulder and placed his hand on my breast.” She tried to stand up and get away, but he pulled her into a bedroom. She said she again tried to leave, and push him off, saying “Come on man, get real.” He said he repeated her words back to her, “Come on man, get real,” while thrusting his genitals on her. They ultimately had dinner in the room, and she said she left feeling violated and distraught. “I wondered if the sexual behavior was some kind of test or whether or not I had passed,” she said.\n\nZervos said the Access Hollywood tape had motivated her to come forward with her story, saying she would like to tell Trump that “you do not have the right to treat women as sexual objects just because you are a star.”\n\nWhen Zervos initially went public with her claims last year, Trump released the following statement, denying the events took place:\n\nTo be clear, I never met her at a hotel or greeted her inappropriately a decade ago. That is not who I am as a person, and it is not how I’ve conducted my life. In fact, Ms. Zervos continued to contact me for help, emailing my office on April 14 of this year asking that I visit her restaurant in California.\n\nIn January, lawyer Gloria Allred filed a complaint on behalf of Zervos in New York, which alleges she was “ambushed by Mr. Trump on more than one occasion,” and that Trump had “suddenly, and without her consent, kissed her on her mouth repeatedly; he touched her breast; and he pressed his genitals up against her.”\n\nLast month, Trump addressed Zervos’ claims, this time calling the allegations “fake news.”\n\n“It’s just fake. It’s fake. It’s made-up stuff, and it’s disgraceful, what happens, but that happens in the—that happens in the world of politics,” he said.\n\n17. Cassandra Searles (2013)\nSexual assault (nonconsensual touching)\n\nIn a Facebook post last June, Cassandra Searles, who competed as Miss Washington in the 2013 Miss USA pageant, said Trump “treated us like cattle.”\n\nIn the comments section on the post, other contestants she had tagged in the initial post shared their experiences, and in one comment Searles wrote, according to a report in Rolling Stone: “He probably doesn’t want me telling the story about that time he continually grabbed my ass and invited me to his hotel room.”\n\nTrump continues to deny the allegations\n\nQuartz reached out to the White House for comment on this story but did not receive a response. We will update this story if a statement is made available.\n\nAt a press briefing on Oct. 22, Trump’s spokeswoman Sarah Sanders was asked again about the accusations made against the president during the course of the campaign.\n\n“Is the official White House position that all of these women are lying?”Jacqueline Alemany of CBS News asked.\n\n“Yeah,” Sanders responded. “We’ve been clear on that from the beginning and the president has spoken on it.”\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1510967650",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.525737Z"
}