{
  "id": "101ca2c960ec4a23ab57edad647d650b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://ritholtz.com/2020/12/cost-of-financing-us-deficits/",
      "Title": "Cost of Financing US Deficits The Big Picture",
      "Selection": "Source: Peterson Institute for International Economics,\n\n \n\n \n\n \n\nAs the Congress continues to debate the details of a Covid rescue package, a brief reminder: Low interest rates makes it easier to pay off debts.\n\nThis is what awaits the new administration that will begin governing in a little over a month. The facts about deficit financing should be front and center of the White House and Congress.\n\nIts the Debt servicing costs, stupid — not total debt.\n\nConsider in 2000, when the US federal debt was 34% of GDP, relatively close to its post-war low. By the end of 2020, the debt-to-GDP ratio will have nearly tripled to over 100% of GDP. At the same time, the cost of servicing this larger debt has fallen, relative to the size of the economy, because of the widespread fall in interest rates across advanced economies. As a share of GDP, the cost of servicing US debt has fallen since 2000, even though federal debt has increased.\n\nThe Peterson Institute has observed:\n\n“This situation also creates more space for primary deficits (noninterest spending minus revenue) without resulting in an unlimited explosion of debt. Rather than focus on the size of US debt, policymakers should assess fiscal capacity in terms of real interest payments, ensuring they remain comfortably below 2 percent of GDP. By this measure, there is room for substantial additional fiscal support and needed public investments while maintaining a sustainable public debt.” (adapted from Jason Furman and Lawrence H. Summers’ working paper, “A Reconsideration of Fiscal Policy in the Era of Low Interest Rates)\n\nI will be watching to see if this argument carries with the faux deficit hawks.\n\n \n\n \n\n \n\nPreviously:\nCan We Please Have an Honest Debate About Tax Policy? (October 2, 2017)\n\nDeficit Chicken Hawks vs Ronald Reagan (July 13, 2010)\n\nPolitics & Investing\n\nThe post Cost of Financing US Deficits appeared first on The Big Picture.\n",
      "Folder": "Feedly",
      "Timestamp": "1608350606",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.232124Z"
}