{
  "id": "102d2d6bfb7640d4b1081634a5cb70f3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.slate.com/id/2280264/pagenum/all/#p2",
      "Title": "If conservatives want to deny \"anchor babies\" U.S. citizenship, they'll have to change the Constitution. - By Emily Bazelon - Slate Magazine",
      "Selection": "Anchors Aweigh\nIf conservatives want to deny \"anchor babies\" U.S. citizenship, they'll have to change the Constitution.\nBy Emily Bazelon\nPosted Friday, Jan. 7, 2011, at 6:33 PM ET\n\nJustice William J. Brennan\n\"Anchor babies\" are back in the news: Be prepared for another round of railing against the granting of automatic citizenship to the children of illegal immigrants. There was a burst of this last summer, when Sen. Lindsey Graham rumbled about pregnant Mexican women crossing the border to give birth and win American citizenship for their babies—which he inelegantly called \"drop and leave\"—and how it was necessary to change the Constitution to stop them. Now Rep. Steve King of Iowa promises to end automatic birthright citizenship through legislation, and conservative legislators from five states are talking about excluding kids from a new thing called state citizenship, and also creating distinct (second-class) birth certificates for these kids.\n\nPRINT\nDISCUSS\nE-MAIL\nRSS\nRECOMMEND...\nREPRINTS\nSINGLE PAGE\nLegally speaking, this is all pretty confusing. The 14th Amendment to the Constitution reads, \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" The framers could have denied citizenship to all persons born in the United States whose parents had arrived 10 minutes earlier, but they didn't. Graham, at least, seemed to acknowledge this in his call for a constitutional amendment. But the latest efforts don't do the Constitution that courtesy: They pretend that it says what it does not.\nIt's kind of a mind-bender to square this with the great swelling of conservative love for the Constitution. As Dahlia Lithwick has pointed out, the Tea Party's constitutional fetish really applies only to parts of the Constitution. And the 14th Amendment is not one of its favorites. To avoid the obvious problem here, conservatives have seized on one innocuous-sounding phrase in the amendment to explain why it doesn't actually say what the words plainly mean.\nThat phrase is \"subject to the jurisdiction thereof.\" Why did Congress include these five words, and what kind of limiting effect do they have? Not surprisingly, legal historians have dug into this question. As the ACLU points out, birthright citizenship has been a flashpoint before, as when fear of Chinese immigrants was widespread in the 19th century and when Japanese natives were held in internment camps in World War II.\nThe answer most constitutional historians give is straightforward. According to Akhil Amar, a professor at Yale Law School, Congress was making it clear that citizenship would not be automatically granted to the children of diplomats, based on the longstanding principle that embassies are foreign soil, or to the children of members of an invading army that was occupying American soil. In those cases, it's clear that the United States lacks jurisdiction over the children. And as Amar points out, these are clearly defined, limited exceptions. Congress also had in mind as an exception to automatic birthright citizenship for members of Indian tribes, since the tribes were sovereign.\nThat's the list of exceptions historians have identified, with the first two coming straight out of centuries of British common law. In 1895, a customs official at the port of San Francisco denied entry to Wong Kim Ark, a man born of Chinese parents in the United States in 1873. Returning to the U.S. after a trip, he was stopped from re-entering the country \"solely upon the pretence that he was not a citizen of the United States,\" the Supreme Court wrote in its ruling in the case. The theory behind denying his citizenship was that his parents were \"subjects of the Emperor of China.\" The Supreme Court said this was wrong, based on a lengthy survey of British common law—lots about diplomats and invaders.\nThe court didn't discuss whether Ark's parents were legal or illegal immigrants—at the time, the distinction wasn't as clear as it seems now. But implicit in the ruling is the assumption that a child born in the United States, unless he's the kid of an ambassador or a marauding soldier, is a citizen. Full stop. In the 1981 case Plyler v. Doe, in which the Supreme Court held that Texas could not deny the children of illegal immigrants admittance to public school, Justice William Brenann went back to Wong Kim Ark's case in his opinion for the majority. Brennan pointed out that \"jurisdiction\" is a geographic term as used in the 14th Amendment: It's about where children are born. And so the court said there is no \"plausible distinction\" between the children of legal and illegal immigrants for the purpose of birthright citizenship.\nBut that has not stopped wishful thinkers from interpreting all kinds of babies out of their citizenship. Here's one long effort from 2005—see, this is old hat—to enlist the framers of the 14th Amendment in this cause. It includes a quote from a senator from Michigan who said during the debate over the amendment that birthright citizenship \"will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers accredited to the Government of the United States, but will include every other class of persons.\"\nDo \"foreigners\" and \"aliens\" mean the children, or the illegal immigrant parents? The first reading is the one immigration opponents adopt, but it's the second one that's consistent with the British common law history, the Supreme Court interpretation, and the Civil Rights Act of 1866 (in addition, of course, to the plain meaning of the 14th Amendment itself. Here's the full scholarly rundown from Mark Shawhan.\nThe framers of the 14th Amendment could have done this differently. They could have required mutual consent for citizenship—from the United States and the aspiring citizen—or a longer period of residency in the United States for the illegal immigrant parents. Countries in the European Union, including Britain, now take such an approach. You can imagine the advantages, as Yale law professor Peter Schuck does. It wouldn't allow pregnant women to jump the immigration queue for their kids. Maybe it could calm the roiling anti-immigration waters.\nBut Schuck is out of sync with most historians, as well as the plain text, when he says that the 14th Amendment allows for what he calls an \"effective, pragmatic solution\"—cutting off anchor babies from automatic citizenship. On this point the Constitution is clear. Graham is right about one thing: If we're going to change our longstanding practice of granting citizenship to children born on American soil, we can't do it by simply passing a state or federal law. We'd have to amend part of our supposedly sacred foundational document.",
      "Folder": "Archive",
      "Timestamp": "1295239701",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:24.179675Z"
}