{
  "id": "10e25ee70447484688bb5d4373f06cba",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/40471/Cars-With-Automatic-Retractable-Hardtops-Then-and-Now",
      "Title": "Cars With Automatic Retractable Hardtops, Then and Now Core77",
      "Selection": "In 1957 Ford released something rather crazy for the time: The Fairlane 500 Skyliner, a convertible with an automatic retractable hardtop. In an era when your only options were a retractable fabric roof or a manually-removeable hardtop unibody that you needed to stow in the garage, this was completely mind-blowing. Take a look at the operation:\n\nFord was not the first to pull this off, as inventors in America and Europe had been tinkering with the concept since the 1920s, and in the '40s rival Chrysler produced a concept car that could perform this mechanical trick. But Ford was the first American car company to get a retractable hardtop into mass production and they marketed the heck out of it, hiring the celebrity big guns of Lucille Ball and Ricky Ricardo to appear in commercials for it. (It being the '50s, it was unsurprisingly marketed with the \"So simple even a woman can use it!\" approach.)\n\nDespite the marketing push and Ford's impressive mechanical prowess--the roof system used no transistors, instead relying on seven small motors, limit switches, power relays and reportedly more than 600 feet of electrical wire—they sold less than 50,000 of them, with 1959 being the retractable hardtop's last model year.\n\nFrom the 1960s through the 1990s, the retractable hardtop was largely a forgotten oddity. But in the 2000s manufacturers began bringing them back. Mazda's offering for their upgraded 2006 roadster, the venerable Miata, featured a polycarbonate roof that folded up a damn sight faster than the Skyliner's, in roughly 12 seconds versus 50:\n\nThe mechanism on Volvo's 2007 C70 T5 convertible is a bit more complicated, though no less cool:\n\nMercedes's retractable hardtop mechanism, which they'd had since the '90s, was similar but had less sections due to it being a two-seater:\n\nEven sports car manufacturer Ferrari got in on the retractable hardtop game with their 458 Spider (though purists might argue this was a retractable targa top):\n\nI think my favorite in terms of slickness is the one on BMW's 3-series, 4-series, 6-series and M-class cars:\n\nA BMW M4 convertible will set you back at least $74,000. Meanwhile Hemmings has got a pair of '57 and '59 Skyliners for sub-40 grand. Decisions, decisions….\n",
      "Folder": "Feedly",
      "Timestamp": "1441331592",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.838102Z"
}