{
  "id": "1150def7f94e46a89b5de057605dd18a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/first-person/2017/3/6/14766970/abacus-math-learning-lessons",
      "Title": "I learned how to do math with the ancient abacus — and it changed my life Vox - All",
      "Selection": "A few years ago, I stood in a small basement classroom just outside of New York City, watching a high schooler named Serena Stevenson answer math questions in rapid succession.\n\nAn instructor read out numbers —\n\n74,470\n\n70,809\n\n98,402\n\n— and Stevenson added them in her head. For each question, she closed her eyes, and then the fingers of her right hand began to twitch, a progression of plucks and jerks. The movements were fast and exact.\n\nFor almost an hour, she used the abacus-based approach to solve math problems. Sometimes she would get problems wrong and smile and shrug. But she also answered many of the problems correctly, including the addition of multiple five-digit numbers in her head.\n\nThe key to her success was an ancient technology called the abacus. As I discovered while reporting on a book on the science of learning, the typical abacus has small discs that move up and down on thin posts. The small discs have different values, and the four beads on the bottom have a value of 1. The discs at the top have a value of 5. To calculate a problem, you move the discs up and down until you get to a solution.\n\nFor much of that evening, Stevenson used a practice called \"mental abacus,\" envisioning the abacus in her mind and then using her fingers to work through the problem. \n\nFrom watching Stevenson, I knew that gaining skills on the abacus was more than a matter of counting beads, and so I decided to enroll myself and my two daughters in an abacus course to see if we could also hone our math skills. Along the way, I learned surprising insights into how people gain new skills.\n\nThe abacus: an ancient technology with modern relevance\n\nAs a technology, the abacus predates the making of glass and the invention of the alphabet. The Romans had some sort of counting device with beads. So did the early Greeks. The word \"calculate\" comes from the expression “drawing pebbles,” basically using some sort of abacus-like device to do math.\n\nResearchers from Harvard to China have studied the device, showing that abacus students often learn more than students who use more modern approaches. \n\nUC San Diego psychologist David Barner led one of the studies, and he argues that abacus training can significantly boost math skills with effects potentially lasting for decades. \n\n“Based on everything we know about early math education and its long-term effects, I’ll make the prediction that children who thrive with abacus will have higher math scores later in life, perhaps even on the SAT,\" Barner told me. \n\nThese sorts of conclusions have inspired groups of abacus devotees, and schools devoted to the practice have been popping up everywhere Los Angeles to New Jersey. My sister, Katharina, counts herself among the converts. A technology teacher in Maryland, she started using the tool to teach her students math a few years ago. Now she gives abacus workshops and has half a dozen different abacus apps to help her students hone their skills on the tool. \n\nTo learn something new, your brain needs to be fully engaged\n\nWhen first I watched high school abacus whiz Serena Stevenson, her hand gestures seemed like a pretentious affect, like people who wear polka-dot bow ties. But it turned out that her finger movements weren't really all that dramatic, and on YouTube, I watched students with even more theatrical gesticulations. What's more, the hand movements turned out to be at the heart of the practice, and without any arm or finger motions, accuracy can drop by more than half. \n\nPart of the explanation for the power of the gestures goes to the mind-body connection. But just as important is the fact that abacus makes learning a matter of doing. It’s an active, engaging process. As one student told me, abacus is like “intellectual powerlifting.” \n\nPsychologist Rich Mayer has written a lot about this idea, and in study after study he has shown that people gain expertise by actively producing what they know. As he told me: “Learning is a generative activity.”\n\nThe power of mentally doing is clear in memory tasks. Want to remember the French word for home, “maison,” for instance? People are far more likely to recall the word “maison” if a letter is missing from the word — e.g., “mais_n.\" When people add the “o,” they’re more engaged and thus learn more.\n\nThis idea also extends to more difficult cognitive tasks. Take something like reading. If we push ourselves to dream up a mental image of what we’re reading, we retain a lot more knowledge. By creating a type of “mind movie,” we're building more cognitive connections — and making the learning more durable. \n\nShort-term memory is crucial to learning but is easily overwhelmed\n\nAfter seeing abacus students like Stevenson in action, I did more research and soon discovered another reason for the abacus’s success. As an approach to learning math, abacus reduces demands on short-term memory. When people use the beads on an abacus, they’re using the device to keep track of digits, which allows them to execute more complex calculations. \n\nThis is important because short-term memory is important. Researchers now believe that everything that we learn needs to first be processed in short-term memory before the material becomes stored in long-term memory and thus learned. \n\nThe problem is that short-term memory is pretty short, and we are only able to juggle around half a dozen items at a time. This explains why we can't multitask while learning. Music, driving, Twitter — they all drag on short-term memory, and thus keep us from understanding. \n\nThe abacus appears to have evolved over the centuries to put less demand on short-term memory, and the five beads on each post lines up pretty well with the number of items that people can retain in working memory. “You might say that the abacus makes best use of what we’ve got in terms of cognitive capacity,” UCSD’s Barner told me. “It fits the limits of human cognition.” \n\nYOSHIKAZU TSUNO/AFP/GettyImages\nChildren from a US school in Japan compete during a Tokyo abacus contest in 2012.\nIn this regard, the abacus provides some important take-homes when it comes to learning. We often overestimate how much information we can store in short-term memory. More precisely, people often try to learn too much at a time, taking an all-you-can-eat-style approach to gaining expertise. People will think, for instance, that they can learn from a lecture while chatting with a friend. (They can't.) Or people will try to understand a big, complicated idea in a single sitting. (They can't.)\n\nEvents often suffer from much the same problem. Long talks, lengthy meetings, and prolonged lectures can all erode short-term memory, crowding the limited pathway to long-term memory. For this reason, experts such as Ruth Colvin Clark argue that classes should never go longer than 90 minutes. We simply don’t have the mental stamina to continue learning for much longer. \n\nWhen I interviewed psychologist John Sweller, who studies the role of short-term memory in learning, he gave the example of foreign language programs that try to instruct people in history or literature. By combining the two topics, people learn a lot less, he argues. \n\n“You’re going to learn neither,” Sweller told me. “It’s cognitive overload.”\n\nTo learn something well, people need to know the underlying system within that area of expertise\n\nShortly after enrolling my daughters and myself in an abacus class, we discovered that the practice relies on a math strategy known as decomposition, which makes computation easier by breaking numbers down into their component parts. So students are encouraged to think about how certain numbers have \"complements\" or \"partners.\" For instance, 10 is made by partnering 7 plus 3 or by partnering 6 plus 4. \n\nFor an actual math problem, consider 5 plus 8. On the abacus, you would not add those actual figures. Instead, you would \"decompose\" the numbers and add 10 to the 5 and take away 2 — or the partner of 8 — in order to get to the answer: 13. \n\nIt can take a little longer to learn math in this way. Certainly it took me a little while to fully grasp this approach. But decomposition gives people a better underlying sense of how the math actually works. (Interestingly, my kids didn’t find the approach all that novel, since a decomposition approach is embedded in the new Common Core math standards.)\n\nTom Sato, Stevenson’s instructor, has taught abacus for more than a decade, and he argues that the abacus's more systemic approach is one of the key benefits of the practice. “I see a lot of kids who struggle with math because they know that 1 and 1 is 2. But when they see 2 plus 2, they don’t know what to do,” Sato told me. “The way we teach it, we try to make a framework for students to work in, and the ones who are successful are the ones who understand the system.” \n\nThis idea extends well past math, and today a growing number of experts believe that understanding systems knowledge is key to richer forms of learning. Cognitive scientist Lindsey Richland, for instance, argues that to build concepts, to solve problems, to engage in any sort of critical thought, people need to grapple with patterns within an area of expertise. “The underpinnings of the ability to do higher-order thinking really comes down to reasoning about relationships,” she says.\n\nAs an example, take learning about the ocean. To develop reasoning, to create a systems understanding, Richland argues that people shouldn't dwell overly on standalone facts. Rather, they should examine questions like: What happens to the ocean if the level of salt goes up? What’s the difference between oceans and lakes? How do reefs impact ocean currents?\n\nWe can do this ourselves. If you're learning something new, ask yourself hypothetical questions. By asking \"what if\" questions, people gain more of a systems understanding. So if people want to know more interior design, they might ask themselves: How would I design a bathroom if my client were wealthy and loved gold? How would I design a bathroom if my client were young and disabled? How would I design a bathroom with a nautical motif? \n\nTake any bit of literature as another example. People can gain a lot by discussing the implications of counterfactuals. Want to better understand Romeo and Juliet? Then consider what would have happened if the young lovers had not died. Would the Capulets and Montagues have continued their feud? Would the lovers have lived happily ever after?\n\nIn this sense, the ancient abacus is nothing new. As Sato told me, “The big question is: Do you just memorize certain things?” he said. “Or do you try and see how it all fits together?” \n\nLearning runs on confidence\n\nSome aspects of the abacus classes were not surprising, like the fact that my kids hated them. For my children, Sunday mornings were about watching cartoons, not doing math. “Boring, boring, boring,” my daughter once told me. \n\nWhat I didn’t expect was the boost in mathematical self-esteem. I’m one of the many who harbor some math doubts, and whether it is trigonometry or number theory, I’ll feel a touch of fear. My typical solution is avoidance, and if I have to calculate something like percentage change, I’ll go online. One of my phone apps is a tip calculator. \n\nLike every anxiety, there’s a lot of irrationality, and in a way, that’s why I found abacus so helpful. It gave me a dedicated way to succeed, and after a few classes — and a good amount of practice — math seemed a little less frightening. I hadn’t become Euclid. But the practice knocked my numerical trepidations down a notch. \n\nThis is a time-demonstrated power of the abacus. Self-assurance grows easily on the device, and abacus students are almost 30 percentage points less likely to be nervous about an upcoming math test, according to one study. Part of the reason, it seems, is that practice and outcomes appear to move in near lockstep, with dedication correlating highly with performance.\n\nWhat's more, abacus training underscores the importance of fluency, and most abacus courses demand students do calculations at lightning speed. And while this aspect of the practice can make math seem a little mindless, there’s a good amount of evidence behind the idea of overlearning. \n\nMy kids were glad once the classes were over, and it was clear that they, too, had gained some math confidence. My youngest daughter would increasingly beam after getting a math problem correct, while my older child brought her abacus into school to show to her teacher. Later, one of my kids even started wearing an abacus necklace. These were small successes. Just a moment of self-triumph. But that's how people ultimately develop confidence. \n\nUlrich Boser is a senior fellow at the Center for American Progress. This article was adapted from his new book, Learn Better. \n\nAdapted from Learn Better by Ulrich Boser. By permission of Rodale Books.\n\nFirst Person is Vox's home for compelling, provocative narrative essays. Do you have a story to share? Read our submission guidelines, and pitch us at firstperson@vox.com.",
      "Folder": "Feedly",
      "Timestamp": "1488853942",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.705674Z"
}