{
  "id": "11a8b1d00c52457aba3ee37c41148356",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/news/american-airlines-miles-partner-flights/",
      "Title": "I Almost NEVER Use American Airlines Miles the Way They’re “Intended” – Here’s What I Do Instead Million Mile Secrets",
      "Selection": "Earning American Airlines miles is a big part of my miles and points strategy.  While I have a few paid flights a year, most of the American Airlines miles I’ve earned have come from credit card welcome bonuses and spending – for example:\n\nCitiBusiness® / AAdvantage® Platinum Select® World Mastercard® – (I have this in my wallet now, it’s got the highest current bonus of any American Airlines card)\n\nCiti® / AAdvantage® Platinum Select® World Elite Mastercard® – (A solid choice for perks like a free first checked bag on domestic flights and preferred boarding)\n\nCiti® / AAdvantage® Executive World Elite Mastercard® – (Great for frequent American Airlines flyers because it comes with Admirals Club airport lounge access)\n\nThanks to these cards and others, I’ve accumulated hundreds of thousands of American Airlines miles over the years.  But would you believe I almost never redeem them for American Airlines award flights?\n\nWait, That’s NOT American Airlines! But This Incredible Lie-Flat Business Class Seat My Son Enjoyed Came Courtesy of American Airlines Miles\n\nThat’s not to say I never book American Airlines award flights – I do, but I don’t use American Airlines miles (more on that later).  For me, when it comes to redeeming American Airlines miles, partner award flights are the way to go.\n\nAvoid Frustration and Get Huge Value:  Redeem American Airlines Miles for Partner Airline Flights Instead\n\nRead our Ultimate Guide to American Airlines Miles \n\nRead about All the Ways to Earn American Airlines Miles\n\nAmerican Airlines can be pretty stingy about offering low-level award seats, particularly in Business Class.  If your travel dates aren’t flexible or you’re traveling at peak times to popular destinations, you might find your options limited for American Airlines award flights.\n\nI’ve had much better luck using American Airlines miles for award flights on partner airlines.  Because they’re part of the oneworld alliance, you can redeem American Airlines miles for flights on airlines like Cathay Pacific, Japan Airlines, LATAM, and Iberia.  Or book non-alliance partner flights like Etihad, Alaska Airlines, or Air Tahiti Nui.\n\nWe Crossed the Pacific in Japan Airlines’ Amazing Business Class by Redeeming American Airlines Miles – and Saved Thousands of Dollars\n\nIt might seem strange to collect American Airlines miles if you don’t plan to use them for American Airlines flights.  It actually makes a lot of sense, because you’ve got a ton of options with partner airlines where award seats are sometimes easier to find.  You can often get outsized value when you redeem miles this way – especially on international Business and First Class flights.\n\nFor example, in the past few years, I’ve redeemed American Airlines miles for:\n\n4 round-trip Business Class tickets between Manila and New York (via Tokyo) on Japan Airlines and Cathay Pacific – I saved over $18,000 by redeeming American Airlines miles and we even got to spend ~23 hours in Tokyo\n\n2 one-way Business Class tickets between Toronto and Berlin (via Helsinki) on Finnair and Air Berlin (no longer in existence) – We even squeezed in an overnight layover in Helsinki – such a charming city!\n\n2 one-way Business Class tickets between Honolulu and the US mainland on Hawaiian Airlines – Unfortunately, it’s no longer possible to book Hawaiian Airlines awards between the continental US and Hawaii with American Airlines miles, but you can still redeem for inter-island flights\n\nA round-trip coach ticket between New York and Berlin on Air Berlin (again, RIP) – This was extra cheap because it was during the off-peak season\n\nThe Smoked Salmon Appetizer in Finnair Business Class Was Very Civilized!\n\nAll told, I’ve probably saved close to $40,000 just by redeeming American Airlines miles on partner flights.  That’s why I’ll continue to earn (and redeem) American Airlines miles.\n\nWait, What About American Airlines Flights?\n\nI mentioned I’ve booked award flights on American Airlines with other airline miles.  For short-haul flights within North America, I prefer using British Airways Avios points (also a oneworld partner) because of their distance-based award chart.  Flights 1,151 miles or less on these routes cost just 7,500 British Airways Avios points one-way in coach.\n\nWhile American Airlines has the same pricing on very short flights, it’s only valid on routes that are 500 miles or less in distance, which really limits your choices.  Plus, British Airways doesn’t add close-in booking fees like American Airlines does, so redeeming Avios points is ideal for last-minute getaways or emergency travel.\n\nUsing 7,500 British Airways Avios Points Instead of 12,500 American Airlines Miles on Shorter Flights Is a Better Deal\n\nThe great thing about British Airways Avios points is they’re super easy to earn, because British Airways is a Chase Ultimate Rewards, AMEX Membership Rewards, and Marriott transfer partner.  So if I ever need more points, I just move them over from my Chase Sapphire Preferred Card or Ink Business Preferred Credit Card.\n\nThen I can save my American Airlines miles for more partner trips.  I’m currently stocking up for (hopefully) another epic trip to Asia in a year or two.\n\nBottom Line\n\nIt might sound odd, but I very rarely redeem American Airlines miles for flights on on American Airlines.  Instead, I use them to book partner award flights on airlines like Cathay Pacific, Japan Airlines, and Finnair for incredible value.  And it’s often easier to find seats on partner airlines because American Airlines award flights can be hard to find if you’re not flexible with your travel dates.\n\nAll told, I’ve probably saved ~$40,000 on amazing flights to Europe, Hawaii, and Asia by booking this way.  And when I need a short American Airlines flight within the continental US, I use British Airways Avios points instead.  They’re easier to earn (I just transfer points from my Chase Sapphire Preferred and Ink Business Preferred) and many short-haul flights are cheaper compared to booking with American Airlines miles.\n\nYou can earn American Airlines miles quickly with cards like:\n\nCitiBusiness® / AAdvantage® Platinum Select® World Mastercard®\n\nCiti® / AAdvantage® Platinum Select® World Elite Mastercard®\n\nCiti® / AAdvantage® Executive World Elite Mastercard®\n\nI’d love to hear your strategy for redeeming American Airlines miles.  Do you get more value on partner flights, or have you had luck using them for American Airlines flights?\n",
      "Folder": "Feedly",
      "Timestamp": "1548523977",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.405408Z"
}