{
  "id": "11fb9f289bae426889924f893f9ab08c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/science-and-health/2018/4/23/17247932/love-sex-science-marriage-psychology-brain",
      "Title": "This is what love does to your brain Vox - All",
      "Selection": "“It’s really an addiction.”\n \nWhat happens to your brain on love? Is there such a thing as “casual sex”? What do we get wrong about male and female sexuality?\n\nThese are a few of the questions I put to Helen Fisher in a recent interview. \n\nFisher is a biological anthropologist, the chief scientific adviser to the dating site Match.com, and the author of several books including Why We Love: The Nature and Chemistry of Romantic Love. \n\nShe’s written six books about human sexuality, gender differences in the brain, and how cultural trends shape our views of sex, love, and attachment. Fisher, in other words, has spent a lot of time thinking about the role of sex and love in human life. \n\nSo I reached out to her to find out what she has learned and how it undercuts a lot of our conventional ideas about sexuality and gender. \n\nI also wanted to know what distinguishes love from attachment, and why she thinks there are three simple things you can to do maintain a happy relationship. \n\nA lightly edited transcript of our conversation follows. \n\nSean Illing\n\nWhat happens to our brains on love?\n\nHelen Fisher\n\nIt’s a fascinating question. My colleagues and I put over 100 people who had recently fallen in love into the brain scanner to understand what’s going on in their brains. \n\nWe found that in almost all cases there was activity in a tiny little part of the brain called the ventral tegmental area (or VTA). It turns out that this brain system makes dopamine, which is a natural stimulant, and then sends that stimulant to many other brain regions. \n\nThat’s what gives you the focus, the energy, the craving, and the motivation to win life’s greatest prize: a mating partner.\n\nSean Illing\n\nAnd the experience of love, at the level of the brain, is different from the experience of sex or from feelings of attachment?\n\nHelen Fisher\n\nThe sex drive is largely orchestrated by testosterone in both men and women, but romantic love is orchestrated by the dopamine system. I see romantic love as a basic drive that evolved millions of years ago to focus your mating energy on just one individual and start the mating process. \n\nThe sex drive motivates you to look for a whole range of partners, but romantic love is about focusing your mating energy on one person at a time. \n\n“You can think of love as an intense obsession, but it’s really an addiction.”\n\nSean Illing\n\nSo being in love is like being hooked up to a perpetual dopamine drip, and you get a little hit every time you see the person or touch them or think about them?\n\nHelen Fisher\n\nDopamine drip — I love that phrase! I haven’t heard that before; it’s a great way to put it. But the dopamine hits occur even when you’re not with the person. \n\nYou can think of love as an intense obsession, but it’s really an addiction. You think about them all the time; you become sexually possessive; you get butterflies in the stomach; you can read their emails and texts over and over again.\n\nBut I say it’s an addiction because we found that, in addition to the dopamine system being activated in the brains of people in love, we also found activity in another part of the brain called the nucleus accumbens. \n\nThis part of the brain is activated in all forms of behavioral addiction — whether it’s drugs or gambling or food or kleptomania. So this part of the brain fires up in people who have recently fallen in love, and it really does function like an addiction. \n\nWhich is why romantic love is a far more powerful brain system than the sex drive. \n\nSean Illing\n\nI’ve heard you say that “casual sex” isn’t as casual as we think. Why not?\n\nHelen Fisher\n\nIt’s not casual because when you have sex with somebody, and it’s pleasurable, it drives up the dopamine system in the brain. That can push you over the threshold into falling in love. \n\nAnd when you orgasm, there’s a flood of oxytocin and vasopressin. Those neurochemicals are linked with the attachment system in the brain. \n\nSo there are all these potential chemical triggers that can get activated when you have sex with someone, whether it’s “casual” or not. Something like one-third of people who’ve had a “friends with benefits” relationship have fallen madly in love with that person. \n\nSo casual sex is not casual: It can trigger these brain systems for romantic love and feelings of attachment. \n\nSean Illing\n\nIn other words, don’t have sex with someone unless you’re prepared to fall in love with them.\n\nHelen Fisher\n\nExactly. If you’re on vacation and there are natural barriers and you’re unlikely to see them again, then that’s probably safe. But otherwise you’re risking falling in love, and that might complicate your life in ways you’re not prepared for. \n\nSean Illing \n\nWhat do we, as a culture, get wrong about male and female sexuality?\n\nHelen Fisher\n\nA lot. We think men want to have sex with everything that walks, but that’s not true. They’re much more picky than people think. \n\nI think we also got it wrong that women are not interested in sex. Among people under the age of 40, women are apparently just as adulterous as men. Women in college have more sex than men in college do, largely because women have the pick of the place when they’re in college, and men don’t. \n\nBut the idea that men need or desire sex more than women is a fantasy. \n\nI’ve been telling women’s magazines for 30 years that men fall in love faster than women do because they’re so visual, and they fall in love more often. Men like public displays of affection more regularly, which sounds romantic but isn’t. \n\nThis is probably a form of mate guarding, a way of informing everybody that “she’s with me.” Men want to introduce women they fall in love with to friends and family sooner. Men also want to move in with a woman that they’re in love with sooner. \n\nMen have more intimate conversations with their girlfriends and wives than women do with their husbands and boyfriends because women have their intimate conversations with their girlfriends, not necessarily with their man. \n\nMen are also 2.5 times more likely to kill themselves when a relationship is over. That is something that the press and the public really have wrong.\n\nSean Illing \n\nWait, men are 2.5 times more likely to kill themselves when a relationship fails? Do you have an explanation for that?\n\nHelen Fisher\n\nIt’s a really good question. All I have is a hypothesis. I don’t think anyone has come up with a good Darwinian explanation. Women appeal to their networks. I mean, they will threaten suicide, but often they don’t follow through or they do try to kill themselves and fail. But men do the job.\n\nI think some of this has to do with how differently men and women express their emotions. Women’s emotions are always dribbling out. We tend to be more emotionally expressive. \n\nMen hide their emotions, probably because for millions of years it was not adaptive for men to express their frailty or their fear. Their job was to protect the group. Their job was to protect the wife and family. Their job was to go out and kill very dangerous wild animals and bring home dinner. \n\nUnder those circumstances, it’s really not adaptive to be expressing your fear, your anger, your surprise, your vulnerability. \n\nSo men are better at containing their emotions, but they are also more predisposed to what we call emotional flooding. Unlike women, they hold their anger in, but eventually that anger builds up and explodes. \n\nI suspect this is related to suicide in some way, but it’s just a hypothesis. \n\nSean Illing\n\nLove is love and I assume your data holds whether we’re talking about gay or straight couples, or gay or straight men and women, but I want to ask just in case you’ve noticed any differences.\n\nHelen Fisher\n\nI have data on several hundred gay men and they fall in love just as often as straight men. (As I mentioned, romantic love is a brain system like anger and fear, everyone has this brain system—regardless of to whom their romantic feelings are directed). But I have no data on whether gay men are just as likely to kill themselves when a relationship ends. Actually, I’ve never seen these data either. But it might exist.\n\nSean Illing\n\nI’m sure you get pushback from people who worry about reducing something as rich and complex as love to brain systems. What’s your general response to this concern?\n\nHelen Fisher\n\nThis basic brain physiology is only part of the experience. You asked me about the brain circuitry associated with romantic love, so that’s what I told you about. This isn’t reductionistic; I was just trying to explain part of a vast complex system. I’ve spent my entire intellectual life chipping away at a vast array of phenomena associated with romantic love. And surely basic brain circuitry is part of this. \n\nBut this work of mine only explains how the brain generates the ecstatic, possessive, obsessive feelings of romantic love. It doesn’t explain who you love, how you express your love, where you love, or when you love.\n\nBut for those who feel this is reductionistic: I often say “You can know every single ingredient in a piece of chocolate cake and still sit down and eat the cake and feel that joy. The same with love. There will always be magic to love.” \n\nThose who study the fear system aren’t called “reductionistic.” But when it comes to love, people seem to think this comes from the supernatural. It doesn’t. It’s one of the most powerful brain systems humanity has evolved. \n\nPeople pine for love, live for love, kill for love and die for love. Everywhere in the world, people have love songs and love poems, and most places also have novels, TV series, ballets, operas, symphonies, myths, legends, and even holidays for love. Everywhere people also stalk, murder and/or kill themselves over love. \n\nI will go to my grave believing that it’s worthwhile to understand the brain circuitry involved in this unquenchable, adaptable and primordial human trait: romantic love.\n\nSean Illing\n\nYou’ve done a lot of research for Match.com. What makes for a happy marriage or relationship?\n\nHelen Fisher\n\nYou talk to a psychologist, and they’ll probably give you a different answer, but I can tell you what the brain says about happiness in a longterm partnership. There are three brain regions that become active when you are in a longterm, loving relationship. \n\nA brain region linked with empathy, a brain region linked with controlling your own stress and your own emotions, and a brain region linked with what I call “positive illusion,” the ability to overlook what you don’t like about somebody and focus on what you do. \n\nYou want a happy marriage? Do all those things that psychologists and others might suggest, but this is what the brain says: Express empathy, control your own emotions, and overlook the negatives in your partner and focus on the positives.",
      "Folder": "Feedly",
      "Timestamp": "1524523561",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.476502Z"
}