{
  "id": "12b47096d0104117833fa64ccd4d3434",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theatlantic.com/business/archive/2016/10/79-cents/504386/",
      "Title": "About Those 79 Cents The Atlantic - Business",
      "Selection": "Extensive research shows that even when controlling for factors like education, skill, and experience, women routinely earn less than men employed in the same professions. Often, this argument is accompanied by the now-famous statistic that women earn about 79 cents for every dollar men make at work. This is an important data point, but focusing on that figure alone masks the role race can play in perpetuating these disparities.\n\nFor instance, it is important to ask: Which women? The 79-cents statistic is an average that includes all women, but it obscures the even wider gaps faced by women of color. For black women, the number is closer to 65 cents, while for Latinas it is even lower, at 54 cents. This data draws attention to the fact that while women as a group aren’t paid as much as men, women of color see even more pronounced earnings gaps.\n\nWhat is at the root of these disparities? In the late 1980s, the legal scholar Kimberlé Williams Crenshaw argued that when it came to anti-discrimination law, looking at categories like race or gender in isolation obscured the ways gender and race intersected to create a specific, unique disadvantage for black women. This omission rendered them an overlooked, unprotected group whose particular experiences with discrimination had little legal recourse. Crenshaw introduced the theory of intersectionality, the idea that when it comes to thinking about how inequalities persist, categories like gender, race, and class are best understood as overlapping and mutually constitutive rather than isolated and distinct.\n\nThis is particularly evident when it comes to the gender-wage gap. There are a couple commonly-offered explanations for why women of color make less than men: Some say it’s the unfortunate result of the fact that women of color tend to go into different, lower-paying careers, or the fact that many of them temporarily pause their careers to care for their children. However, studies looking at specific occupations show that even when controlling for professional experience, area of specialty, and educational background, disparities still persist.\n\nIn fact, sociologists have shown how racial and gender discrimination play important roles in creating and reinforcing this particular wage gap. Using data from the Ohio Civil Rights Commission, the sociologist Vincent Roscigno points out that office rules are applied more harshly to women of color than to others, and that some predominantly white workplaces have racially inhospitable environments that serve to push women of color out. This effect is even more pronounced in majority-male occupations. The sociologists Ella L. J. Bell Smith and Stella Nkomo also document how black women working in male-dominated executive ranks encounter both racial and gender stereotypes as well as disparities in mentorship that limit their career trajectories.\n\nAdditionally, as the sociologist Jake Rosenfeld has shown, the decline in unionization has worsened the racial wage gap, particularly for black women working in the private sector. Rosenfeld’s work indicated that black women were joining the workforce in large numbers—at last gaining access to the benefits of unions—right around the time that organized labor began to decline in influence, scope, and power. This left collective bargaining largely unavailable to them, worsening wage gaps that still exist today.\n\nThe point is that the gender-wage gap is not just a story of women making less money than men; it is indicative of how race also shapes earnings disparities, such that women of color often find themselves financially in even worse shape than their white female colleagues.\n\nImportantly, these racial disparities exist on both sides of the gender-pay gap. While researchers and policymakers are more likely today to draw attention to how women of color are differentially affected by these gaps in pay, men of color, as the intersectional approach would suggest, are facing earnings gaps unique to them. When it comes to hourly wages, white men earn an average of $21 an hour, compared to $15 an hour for black men and $14 an hour for Latino men. (White and Asian women actually earn more per hour, on average—$17 an hour and $18 an hour, respectively—than black and Latino men.) Further, a recent report from the Economic Policy Institute, a left-leaning think tank, showed that in 2015, after controlling for education, region, and work experience, black men earned 22 percent less than white men working in the same occupations, a disparity that has worsened in the aftermath of the Great Recession.\n\nOther sociological research can provide some insights into the processes that enable and perpetuate these particular gaps. New York University’s Deirdre Royster has shown that social networks help white men more than black men when it comes to looking for skilled jobs. And the sociologists Kathryn Neckerman and Joleen Kirschenman have reported that in lower-wage markets, employers are particularly loath to hire black men, often based on stereotypes about their work ethic. Further, my own work on black male professionals—specifically, lawyers—shows that they often are steered to organizational tasks that give firms the appearance of greater diversity but obscure their ability to contribute in other, more valued ways. Thus, it’s important to think about how race operates in conjunction with gender when considering pay disparities not just for women, but for men as well.\n\nRecent data from California are particularly illustrative of this. In the state’s 37th congressional district, which is in Los Angeles county, data from 2015 seemed to show an encouraging erasure of the gender-pay gap, with women’s average earnings above men’s. But it turns out that it was not so much that the pay gap had closed as it was that the 37th district has a very high proportion of black and Latino men relative to the rest of the country; when women’s—particularly black and brown women’s—wages were being compared to those of a group of mostly non-white men, the gender-pay gap effectively disappeared—an effect that can be explained by the fact that the wage gap between men and women of color is smaller than the one between women of color and white men. A disappearance of the pay gap, in this context, likely means that the same processes that put workers of color at a disadvantage—closed social networks, stereotyping, and persistent discrimination, in particular—remain present. It is less of an egalitarian success story if gender-pay equity emerges as a result of lower average wages for men of color.\n\nSo, while the gender-pay gap certainly exists, it is a little more complicated than the basic assertion that men make more than women; an intersectional approach reveals that some groups of men—namely, men of color—actually earn less on average than white women. Therefore, any efforts to close the gender-pay gap should address not just the processes that perpetuate gender discrimination—the motherhood penalty, gender stereotypes, and a lack of policies to support working parents, to name a few—but also the mechanisms that reproduce racial inequalities. Pay gaps will still remain, but they should be driven only by differences in skill, education, and experience—not by race or gender.\n",
      "Folder": "Feedly",
      "Timestamp": "1476763138",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.704805Z"
}