{
  "id": "12f4d148cbd5482596578cae513e300e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2017/9/7/16265888/jaguar-e-type-zero-electric-car-announced",
      "Title": "Jaguar’s E-type Zero is the most beautiful electric car yet The Verge",
      "Selection": "Jaguar, having freshly committed to electrifying all of its cars from 2020 onwards, has today also unveiled a new all-electric automobile, which is based on its sleek E-type from the 1960s. The new E-type Zero keeps the classic styling, which was once lauded as “the most beautiful car in the world” by Enzo Ferrari, while introducing a bespoke electric powertrain that produces up to 220kW of power. It will take you from 0 to 100kmh in 5.5 seconds, which isn’t quite Tesla territory in terms of acceleration, but let’s be honest, no Tesla has ever looked quite this dashingly gorgeous.\n\nMore than a concept, but not much more\n\nThe E-type Zero roadster is said to have a real-world range of 270km (just under 170 miles) thanks to a 40kWh battery that can be fully recharged in six to seven hours. As it stands, this is simply a retrofit of an electric car into the shell of an old school classic, and Jaguar isn’t being terribly explicit about either pricing or availability. It seems to be more than a concept, but not much more than that. Tim Hannig, chief of Jaguar Land Rover Classic, says that the company’s “aim with the E-type Zero is to future-proof classic car ownership. We’re looking forward to the reaction of our clients as we investigate bringing this concept to market.”\n\nThe basic premise of bringing classic car designs up to date with electrification and other modern niceties like LED headlights, as with this E-type Zero, seems like an ingenious way of appealing to a younger clientele — which has both an appreciation for the past and an eagerness to embrace the future. Jaguar is showing off the E-Type Zero at the Jaguar Land Rover Tech Fest event in London, which is open to the public between September 8th and 10th.\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n\n Jaguar E-type Zero Photo: Jaguar Land Rover\n",
      "Folder": "Feedly",
      "Timestamp": "1504803130",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.636067Z"
}