{
  "id": "13038167d2ab46f5a828a0ee891adc4e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.smartpassiveincome.com/the-sad-truth-about-your-half-finished-projects/",
      "Title": "The Sad Truth about Your Half-Finished Projects The Smart Passive Income Blog",
      "Selection": "Here is a common experience:\n\nYou get incredibly excited about a new business idea or project. Maybe you’ve had it in the back of your head for a long time and something finally clicked inside of you to start working on it. Or, maybe it’s something you just thought of and you want to get it up and running as soon as possible.\n\nAt work, in the car, and even in your sleep, thoughts about your new idea race through your brain. You’re not only taking mental notes about the work you need to do but you’re also imagining what it would be like when other people experience your idea and benefit from your creativity and hard work.\n\nYou go full throttle with your idea. You work hard, make sacrifices, and get stuff done. Progress is being made and it’s incredibly exciting.\n\nThen, for some reason, the fire dies and the excitement goes away. Work that you were once totally jazzed about now seems like a chore. “What’s possible” is replaced with “what am I doing?” and the progress begins to slow down and production eventually comes to a halt.\n\nYour idea just sits there, half-finished (more or less).\n\nSound familiar?\n\nIf this hasn’t happened to you, you’re one of the “lucky ones.” But for most people this “crank then tank” experience is all too common. Although I’ve taken many of my ideas to launch, I have a slew of others that I’ve started but never followed through with.\n\nHere’s one in particular that I’d like to dissect for you:\n\nStep-by-Step Images\n\nIn January 2011 I wrote An Underrated Skill That All Bloggers Should Have and I Would Like To Teach. In it, I talk about how important graphic creation and manipulation skills (i.e., Photoshop skills) have been for my online business—to be able to quickly (and on my own) create or manipulate an image and use it right away as opposed to hiring someone and paying them to do it for me, which could take several days and a lot of back and forth.\n\nIt’s the one skill that I learned while working in the architecture industry that I can easily apply to my online businesses, and I’m in Photoshop almost every single day. It reduces stress and saves me a ton of time and money.\n\nThe post I wrote was meant to increase awareness of this valuable skill but also use it as a “feeler” to see whether or not people would be interested in learning how to use Photoshop or software similar to Photoshop.\n\nIn short, there was a lot of interest.\n\nAs a result, in addition to a webinar, I had a big idea for a separate website that would include a number of graphic design tutorials that people could learn from.\n\nThere were, of course, a ton of existing resources, both paid and free, for how to use Photoshop and other software, but I wanted to take a slightly different approach. I wanted to create tutorials specifically for bloggers, Internet marketers, and anyone else who does business online.\n\nInstead of something like a course that takes you through all of the tools and helps you understand how Photoshop works, it would instead let you select from a library of tutorials for whatever specific kind of graphic you needed at that time. A banner ad, a Twitter background, a Facebook cover image—you select the graphic you need and my tutorials would walk you through, step-by-step, how to create that specific graphic, some including templates to work off of to make things even easier.\n\nThat’s when I started working on StepbyStepImages.com.\n\nFor three weeks I was so amped about my idea. I created mind maps, outlined tutorials, and built the website that you see on the deserted website linked above. I even learned how to install and use WP-Wishlist to include members-only content.\n\nAfter three weeks I had created the perfect “shell.” It was sort of like a totally brand new house: empty, but ready to be furnished.\n\nThen, it was time to furnish the site and create all of the tutorials. That’s when things started to slow down.\n\nA Change in Course\n\nIn total, I had mind-mapped about 60 different graphic design tutorials. For each, I wanted two versions: a version where I show how to create or edit the image in Photoshop, and then another version where I show how to create or edit the image in Gimp, a free online image editing software. That’s 120 different screen recordings.\n\nI started to screen record the first video and with edits, re-shoots, branding, and effects, it took about 30 minutes to complete a high-quality 5-minute tutorial.\n\nI didn’t expect it to take that long and I still had 119 more to go.\n\nThat’s when things started to slow down. A lot. Something happened mentally and I just wasn’t excited anymore. It was a feeling I almost had in an instant and my whole mindset about this project changed. I only created one more tutorial after that first one, and since then, nothing.\n\nWhat Happened?\n\nThis sort of thing happens to me every so often, although lately I’ve been very good about completing big projects before moving on to the next. One example of this is my podcasting tutorial, which took over 30 hours to complete.\n\nWith Step-by-Step Images, however, I just didn’t feel compelled to work on it anymore, and even after some time the drive to work on it never came back.\n\nI’m sure there are a lot of factors involved, but here are some thoughts on what happened:\n\nOverwhelm\n\nBeing overwhelmed with the work that lies ahead before an idea actually becomes a reality is probably the most common cause for dropped, unfinished projects.\n\nThe excitement in the beginning can cloud the truth about how much work actually needs to be done, and so halfway through when you finish the work you enjoyed doing, the rest of it seems like climbing Mt. Everest.\n\nIt’s tough though because everyone says to “just take action” and “go for it,” and to an extent I absolutely agree, but at the same time some smart, initial planning and general reality checking needs to be done before diving into anything.\n\nThe best thing to do is to familiarize yourself with what work may lie ahead so that you’ll know what to expect. Unexpected things will happen, of course, but the more you learn about what you’re about to do the better chance you have to follow through.\n\nHow do you best familiarize yourself with stuff that’s new to you? Talk to other people and read about it.\n\nBusiness Cards First?\n\nFor some reason, when I was in high school, my friends and I all had business cards. It was “cool” to have a business card with your name on it and some of your skills listed. But the funny thing was, none of us had actual businesses!\n\nBut we were cool because we had business cards, right?\n\nFor Step-by-Step Images, it seems I had adopted the mentality of business cards first, business second. When you think about it, that’s silly.\n\nUnfortunately, this is what a lot of people do. We get an idea but build everything around it before getting into the meat of what that idea is really all about.\n\nIf I had simply started with recording the tutorial videos, I would have learned just how much time each one would take and maybe I wouldn’t have wasted three weeks and a ton of energy on something that I was going to eventually put aside.\n\nIf I had finished the tutorials first, you can be darn sure I’d get everything I built in that first three weeks up and running fast.\n\nAlso, this validates the idea in the first place; the actual meaty business part of the idea. Get that done first, and the rest will fall into place. The business cards will come when you’re ready.\n\nHow many “business card first” ideas have you done that you’ve never finished?\n\nAll of it?\n\nAlong the same line as some advice that was given to us by Dane Maxwell on SPI Podcast Session #46, I don’t have to create all 120 tutorials before launching Step-by-Step Images. And really, I shouldn’t.\n\nI could start with fewer and still make paying customers happy, and they’d be even happier down the road when any new tutorials come out, instead of using them all up at first.\n\nLet’s say, for example, I start with only the Photoshop Tutorials. I could add the Gimp tutorials later as a value-add and make a big announcement about it. Right there, that cuts away half of the tutorials I need to do before launch.\n\nThen, maybe I could eliminate a couple of the larger categories, like banner ads, for which there are already many tools available online to help people create them. I could then focus on fewer, stronger, and more unique tutorials that are in demand.\n\nThe lesson here is that thinking about every single feature and function of your product or service is smart, but you don’t need all of those things ready before you launch.\n\nWhat are the core things that people need and would be happy to pay for? Focus on that, and then add to it later.\n\nThis is exactly what I did to launch my new course, Smart from Scratch! I launched it in October last year (2016) and only a small portion of it was actually finished. After validating the course with a batch of founding students who paid to get access, I then created the rest of the course with them and their valuable feedback.\n\nAnd, by the way, this course is coming out of “beta” soon, and will be re-opening sometime next month. To sign up, head to SmartFromScratch.com to get on the waiting list today!\n\nYou can't earn 50% on a project that's only 50% complete. You earn nothing until that project is available to the end user.\n\n“Outs”\n\nWhen I started shooting tutorial videos for Step-by-Step Images, it was at the same time I had some other exciting projects going on. A site I built as a result of a Niche Site Duel was starting to earn hundreds of dollars per month and was growing exponentially. A few weeks prior, I was contacted by a Hollywood producer about potentially working on a film as the Director of Web and Social Media, which I eventually agreed to do.\n\nSo what happens when you work on a project and it gets to a point where it becomes overwhelming and challenging? And you also have other more exciting things going on? You shift your focus to what’s exciting.\n\nI remember a story someone once told me about personal training. Most personal trainers charge you per session. If you don’t make a scheduled session, you have to pay anyway, but they give you one or two “free passes” per month where they won’t charge you.\n\nMy buddy would always tell his personal trainers, “No free passes. If I don’t show up, charge me, no matter what!”\n\nHe didn’t want any outs—that thing he could fall back on in case something didn’t work out. It’s risky to have outs, even though they are usually there to help you.\n\nWhy?\n\nBecause mentally if you know that “safety net” is there, you’ll likely start making excuses.\n\nLet’s say, for example, you were to wake up ten minutes before a session starts one day. If you have that freebie, you might say “Well, I have a freebie, I’ll just fall back asleep.” If you didn’t have that freebie you’re more likely to jump out of bed and sprint out the door like you’re going to miss the bus. Next time, you’ll make sure to double check your alarm clock from that point forward.\n\nIn my situation, the other projects I had going on were my outs. I didn’t need to succeed with Step-by-Step Images because I already had all of this other stuff going on, and other things that were successful and generating an income.\n\nIt’s no wonder the one moment I sprint up to a hurdle I turn around and walk away.\n\nSo what should I have done instead? \n\nFirstly, I needed to stop thinking of my other projects as outs.\n\nGreenExamAcademy.com, my first online business, was a successful because I had no other choice but for it to succeed. I was just laid off and had no other options, including getting another job in the architecture industry, which was impossible. Does this mean I should get rid of everything else I have going on? Of course not, but it means mentally I should treat them as separate projects and should want them each to succeed separately just the same.\n\nSecondly, I should have committed. Looking back, I can’t remember a time when I fully committed to the project. It was the idea I got so excited about I started working on it before truly thinking about it, and so when I got to that stopping point it actually wasn’t very hard for me to just move onto something else.\n\nAnd lastly, I should have pre-sold the idea. If you promise delivery by a certain date you could take pre-orders for your project (potentially with an early-bird discount) and use that money as a resource to help you finish your project, or at least as motivation to get things done and done on time, or else you’re going to have a lot of very angry customers.\n\nWhere will I go from here?\n\nI’m not sure, but this post isn’t all about me, it’s about you too. Thank you for sharing my experience with this project. Of course, it’s always tough to admit to failure but life is a learning process and I hope my experiences here have or will help you in some way, shape, or form.\n\nThink about the projects you’re working on right now.\n\nHave you truly committed to them?\n\nDo you have any outs that could take your focus away from what you should really be focusing on?\n\nRemember, half-finished projects aren’t the same as eating half of a meal or finishing half of a marathon. You still get a benefit from each of those things, but the sad truth about your half-finished project is that in reality, it’s nothing.\n\nYou can’t earn 50% on a project that’s only 50% complete. You earn nothing until that project is available to the end user.\n\nimage\n",
      "Folder": "Feedly",
      "Timestamp": "1484604670",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.725064Z"
}