{
  "id": "135a6bf997f340f4b86f5d3e20cf818f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1003846/sleeping-in-on-the-weekends-may-be-bad-for-your-health/",
      "Title": "Staying out late two days a week is worse for your health than you think Quartz",
      "Selection": "Even if you get the recommended seven or more hours of sleep on the weekends, you may ruin your week if you pass out at 3am and wake up at 11. Researchers call this social jet lag: even if you get the same number of hours of sleep you’d get on a weeknight, your inconsistent bedtimes may still reduce the quality of your sleep.\n\nThe consequences are worse than just being tired Monday morning. Preliminary research led by a team at the University of Arizona shows a link between social jet lag and health issues like an increased risk of heart disease.\n\nThe research, presented on June 5 at the Annual Meeting of the Associated Professional Sleep Societies in Boston, was based on a survey of about 1,000 American aged 22 to 60 about their daily sleep, exercise, and eating habits. Over the course of 14 days, participants reported when they typically went to bed at different points during the week, as well as other markers of health like diet, mood, and how tired they felt. They also answered questions about their medical record, including any history of heart disease.\n\nTo measure social jet lag, the research team compared what time people went to sleep and woke up on weekdays and weekends. They found that—assuming people got the same total amount of sleep seven nights a week—every hour later people were going to bed on the weekends correlated with a roughly 11% increase in risk of heart disease. Each hour of social jet lag was also related to how healthy people thought of themselves overall: for every hour participants said they were up later, they were 22% more likely to say that they were in “good” or “fair” instead of “excellent” health.\n\nAlthough these results are self-reported, and therefore less rigorous than a study in which researchers could observe participants first hand, they suggest our bodies prefer consistent sleep. “A regular sleep schedule may be an effective, relatively simple, and inexpensive preventative treatment for heart disease as well as many other health problems,” Sierra Forbush, a student studying sleep at the University of Arizona and lead author of the paper, said in a statement.\n\nForbush told MedPage Today she believes later bedtimes can throw off our circadian clock, the rhythm our bodies keep to produce different hormones when we go to bed or wake up. It’s not clear why this is the case, but it also isn’t the first time researchers have found adverse health effects connected to social jet lag. In 2012, researchers from the University of Munich found that people who stayed up later on the weekends were more likely to be obese, which is a risk factor for heart disease and diabetes. In 2006, a different team also from the University of Munich found (paywall) that people with larger social jet lag also tended to be tobacco smokers.\n\nNotably, this research hasn’t yet been published in a peer-reviewed journal, and the researchers conspicuously didn’t ask responders what keeps them up later. Alcohol is a sleep disruptor (paywall) itself, and consistent drinking has been linked to both heart and liver disease, as well as breast and colon cancer.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1497309735",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.588437Z"
}