{
  "id": "147dbd49553842a0a06b4a46704dc6d8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.frugaltravelguy.com/2016/08/5-reasons-im-hoarding-american-express-membership-rewards-points.html",
      "Title": "5 Reasons I’m Hoarding American Express Membership Rewards Points Frugal Travel Guy",
      "Selection": "Since May of this year, I have signed up for three American Express credit cards. Both my husband and I signed up for the Amex Platinum Card in May and I recently signed up for the Amex Business Platinum.\n\nWhile Amex’s once-per-lifetime rule has cramped many people’s style, it wasn’t standing in my way. Due to an oversight on my part, I hadn’t held any of the top American Express credit cards before anyway. And since I hadn’t had them in the past, I was eligible to sign up when a good offer rolled around.\n\nSo far, I have around 205,000 Membership Rewards points lingering in our accounts. Once I finish the signup bonus on my business card, I’ll have well over 300,000.\n\nThis might sound like a lot, but I promise to put them to good use. Here are 5 reasons I’m perfectly comfortable hoarding these points for the time being:\n\nRogue links and targeted offers for 100K pulled me in.\n\nOkay, so I’m a sucker for a huge signup bonus. A few months ago, American Express accidentally let a rogue link for 100,000 points for a 3K minimum spend fly, and I jumped right in. It’s rare to score 100,000 points for just $3,000 in spending, so I was all over that. In July, however, I also received a targeted offer for 100,000 points on the business card if I could spend $10,000 in three months. Obviously, that was happening, too.\n\nI am planning a 5-person, three-week trip to somewhere in Europe next summer.\n\nEven though I don’t have definitive plans for these points, I know they’ll come in handy in some way, shape, or form. Next summer, we plan to take our two kids and a caregiver (hopefully my mom) to Europe for three weeks and these points should help take the sting out of that huge expense.\n\nAmex rewards have a ridiculous number of transfer partners.\n\nSpeaking of our trip to Europe, it’s quite possible I’ll transfer some or all of our points to an Amex airline partner to make it happen. I haven’t begun checking availability yet, but the fact that American Express Membership Rewards has around 20 airline transfer partners gives me hope!\n\nYou can book flights with points through the American Express travel portal.\n\nOne thing I always worry about with family trips is finding award availability. With my two small children (ages 5 and 7) and my mother in tow, we don’t want to do anything crazy like fly on separate flights or endure lots of layovers. So while booking airfare directly with Amex points isn’t a stellar deal, I like having that option. Since Membership Rewards are worth one cent each when used for airfare, I’ll have more than $3,000 to spend on flights if I go that route.\n\nAmex offers some decent transfer bonuses.\n\nWhile I plan to use these points for our big trip, I could easily be swayed by a huge transfer bonus. In the past, American Express Membership Rewards has offered up to 50 percent bonuses on points transferred from British Airways, Etihad Airways, and others. Depending on the bonus and the airline, these offers can be pretty sweet.\n\nThe Bottom Line\n\nChase Ultimate Rewards are still my favorite award currency by far, but American Express Membership rewards are growing on me. With tons of transfer partners, the ability to book travel directly if needed, and huge signup bonuses that appear from time to time, what’s not to like?\n\nWhat is your favorite way to use American Express Membership rewards points?\n\n[Image via Getty]\n\nHolly Johnson\n\nHolly Johnson is a financial expert and award-winning writer whose obsession with frugality, budgeting, and travel plays a central role in her work. In addition to serving as Contributing Editor for The Simple Dollar, Holly writes for inspiring...\n\nAll Articles\n\n|\n\nFollow on Google+\n\nChase Sapphire Preferred® Card\n\nAnnual Fee: $95 fee waived for the first year\n\nForeign Fees: No\n\nCard Type: Bank\n\nApply Now Add to Favorites\n\nEarn 50,000 bonus points when you spend $4,000 on purchases in the first 3 months from account opening. That's $625 in travel when you redeem through Chase Ultimate Rewards®\n\nNamed a 'Best Credit Card' for Travel Rewards by MONEY Magazine\n\n2X points on travel and dining at restaurants & 1 point per dollar spent on all other purchases\n\nSleek metal card design\n\nEarn 5,000 bonus points after you add the first authorized user and make a purchase in the first 3 months from account opening\n\n$0 foreign transaction fees, plus chip-enabled for enhanced security and wider acceptance when used at a chip card reader\n\n1:1 point transfer to leading frequent travel programs at full value – that means 1,000 Chase Ultimate Rewards points equal 1,000 partner miles/points\n\nTravel confidently with premium Travel Protection Benefits, including Trip Cancellation/Trip Interruption Insurance, Auto Rental Collision Damage Waiver, Trip Delay Reimbursement and more\n\nBreakdown\n\nEarn (pt.)\n\nSpend\n\nFirst 3 months\n\n50,000\n\n$4,000\n\nRestaurants Purchases\n\n2.00\n\n$1\n\nCoffee Shops Purchases\n\n2.00\n\n$1\n\nFast Food Purchases\n\n2.00\n\n$1\n\nAlcohol & Bars Purchases\n\n2.00\n\n$1\n\nChase Sapphire Preferred® Card\n\nAnnual Fee: $95 fee waived for the first year\n\nForeign Fees: No\n\nCard Type: Bank\n\nApply Now Add to Favorites\n\nFTG Review\n\nReward Breakdown\n\nPoints Breakdown\n\nEarn 50,000 bonus points when you spend $4,000 on purchases in the first 3 months from account opening. That's $625 in travel when you redeem through Chase Ultimate Rewards®\n\nNamed a 'Best Credit Card' for Travel Rewards by MONEY Magazine\n\n2X points on travel and dining at restaurants & 1 point per dollar spent on all other purchases\n\nSleek metal card design\n\nEarn 5,000 bonus points after you add the first authorized user and make a purchase in the first 3 months from account opening\n\n$0 foreign transaction fees, plus chip-enabled for enhanced security and wider acceptance when used at a chip card reader\n\n1:1 point transfer to leading frequent travel programs at full value – that means 1,000 Chase Ultimate Rewards points equal 1,000 partner miles/points\n\nTravel confidently with premium Travel Protection Benefits, including Trip Cancellation/Trip Interruption Insurance, Auto Rental Collision Damage Waiver, Trip Delay Reimbursement and more\n\nBreakdown\n\nEarn (pt.)\n\nSpend\n\nFirst 3 months\n\n50,000\n\n$4,000\n\nRestaurants Purchases\n\n2.00\n\n$1\n\nCoffee Shops Purchases\n\n2.00\n\n$1\n\nFast Food Purchases\n\n2.00\n\n$1\n\nAlcohol & Bars Purchases\n\n2.00\n\n$1\n\nApply Now\n",
      "Folder": "Feedly",
      "Timestamp": "1470763672",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.786721Z"
}