{
  "id": "149d5f3fffb74af78bf7a4bd64faf88b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2017/7/1/15886012/trump-millennial-voters",
      "Title": "Trump and millennials have completely different economic priorities Vox - All",
      "Selection": "President Trump and American millennials have drastically different priorities when it comes to the economy.\n\nTrump wants to boost the shrinking manufacturing industry and revive dying coal jobs. He wants to limit international trade. And he also wants to cut taxes for the wealthiest Americans.\n\nThat doesn’t seem to be at all what young Americans want. A survey of 1,750 Millennials across the country shows that a majority of young Americans (of all races) care most about job wage growth and income inequality —two things that the administration has shown little interest in.\n\nIn May, Trump released a budget that, among other things, drastically increases military spending while cutting funding for welfare programs and scientific research. It’s basically the opposite vision that millennials have for their country, even just white millennials — a demographic group that voted for Trump. For one, they strongly believe that the federal government should increase taxes on the wealthy, not cut their taxes.\n\nHow this generation views the president’s action could have a huge impact on the 2020 elections, as Millennials make up most of the American workforce and have the same share of registered voters as the baby boomer generation. Many, including a large number of young black voters, did not turn out to the polls on Election Day. That had a lot to do with dissatisfaction with the two candidates, said Cathy Cohen, a political science professor at the University of Chicago and lead researcher on the GenForward survey. That could easily be a different story in 2020.\n\n“A lot of millennials were not taken by the Clinton candidacy,” said Cohen. “If another Democrat can fight the right economic agenda to motivate millennials of color to turn out, it would negate any advances that the Trump administration would make.”\n\nThis is what Millennials think the president (and Congress) should be thinking about when it comes to economic policy, according to the GenForward survey, which polled Latino, black, white and Asian adults between the ages of 18 and 34 in April and May.\n\nTaxes\n\nThe most glaring difference between what the president has proposed and what millennials want comes down to taxes. Trump’s tax plan, which he released earlier this year, would overwhelmingly benefit the top income earners in the country, particularly by lowering taxes on owner-operated businesses and eliminating the alternative minimum tax. Yet millennials want the federal government to raise taxes on millionaires, not give them a tax breaks. The vast majority of black, whites, Asians and Latinos felt that way.\n\n GenForward survey\n\nOne reason behind their thinking is that reducing income inequality is one of the top economic priorities for millennials. The gap between rich and poor has been getting worse since the Great Recession, and young Americans want Congress to address this.\n\nTrump’s tax plan would just widen the gulf, as some analysts have argued. If Congress goes along with Trump’s tax plan, it could be the Republican party’s biggest liability in the midterm elections.\n\nInfrastructure spending\n\nThe one economic issue that was heralded as a bipartisan issue is federal spending on rebuilding highways, bridges and airports. Though Trump promised to push for infrastructure spending, so far, Congress has not come up with a bill to make it happen. If they did, it would likely have strong support from young voters. The majority of white, Latino and Asian-American millennials support increased federal spending on infrastructure. On the other hand, most young African-Americans (57 percent) oppose it.\n\n GenForward survey\n\nHere is where Trump and millennials can find common ground when it comes to infrastructure. Both would prefer that spending be in the form of decreased business regulations and tax incentives that would boost infrastructure investment from private businesses. Asian Millennials were the only group that favored direct federal spending on these projects.\n\nBusiness regulation\n\nOne of the core elements of Trump’s economic agenda involves deregulation. One of his most-often repeated mantras involves description of how the federal government is strangling businesses with excessive rules. Whether that means deregulating Wall Street banks or power plants, Trump has been pretty clear that he wants the government to leave businesses alone (hence, the two-for-one rule he instituted shortly after his inauguration).\n\nWhile Millennials think that some deregulation is good to spur infrastructure spending, they don’t seem to agree with Trump that government rules are that bad for businesses. In fact, most young Latino, white and Asian Americans think government regulations are necessary to protect the public. Only a slight majority of black respondents think that business regulations do more harm than good.\n\nHere is the breakdown:\n\n GenForward Survey\n\nRight now, Trump’s budget represents everything that Millennials do not want to see happen. For young African-Americans, the most important economic issue for the president to address is increasing wages. For Asian Americans, it’s reducing the gap between poor and rich. For Latinos, it’s increasing the minimum wage. White millennials want the president to create more jobs.\n\nThe only one of these issues the president seems to care about is creating jobs. So far, his promise to increase manufacturing and coal mining jobs has not materialized.\n",
      "Folder": "Feedly",
      "Timestamp": "1498924248",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.657232Z"
}