{
  "id": "153d2b2a17424e55bc385d873319ecc4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/880084/love-based-marriage-is-not-the-best-model-for-raising-children/",
      "Title": "Love-based marriage is not the best model for raising children Quartz",
      "Selection": "When I was in graduate school in the United States in the early 1980s, a member of our women’s support group informed us that she was pregnant. Although she was single and not in a serious relationship, she told us she intended to have the baby and raise it herself. She decided not to tell the genetic father, as she feared that he would pressure her to get an abortion, or disappear and then later try to enter the child’s life. She preferred to parent alone.\n\nMy mother was in a similar position, even when she was married to my father. In the US at the time, it was common for fathers not to be involved in raising the children. What we would now call a “traditional marriage” never really spelled out any principles for shared parenting, except to assign all basic childcare to wives. A father might be called upon occasionally to back up a mother’s disciplinary rules, but I felt somewhat lucky that my mine was never enlisted for this role. When my parents separated, there was no question about who would get the kids: the wife, my mother. Once my parents divorced, my father was around even less, and never got to know my children (my eldest was 12 years old when he died).\n\nThese scenarios—being a single parent by choice, and raising children in a marriage and after a break-up—point to the fact that the institution of marriage often fails to facilitate the complex and shifting nature of parenthood. The modern family is changing, and an increasing number of people are choosing to have children outside marriage in the first place. In 1970, 11% of all births in the US were extramarital; by 2014, it had climbed to around 40%. In countries including Norway, Sweden, France, Mexico, and Iceland, more than half of all children are born outside of marriage.\n\nThis trend troubles some observers, who think that marriage is necessary for the stability of the family. But people become parents under many different circumstances, and often these circumstances aren’t conducive to marriage anyway. Is there an alternative that adds a degree of financial and emotional security to the lives of parents and children?\n\nYes: akin to a public marriage contract, we need an official “co-parenting agreement” and associated civil status, which not only enshrines the rights and responsibilities of each parent in respect of their children, but also sets out the principles by which they relate to one another and make decisions.\n\nAlthough children benefit greatly from having the ongoing support of several adults as they grow up, they don’t necessarily need this nurturing from people who commit to marriage. Their parents simply need to cooperate effectively, to respect the relationship the other has with the children, and to contribute in comparable ways to caregiving and family finances. In the United Kingdom, parents who are unmarried, separated, remarried, or step-parents can already enter into a “parental responsibility agreement” that aims to establish the terms of shared custody of the children. This includes obligations to keep co-parents informed about a child’s basic wellbeing, and to assist with providing housing, schooling, medical care, and other costs.\n\nHowever, I think that we need to take the notion of official co-parenting a step further—to include parents who might never intend to marry or live together, or who don’t wish to enter into an emotionally intimate relationship. In the US, organizations such as Family By Design and Modamily have sprung up to help single adults find a suitable co-parent for forming a family “minus the couple,” as a New York Times article put it. But without the state’s legal recognition, co-parents must draw up their own agreements. Such privately negotiated contracts could fail to protect the rights of weaker or vulnerable parties, or might reflect the quality of legal advice one can afford.\n\nOf course, like marriage, entering and continuing a public, formal co-parenting agreement should be voluntary; parents should always be free to enter into private or informal arrangements, if they wish to do so. But without an institutionalized public option, we expose families to the risk of nightmarish conflict, especially when relationships break down.\n\nWhen people become parents, they might not be able to anticipate all the ways in which their interests could be interfered with or undermined. Particularly after a break-up, parents often use tactics that they might admit are unfair, and would be incensed if used against them. But when access to their kids and involvement in their lives is at stake, moral consideration for the other parent is not a priority, even for otherwise decent people. Among my friends, and friends of friends, I have seen one parent use a partner’s lack of US citizenship as a bargaining chip to gain access to the children. Another took advantage of the circumstance that her same-gender co-parent had not obtained legal parent status. Yet another elected to move residence far away from the other parent, which made shared arrangements impractical. Many of us know similar stories.\n\nBecause marriage generally does not cover the terms of shared childrearing, public co-parenting contracts would offer a social insurance scheme for both “traditional” and non-traditional families. An official contract would help to safeguard parents’ basic entitlements, such as the right to be involved in the lives of one’s children and to appropriate forms of child support from each co-parent. If and when cooperation among the co-parents breaks down, the existence of an agreement can guide courts or mediators in negotiating new agreements for shared parental responsibility.\n\nThe process of formalizing one’s status as a parent would also encourage people to think through and communicate their expectations right from the start. When we cross the threshold to parenthood, surely it’s sensible for society to nudge parents to reflect on and discuss who will make career sacrifices to be at home with the children, how the children will divide their time if the parents have separate households, and how important decisions will be made that affect a child’s future.\n\nOf course, it can be hard to know precisely what to expect in advance of something as momentous as having a child, and the contract doesn’t have to lay it all down in detail. But the point is that future decisions would take place in the context of a formal commitment and a public declaration about the primacy of the co-parenting relationship in one’s life. Such an agreement would also provide an incentive for parents to work things out to their mutual benefit—in part because they know that ending the arrangement has tangible consequences.\n\nIn short, one’s rights as a parent, and the relationship with one’s children, shouldn’t be contingent on the ups and downs of one’s love life. Co-parenting as friends, or at least as collaborators, is good for children, adults, and society. If a civil institution of co- parenting had been available, both my mother and my friend from graduate school might not have had to go it alone.\n\nThis article was originally published at Aeon and has been republished under Creative Commons.",
      "Folder": "Feedly",
      "Timestamp": "1485095682",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.653769Z"
}