{
  "id": "1549deecd9f645ff86ea73cf765ef8f6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1017842/how-to-be-smarter-learn-to-say-i-dont-know/",
      "Title": "If you want to be smarter, learn to say “I don’t know” Quartz",
      "Selection": "There is an old legend in which Socrates, the great Greek philosopher, is recognized by Pythia, the Oracle of Delphi, as the wisest man alive. It’s notable for Socrates’ response.\n\n“I am the wisest man alive, for I know one thing, and that is that I know nothing.”\n\nI think that if Socrates lived today, he would likely have been disappointed. We seem to live in a world where everybody is always certain and nobody is willing to concede that they might be wrong. It seems that it’s more vital to have any old opinion than to truly understand the contents of that opinion.\n\nSomehow, we have decided that it’s okay to hold beliefs based on blind affiliation rather than rigorous critical thought. And if you don’t take a side right away, well, then you are to be shunned or to be labelled as ignorant.\n\nThis likely isn’t new to our age, but it’s very much amplified by the internet. Part of it can be attributed to passion. Understandably, we feel strongly about certain things and that clouds our ability to see the other side. That said, more often than not, the issue lies in our inability to humbly accept that we don’t and can’t know everything; that, often, we are wrong.\n\nThat’s a problem.\n\nThe Irrationality of Certainty\n\nEverything that we see and observe around us is an approximation of sorts. Our senses only take in a small fraction of the available information in our environment, and our brains consciously process an even smaller part.\n\nThere are smells around that we physically can’t smell, there are sights to witness beyond the wavelength that our eyes operate in, there are sounds to be heard that we will never fully hear, and there are influencing thoughts in our subconscious mind that, in many ways, we can’t even begin to relate to.\n\nThis is on a very core level. If we add in the complexity brought on as a result of our interactions with the world through the systems and ideologies we have in place, it’s even more unlikely that we have complete knowledge.\n\nNone of us are ever right. Certainty is an illusion, and there is no shame in being wrong because, by nature, our entire perception of the world is wrong. Over time, we progress and thrive in our surroundings by being less wrong. We feel around, we test, and we question ourselves until something works.\n\nUncertainty isn’t a condition to be avoided, but a tool for better decisions.\n\nThe Disease of Blind Affiliation\n\nThe primary way we mask our discomfort of uncertainty is via affiliation. In some ways, if we don’t have a fully formed opinion, it makes sense to look toward the ideologies, groups, and people who we most generally identify with because there is already a proven track-record of alignment. It’s a useful heuristic—a rule of thumb, if you will—and when it comes to small matters, there likely isn’t too much harm in using that as a shortcut.\n\nThinking is hard work, and it’s worth conserving that energy when possible. The problem occurs when we use our identity as Liberals or Conservatives, or when we let the weight of our loyalty to a personal hero or author, dictate how we make sense of the world rather than critically reasoning ourselves.\n\nIt’s quite a slippery slope, too. If these viewpoints are consequential and important, over time, we get drawn closer to them, and eventually, we form a connection to something that we fundamentally haven’t questioned. That’s no way to live. The dissonance often catches up, and it’s rarely pretty.\n\nEveryone is a sum total of their own unique experiences, and none of these experiences align perfectly with any one person or ideological system. It’s better to not have an opinion than to naively purse someone else’s.\n\nThe Value of “I Don’t Know”\n\nWhen you think about it, acknowledging ignorance is actually productive. Sometimes, the best answer is simply “I don’t know.” Now, that isn’t to give you a reason to exercise indifference or to avoid making difficult decisions. It’s just about choosing to stick to your circle of competence and awareness.\n\nAt any given point, there’s only so much information we can make sense of. On a daily basis, there will be things we don’t understand. If they aren’t relevant, it’s okay not to know. If they are, it’s better to take time to think. This may seem fairly intuitive, and yet, the vast majority of people rarely find themselves comfortable enough to be at ease with not knowing. Instead, they recite from memory whatever has been ingrained into their mind.\n\nThey would rather stand for something with a loose foundation, and they prefer certainty even after being challenged rather than to reconsider. In the long-term, none of these tactics tend to lead to a healthy outlook. “I don’t know” not only keeps us in our circle of competence and awareness where the risk of potential harm is low, but it also works as a feedback tool.\n\nIt’s a competitive advantage because it adds an incentive to critically break things down rather to take the easy way out. It forces us to get smarter. There’s no point standing for something if you have a bad reason to do so.\n\nThe Takeaway\n\nLife is complex and messy, and it’s okay not to know everything. It’s fine to take time to form an opinion, and it’s useful to acknowledge ignorance. We live in a world saturated with ideas, and not all of them are good, and not all of them are right for everyone. Ask questions, be critical, and don’t be afraid to change your mind. There are no solid rules against doing so.\n\nNo one makes progress by standing in the same place, and we didn’t get to where we are by always being right. Everything is trial and error, and if you truly want to understand the world, you have to be comfortable with that. It’s okay to open your mind.\n\nWant more? Zat Rana publishes a free weekly newsletter at Design Luck where he shares unique insights on how to live a good life.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1498737029",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.657570Z"
}