{
  "id": "155764eb9ed746c0964caf6c93262ce2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/20144-jamie-oliver-s-genius-one-pot-roast-chicken-legs",
      "Title": "Memo Make Jamie Oliver’s Crazy, Genius One-Pot Chicken ASAP Food52",
      "Selection": "Jamie Oliver has been known to do otherworldly things with chicken, given a few strident ingredients and enough time in a single pot. But this time, somehow, you have to do even less to get there.\n\nJamie Oliver’s Tender & Crisp Chicken Legs with Sweet Tomatoes & Basil\nby Genius Recipes\n\nThis summery chicken-tomato-mélange's miraculous qualities have all the hallmarks of a braise—the fall-apart tenderness and well-developed, concentrated sauce—without having to sear anything first or spatter your stovetop or do ... much at all.\n\nYou truly can throw everything into the pot in the time it takes the oven to heat, ripping the basil leaves caveman-style and chucking them in; chopping the stems imprecisely and cleaving through small tomatoes, then chucking them in, too. Oliver’s website in fact clocks this recipe at 1 hour 35 minutes, implying just 5 minutes of assembly, which is only exaggerating a little bit. Like in this instant dinner party pork shoulder ragu, there are very few ways to improve on the good work a moderate oven and time can do.\n\nSee? In this gif, it only takes like 9 seconds!\n\nQuick question: Did you catch that the basil stems go in, too? Have you ever seen a recipe that does this? (No really, please tell me.) The stems cook down just long enough to turn soft and almost meaty, so that all but the very woodiest ones are safe to add to the pot.\n\nOliver is also the king of glugs and handfuls, which can reasonably be unnerving for people who treasure the guidance of recipes, as we do. But in this instance, it’s altogether freeing. I haven’t needed to reference the actual recipe since the first time I made it. The simplicity of the technique—snuggle in pan, roast—is fairly un-stumpable, and will expand and contract to fit any size vessel you have. I like to make a lot at once, which means I’ve found the perfect use for extra-wide Dansk pan I inherited from my grandmother-in-law Virg (her pan is just like this round one, but in a deep coral/mauve).\n\nThe one thing you might feel torn about is running your oven for an hour and a half in the heat of tomato season—but as long as you’re not in one of the swampier corners of the country or world, it’s a very small price to pay. If you are, stay strong, and bookmark this for your first cool night, and all fall long.\n\nBecause as it roasts, the basil leaves turn crispy while the stems fuse into the sauce. Food52er nutcakes, who sent me this recipe years back, rightly called it “stunningly fragrant.” The chicken jus intensifies and swirls together with the slumpy tomatoes and whatever other friends you’ve thrown in with them. Cannellini beans? Baby potatoes? Collard greens? Just think: What would taste better in chicken-tomato-basil-schmaltzy-stew? Pretty much anything, right?\n\nJamie Oliver’s Tender & Crisp Chicken Legs with Sweet Tomatoes & Basil\n\nBy Genius Recipes\n\n4\nhigher-welfare chicken leg quarters\n\nSea salt & freshly ground black pepper\n\n1\nbig bunch fresh basil, leaves picked, stalks finely chopped\n\n2\nbig handfuls red and yellow cherry tomatoes and ripe plum or beefsteak tomatoes, cherry tomatoes halved, plum tomatoes quartered\n\n1\nwhole bulb garlic, broken into cloves\n\n1\nfresh red chile, finely chopped, or a big pinch of dried chile flakes\n\nOlive oil\n\nOne\n14.5-ounce/410 g can cannelini beans, drained and rinsed (optional)\n\n2\nhandfuls new potatoes, scrubbed (optional)\n\nView Full Recipe\n\nPhotos by Julia Gartland\n\nGot a genius recipe to share—from a classic cookbook, an online source, or anywhere, really? Please send it my way (and tell me what's so smart about it) at kristen@food52.com. Thank you to Food52er nutcakes for this one.",
      "Folder": "Feedly",
      "Timestamp": "1501102359",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.568588Z"
}