{
  "id": "156105a147dd42b08b3442d0e9f08b9d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2018/4/6/17169448/trump-islamophobia-muslims-islam-black-lives-matter",
      "Title": "What most Americans get wrong about Islamophobia Vox - All",
      "Selection": "It’s no secret that hate crimes against Muslims have been on the rise. \n\nIn one recent incident, an anonymous group in the UK declared Tuesday, April 3, to be “Punish a Muslim Day.” They circulated leaflets in several UK cities calling for people to attack Muslims in various ways, by “using gun, knife, vehicle or otherwise,” and advocated for burning and bombing mosques.\n\nAnd in the US, studies show that in 2015 and 2016, hate crimes and attacks against Muslims skyrocketed. According to a 2017 Pew Research center analysis, which relied on FBI statistics, assaults on Muslims have “easily surpassed” post-9/11 levels. \n\nOne factor that experts often point to is the rise of Donald Trump. \n\nAs a presidential candidate, Trump made frequent use of anti-Muslim rhetoric, saying things like, “I think Islam hates us,” and suggesting that he was not opposed to the idea of a Muslim database. After taking office, Trump signed an executive order barring people from several Muslim-majority countries from entering the US. He’s appointed people who have espoused anti-Muslim views to key Cabinet positions. And he’s even circulated anti-Muslim videos to his tens of millions of Twitter followers.  \n\nBut Khaled Beydoun, a law professor and the author of a new book called American Islamophobia: Understanding the Roots and Rise of Fear, argues that there’s something much more complex going on. According to Beydoun, Islamophobia — fear and hatred of Muslims and the religion of Islam — has deep roots in American history. \n\nI called Beydoun to find out more about Islamophobia in America — and what he told me was surprising. He explained that this type of racialized hatred is not limited to Muslims; it also impacts non-Muslim Arab Americans and South Asian Americans, among others. And anti-Muslim sentiment isn’t solely a problem on the right in America, he pointed out. The left also has a problem with Islamophobia.\n\nOur conversation has been lightly edited for clarity and length.\n\nAlexia Underwood\n\nHow would you sum up the argument of your book?\n\nKhaled Beydoun\n\nEssentially, it’s that even though Islamophobia animates a modern form of bigotry ... the essence of the hate is not new. It’s deeply rooted in American political discourse. It’s deeply rooted in American law. It’s deeply rooted in American framings of who was a citizen and who was not. But it’s been given a new face — a new caricature — as a consequence of the war on terror, and then intensified by the rhetoric of, mainly, President Trump.\n\nAlexia Underwood\n\nYou write that Trump proved that Islamophobia was an effective campaign tactic. How has this played out during his administration? Have things gotten worse for Muslims in the US under Trump?\n\nKhaled Beydoun\n\nDuring his campaign, Trump adopted this strategy of full-fledged, explicit, and bellicose rhetoric against not only Muslims but a whole range of people. \n\nI’m sure you remember pundits and analysts on television, even scholars, saying that Trump is only doing this to win the race, and that once he was actually in office he’d do away with that intense rhetoric.\n\nWe saw otherwise, obviously. Only a week into his administration, Trump signed the executive order now known as the first rendition of the Muslim ban, or the travel ban. What many thought was mere rhetoric to mobilize voters quickly evolved — or devolved —  into Islamophobic policy during the early stages of his presidency.\n\nHe weaponized that rhetoric into real policy impacting Muslim communities.\n\nAlexia Underwood\n\nThere’s a lot of talk about how Islamophobia is particularly strong among right-wing US politicians, but you point out that it’s also very present on the left.\n\nKhaled Beydoun\n\nYeah, definitely. Islamophobia, largely on account of it being so closely tied and tethered to Trump, is caricatured as exclusively a form of hate that comes from people on the right. We almost conflate Islamophobia with right-wing politics, which is really simplistic. It glosses over the idea that you have individuals on the left engaging in and propagating Islamophobia.\n\nPresident Obama established this state-sponsored program called Countering Violent Extremism. As a consequence of this program, his surveillance of Muslim communities actually was broader and more intense than the Bush administration — and Obama was lauded as one of the most, if not the most, progressive presidents in our country’s history.\n\nAnother example are popular media personalities and pundits like Bill Maher. I was a fan of his show, Real Time With Bill Maher, and I sometimes still find myself watching it because it’s a space for really vibrant and important discussion on a range of issues. Bill Maher is somebody who is very left-wing on a range of issues, like the LGBTQ community and the environment. \n\nBut he veers entirely away from that when it comes to Muslims and Islamophobia, and espouses this clash of civilizations, this narrow view of Islam as being a faith that is entirely antithetical to the West — that Muslims are a pariah that need to be policed and dealt with by the state.\n\nAlexia Underwood\n\nYou also say in the book that it’s not just Muslims who have been targeted. Talk more about what you mean.\n\nKhaled Beydoun\n\nWhen we think about Islamophobia and who it victimizes, it’s important to be nuanced. So your average Joe and Jane living down the street who might be ignorant or misinformed about Islam, who adopt a racialized view of who Muslims are, these are private Islamophobes. Private Islamophobes can victimize and target non-Muslims.\n\nA quintessential example is Balbir Singh [Sodhi], a man who was killed in Arizona in September 2001. He was a gas station owner, a Sikh man who had a turban and a beard, and he was the first post-9/11 hate crime, or hate murder. \n\nHe wasn’t a Muslim, but because Sikh men fit within this racialized caricature some people have of Muslims, they can be victims to private Islamophobia. Obviously there are South Asian men who are Hindu or Christian or atheist or agnostic. On the West Coast, a lot of Latino men kind of fit within the physical caricature of how people perceive Muslim men.\n\nThe state, whether it be the federal government or even local government, is different. They have a more nuanced and developed understanding of Islam as a consequence of 9/11. They know, I think, at this juncture, based on the war on terror mandate, that Muslims are racially diverse and ethnically diverse, diverse in regard to ideology, and so on.\n\n        Courtesy of Khaled Beydoun\n\nAlexia Underwood\n\nYou mention Black Lives Matter in the book. How does Islamophobia affect a group like Black Lives Matter? How would you connect those two?\n\nKhaled Beydoun\n\nIslamophobia intersects with Black Lives Matter in dynamic and distinct ways. A large number of African Americans are Muslim; we know that anywhere between 25 and 33 percent of the entire Muslim population here, in the states, [is] black. When we think about violent policing, we think about these issues that the Black Lives Matter movement has committed to addressing and dismantling.\n\nI think it’s also important to frame Islamophobia as another aspect of white supremacy. Specifically, war on terror programming, when we think about the state-sponsored Islamophobic programs that I talk about in the book, whether it be counter-radicalization in the Patriot Act, the Muslim ban, and so on. \n\nThese are also tools that are tied to white supremacy. The ultimate, primary objective of Black Lives Matter is to dismantle and do away with white supremacist structures and policies from the state, and that is also the objective of a movement that’s looking to do away with structural Islamophobia. \n\nThe victims of Islamophobia, racist policing, the school-to-prison pipeline and so on, can be black Muslims, they can be Latino Muslims, they can be indigent and working-class Muslims. It’s important to frame that these movements intersect and that they converge in really dynamic ways.\n\nAlexia Underwood\n\nDo you see these movements working together to combat this type of discrimination?\n\nKhaled Beydoun\n\nOne of the positive developments in the context of this current, intense moment is that Islamophobia has become a mainstream social justice issue.\n\nIt’s something that Muslims, but also non-Muslims, are talking about. I’m doing these talks at universities, and you can talk to, for example, a Chinese-American undergraduate at UCLA who knows what Islamophobia is, who has a nuanced understanding that it’s being extended by the state, and it’s been unleashed by private individuals. \n\nThat, to me, is really eye-opening, and I think it marks progress. It foreshadows, I think, even greater strides being made in the future — the idea that there’s a whole range of new communities that are mobilized and committed to fighting Islamophobia in all of its forms.\n\nA second thing is that Muslim America right now has a sizable and growing crop of leadership. Leadership that are really fluent and literate in the language of racial and social justice. I think that’s partly a credit to the Black Lives Matter movement, to be frank with you. I think a lot of younger-generation Muslim-American leaders were really politically empowered, mobilized by the BLM movement. \n\nSo I want readers to understand that Islamophobia is comprehensive: that it’s not only this form of hate and violence coming from individuals on the fringe. It’s far more complex than that. It’s important to see that it’s something that is spearheaded by state policy, and that it’s deeply entrenched, it’s deeply rooted. It’s not a new phenomenon.\n\nI also think it’s a cornerstone racial justice issue, and I hope that that commitment [to fighting Islamophobia] doesn’t fade away when Trump steps down.\n",
      "Folder": "Feedly",
      "Timestamp": "1523033394",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.482565Z"
}