{
  "id": "169c9353620640df8aaea260413478e7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://theringer.com/zach-lavine-kris-dunn-chicago-bulls-new-beginnings-15929274f1ec",
      "Title": "Zach LaVine and the Bulls Could Be Great for Each Other The Ringer - Medium",
      "Selection": "Unintentional New Beginnings\n\nYes, the trade that brought LaVine to Chicago was lopsided, but the franchise’s rebuild isn’t hopeless\n(Getty Images/Ringer illustration)\nThis offseason, hours, podcasts, think pieces, and strong drinks have been devoted to figuring out how blockbuster acquisitions like Chris Paul and Paul George will fit in new roles next year. But what about the less-acclaimed pieces in these trades, the guys exchanged for the superstars? Can a highly paid role player offloaded as part of a “salary dump” ever blossom in a new situation? Or can someone on the cusp of 25 minutes a game fall out of the league? This week we’re looking at the prospects of those players, the Unintentional New Beginnings crew.\n\nOne calendar year was all it took for the Minnesota front office to change its mind on Zach LaVine. Legend (and, well, reporting) has it that during the 2016 NBA draft, the Timberwolves refused to entertain a trade for Jimmy Butler if it meant parting with their own 6-foot-5 shooting guard. But a few picks into the 2017 draft, Minnesota made nearly the exact deal it dismissed the year before. Twenty-two-year-old LaVine, along with Kris Dunn (who Chicago was hot on last go-round) and the seventh overall pick, was dealt to the Bulls for Butler and the rights to Chicago’s 16th pick.\n\nThe trade was a swindle, Tom Thibodeau’s first on the job since he was hired in April 2016 to be the coach and president of basketball operations. (After being fired by Chicago, no less.) Minnesota may have had the best draft night of anyone based on that acquisition alone, but on a micro level, the timing was incongruous. The front office took off LaVine’s “untouchable” tag after an undeniable breakout year.\n\nSelected 13th overall in 2014, LaVine improved in nearly every category during the 2016–17 season, his third, before tearing his left ACL in early February against the Pistons. In the 47 games before the injury, the Washington native averaged 18.9 points per game while sharing the ball with Andrew Wiggins and Karl-Anthony Towns.\n\n“Freak athlete” is an overused term in the NBA, but LaVine deserves the label. His leaping ability nabbed him a spot in the dunk contest as a rookie; his mastery of hovering through air like Dave Chappelle’s Prince won LaVine first place in back-to-back years. Entering his third season, LaVine stopped leaning solely on his vertical. The Wolves needed a perimeter threat, and their two-time dunk-contest champion wanted to become that shooter.\n\nEarly in the season, LaVine told a sideline reporter — to much skepticism, including my own — that in the 2017 All-Star weekend games, it was the 3-point contest he wanted to take part in, not the dunking. Then his identity as a shooter began to sprout. His 3-point accuracy didn’t improve that season from the previous, sloping slightly downward from 38.9 percent to 38.7 percent. But LaVine is forgiven the dip by virtue of his volume: He put up nearly twice as many perimeter attempts as he did the year before. He shot 6.6 per game in 2016–17, far and away the most on Minnesota’s roster.\n\nAnd did they need it. (A not-so-fun fact about the Timberwolves’ 3-point shooting: The second-through-fourth-best averages came from Brandon Rush, a not-yet-re-signed free agent, and the team’s two centers, Gorgui Dieng and Karl-Anthony Towns.) Minnesota shot the fewest deep attempts in the league, another reason why LaVine’s spark was so valuable.\n\nThibodeau told the Chicago Tribune after the trade that “the consistency in which [LaVine] shot the ball” was the area in which he grew the most. “Early on, he was more of a streaky shooter. … Once he settled into being a two guard — and there are times he can bring it up; he can handle that aspect of it — he shot it really well. And he can shoot it deep.”\n\nLaVine did excel more as an off-guard than when slotted at the point, but that limited his touches. Off the ball, he was at the mercy of being a third option to Towns and Wiggins. Playing alongside two Rookie of the Year pre-superstars opened the defense to LaVine, but it sometimes hindered him from doing more. Wiggins needs the ball in his hands to operate, and KAT, well, what offense wouldn’t feed him the rock as often as possible?\n\n“There’d be games where he’d be on fire,” Zach’s dad, Paul LaVine, told the Tribune, “and he thought he didn’t get enough plays. I’d tell him, ‘Those are the No. 1 and No. 2 guys.’ And he was like, ‘I get it. But I’m ready for more responsibility.’”\n\nThose shots will be LaVine’s to take in Chicago. He’ll join a rebuilding roster that will surely give him an elevated role, though how soon his knee will allow him to grace the court is less certain. LaVine told reporters at the ESPYs that his recovery was so ahead of schedule that he expects to be “ready for training camp.” Those close with the team estimate a return around the All-Star break, Zach Harper reported. That’s a five-month difference.\n\nLaVine should be prepared to wait. If any organization is willing to exercise patience with an explosive guard recovering from a knee injury, it’s the Bulls. Not only will a low-expectation season (read: tanking) do the young Bulls well, but the lingering ghost of Derrick Rose still haunts the franchise. Though it feels much longer (the Phil Jackson experience can warp time like that), it’s been only a season since Chicago parted ways with the former MVP.\n\nThe only semblance of that 2015–16 starting lineup now is restricted free agent Nikola Mirotic, attached to the Bulls by only a cap hold. The Rajon Rondo experiment lasted just one season, and only Dwyane Wade remains in Chicago as an established (albeit fading) name on the roster.\n\nFor Fred Hoiberg, who was hired from Iowa State two seasons ago, a group of moldable young guns could lead to his opus. The defense will almost certainly turn from top-10 to muck, all of its former esteem following Butler to Minnesota. Dunn is a solid defender with encouraging upside, but LaVine, who brought the Wolves their fourth-worst defensive rating when he was on the court, represents a more accurate picture of what the Bulls defense could look like this season. But the offense, especially without having to cater to superstars, could finally mimic the pace-and-space style Hoiberg orchestrated in college.\n\nLast season the Bulls offense was set up to crowd near the basket. Butler, Rondo, and Wade all shot better than their career averages from the perimeter, but lacked consistency and combined for fewer than eight attempts per game. Minnesota may have averaged the fewest 3-point tries over the season, but Chicago was the second-least engaged. And the Bulls had the worst effective field goal percentage (which scales to account for the worth of deep shots) of any team.\n\nThis season, with two of the top-three offensive options and Rondo gone, the offense can take on a different identity. It’s impossible to say whether it’s one that will drift to the perimeter, but there are some context clues. The Bulls drafted Lauri Markkanen, a 7-foot sharpshooter (yes, you read that right) with the seventh overall pick. They then promised Denzel Valentine, who was used mostly as an off-ball threat, a bigger playmaking role this season. (Valentine had a rough go from the 3-point line in his rookie season, but he called the team situation “sort of confusing with me just standing over in the corner sometimes just shooting,” which can be chalked up to poor spacing. During his senior year at Michigan State, Valentine shot 44.4 percent from deep.) But the most damning clue of the Bulls’ plan to overhaul its identity is LaVine, whom the team accepted as a new centerpiece for someone of Butler’s caliber.\n\nChicago’s offense could still struggle from the outside, and LaVine will likely be out until at least December. Mirotic (who averaged the most 3-point attempts last season) has yet to be re-signed, and Anthony Morrow (who shot the best from deep) is an unrestricted free agent. Still, without Butler, the Bulls have the opportunity to become something new: a perimeter team. It’s an identity that Chicago will need to take on convincingly to bounce back from the rebuild — kind of like an explosive shooting guard coming off an ACL injury.\n\nZach LaVine and the Bulls Could Be Great for Each Other was originally published in The Ringer on Medium, where people are continuing the conversation by highlighting and responding to this story.",
      "Folder": "Feedly",
      "Timestamp": "1500524173",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.650694Z"
}