{
  "id": "16f8affca9834e3086d5cdb1402d30c8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1038956/a-halal-guide-to-mind-blowing-sex-is-teaching-muslim-women-how-to-set-the-bed-on-fire/",
      "Title": "A halal guide to mind-blowing sex is teaching Muslim women how to set the bed on fire Quartz",
      "Selection": "Even at a slender 65 pages, The Muslimah Sex Manual: A Halal Guide to Mind Blowing Sex packs comprehensiveness. A handbook for Muslim women seeking satisfying love lives, the book starts with the basics—lessons on kissing, sending dirty texts, and the importance of foreplay. After that come chapters on sex positions, shower sex, bondage, and masochism.\n\n“This is the best way to vary your sex life,” said the author, who writes under the pen name Umm Muladhat.\n\nThe Muslimah Sex Manual, independently published in mid-July, has been variously described as groundbreaking and a welcome step. It busts the myth, parading as an Islamic belief, that a pure Muslim cannot be dirty in bed, while giving candid advice. Embedded in it is the message that Muslim women should enjoy a fulfilling sex life.\n\n“You can be pure as snow and still be dirty in bed,” says the manual. “What is amusing (in a sad way) is that many younger Muslims think that the practicing, masjid going, hijab/niqab wearing sisters have dull sex lives and never venture outside of the vanilla.”\n\nGreetings sisters! A wonderful book! I'm thinking of buying one for my auntie Lillah. The Muslimah Sex Manual. http://pic.twitter.com/ITdhAC4XvA\n\n— Umm Ratwa (@ummratwa3) July 18, 2017\n\nIt was a newlywed friend who motivated Muladhat, a practicing Muslim, to write. The friend protested that although she knew how to have sex, she didn’t really know sex. She didn’t know what her husband liked. And, more importantly, she didn’t know what she liked.\n\nThat was the beginning of Muladhat’s impromptu workshops. Everything she had learnt over the course of her marriage, she taught her friend, “fervently hoping that it would help her in her marital life”. A month later, when they met again, her friend was beaming. Muladhat was told: “Please, write this down and share it with other Muslim girls. No one teaches this. We’re thrown into marriage and only know the fiqh (laws taught according to the Quran) and the biology.”\n\nSo that’s what she did.\n\nThe manual details myriad ways to engage a partner, and lists around 100 positions—cowgirl, reverse cowgirl, final furlong, Amazon, among them. “Some couples never move beyond missionary position. If that’s what you two enjoy, that’s perfectly fine! However, not every couple wants to stay vanilla every time.”\n\nAccording to Muladhat, halal sex has some key rules: avoid anal sex, penetrative sex during menstruation, and sex outside of marriage. Pornography too is forbidden—“porn is a lie,” she writes, “porn is one of the worst ways to learn about sex.”\n\nMe reading The Muslimah Sex Manual: A Halal Guide to Mind Blowing Sex on the night of my wedding http://pic.twitter.com/5Vqwonj1x3\n\n— squidward (@bitterbrowngirl) July 18, 2017\n\nMuladhat grew up in a practicing Muslim family but never was she taught to be guilty about sex. “It was never portrayed as something dirty, nor as something that I should feel ashamed about,” she said in an email interview with Scroll.in. “Islam does not criticize sex, see it as dirty, or drum guilt into women. I was taught that sex is something between a husband and wife. Outside of marriage, yes, a person should feel guilty about indulging in it. Inside of marriage, however, it is something to enjoy.”\n\nMuladhat and her husband too have experimented in the bedroom. “Alhamdulillah, my husband and I have always had good communication,” she said. Their go-to source for new ideas is Christian sex and intimacy books because, unlike mainstream guides, these do not include explicit images.\n\nSince the publication of The Muslimah Sex Manual, Muladhat has received a few angry comments. Critics, the few there are, say the book fetishises Muslim women and encourages promiscuity. Muladhat expected this, which is why she chose to publish under a nom de plume. “I didn’t want to become forever associated with the book such that if any future employer would Google my name, they would find this book. My husband is aware I’ve authored the book and has helped me revise it. My friends are not aware, and I intend to keep it this way.”\n\nThe next project\n\nThe few criticisms aside, the reaction to the book has been overwhelmingly positive. In an interview to The Guardian, Shaista Gohir, chairperson of the helpline Muslim Women’s Network (UK), said: “I’m all for women talking about sex. Why shouldn’t they? Talking about sex in Islam is not new, and past scholars highlighted the importance of sexual pleasure for women, which included advice for men to ensure this happens.”\n\nMuladhat told the Huffington Post that she received a letter from a Muslim leader who plans to distribute copies of her book to couples undergoing premarital counselling at his mosque. “He specifically mentioned that he had long felt the need for a book which would talk frankly about sex in marriage without either being so explicit that it bordered on the profane or so bland that it became useless. His only criticism was that he wanted to know why the book was focused only on Muslim women and not Muslim men.”\n\nMuladhat does not plan to disappoint. Her next project is a book aimed at men. “I think it’ll actually be easier than the Muslimah Manual as I have the added perspective of being a woman and thus knowing what my husband does that works. He’ll obviously play a bigger role in helping me write the book than he did in writing the current one.”\n\nThis post first appeared on Scroll.in. We welcome your comments at ideas.india@qz.com. ",
      "Folder": "Feedly",
      "Timestamp": "1501136813",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.567858Z"
}