{
  "id": "171d1790081349f19c720d518e7c7d6c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/20429-preparing-for-eid-al-adha-in-new-york-city-honest-chops-butchery",
      "Title": "How One Halal Butcher is Making a Difference for Eid al-Adha Food52",
      "Selection": "The tale is one of piety, devotion, charity: Ibrahim is to sacrifice his son per God’s request but before his sword can fall, God recognizes Ibrahim’s commitment and spares his son’s life, offering instead a sacrificial ram.\n\nToday, Muslims celebrate Eid al-Adha in commemoration of Ibrahim’s faithfulness and God’s mercy. The holiday is one of the holiest on the lunar calendar and marks the end of hajj, the yearly pilgrimage to the holy city of Mecca. Eid al-Adha is marked by days of prayer, gathering, and feast.\n\nIn New York City, Honest Chops, a halal butcher shop in Manhattan’s East Village, delivers more than cuts of meat in anticipation of Eid. Khalid Latif, a cofounder and co-owner, brings to his business a communal sensibility that guides the shop’s practice. Latif also serves as chaplain and director of the Islamic Center at New York University.\n\nI spoke to Latif in the days leading up to Eid. He talked community and the importance of udhiya, the practice of donating meat to those in need so they can properly celebrate the holiday on their own. The following is from our conversation, edited for clarity and flow.\n\nWhat Muslims Around the World Are Making for Eid\nby Lail Hossain | Founder WithASpin, LLC\n\nHonest Chops came about because there weren't any halal meat stores in Manhattan. There were some in the outer boroughs and there were some stores in Manhattan that would sell halal meat in addition to other things. But there was no dedicated store that only engaged halal meat as its primary product distribution. Honest Chops also came up as an idea when I was trying to brainstorm with some friends how we could create some revenue streams that could go into building out social services that were needed in the community.\n\nAround the upcoming Eid holiday, you are encouraged to slaughter an animal and distribute the meat to people who are in need. Last year, we distributed about three or four thousand pounds of meat to 200 families in need in the extended area.\n\nWhat we're looking to do is to create opportunities for people who are local. There's a lot of food insecurity and hunger issues in the Bronx and Brooklyn. Processes of gentrification tend towards individuals who have lived in certain neighborhoods for generations but get priced out because the incoming stores are charging a lot more than they can afford.\n\nNavigating the Holidays in a Mixed-Faith Family\nby Mayukh Sen\n\nThe meat itself gets delivered to the slaughter facilities that we work with, they slaughter it in the halal fashion, and then the meat gets taken to our butchery. And now this is where it just gets hectic, we've got to break down all these animals and process them in a meaningful way for the people we're distributing them to. We try to divide them into ten to twenty pound bags—some people opt to have the entire portion distributed to people in need, others keep a component of it for themselves. So it's about ensuring that everything is done as per the ritual but that it also reaches people in the best state possible so that there's no real distinction between what they're receiving and what our customers would receive if they walked into the store and bought it for themselves. We feel that everyone should be treated exactly the same.\n\nIn New York City, the beautiful thing you will find is just how deep Islam is as a tradition. There is an estimated 700,000 to 1 million Muslims here and about 200 places for them to pray. Many mosques tend to cater to prevailing cultures, so you'll have a Bengali mosque, a Nigerian mosque, a Turkish mosque, an Albanian mosque. And within that, you'll find people eating the foods that are of their cultures, all that fall under Islamic dietary restrictions. So if you go to a Malaysian mosque, people are going to be eating Malaysian food, celebrating Malaysian holidays. You go to a community like ours where we have people from everywhere, you'll find everything from South Asian food to soul food to Chinese food. And it’s a mix that really caters to the overall experience that you can uniquely find in a city like this. Every aspect of it has some element of communal and social equity. You're sharing with people and enabling everyone to come together. Food varies from culture to culture, but Eid is a celebration, a holiday. One of the reasons it’s encouraged to distribute this meat to local people who are in need is so that they can also celebrate the holiday as meaningfully as possible.",
      "Folder": "Feedly",
      "Timestamp": "1504281164",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.638486Z"
}