{
  "id": "17c5f858174a491cab8b6ba3035acd3e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://work.qz.com/1134172/how-to-give-a-good-presentation-beat-these-five-common-mental-blocks/",
      "Title": "The five biggest lies you tell yourself before giving a presentation Quartz",
      "Selection": "In most of life, you can screw up without drawing too much attention to yourself. This isn’t the case when you’re giving a presentation. All eyes are on you, judging you, and if you do a terrible job, all of them will notice. Right. Away.\n\nIt’s natural to respond to this brutal vulnerability by talking yourself into giving a terrible presentation. But you want to give a good presentation, so when you hear yourself say these five things, you need to talk back.\n\n“This is how it’s always done”\n\nAnd has that worked? If so, can you say that Now is as it’s always been? If you have a Yes to both questions, carry on. Buy a lottery ticket on the way home.\n\n“If my presentation is long, people will know I work hard”\n\nDoes length work for other people when you watch them? If you’re in a culture that needs you to show your work, consider this question: Are there other ways to demonstrate that you work hard while making a shorter presentation? For example, could you include a slide up front that lists all of the activities that got you to your point or offer a longhand document with all the workings?\n\n“I can’t let go of all the information”\n\nYou’re addicted. And here’s the thing, you aren’t letting go of everything altogether, you’re just being selective about how it shows up. You can print out all the information and sleep with it if you need the company. But you want the more important information to shine and not get drowned out by the noise of all the information.\n\n“If I use big words, people will think it’s more important”\n\nYes, but will they understand it? Will the people they’ll ask to help you understand it? At some point your thinking will leave the building—will people outside the building understand your points as you’ve phrased them?\n\n“Using uncommon words makes me feel vulnerable”\n\nIf you’re standing in front of people, believing in something, and asking them to enlist in your point, you’re already vulnerable. Yes, being creative is an act of deviance, and even though humans are wired for creativity, presenting ourselves in new ways makes us feel vulnerable because we fear rejection from the tribe. You’re vulnerable anyway, you’re a human. So, as you write, ask yourself: Is there a shorter, sharper word for this?\n\nOur brains are tricksters, and mental blocks are their weapons. When you catch yourself in the throes of another automated presentation, you must stop and give your brain some lip. Talk back to it. Trick it. Stand up for yourself and your ideas. If you can only handle one question and one jolt to your automatic tendencies, ask this: What’s one thing we can do differently this time? By the tenth presentation… hang on, you just did math ahead of me… yes, you’ll have done ten things differently, and a new approach will have emerged from the fires of presentation hell.\n\nThis article is part of a Quartz series on how to make “pointy” presentations.\n\nMark Pollard is the CEO at Mighty Jungle, a brand strategy agency in New York.\n",
      "Folder": "Feedly",
      "Timestamp": "1511314201",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.524499Z"
}