{
  "id": "17f9b85053d14420bf21c5c7e3a8257f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2017/9/6/16215562/evernote-app-organize-how-to-use-maximum-productivity",
      "Title": "How to use Evernote to organize your life The Verge",
      "Selection": "Finding a great note-taking app is like finding the perfect pair of jeans. They’re hard to come across, but once you do, you’ll always stick with them. The same goes for the best smartphone apps. Some people might still prefer the old, foolproof method of taking notes with pen and paper, but this is the mobile era, and having one good note-taking app on your phone can save you constant hassle. And for students heading back to college, the right notes app can keep you organized and on track.\n\nThat is why Evernote is by far my favorite note-taking app that helps me keep my life in order. I’ve been using the free version since early 2013. One of the best things about Evernote is that it works pretty much everywhere, including iOS, Android, Mac, Windows, and on the web. If you want to get a little bit more from Evernote, such as more devices to sync across, offline access, or more robust storage features, you can sign up for the Plus Plan that starts at $25 annually. I personally feel like the free version will do just fine, as I’ve found 60MB of space to be pretty adequate for notes. But Evernote’s changing prices are one reason The Verge’s Casey Newton gave up on the app completely. Nonetheless, the free tier of Evernote still gets the job done. I’m going to be running through how to use Evernote on a Mac desktop, since that is mainly where I access it. But the app is pretty intuitive and fairly easy to understand on mobile, too. If you’re headed back to school, let’s focus on how to get the most out of this app so you can keep your GPA high throughout the year.\n\nNotebooks\n\nThe first thing to know is that Evernote allows you to organize notes by different “notebooks,” and “notes” within those notebooks. You can simply click the “new notebook” button on the top left corner of the app. Then, you can choose to either make it a private note or one that can be shared with collaborators or classmates. So, say you’re taking four very different classes this semester. You can create a notebook for each of these classes — each with their own notes — and you won’t have to jumble notes for all of them into one place. Instead of carrying around several physical Moleskins, you can have it all in one neat, virtual place. That’s got to be better for both you and the environment.\n\nChecklists\n\nThe neat thing about notes is that you can also decide how you want to view them. I personally prefer the card view, because it gives you a little snippet of your most recent notes on the left and a view of the entire note you’ve selected to the right. But definitely try them in the other views to see which layout suits you best. Once you create a note, there are numerous ways to organize your information. You can add web page clippings, images, and audio recordings all within one note. But perhaps my favorite feature is the check-box bullet point option. It’s great for to-do lists, and is a satisfying virtual equivalent of crossing off things from a handwritten list. You can get super granular and nerdy with it, too, by customizing sections with different colors, fonts, and separate sections with a horizontal line. Get your organizational nerd on!\n\nVoice Notes\n\nIf you’re about to kick off a boring 8AM lecture and you had a late night, Evernote’s voice notes feature might prove very useful. When you don’t feel like typing out your notes, simply hit the microphone button on the far right and select record. Just sit up close to the professor. On Mac, you can choose to have voice recordings saved right to your iTunes library, and they’re equally easy to share on other platforms. You can always go back to the recording later and take your own notes when you’re more attentive. Voice notes can definitely be a lifesaver.\n\nAttachments\n\nThere are two ways to attach files to a note: directly from your computer or from the cloud with Google Drive. For files on your computer, Evernote makes it easy with a simple drag-and-drop function. If you’re a visual learner, it’s easy to drop-in diagrams, videos, photos, GIFs, and anything else that is important in order to give yourself the full picture. For my “post LG Instagram” item on my checklist, I simply dropped the image into the note so I knew exactly which photo I’d be using. There’s also the paperclip icon on the top right corner of the note where you can add attachments that might not be on your desktop. The Google Drive attachment function is great because you can reference a spreadsheet or presentation that can’t be fully created in the free version of Evernote. In my case, I had a very lengthy spreadsheet within Google Docs that was housing all of my hotel, flight, and excursion confirmations for an upcoming trip to Spain. I dropped the attachment into my “Spain” note, and referenced it anytime I needed to add another to-do item.\n\nAdding web clippings\n\nSay you’re doing research for a paper and you want to save articles or web clippings, but don’t want to accumulate a list of URLs with no sense of which article holds what information. There are two ways to save web clippings so that you can have the entire article within a note. The way to do it on desktop is to first add the Evernote Web Clipper Chrome or Safari extension. Once you hit the little elephant icon, you can select which format you want to save the web clipping in. I prefer the “simplified article” option since it removes all the ads and other junk from the site. You can also add a remark, or title for the clip, and select which notebook to add it to. The process is similar for adding from your smartphone. When you’re reading an article, you hit the “share” button, and select the Evernote app from there. You just have to make sure that the Evernote toggle is turned on under “Activities.” The same menu will appear to allow you to add a note.\n\nCreating tables\n\nWhile you can create tables within Evernote, the catch is that they don’t work like your traditional excel spreadsheet. You can’t do simple calculations or really have any advanced formatting. However, tables are at least somewhat customizable by color, size, and border.\n\nSharing\n\nThere are a few ways you can share notes and notebooks. It’s similar to Google Drive in that you can manage permissions by allowing others to either view, edit, or both, and also add in a note for your share. This is great for passing along notes to classmates without copying and pasting into an email and losing the formatting. The other option is to share a note to either LinkedIn, Facebook, or Twitter. I’m not entirely sure why you’d need to do that, but it’s there just in case.\n\nSetting Reminders\n\nReminders are particularly useful if you’ve been procrastinating on a project and need a gentle nudge to get it done. You can title a note the name of your project, and hit the alarm clock icon on the top right corner. Once you do that, Evernote allows you to add a date and time. All of your reminders will also show up in a neat list form above your notes preview if you’re in the card view. This works like a checklist, so once you’ve marked a reminder as complete, Evernote will cross it off like an item on your to-do list.\n\nSyncing\n\nWith the free tier of Evernote, you can sync up to two devices to access your notes. For a college student, this is perfect since it covers both your phone and laptop. If you’re on the subway and remember something last minute, you can open the app on your phone and make a note, but you need to make sure it’s synced so that you see that note on your laptop the next time you open it. How do you know if your work has been synced? If you click on the “i” button on the top right corner, you can edit the metadata of your note and see the last time it was synced. If you just updated a note and need to sync it, click on the two circular arrows button at the top left side of the app. Now you can be sure to find any updates to a note on both of the devices.\n\nRecovering deleted notes\n\nOne time, I accidentally deleted one of the most important notes I had for an upcoming presentation and was horrified that I’d lost it forever. But not to worry, that’s what the “trash” icon on the left-hand side is for. Once you click on a deleted note in this folder, it gives you the option to either delete it forever or recover it. Accidental deletions won’t be a catastrophe. So check in there from time to time if something goes missing.\n\nPresenting\n\nFinally, if you put together a big presentation or plan inside of a note, you can actually present it by entering presentation mode. You access this by hitting the play button icon on the top right next to the alarm clock icon. Presentation mode makes everything look really clean, and there are a few options for how it’s displayed: you can choose between having the note divided into slides with horizontal lines, removing screen breaks, or go with an auto layout.\n\nIt feels like there are endless ways to use Evernote, from making it your simple, everyday notes app to learning some of its more sophisticated features. Use it for school, work, life, and beyond. But hopefully you’ll now go in with a better understanding of how to best make the app feel less overwhelming, and instead make it work for you.\n",
      "Folder": "Feedly",
      "Timestamp": "1504733894",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.636708Z"
}