{
  "id": "18208cb1b1ad4e76b7fe20db3aae9b56",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1618066/trumps-25-china-tariff-how-much-would-it-raise-the-price-of-sneakers/",
      "Title": "How much more a pair of sneakers will cost in the US with Trump’s China tariffs Quartz",
      "Selection": "The US is in the process of increasing tariffs on essentially everything the country imports from China, meaning industries spared from previous tariff hikes are probably going to be hit now. One category where shoppers are likely to start feeling the effect on their wallets is footwear.\n\nAccording to the World Bank, China accounted for nearly 60% of the footwear the US imported in 2017—and nearly all of the footwear sold in the US is imported.\n\nOn May 10, the office of the US trade representative announced it was raising tariffs from 10% to 25% on roughly $200 billion worth of goods imported from China and, at the order of US president Donald Trump, would apply unspecified increases to the $300 billion worth of Chinese goods expected to enter the country.\n\nDespite Trump’s insistence that China will pay the costs of the higher US tariffs, that’s not how tariffs work. The companies importing their goods from China are the ones who pay the duties. They can either absorb the costs and take a hit to their earnings, or they can pass the costs on to consumers by raising prices, which is what tends to be the outcome.\n\nAs Footwear News reported, Footwear Distributors and Retailers of America, a trade organization for the industry, estimated how much an additional 25% tariff on shoes would raise prices paid by consumers at the store. Their figures are based on the “landed cost” of the imported shoes, which includes the price of producing and shipping the shoes, multiplied by three—a standard retail markup that accounts for costs such as warehousing, marketing, transit, labor, and the company’s profit margin.\n\nHere are current costs for a typical pair of sneakers, boots, and children’s shoes:\n\nSneakers\n\nBoots\n\nChildren’s shoes\n\nLanded cost: $14.60\n\nLanded cost: $16.18\n\nLanded cost: $4.25\n\nCurrent duty rate: 14.1%\n\nCurrent duty rate: 37.5%\n\nCurrent duty rate: 9.52%\n\nDuty = $2.06\n\nDuty = $6.07\n\nDuty = $0.40\n\nFinal import price: $16.06\n\nFinal import price: $22.25\n\nFinal import price: $4.65\n\nStandard retail markup: 3x\n\nStandard retail markup: 3x\n\nStandard retail markup: 3x\n\nFinal retail: $48.18\n\nFinal retail: $66.74\n\nFinal retail: $13.96\n\nAnd here are the costs with an additional 25% tariff:\n\nSneakers\n\nBoots\n\nChildren’s shoes\n\nLanded cost: $14.60\n\nLanded cost: $16.18\n\nLanded cost: $4.25\n\nCurrent duty rate: 14.1%\n\nCurrent duty rate: 37.5%\n\nCurrent duty rate: 9.52%\n\nDuty = $2.06\n\nDuty = $6.07\n\nDuty = $0.40\n\nAdditional duty: 25%\n\nAdditional duty: 25%\n\nAdditional duty: 25%\n\nNew duty = $5.71\n\nNew duty = $10.11\n\nNew duty = $1.87\n\nNew final import price: $20.31\n\nNew final import price: $32.36\n\nNew final import price: $6.12\n\nStandard retail markup: 3x\n\nStandard retail markup: 3x\n\nStandard retail markup: 3x\n\nNew final retail: $60.93\n\nNew final retail: $97.08\n\nNew final retail: $18.36\n\nOn a single pair of shoes, the new tariff might not seem a heavy burden, but a similar cost increase across numerous items, including clothing, can add up. Last year, another trade group, the American Apparel & Footwear Association, estimated that an additional 25% tariff would cost a family of four an extra $500 on their typical purchases of clothing and footwear alone.\n\nMaking shoes requires more specialized equipment and knowledge than sewing clothes, so it’s harder for shoe companies to move their manufacturing. But several of the largest sneaker companies, including Nike, Adidas, and Under Armour, have been diversifying their manufacturing away from China, which will help them avoid the worst.\n\nOn the whole, however, the US footwear industry is likely to feel the effect, and footwear stocks are slumping on the news of the escalating tensions.\n\nHopes for a speedy resolution to the trade war between the US and China were slim already, and now they’ve all but vanished. In response to the US hike on tariffs last week, China today said it will raise tariffs on $60 billion of imports from the US.\n",
      "Folder": "Feedly",
      "Timestamp": "1557811468",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.373243Z"
}