{
  "id": "1943d72422e14c98a2ed1afa689dea62",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1008428/why-apples-next-big-investment-should-be-reshaping-capitalism/",
      "Title": "Why Apple’s next big investment should be reshaping capitalism Quartz",
      "Selection": "Late-stage capitalism: such a downer. Consumerism is melting the ice caps, causing social carnage, and burying us under a mountain of sugar. Right?\n\nTrue enough. But what if we could flip this picture on its head? What if we could turn the world’s biggest brands—the brands that consumerism built—into machines for solving the world’s greatest shared problems?\n\nI have a foolish example of how that could look. It centers around Apple, and it owes something to Donald Trump.\n\nStay with me—I’m not a starry-eyed tech utopian. Nor am I naïve when it comes to the primary reason big brands exist, at least as far as most shareholders are concerned: to make money. This idea is practical, and the shareholders should love it, because it would be just as good for Apple as it would be for everyone else.\n\nApple is insanely rich. Back in April, the Wall Street Journal reported that the company’s cash pile now stands at $250 billion. That’s a record for a non-financial company. It’s more than the entire market value of Walmart, Bank of America, and Proctor & Gamble. It’s more than the GDP of New Zealand or Finland. In fact, Apple could afford to give all 4.6 million citizens of New Zealand a cheque for $54,000 dollars. Which would be a nice gesture, given reports that Apple has paid zero tax in NZ for a decade now, despite sales across that period of NZD 4.2 billion.\n\nBut while Apple has been accumulating cash, the product lines are a mess. iTunes is a crime against interface design. Tim Cook says the Apple Watch is selling just fine, but it’s simply not the revolution some people thought it would be. The touch bar: meh. The HomePod, announced at June’s WWDC 2017, was a necessary and expected play if Siri is to stand any chance against Alexa and Google Assistant.\n\nBy any standard, Apple is still a great company. But even the brand’s most ardent admirers have to admit that something has changed since its imperial phase, back when there seemed something different about Apple versus any other company. Apple is at the start of a long, slow drift toward average. And Apple Park, their new HQ in Cupertino that took five years and $5 billion to build, is a pretty powerful symbol of that change. Apple can obsess over door handles for employees, but it can’t fix iTunes for customers. Apple Park is the most exciting new product the company has released since the iPad.\n\nBut it doesn’t have to be this way. Apple can once again become a company that changes everything; it can point the way forward for consumerism in these polarized, post-truth times, and it can save itself in the process.\n\nHere’s how. Most of Apple’s $250 billion is held overseas. Apple hasn’t brought the money back to the US because it would have to pay tax on it if it did. But now it looks as though the Trump administration will reform tax laws to allow businesses to repatriate cash without incurring such a tax hit. If Apple brings back even a fraction of its pile, it will have to undertake some serious thinking: What shall we do with all this money?\n\nHere’s an idea: help reinvent capitalism.\n\nWe live at a time when Apple and other corporations can accumulate unprecedented riches while income for most working people has been stagnating for decades. Indeed, for the last three decades the gains from economic growth have been hoarded by corporations. Inequality in affluent countries is growing. Many economists agree that this is a problem for everyone, because the 1% can’t spend fast enough to support the economy. Under this view, the economies of the US and others are suffering from a chronic lack of demand. That’s only set to get worse when automation eats a ton of middle class jobs.\n\nSo what can Apple do? It could fund the largest trial of the universal basic income ever.\n\nIt’s become commonplace to observe that UBI is an idea whose time has come. A guaranteed income for every citizen could narrow inequality, pump up demand, alleviate the crushing effects of job automation, and solve the emerging crisis in care for the elderly by freeing people to look after older relatives.\n\nWhat’s more, evidence is growing that when you give people free money, they don’t just sleep all day and play video games. They educate themselves. They start small businesses. They care for children and parents. Isn’t that what human flourishing looks like?\n\nTrials of UBI are popping up everywhere. The seed-capital firm Y Combinator is currently running a trial with 100 families in Oakland. Finland is paying 2,000 randomly selected unemployed people €560 a month for two years. Ontario is about to run a trial with 4,000 participants for three years.\n\nThe Y Combinator trial is great, but they are a minnow. We’re still waiting for a true Valley giant to step up and say, “Let’s find answers.” Apple could afford a trial that would surpass any of those in scale. How about 5,000 families, $12,000 dollars each, for five years? That would cost $300 million. Sure, there’s also the costs for set up, running the trial, and researching the data—but it’s small change when you’re sitting on $250 billion.\n\nApart from its money, Apple makes a natural fit for values-based reasons. The company has always positioned itself as an insurgent willing to Think Different in order to fix a broken established order. In 2017, the most powerful way to stand by that heritage is not by making another device: It’s by daring to think different on the system—that is, 21st-century consumerism—that underpins their success.\n\nOf course, Apple can’t fix a problem this big on its own. But if it ran a successful UBI trial, who knows who else would want to get involved? And way before then, just because Apple is showing it even cares about this stuff, it will benefit from a massive upswing in public sentiment, and the revitalization that comes with doing something that really matters.\n\nSo that’s my challenge to Apple. Give away a ton of money. Refocus around an insanely great mission to solve capitalism. Help rewire consumerism for the 21st century by inspiring other brands to act on the urgent shared challenge they are best placed to solve. (Hey, I said it was a foolish idea. Then again, Steve did say to stay foolish.)\n\nThe shareholders probably won’t like it. But finding a way to have a massive positive impact is the best way for any big legacy brand to assure continued survival in the decades ahead. It could change everything. And no one will care about the iTunes interface if Apple truly once again becomes a company on a mission to change the world.\n\nOh and one more thing: Woz says Apple should pay 50% tax. And he likes the universal basic income. That’s basically an endorsement. Right?\n\nFollow David on Twitter. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1498134127",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.659378Z"
}