{
  "id": "1bc0c281da404b80b1ba534c17beb9b8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/699535/donald-trump-cynically-mourns-muhammad-ali-who-tore-apart-his-proposed-muslim-ban/",
      "Title": "Donald Trump cynically mourns Muhammad Ali, who tore apart his proposed Muslim ban Quartz",
      "Selection": "Donald Trump tweeted today that he, like so many people around the world, was mourning the death of Muhammad Ali.\n\nMuhammad Ali is dead at 74! A truly great champion and a wonderful guy. He will be missed by all!\n\n— Donald J. Trump (@realDonaldTrump) June 4, 2016\n\nYet just a few months ago, the three-time boxing champ was railing against Trump’s proposal to ban all Muslims from entering the United States.\n\nIn the wake of the San Bernardino and Paris attacks, Ali published a statement titled “Presidential Candidates Proposing to Ban Muslim Immigration to the United States.” It didn’t mention Trump by name, but it didn’t have to.\n\nI am a Muslim and there is nothing Islamic about killing innocent people in Paris, San Bernardino, or anywhere else in the world. True Muslims know that the ruthless violence of so called Islamic Jihadists goes against the very tenets of our religion.\n\nWe as Muslims have to stand up to those who use Islam to advance their own personal agenda. They have alienated many from learning about Islam. True Muslims know or should know that it goes against our religion to try and force Islam on anybody.\n\nSpeaking as someone who has never been accused of political correctness, I believe that our political leaders should use their position to bring understanding about the religion of Islam and clarify that these misguided murderers have perverted people’s views on what Islam really is.\n\nTrump, after the San Bernardino shootings, said the US should ban all Muslims, from anywhere in the world, from coming into the US. He defended his position by saying it was “probably not politically correct, but I don’t care.”\n\nOn the same day Trump proposed that ban, he also tweeted this:\n\nObama said in his speech that Muslims are our sports heroes. What sport is he talking about, and who? Is Obama profiling?\n\n— Donald J. Trump (@realDonaldTrump) December 7, 2015\n",
      "Folder": "Feedly",
      "Timestamp": "1465060105",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.766868Z"
}