{
  "id": "1d70d1071ae5436a88d824c5e47c0ccd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/news/southwest-american-airlines-class-action-payment/",
      "Title": "Have You Flown With Southwest or American Airlines Since 2011 They Might Owe You Cash! Million Mile Secrets",
      "Selection": "Typically, we expect to spend money on travel and in return, we’re paid out in unique experiences, exposure to new cultures, and adventurous stories to bring home and share with friends.  But now it’s time to check all of your old airline receipts and flight itineraries.  Did you fly on either American Airlines or Southwest Airlines between July 1, 2011, and June 14, 2018?\n\nIf you did, you may be entitled to part of the upcoming settlement these airlines are offering their passengers.  That means money.\n\nBut if you aren’t eligible for this payout, you can still save on travel using miles and points.  To stay up to date on the latest tips & tricks, subscribe to our newsletter.\n\nYou Might be Eligible for a Payout From American Airlines or Southwest\n\nWhy Are Southwest & American Airlines Paying Out?\n\nLet’s back up for a minute…these airlines are paying their customers cash?  What is going on here!?\n\nThis is in regards to a lawsuit that’s going on with multiple airlines (Delta, United Airlines, Southwest, American Airlines, US Airways and Continental) stating that all airlines involved knowingly limited capacity on flights in order to increase their profits.  In other words, they published less than they actually had available so they could charge more for those seats.  Not cool.  All of the airlines have denied this claim, but instead of waiting for the legal process to play out, Southwest and American Airlines have both agreed to settle now.\n\nThese payouts are not insignificant.  Southwest is planning to pay out $15 million and American is tripling that with a $45 million payout.  But given the number of people who will be involved in the settlement, the individual payouts probably won’t be that much.  But even $5 back is a cup of coffee at the airport so it’s still worth looking into!\n\nHere’s How to Qualify for a Payout\n\nMany people will have already received an email from the Domestic Airlines Antitrust Litigation Settlements containing information about the upcoming settlement.  If you haven’t received that email, your first step is to register here to continue to receive updates and new information as it’s produced.\n\nYou’ll qualify for a payout if you purchased a domestic flight on one or both of these airlines between:\n\n  July 1, 2011, and December 20, 2017 (Southwest settlement)\n\n  July 1, 2011 and June 14, 2018 (American settlement)\n\nWill You Get Money Back?\n\nSo far, the answer is that we don’t know.  Again, there’s a good chance that with this many people involved it won’t make sense to distribute this settlement money to everyone.  After lawyers fees, court costs, and all of the other associated charges, the money will either be distributed to those involved in the case or to a charitable organization.\n\nIt definitely feels good to know that these airlines will be required to at least donate the settlement money to an organization that is doing something positive in the world.  And it’s still worth following this case through settlement to see if you actually can expect some money back!\n\nIf you want to stay on top of other travel news, then subscribe to our newsletter.  And be sure to follow us on Instagram!\n",
      "Folder": "Feedly",
      "Timestamp": "1545525402",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.440556Z"
}