{
  "id": "1db4e37a3ba944b3999c8479d79b1403",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/story/viceland-keeps-growing/",
      "Title": "Viceland Keeps Growing—But In What Direction Wired",
      "Selection": "The second season of Huang’s World, chef Eddie Huang's punchy man-on-the-street food and travel show that airs on Viceland, returned in late June. Its first episode, though, carried a heavier load than usual: wading through America’s troubled waters. In a segment following an Inauguration Day visit to Washington, D.C.’s oldest black-owned restaurant, Huang meets with Jared Taylor, founder of the “white advocacy” nonprofit American Renaissance, to discuss the ominous political climate over plates of, as Huang phrases it, “some fire peking duck skins.” Taylor, who considers himself an acolyte of “race realism,” is strong-armed in his frame of mind: in one exchange, he spews a theory about how there is a higher racial probability that you will become a criminal depending on the color of your skin. “The likelihood to commit crime has a clear genetic component to it,” he says venomously. Huang’s face goes blank; watching him, I felt the same mix of irritation and hopelessness his appearance belied. The first season of Huang’s World had visited Jamaica, run afoul of the law in Sicily; the host had confronted his own complicated heritage while visiting Taiwan. To be in his own nation’s capital, confronted with the contempt and hatred that had arguably birthed Trump, felt inescapably unjust.\n\nIt’s one of those moments that is hard to digest, but stimulating all the same—the kind of hallmark segment Viceland has become known for. Huang’s World is one 40-plus shows in a patchwork of scattered, rebellious programming featured on the Vice Media-owned network, which partnered with A&E and launched in February 2016. “We’re trying to make this organism that’s alive,” Spike Jonze, the veteran film and video director who served as Viceland’s founding creative director, said last year before its unveiling. Jonze said he wanted to mold a “channel that is personal, that is people trying to understand the world that we live in.”\n\nIn the 18 months since its initial broadcast, and true to Jonze’s original promise, Viceland has taken a no-holds-barred, documentarian approach to the bulk of its programming. A Season 2 episode of the Emmy-nominated docuseries Gaycation—wherein actress Ellen Page and her best friend Ian Daniel chronicle the pain and pluck of queer individuals—surveys Orlando in the aftermath of the June 2016 Pulse nightclub mass shooting, when a lone gunman fatally shot 49 people and wounded 58 on “Latin Night” (90% of the victims identified as Latino/a). Many of the episode’s moments are difficult to watch, and purposefully so. “These were humble people, just looking for a dream,” one man says of his two friends murdered that night, speaking to Page and Daniel, minutes before they attend their funeral. Later, the duo visit a memorial in which a mother tearfully remembers her daughter who was taken that night. “We have to take the message across the world,” she says. “We have to respect one another.”\n\nHow that respect plays out, though, isn’t always consistent; Viceland is often at its most fraught when it apes the voyeuristic tropes of other cable mainstays. One of the network’s more paradoxical shows is The Therapist—a face-to-face confab that, in certain regards, mirrors Intervention and Rehab with Dr. Drew—where Dr. Siri Sat Nam Singh unpacks the lived experiences of contemporary pop stars, and the habits that have bloomed as a result of years-long mental strains: alcoholism, drug use, depression. Freddie Gibbs opened up about the rape accusations he was charged with, while Katy Perry discussed being plagued by feelings of inauthenticity. The end result is something of an emotional tempest: therapy in the open can feel invasive and cruel, cheap even, but also important in its effort to destigmatize the toxic vocabulary that surrounds the practice, especially in communities where it is frowned upon (The upcoming season of HBO's Insecure in part tugs at the tension of Going To Therapy While Black). At times you want to empathize with the artist, but the thought that this was made for TV—and perhaps not as constructive as an actual, closed therapy session might be, without the spectacle of posture and performance—is never far from the registers of your mind.\n\nThematically, the channel’s collective landscape spans a handful of millennial-targeted provinces: comedy (Funny How?; Flophouse), weed (Bong Appetit; Weediquette), food (the Action Bronson-hosted Fuck, That’s Delicious!), fashion (States of Undress), feminist realities (Woman), modern finance (The Business of Life), and, among a dozen or so more categories, teen culture (American Boyband; Big Night Out). Many are good-humored and insightfully sharp, and burrow into important issues with humor rather than sobriety. In one of the soon-to-be-released, and rare, scripted series, James Van Der Beek stars as DJ and Major Lazer founder Diplo, in the cheekily titled, What Would Diplo Do? It’s a comedic gambit meant to poke fun at the artist, and also perhaps humanize him through a series of awkward encounters as he tours the globe.\n\nDesus & Mero, easily Viceland’s most beloved viral venture, is a current events late-night talk show hosted by Bronx-born Twitter heroes Desus Nice and The Kid Mero, who first became breakout talents with a series of podcasts. The show has hosted guests as varied as author and trans-rights activist Janet Mock, Harlem rapper Juelz Santana, and MSNBC commentator Chris Hayes; New York adoringly described the duo’s sportive, free-form format as “more like a FaceTime conversation than highly produced cable TV.” Watching a recent episode that featured the multihyphenate entrepreneur and artist Diddy, the conversation swayed from honest and relatable to sneakily illuminating, all without trying to be more than it was. “They can see a story about black men and black women, and it don’t have to be a slave story, it don’t have to be about us being incarcerated,” Diddy said, commenting on his just-released documentary about Bad Boy Records, the label he founded. “We could have a story that ends happily even though there was some drama in between it.” But even for its successes, shows on Viceland have veered into offensive and distasteful territory, if not fully crossed the line. Its flagship music docuseries Noisey—which digs into the lives of on-the-rise black artists; it’s profiled people like Lil Yachty, YG, and Danny Brown—has courted controversy for its shallow, uniformed interview style, which, more frequently than not, verges on hipster anthropology and sensationalism.\n\nThe network’s short run has been an admirable push for greater sustainability and relevance, but a puzzling expedition at best. Jumping into a full-fledged daily programming feels curious for a company like Vice, which has long touted its own edginess by embracing counter cultures. It’s not that the shows aren’t innately enthralling—most are—it’s that the TV-streaming-social-media swamp into which they were born into fragments their importance and reach. There are limits to traditional television, after all. Where streaming hubs like Netflix and Hulu allow for a democratization of content—for a modest monthly fee, of course—Viceland caps its viewership by playing within the dated and often costly cable ecosystem. (A rotating cluster of free episodes are viewable on its website each week). Consider, too, that the way we consume TV has changed since nightly blocks had a chokehold on stations like NBC and ABC in the 1990s. Viewers are now loyal to particular shows, not whole networks. My favorites, for example—Blackish, Westworld, Power, Queen Sugar, Shameless, Atlanta, The Blacklist, Veep, and Transparent—span a carousel of networks and streaming platforms.\n\nWhat you’ve heard is true; we live in an era of Prestige TV. There are smart, incisive dramas and comedies and limited-series all around us, shows that, like Westworld and The Handmaid’s Tale, which garnered a combined 35 Emmy nominations last week, want viewers to marvel not just at the labyrinthine storylines, but at the caliber of acting and the heightened aesthetics. These shows intentionally don drag. They demand your attention. Viceland’s banquet of shows stands far outside this realm, and with good reason. On Huang’s World or Funny How?, there is no guise, no forced pantomime, however rotten the truth. What you see is what you get: real stories in real time. All of which is good and well, but with Viceland’s reported meager ratings, will any of it matter if no one is watching?\n",
      "Folder": "Feedly",
      "Timestamp": "1500301888",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.573098Z"
}