{
  "id": "1db635b9944b4792b3f4ef0fefdfe8bd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/22509-legendary-crispy-as-heck-chicken-thighs-we-d-want-for-dinner-any-night",
      "Title": "Legendary, Crispy-As-Heck Chicken Thighs We'd Want for Dinner Any Night Food52",
      "Selection": "We first told you about Canal House’s rule-breaking chicken thighs in 2015. Then, our Genius Recipes fearless leader Kristen Miglore described the skin as “impossibly crisp, enough so to satisfy your darkest fried chicken cravings.”\n\nBut they’re way easier than frying.\n\nFirst, you take everything you know about skin-on chicken and toss it out the window. Instead of searing over high heat, you get a cast-iron pan mostly warm, add the thighs, and leave them to tread their own path.\n\n15 or 20 or 30 minutes later, the fat will be rendered and the skin so crunchy a potato chip would feel jealous. Now flip and repeat.\n\nThe original version features both preserved and fresh lemon and, well, that’s it. Simple and timeless and chic, like a little black dress.\n\nIf you want to make a good thing better, Canal House founders Melissa Hamilton and Christopher Hirsheimer suggest a few accessories: Say, bacon and olives. Or sherry and mushrooms. Between you and me, water and cardboard, too, would be wonderful with this chicken. But I had another idea:\n\nKale and croutons.\n\nWhile the chicken takes its sweet time crisping up, we’ll bring a pot of salty water to a boil. Throw in a mountain of chopped Tuscan kale, also known as lacinato, also known as dinosaur—the shiny, deep green, crinkly kind. Cook for less time than most songs. This gives the kale a head start on sautéing, seasons and hydrates it, too.\n\nNow find a loaf of crusty bread. It could be fresh, made this morning and from your favorite bakery. Or it could be a forgotten in the back of the freezer, behind the coffee ice cream and frost-covered blueberries. Cut into thick slices, then tear into pieces with your hands.\n\nOh, look! The chicken is done. Transfer from the pan to a waiting plate. Leave all that schmaltz right where it is. Add the bread and toss in the fat, cooking until it starts to crisp and turn the color of dark honey. Now add minced garlic and chili flakes (because most things are better with them) and the kale. No need to squeeze or wring the kale out—that lingering water is welcome here, something like Italian pancotto. Nestle the chicken thighs on top. Serve them in the skillet. Or eat from the skillet. I find it tastes even better that way.\n\nCrispy Chicken Thighs with Kale & Croutons\n\nServes 3\n\n1 tablespoon olive oil\n\n6 bone-in, skin-on chicken thighs\n\n3 tablespoons kosher salt, plus more for seasoning chicken\n\n2 pinches freshly ground black pepper\n\n10 cups chopped Tuscan kale (about 10 ounces)\n\n3 cups torn bread chunks (about 6 ounces)\n\n2 garlic cloves, peeled and minced\n\n1 pinch crushed red pepper flakes\n\n1/2 lemon, juice of\n\nGo to Recipe \n\nHave you made the Canal House chicken thighs before? Have you added your own twist? Do tell in the comments.\n\nANOTHER GENIUS RECIPE FOR DESSERT\n\nTags: Chicken, Kale, Weeknight Cooking\n",
      "Folder": "Feedly",
      "Timestamp": "1528746072",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.496996Z"
}