{
  "id": "1e562e0c41964b73b142151c87eaacbf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2020/01/the-economic-policy-of-elizabeth-warren.html",
      "Title": "The economic policy of Elizabeth Warren Marginal Revolution",
      "Selection": "Jerry Taylor has made some positive noises about her on Twitter lately, as had Will Wilkinson in earlier times.  I genuinely do not see the appeal here, not even for Democrats.  Let’s do a quick survey of some of her core views:\n\n1. She wants to ban fracking through executive order.  This would enrich Russia and Saudi Arabia, harm the American economy ($3.5 trillion stock market gains from fracking), make our energy supply less green, and make our foreign policy more dependent on bad regimes and the Middle East.  It is perhaps the single worst policy idea I have heard this last year, and some of the worst possible politics for beating Trump in states such as Pennsylvania.\n\n2. Her private equity plan.  Making private equity managers personally responsible for the debts of the companies they acquire probably would crush the sector.  The economic evidence on private equity is mostly quite positive.  Maybe she would eliminate the worst features of her plan, but can you imagine her saying on open camera that private equity is mostly good for the American economy?  I can’t.\n\n3. Her farm plan.  It seems to be more nationalistic and protectionist and also more permanent than Trump’s, read here.\n\n4. Her tax plan I: Some of the wealthy would see marginal rates above 100 percent.\n\n5. Her tax plan II: Her proposed wealth tax would over time lead to rates of taxation on capital gains of at least 60 to 70 percent, much higher than any wealthy country ever has succeeded with.  And frankly no one has come close to rebutting the devastating critique from Larry Summers.\n\n6. Student debt forgiveness:  The data-driven people I know on the left all admit this is welfare for the relatively well-off, rather than a truly egalitarian approach to poverty and opportunity.  Cost is estimated at $1.6 trillion, by the way (is trillion the new billion?).  Furthermore, what are the long-run effects on the higher education sector?  Do banks lend like crazy next time around, expecting to be bailed out by the government?  Or do banks cut bank their lending, fearing a haircut on bailout number two?  I am genuinely not sure, but thinking the question through does not reassure me.\n\n7. College free for all: Would wreck the relatively high quality of America’s state-run colleges and universities, which cover about 78 percent of all U.S. students and are the envy of other countries worldwide and furthermore a major source of American soft power.  Makes sense only if you are a Caplanian on higher ed., and furthermore like student debt forgiveness this plan isn’t that egalitarian, as many of the neediest don’t finish high school, do not wish to start college, cannot finish college, or already reject near-free local options for higher education, typically involving community colleges.\n\n8. Health care policy: Her various takes on this, including the $52 trillion plan, are better thought of as (vacillating) political strategy than policy per se.  In any case, no matter what your view on health care policy she has botched it, and several other Dem candidates have a better track record in this area.  Even Paul Krugman insists that the Democrats should move away from single-payer purity.  It is hard to give her net positive points on this one, again no matter what your policy views on health care, or even no matter what her views may happen to be on a particular day.\n\nAll of my analysis, I should note, can be derived internal to Democratic Party economics, and it does not require any dose of libertarianism.\n\n9. Breaking up the Big Tech companies: I am strongly opposed to this, and I view it as yet another attack/destruction on a leading and innovative American sector.  I will say this, though: unlike the rest of the list above, I know smart economists (and tech experts) who favor some version of the policy.  Still, I don’t see why Jerry and Will should like this promise so much.\n\nThose are some pretty major sectors of the U.S. economy, it is not like making a few random mistakes with the regulation of toothpicks.  In fact they are the major sectors of the U.S. economy, and each and every one of them would take a big hit.\n\nMore generally, she seems to be a fan of instituting policies through executive order, a big minus in my view and probably for Jerry and Will as well?  Villainization and polarization are consistent themes in her rhetoric, and at this point it doesn’t seem her chances for either the nomination, or beating Trump, are strong in fact her conditional chance of victory is well below that of the other major Dem candidates.  So what really are you getting for all of these outbursts?\n\nWhen I add all that up, she seems to have the worst economic and political policies of any candidate in my adult lifetime, with the possible exception of Bernie Sanders (whose views are often less detailed).\n\nI do readily admit this: Warren is a genius at exciting the egalitarian and anti-business mood affiliation of our coastal media and academic elites.\n\nIf you would like to read defenses of Warren, here is Ezra Klein and here is Henry Farrell.  I think they both plausibly point to parts of the Warren program that might be good (more good for them than for me I should add, but still I can grasp the other arguments on her behalf).  They don’t much respond to the point that on #1-8, and possibly #1-9, she has the worst economic and political policies of any candidate in my adult lifetime.\n\nFor Jerry and Will, I just don’t see the attraction at all.\n\nThat said, on her foreign policy, which I have not spent much time with, she might be better, so of course you should consider the whole picture.  And quite possibly there are other candidates who, for other reasons, are worse yet, not hard to think of some.  Or you might wish to see a woman president.  Or you might think she would stir up “good discourse” on the issues you care about.  And I fully understand that most of the Warren agenda would not pass.\n\nSo I’m not trying to talk you out of supporting her!  Still, I would like to design and put into the public domain a small emoji, one that you could add to the bottom of your columns and tweets.  It would stand in for: “Yes I support her, but she has the worst proposed economic policies of any candidate in the adult lifetime of Tyler Cowen.”\n\nThe post The economic policy of Elizabeth Warren appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1579420005",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.346393Z"
}