{
  "id": "1f49fa09528a4ce6a9560c83153f148a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.blog.google/products/google-nest/nest-hub-max-features/",
      "Title": "101 ways you can use the new Nest Hub Max at home The Official Google Blog",
      "Selection": "Today, we’re launching Nest Hub Max. Hub Max is a Google Assistant smart display that’s the perfect addition to your helpful home—it’s a TV for your kitchen, an indoor camera, a smart home controller, a digital photo frame and a great way to make video calls. It comes in chalk and charcoal for $229 in the U.S. on the Google Store, as well as retailers such as Best Buy, Home Depot, Target and more; it’s also available in the U.K. for £219 and Australia for AUS$349. To give you a glimpse of how Hub Max can be helpful in your household, we gathered the top 101 ways we’ve been using Nest Hub Max in our own homes:\n\nGet entertained\n1. Launch your favorite channels through your YouTube TV subscription by saying, “Hey Google, watch [channel]” to enjoy live TV while you finish the dishes.2. Catch up on the news, sports and your favorite TV shows with a YouTube TV subscription that provides access to 70+ channels—no cable box required. Not sure what to watch? Ask your Assistant, “What’s on TV?”3. You can also enjoy other entertainment services you’re subscribed to using just your voice, including CBS All Access and Starz. 4. Stream thousands of apps from your phone to your Hub Max with built-in Cast functionality. Just open the Chromecast-enabled app on your phone and tap the Cast button.5. Enjoy millions of YouTube videos, from original content to cooking clips to how-to videos. \n6. Jam to your favorite tunes on Hub Max’s stereo speakers from services like YouTube Music, Spotify, Pandora and more.7. Set your favorite music service as your default listening app, so the Google Assistant will search there first when you ask it to play a song.8. Get personalized recommendations on the home screen with Face Match. Just tap the screen to see suggested videos, music, news and podcasts, just for you.9. Can’t decide which playlist or station is right to set the mood? Just say, “Hey Google, open Spotify” or “Hey Google, open YouTube Music.”10. Need a groove to get you ready for a night out? Say, “Hey Google, play smooth jazz\" or pick another genre you like. 11. Don’t want to yell over the music? Use Quick Gestures to pause or resume music, videos and other content—just look at Hub Max and raise your hand.12. Group Nest Hub Max with other smart displays, speakers and Chromecast devices to fill your entire home with music.13. Catch up on the news of the day from a variety of top sources. Just say, “Hey Google, play the news” to get started. 14. For live updates from specific news outlets, just say, “Hey Google, play CBS News” or another outlet.15. Want to learn more about what’s happening within a specific topic? Ask “Hey Google, show me the sports news,” for example. 16. Customize your news by selecting from some of your favorite sources, including hundreds of national and local broadcasters. 17. Control thousands of entertainment devices from all major brands in your home from your Hub Max.18. Lost the remote? Turn your Chromecast built-in TV on or off with a simple, “Hey Google, turn off the TV.”\n\nStay connected\n19. Make video calls to family and friends with Nest Hub Max using Google Duo—and not just to other Hub Max devices, but also to any Android or iOS device.\n20. Stay in view during a video call with auto-framing, so you can prep dinner around the kitchen while you catch up with loved ones.21. Don’t have time for a call? Leave a video message. Say “Hey Google, leave a video message for John” or send a video message from the Duo app on your phone.22. With Face Match, just walk up to Hub Max and your Assistant will let you know about any video messages or missed calls you've received.23. Create reminders for other members of your household, like reminding your partner to walk the dog. Face Match will also surface any missed reminders automatically when they approach Hub Max.24. You can also use reminders to send someone a note of encouragement when they need it the most (“Hey Google, remind Kathy that she’ll do great in tomorrow’s interview”).25. Use Hub Max’s built-in Nest Cam to check in on your pet when you’re not at home. 26. Use Talk and Listen through the Nest Cam to say a quick hello.27. Get continuous video recording, familiar face alerts and more with a Nest Aware subscription.\n\nKeep the memories alive\n\n28. Enjoy photos of your favorite memories from Google Photos on Nest Hub Max’s 10-inch HD screen.29. Find those special memories in a flash with a simple, “Hey Google, show my photos from Hawaii,” and relive the family vacation. 30. Search for photos of your dog, birthdays, weddings and more.31. Create a Live Album so your best and latest shots show up on your Hub Max automatically. Just choose the people (or pets) you want to see.32. Share a Live Album with friends and family, so they can see your latest photos on their smart display, too.33. See a photo pop up that brings a smile to your face? Share it with one of your contacts: “Hey Google, share this photo with Mom.”34. See an old memory and can’t remember the location? Just ask “Hey Google, where was this photo taken?”35. Or say, “Hey Google, favorite this photo” to keep track of the shots you love in the Google Photos app.36. Let Nest Hub Max better blend into your home with Ambient EQ so the screen automatically adjusts to match the lighting in the room. Just say, “Hey Google, turn on Ambient EQ.”\n\nGet help in the kitchen\n37. Discover recipes and see visual step-by-step directions—all hands-free—making Nest Hub Max your digital sous chef to help unleash your culinary creativity. 38. Set multiple timers—for example, one for baking and one for your yoga workout.39. Or name your timer: “Hey Google, set a 10 minute chicken timer.”40. Ask your Google Assistant for quick conversions like, “Hey Google, how many milliliters in an ounce?”41. Stay on track with your nutrition goals: “Hey Google, how many calories are in an apple?” 42. Get access to millions of recipes from top names like Food Network and Tasty. 43. If you need help in the middle of a recipe, “Hey Google, show me how to dice an onion” will pause the recipe and play a how-to video to help you get it right.44. Search for recipes and save them to “My Cookbook” for later. 45. Run out of buttermilk? Ask your Google Assistant to add it to your shopping list. 46. Or ask for a substitute: “Hey Google, what’s a substitute for buttermilk?”47. Next time your timer is going off, silence it by simply saying, “Stop”—no \"Hey Google\" required.48. Or use Quick Gestures to stop the timer with just a raise of your hand. \n\nHave fun with family\n\n49. Have a laugh with your Assistant! Just say, “Hey Google, tell me a joke.”50. Or get the whole family in on the fun by saying, “Hey Google, let’s play Mad Libs.”51. Don’t have the best voice for singing? Hub Max can help you with a rendition of “Happy Birthday.” Say, “Hey Google, sing ‘Happy Birthday.’” 52. Keep little ones entertained with the sounds and images of their favorite animals: “Hey Google, what sound does a hippo make?”53. You can also ask the Assistant to help the kids learn their ABCs; just say, “Hey Google, sing the ABCs.” 54. Control your family’s experience with Filters to allow only family-friendly Actions or restrict access to music with explicit lyrics.55. Enjoy story time together with Disney and Little Golden Books, powered by Family Link. Just say “Hey Google, let’s Read Along.” 56. Sit back and relax with “Hey Google, tell me a story.”57. Set alarms with your favorite characters, from Teenage Mutant Ninja Turtles to Hatchimals. Just say “Hey Google, set a Character Alarm” and the Assistant takes it from there.58. Want to play a song but not sure of the title? Just ask Google to identify the song by saying a few lyrics instead.59. Playing a game and trying to decide who gets to go first? Ask, “Hey Google, roll dice.\"60. Planning ahead for Halloween? Make it spooky with “Hey Google, haunt my house!”61. Ask the Google Assistant to drop you a beat: “Hey Google, beatbox for me.”62. Say “please” or “thank you” when using the Assistant and you’ll often be rewarded with delightful responses. Try “Hey Google, please set a timer for 5 minutes.”\n\nGet things done\n\n63. Start your day with personalized info meant just for you using Face Match. The Hub Max will welcome you with  a “Good morning” greeting and share your reminders, commute or an upcoming reservation when you walk up to the device.64. Unsure about bringing the umbrella? Just say, “Hey Google, show me the weather.” 65. Set aside quiet time before bed with Downtime, and the Hub Max will hold off on sharing notifications or responding to commands.  66. Use Routines to streamline multiple tasks. Say “Hey Google, good morning” and Hub Max can control the lights, temperature, music or more all at once. 67. Set up your personalized commute times and routes in the Assistant app. Then ask “Hey Google, how do I get to work?” and get real-time commute info. 68. Got dinner ready, but no one’s in sight? Swipe down from the top of Nest Hub Max’s screen and tap “Broadcast” to call your family to the table through other Google Nest devices. 69. You can also reply to a broadcast with a “Hey Google, reply,” followed by your message.70. Getting ready for bed and want to dim the lights? Set up a routine and trigger it with something like \"Hey Google, it’s nighttime.\"71. Never lose your phone again. Say \"Hey Google, find my phone\" and your Assistant will call your phone. 72. Waiting anxiously for the spoils of your latest bargain hunting victory? With Face Match, see proactive notifications from your Assistant for upcoming package deliveries, right on Hub Max.73. Use interpreter mode to have a conversation in real time, even when you don’t speak the language. Simply ask your Assistant, “Hey Google, be my Italian interpreter.”74. Making weekend plans? Ask the Assistant to find restaurants nearby.75. Head to the movie theater on a rainy day to catch the latest flick. “Hey Google, what movies are playing right now?\"76. Get help remembering things. Simply say “Hey Google, remember my passport is in my sock drawer.” Then next time you’re looking for your passport, just ask the Assistant and you’ll be reminded.77. Stay on top of your portfolio with the latest information on individual stocks and the global market: “Hey Google, what is [stock] trading at?”\n\nControl your smart home\n78. Manage all your compatible devices in one dashboard with home view. View devices by room, turn the lights on or off with a tap or pause what’s playing on your Chromecast. 79. Use home view to adjust the colors or brightness of your compatible lights so you can get the mood just right.80. Set up your Hub Max with a Nest Hello doorbell and you can see who’s at the front door.81. Turn on the compatible lights in the room you’re in with a simple, “Hey Google, turn on the lights.”82. If you want to turn on all the compatible lights across your home, just ask, “Hey Google, turn on all the lights.”83. Get peace of mind and see your security camera video stream right on your Nest Hub Max.84. Stay under the covers until it’s just right. Say, “Hey Google, make it warmer” to have your Nest thermostat make the room nice and toasty. 85. Start your morning off right. Use a smart plug with your coffee maker and ask your Google Assistant to get things brewing.86. Change your compatible smart bulb colors to set the party mood. \"OK, Google, turn my lights pink.\"\n\nDo even more\n\n87. Too far down the rabbit hole of apps? Get back to the home screen anytime with “Hey Google, go home.”88. Get a daily dose of good news. Just say “Hey Google, tell me something good.”89. Preparing for your upcoming trivia night? Just ask, “Hey Google, who won the NBA Finals in 1990?”90. Ask for help with your next vacation: “What are the best places to vacation in February?”91. Enjoy the silky smooth voice of John Legend answering everyday questions. Just say, “Hey Google, talk like a Legend.” 92. Need to relax? Just ask your Hub Max to play ocean sounds or soothing white noise.93. Get ready for your road trip with help. Just say, “Hey Google, what are fun things to do in Austin?”94. If you’re bored and just want to get out of the house, turn to the Assistant for ideas. “Hey Google, what events are happening today near Chicago?”95. Or stay home and learn some interesting tidbits. Just say, “Ok Google, tell me a fun fact.”96. Learn a new language. Simply say “Hey Google, how do you say ‘how much does this cost’ in French?”97. Brush up on your vocabulary skills. “Ok Google, what does ‘gregarious’ mean?”98. Stay up to date on your favorite sports and teams by asking for recent sports scores and stats. 99. Never reach for a calculator again. \"Ok Google, what's 254 times 13?\" 100. Do (almost) anything yourself. Need to learn how to French braid? There’s a YouTube video for that.101. There’s even more to do with Nest Hub Max. Just ask “Hey Google, what can you do?”\n",
      "Folder": "Feedly",
      "Timestamp": "1568175748",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.375032Z"
}