{
  "id": "20993f3149f040c2b7137a0493daf25f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1022164/adam-grant-explains-how-to-answer-whats-your-biggest-weakness-interview-question/",
      "Title": "In a job interview, this is how to acknowledge your weaknesses Quartz",
      "Selection": "Two years ago, a young woman named Michele Hansen spotted a job opening that piqued her interest. She wasn’t qualified—the posting was for a product manager at an investment company, and she had no experience in financial services.\n\nIn that situation, the voice in your head screams for self-promotion. If you’re applying for a job, you know you need to bend over backward to hide your shortcomings. As an interviewer, when I ask candidates to name their biggest weaknesses, they usually respond with strengths in disguise. I work too hard. I’m too much of a perfectionist. I only won a silver medal in the Olympics.\n\nBut Michele Hansen did the exact opposite. She took a page out of George Costanza’s playbook on Seinfeld: “My name is George. I’m unemployed and I live with my parents.” Instead of trying to hide her limitations, she led with them:\n\n“I’m probably not the candidate you’ve been envisioning,” her cover letter began. “I don’t have a decade of experience as a Product Manager nor am I a Certified Financial Planner.”\n\nHansen got the job. And she isn’t alone. In one study, interviewers gave the highest ratings to business school applicants who were more concerned with being seen accurately than positively. In another study, Harvard researchers asked undergraduates to answer a job interview question about their weaknesses. Only 23% gave actual negative qualities: I procrastinate. I overreact to situations. The other 77% hid their weaknesses inside a humblebrag: I’m too nice. I’m too demanding when it comes to fairness. When collaborators reviewed the answers, they were 30% more interested in hiring the candidates who acknowledged a legitimate weakness.\n\nAlthough applicants believe self-promotion is the ticket to landing a coveted job, the evidence shows otherwise. Undergraduates who played up their skills and accomplishments were not significantly more likely to get job offers. Executives who tried to impress board members with their qualifications did not succeed in landing more board seats. And employees who went out of their way to highlight their successes had substantially lower salaries and promotion rates. Compared to flattery and favors, researchers James Westphal and Ithai Stern explain, “self-promotion is less consistently effective… it is less subtle and more transparent.”\n\nIn a pair of experiments, Alison Fragale and I found that self-promotion only paid off when the audience was distracted enough to remember the information but forget the source. Otherwise, they saw right through it: “If you were that great, you wouldn’t need to boast about your greatness.”\n\nOf course, you can’t get a job if you only focus on your inadequacies. After confessing her lack of relevant experience, Michele Hansen devoted the rest of her cover letter to explaining why she had the motivation and skills to succeed anyway. “I don’t wait for people to tell me what to do and go seek for myself what needs to be done,” she wrote. “I’m entrepreneurial, I get things done… I love breaking new ground and starting with a blank slate.”\n\nThere’s evidence for a backlash against female self-promoters. Trumpeting accomplishments violates gender stereotypes of women as communal rather than assertive and ambitious. (This helps explain Nate Silver’s finding that Hillary Clinton’s approval ratings go up every time she holds an office and down when she’s vying for one.) Michele Hansen overcame that backlash by establishing her deficiencies up front with candor and humility. As a result, her comments about her strengths came across as more credible.\n\nBy admitting your inadequacies, you show that you’re self-aware enough to know your areas for improvement—and secure enough to be open about them. That you’re interested in being hired for what you actually bring to the table, not what you pretend to bring.\n\nIn 1987, the Chicago Sun-Times had to replace their beloved advice columnist, Ann Landers. A young journalist, Jeff Zaslow, was writing an article about the search and decided to throw his hat in the ring. “How could you have the audacity to give advice?” an interviewer scoffed. “I may only be 28,” Zaslow replied, “but I have the wisdom of a 29-year old.”\n\nThey hired him.\n\nThis post originally appeared on LinkedIn. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n\nRead next: Three great questions to ask when you’re being interviewed, from a rock-star management professor",
      "Folder": "Feedly",
      "Timestamp": "1499291553",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.654683Z"
}