{
  "id": "20bd8a9c760d426db7b289762622767b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/19583-the-no-recipe-route-to-the-crispiest-juiciest-fried-chicken",
      "Title": "The No-Recipe Route to the Crispiest, Juiciest Fried Chicken Food52",
      "Selection": "Fried chicken, for some, is the holy grail. People across the country love and obsess over it. Many restaurants and roadside joints have attained cult status, each establishment with its own massive following. Heated debates ensue over who has the crispiest crust, the juiciest meat, the most magical spice rub, and the perfect sides. Now, I know what you're thinking: \"What does a nice Jewish girl know about frying chicken?\" A lot, it turns out. I spent the better part of five years working in a restaurant known for its fried chicken, churning out over a hundred orders for weekend brunch. After Sunday shifts, I would find myself dusted with peppery chicken spice. Buttermilk and seasoned flour coated the backs of my elbows, and I wore a perfume of honey butter. I fry chicken like a pro, and the secrets to making it for yourself are not all that complicated. Follow these simple steps, and you too can be a chicken hero.\n\nThe process for creating proper fried chicken lies in this procedural order: brine, rinse, dip, dredge, fry (or bake!).\n\nBrine & Rinse\n\nIf I could, I would like to take a moment to bask in my love of brine. It is, perhaps, the most important part of this process. Brine is chemistry at its finest. It negotiates the relationship between the water and salt absorbed by whatever is being brined, be it meat or vegetables. It makes any meat juicier and removes the albumen from fish (that goopy white stuff). I even brine my vegetables before I pickle them. Brine can be defined as a water and salt solution, which often contains a bit of sugar. The classic brine for fried chicken often involves buttermilk—a tip wisely picked up from the South. It gives wonderful flavor, and milk, in general, is very good for tenderizing meat.\n\nLet the bird sit in the brine, but not for too long.\nPhoto by Bobbi Lin\n\nThat being said, there are a number of ways to get your fry on. In Nashville, they dry-brine their chicken with salt and hot pepper, which is great for a well-seasoned and spicy bird. (A dry-brine is essentially a spice rub, but not all spice rubs contain salt—here, salt is crucial because it not only acts as a flavoring agent, but tenderizes the meat as well.) Additionally, some people may not like buttermilk, and a standard brine of water with sugar and salt will suffice. I encourage you to experiment and find a method that you love.\n\nDon't psych yourself out before you start, just use a simple ratio. Remember: you only need enough liquid or dry rub to submerge or coat respectively. For every medium sized bird, use 2 cups of brine or about 2 tablespoons of dry rub. If you are using buttermilk or water, add 5 tablespoons of kosher salt to the liquid and 1 tablespoon of sugar, in addition to any aromatics you'd like. Good options include sliced lemons, smoked paprika, fresh or dry thyme, cayenne or red pepper flakes if you like heat, a crushed garlic clove, and my personal favorite: a dash or two of Tabasco. Warm 1/4 of your liquid, with the salt, sugar, and spices or aromatics in it, to dissolve—but do not let it boil! Remove this base from the heat, and add the remainder of your liquid. Stir to incorporate and your brine is ready. You can brine your chicken for 2 or 4 hours to overnight, but no longer than 12 hours. When you remove the chicken from the brine, give it a nice rinse, and make sure any aromatics that may have gotten stuck to it are removed.\n\nDunk & Dredge\n\nWork quickly, like this.\nPhoto by Bobbi Lin\n\nThe process of dunking, dredging and frying happen in quick succession, so it is imperative that everything is in place before you begin. You don't want the chicken to sit for too long after it has been dredged in the flour, because it will re-hydrate and get wet and therefore will not fry properly. You also don’t want to set up your oil too soon, as it will likely get too hot very quickly and then take forever to cool down. I like to set up my dip and my dredge and have either my deep fryer ready, or my cast iron pot filled with fryer oil on a low temperature on standby. More on that in a moment.\n\nThe dip: If you brined your bird in buttermilk, after rinsing you can go ahead and dip it in buttermilk again before dredging it. You can also re-use your buttermilk brine. If you used a saltwater brine and you want to avoid dairy you can use soy milk, but I would recommend adding a couple of tablespoons of lemon juice for the acidity. If you used a dry brine to prep your chicken, you can use either the buttermilk or soy milk dip.\n\nThe chicken needs to take a really, really short micro-nap in the flour (aka, dredge).\nPhoto by Bobbi Lin\n\nThe dredge: After dipping your chicken in either of the options listed above, you can dredge your chicken in seasoned flour. All-purpose flour works well for the dredge, and for each whole bird you are frying, you need a few cups of flour with a tablespoon of kosher salt, and a tablespoon or two of dry spices. The seasoning can mimic whatever herbs or spices used in your brine, but remember to use dry spices as fresh ones will burn! You can use dried thyme or smoked paprika, for example, but simple salt and pepper work wonderfully too. I would also encourage you to try reserving your spices for after you fry, which can deliver a potent seasoning kick. At the very least, lightly salt immediately after the chicken comes out of the fryer.\n\nYou can also toy with the thickness of the crust. If you want an ultra-thick crust, you can go straight from rinsing the brine to dredging the chicken lightly in cornstarch, then dipping in the brine again, dredging again, and then straight into the deep fryer. Perhaps this is why so many restaurants have such heated competition: everyone claims their version is the best. You, however, have the advantage of knowing what you like. Want to keep it simple? Go for the brine, rinse, dip, dredge, and fry route. I promise you will be happy with the result.\n\nLeft hand is for wet ingredients, right hand is for dry.\nPhoto by Bobbi Lin\n\nI cannot stress enough that you should let as much of the dip drip off before you dredge. Excess liquid will form lumps in your flour, preventing it from adhering properly to the meat. If the flour doesn't stick, you'll end up with \"bald spots\" or spots where the meat will burn. Once the chicken is in the dredge, don't shake it around too much because again- you'll form lumps. Use gloved hands and designate one hand for handling wet ingredients, and one for dry. Use the wet ingredient hand to transfer the buttermilk/soymilk dipped chicken into the dredge. Now, use the dry hand to dump flour over the chicken to coat it on all sides with dry seasoned flour.\n\nFry (Or Bake)\n\nNow that you have sorted out your preferred process, it's time to fry. Whether you are frying in a deep fryer or in a cast iron pot on your stove top, the temperature of your oil is crucial. Too low, and your chicken will not cook through; your crust won't get to that perfect golden brown. Too high and you will burn your crust before the meat inside of it cooks all the way. 350° is the magic number. If you are going to fry, I highly encourage you to invest in a candy thermometer. You can clip it to the side of your pot to monitor the temperature of your oil. Fill your pot 3/4 full, and set it on the lowest temperature on your stove while you dip and dredge. This way, your chicken only sits for a moment or two while your oil heats to the proper temperature. I would recommend frying the chicken for 8-10 minutes, stirring occasionally until the internal temperature of the chicken reads 160° F. Taste testing is encouraged, fry up one piece to check your oil, your seasoning, and your cooking time. Cut it open and check!\n\nPatience here is key. Execute your steps one by one with care, monitor the temperature of your oil, and you will be rewarded with beautifully cooked chicken.\n\nPhoto by Bobbi Lin\n\nDon't want to fry? I hear you, it can make a little bit of a mess, and it certainly isn't the healthiest route to go by. Judy Hesser, our founder Amanda's mother, bakes her chicken. It takes slightly longer, but your compensation is in the form of an oil splatter-free kitchen. Also, some pretty tasty chicken. Judy's recipe keeps the chicken in the oven for approximately 50 minutes to 1 hour.\n\nLet's review the process. We brine, in our magical brine, for 2 or 4 hours or overnight. We rinse the salty brine off. We dip, and we dredge, making sure not to transfer too much of the wet dip in our seasoned flour. Finally, we fry in 350° degrees of hot oil for 8-10 minutes until your chicken is a beautiful crisp golden brown, cooked to 160° F, and you are fighting off every member of your household. Oh, and don't forget the sides.\n\nLeslie's Peanut Slaw\nby Emily | Cinnamon&Citrus\nCheese Biscuits\nby Merrill Stubbs\nCollard Greens Braised in Coconut Milk\nby Gena Hamshaw\nJudy Hesser’s Oven-Fried Chicken\nby Genius Recipes\n\nWhat are some of your tricks for fried chicken? Let us know in the comments!",
      "Folder": "Feedly",
      "Timestamp": "1493689769",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.679901Z"
}