{
  "id": "20c3ee7769f04ba59b936b7c6a9df501",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/2017/09/27/one-week-left-to-earn-the-best-deal-in-travel-with-minimal-effort/",
      "Title": "One Week Left to Earn the Best Deal in Travel With Minimal Effort Million Mile Secrets",
      "Selection": "Here’s a friendly reminder for y’all!  Don’t forget that the Southwest Companion Pass will soon be harder to earn.\n\nOn October 4, 2017, the limited-time increased sign-up bonuses on the Chase Southwest Plus and Chase Southwest Premier cards are ending.  So if you’re thinking about applying, you should do it soon!\n\nSouthwest Flies to Picturesque Locations Around the US, Central America, and the Caribbean\nIncreased Bonus With Chase Southwest Credit Cards Are Ending\n\nLink:   Easily Earn the Southwest Companion Pass! All 3 Southwest Cards Offering 60,000 Points\n\nLink:   Southwest Companion Pass\n\nYou have 1 week left to apply for the Chase Southwest Plus or Chase Southwest Premier before their increased 60,000 point welcome offers end.  That’s important to note, because without the increased bonuses, it will be harder to earn the Southwest Companion Pass!\n\nBy earning 60,000 bonus points from 1 personal and 1 small business Southwest card, you’ll have more than the 110,000 Southwest points required in a calendar year to earn the Southwest Companion Pass.\n\nEmily and I consider the Southwest Companion Pass to be the best deal in travel!  That’s because it allows you to bring a friend or family member with you for (nearly) free on any paid and award Southwest tickets for up to 2 years!\n\nNote:   To get a full 2 years of use from your Companion Pass, timing is very important.  The Companion Pass is good through the calendar year you earn the points, as well as the following calendar year.  So if you earn the Companion Pass today, it will be good through December 31, 2018.\n\nIf you apply for the cards now, and wait to complete your minimum spending after your December 2017 statement closes, your points will post in January 2018.  So your Companion Pass will be good until December 31, 2019 (nearly 2 full years!).\n\nHere’s a post about timing your spending to earn the Companion Pass in 2017 or 2018.\n\nBottom Line\n\nThe increased 60,000 Southwest point offers for both Chase Southwest personal credit cards will end next week, on October 4, 2017.\n\nBy opening 2 cards, you’ll earn more than enough Southwest points to qualify for the Southwest Companion Pass.  It’s the best deal in travel!\n\nBut be sure to time the minimum spending correctly to make the most of this deal!\n",
      "Folder": "Feedly",
      "Timestamp": "1506507726",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.623822Z"
}