{
  "id": "21a5d0af40b64eefbf5e811992fbe320",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theatlantic.com/business/archive/2017/06/the-hoarding-of-the-american-dream/530481/",
      "Title": "The Hoarding of the American Dream The Atlantic - Business",
      "Selection": "There’s a certain type of financial confessional that has had a way of going viral in the post-recession era. The University of Chicago law professor complaining his family was barely keeping their heads above water on $250,000 a year. This hypothetical family of three in San Francisco making $200,000, enjoying vacations to Maui, and living hand-to-mouth. This real New York couple making a six figures and merely “scraping by.”\n\nIn all of these viral posts, denizens of the upper-middle class were attempting to make the case for their middle classness. Taxes are expensive. Cities are expensive. Tuition is expensive. Children are expensive. Travel is expensive. Tens of thousands of dollars a month evaporate like cold champagne spilled on a hot lanai, they argue. And the 20 percent are not the one percent.  \n\nA great, short book by Richard V. Reeves of the Brookings Institution helps to flesh out why these stories provoke such rage. In Dream Hoarders, released this week, Reeves agrees that the 20 percent are not the one percent: The higher you go up the income or wealth distribution, the bigger the gains made in the past three or four decades. Still, the top quintile of earners—those making more than roughly $112,000 a year—have been big beneficiaries of the country’s growth. To make matters worse, this group of Americans engages in a variety of practices that don’t just help their families, but harm the other 80 percent of Americans.\n\n“I am not suggesting that the top one percent should be left alone. They need to pay more tax, perhaps much more,” Reeves writes. “But if we are serious about narrowing the gap between ‘the rich’ and everybody else, we need a broader conception of what it means to be rich.”\n\nThe book traces the way that the upper-middle class has pulled away from the middle class and the poor on five dimensions: income and wealth, educational attainment, family structure, geography, and health and longevity. The top 20 percent of earners might not have seen the kinds of income gains made by the top one percent and America’s billionaires. Still, their wage and investment increases have proven sizable. They dominate the country’s top colleges, sequester themselves in wealthy neighborhoods with excellent public schools and public services, and enjoy healthy bodies and long lives. “It would be an exaggeration to say that the upper-middle class is full of gluten-avoiding, normal-BMI joggers who are only marginally more likely to smoke a cigarette than to hit their children,” Reeves writes. “But it would be just that—an exaggeration, not a fiction.”\n\nThey then pass those advantages onto their children, with parents placing a “glass floor” under their kids. They ensure they grow up in nice zip codes, provide social connections that make a difference when entering the labor force, help with internships, aid with tuition and home-buying, and schmooze with college admissions officers. All the while, they support policies and practices that protect their economic position and prevent poorer kids from climbing the income ladder: legacy admissions, the preferential tax treatment of investment income, 529 college savings plans, exclusionary zoning, occupational licensing, and restrictions on the immigration of white-collar professionals.  \n\nAs a result, America is becoming a class-based society, more like fin-de-siècle England than most would care to admit, Reeves argues. Higher income kids stay up at the sticky top of the income distribution. Lower income kids stay down at the bottom. The one percent have well and truly trounced the 99 percent, but the 20 percent have done their part to immiserate the 80 percent, as well—an arguably more salient but less recognized class distinction.\n\nWhy more salient? In part because the 20 percent are so much bigger than the one percent. If you are going to raise a considerable amount of new income tax revenue to finance social programs, as may Democrats want to do, dinging the top one percent won’t cut it: They are a lot richer, but a lot fewer in number. And if you are going to provide more opportunities in good neighborhoods, public schools, colleges, internship programs, and labor markets to lower-income families, it is the 20 percent that are going to have to give something up.\n\nReeves offers a host of policy changes that might make a considerable difference: better access to contraception, increasing building in cities and suburbs, barring legacy admissions to colleges, curbing tax expenditures that benefit families with big homes and capital gains. Still, given the scale of the problem, I wondered whether other, bigger solutions might be necessary as well: a universal child allowance to reduce the poverty rate among kids, as the Century Foundation has proposed, say, or baby bonds to help eliminate the black-white wealth gap fostered by decades of racist and exclusionary government policy, as Darrick Hamilton has suggested. (So often, the upper-middle class insulating and enriching itself at the expense of the working class has meant white families doing so at the expense of black families—a point I thought underplayed in Reeves’ telling.)\n\nYet, as Reeves notes, “sensible policy is not always easy politics.” Expanding opportunity and improving fairness would require the upper-middle class to vote for higher taxes, to let others move in, and to share in the wealth. Prying Harvard admission letters and the mortgage interest deduction out of the hands of bureaucrats in Bethesda, sales executives in Minnetonka, and lawyers in Louisville is not going to be easy.\n\nMembers of the upper-middle class, as those viral stories show and Reeves writes, love to think of themselves as members of the middle class, not as the rich. They love to think of themselves as hard workers who played fair and won what they deserved, rather than as people who were born on third and think they hit a triple. They hate to hear that the government policies they support as sensible might be torching social mobility and entrenching an elite. That elite is them.\n",
      "Folder": "Feedly",
      "Timestamp": "1497616650",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.662117Z"
}