{
  "id": "2226e6612172474d913350c11e6c05d9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://sports.vice.com/en_us/article/remembering-hakeem-olajuwons-phantom-quadruple-double-and-the-mystery-of-nba-stat-cookin",
      "Title": "Remembering Hakeem Olajuwon's Phantom Quadruple-Double, And The Mystery Of NBA Stat Cookin' VICE Sports",
      "Selection": "For a few days, Hakeem Olajuwon made NBA history.\n\nIt was March 3, 1990. Olajuwon, then still known as Akeem, and his 25-31 Houston Rockets were taking on the equally listless 25-31 Golden State Warriors. The 27-year-old Olajuwon had long been entrenched as one of the league's premier stars, a three-time All-NBA first-teamer who had played in a Finals and was fresh off his sixth All-Star appearance.\n\nHe was still four years away from his lone MVP award, and the first of two NBA championships. But by the time the calendar turned to April, Olajuwon had tallied perhaps the most impressive achievement of his Hall of Fame career.\n\nOnly four men have ever recorded a quadruple-double in an NBA game. Olajuwon is the third of those four, with a final stat line of 18 points, 16 rebounds, 11 blocks, and 10 assists. This, however, is not a story about that game, which took place on March 29, 1990, against the Milwaukee Bucks.\n\nRather, this is a story about the first time Olajuwon reached that milestonethree and a half weeks earlier in the previously mentioned Rockets-Warriors game, which saw him credited for what would have been his first quadruple-double. His achievement stood for all of three days, until longtime NBA executive Rod Thorn, then serving as the league's vice-president, reviewed game tape and ruled that Olajuwon's bid had, in fact, come up one assist short.\n\nRead More: By Moving Pau Gasol to the Bench, the Spurs Are Better Than Ever\n\nOlajuwon's phantom assist has endured to such a degree that even today, a quick Google search turns up more than a few articles or videos incorrectly referencing his performance in the game as the league's fifth quadruple-double. His 29 points, 18 rebounds, and 11 blocks from that evening remain beyond reproach.\n\nHis assist total does not. And that matters, not only because of the weird, near-historic nature of Olajuwon's night, but also because it illustrates just how much discretion NBA official scorers once hadand how easily basketball moments could be shaded and fudged into something they weren't.\n\nWhen Olajuwon left the floor that nightafter the Rockets mauled Golden State 129-109the game's official box score credited him with nine assists. Rockets head coach Don Chaney and media relations director Jay Goldberg immediately reviewed the game tape and unearthed what they believed to be an uncredited assist, a feed to Buck Johnson with about six minutes to go in the first quarter. The box score was then updated to reflect 10 assists, cementing the league's first quadruple-double since Alvin Robertson in 1986.\n\nThree days later, Thorn weighed in: The assist would not stand. More than that, he tut-tutted Houston for breaching protocol.\n\n\"If an appreciable statistical change needs to be made after the box score is distributed, the league office is responsible for making the change if it is deemed necessary,\" he told the Associated Press.\n\nThorn also considered fining the Rockets, but ultimately decided against it. From there, things get murky. Longtime Philadelphia Inquirer columnist Bob Ford was among those who wrote about the non-quadruple double after the fact, and his column contained the following passage:\n\n\"(A source within the league office said that if Olajuwon actually had had nine assists, he probably would have been allowed to keep the quad honor. But the tape showed that Olajuwon actually had six or seven assists and was given the benefit of charitable home-town scoring.)\"\n\nRuh-roh. Let's go down the rabbit hole. If as many as four assists were falsely credited in this single, otherwise forgettable game, then how many other NBA numbers aren't exactly on the level? Is league history rife withahemcharitable hometown scoring, with local stars making hay on more than just merit?\n\nHakeem eventually recorded a quadruple double on March 29, 1990. Photo by RVR Photos-USA TODAY Sports\n\nThe answer, of course, is that there's no way to know. That said, Olajuwon's non-historic night isn't the only known example of statistical funny business. In 2009, a former Vancouver Grizzlies scorekeeper named Alex told Deadspin's Tommy Craggs about what he termed \"the subjectivity of NBA statistics,\" and how he \"was good at making them inaccurate.\"\n\nAlex's masterpiece? A 23-assist game from Los Angeles Lakers guard Nick Van Exel that included no shortage of \"comically bad assists,\" credited to the guard simply because the Grizzlies were horrendous. The way Alex explained it, he was bored, and wanted to prove a point about how easily the system could be gamed.\n\nCraggs' article spawned a paper at the 2016 Sloan Sports Analytics Conference titled \"The Van Exel Effect: Adjusting for Scorekeeper Bias in NBA Box Scores.\" The paper's authors, Matthew van Bommel and Luke Bornn of Simon Fraser University, focused on two statistics during the 2014-15 seasonassists and blocks, which according to Alex were basketball's most malleable numbers. This makes sense: an assist is any pass that leads directly to a basket, and a block is something that alters the pathway of a shot. Both are somewhat subjective by nature, and given the flow and speed of basketball, both are open toahemscorekeeper interpretation.\n\nWhile van Bommel and Borrn failed to turn up a league-wide pattern of home teams cooking the books across the board, they did find eight teams whose assist ratios were higher at home than on the road, and nine teams with higher block ratios. Expanding their model to the 2013-14 season, they determined that, league-wide, the predicted assist ratio of a random home scorekeeper to an away team was 0.742, versus 0.792 for home teams. They also concluded that:\n\n\"The leaders in both assists (Chris Paul, Los Angeles Clippers) and blocks (Anthony Davis, New Orleans Pelicans) for the 2014-2015 season may have been aided by their home scorekeepers, as the Clippers scorekeeper was the most generous in awarding assists and the Pelicans scorekeeper was the most biased in awarding blocks to their home team.\"\n\nChris Paul's league leading assist total during the '14-15 season might have been as a result of some stats cookin'. Photo by Gary A. Vasquez-USA TODAY Sports\n\nIn fairness to NBA scorekeepers, van Bommel and Borrn's study found that many teams' home scorekeeping fell right in line with league averages, and that some scorekeepers were actually more generous to the away team. Moreover, it's reasonable to assume that many of the discrepancies may be the result of human error, not stat-cooking. Basketball gets faster all the time, with more passes and more shots; with only so much time to log each action and stat crews that can consist of as few as two people, it's easy to see how things may be missed.\n\nIn addition, oversight from the league office likely is as good as it ever has been. The NBA is fairly transparent: it still issues announcements like the one it did for Olajuwon's quadruple-double, like this one in 2014 that cost LeBron James a triple-double. (Once again, the culprit was a phantom tenth assist.) Digital technology means the league can monitor games in real time, alongside the local crews keeping score; there's no need to send a game tape to today's Rod Thorn.\n\nAll of that said, there's no possible way to know how many old-school assist or block totals were a bit high thanks to favorable local crews squeezing a few extra drops into the bucket. And there's no way to say the possibility of shading stats has completely disappeared; whether it's via unconscious bias or as part of an active agenda, local crews have ample motivation to push the envelope in favor of their own players, and sometimes even opposing ones. In the Deadspin piece, Alex recalled getting praised by a management figure for the Van Exel game, just because it was bound to get Vancouver a rare bit of national exposure on that night's SportsCenter.\n\nIn fact, Alex said, that was the motivation behind the only time he was outright told to manipulate the system. The intended beneficiary, of all players, was Olajuwon, who was one block away from a triple-double. (For what it's worth, Alex recalled that Olajuwon legitimately earned the tenth block.)\n\n\"When you get a triple-double, that dramatically increases the potential of our game being shown on ESPN,\" he told Deadspin. \"'Here are some highlights of Olajuwon, and oh, by the way, they happen to be in Vancouver.'\n\n\"A team like ours was getting zero national media coverage. There's some value in that, even if someone is lighting us up, for marketing and long term growth.\"\n\nAnd that brings us back to March 3, 1993. The Rockets would eventually squeak into the playoffs at 41-41, but at the time they were team mired in the depths of the Western Conference. What better way to generate some sorely needed good press than by having Olajuwon, a budding Hall of Fame-caliber center, reach a statistical milestone that not even Wilt Chamberlain, Kareem Abdul-Jabbar, or Bill Russell managed?\n\nUltimately, we'll never know what happened. Maybe it was an honest mistake. But maybe not. The enduring lesson is what Chaney, Olajuwon's head coach, told the Associated Press after Thorn's reversal came down:\n\n\"What they think is an assist and what we think is an assist must be two different things.\"\n\nWant to read more stories like this from VICE Sports? Subscribe to our daily newsletter.",
      "Folder": "Feedly",
      "Timestamp": "1489103700",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.626730Z"
}