{
  "id": "248b5d2e50524e84a70a4e1093fb2a1f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.fangraphs.com/blogs/scouting-the-white-sox-monster-return-for-chris-sale/",
      "Title": "Scouting the White Sox’ Monster Return for Chris Sale FanGraphs Baseball",
      "Selection": "In what will probably be the blockbuster deal of the entire offseason, the White Sox sent LHP Chris Sale to Boston this afternoon in exchange for two of the highest-upside prospects in baseball, Yoan Moncada and Michael Kopech, as well as tools-goof outfielder Luis Alexander Basabe and arm-strength lottery ticket Victor Diaz. Below are my scouting reports on the prospects involved. I’ll update the White Sox prospect list with these reports later this evening. Moncada will be No. 1 and Kopech No. 2, with Basabe slotting in toward the back of the org’s top 10 and Diaz falling toward the bottom of the 40 FV section.\n\nIt’s strange that one of the hardest-throwing pitchers in the minor leagues is involved in this deal and yet somehow not its headliner. Such is the prodigious talent of Cuban infielder Yoan Moncada, who I believe to be the best prospect in all of baseball despite his swing-and-miss issues. A generational talent who possesses one of the most robust collections of tools I’ve seen, Moncada has an SEC running back’s body at an athletic and strong 6-foot-2, 205 pounds. There are very few, if any, comparable physiques across baseball. He’s also a plus-plus runner, both from home to first and on the bases, scattering large swaths of dirt behind him as he traverses the bases. I think Moncada is going to retain that speed for quite a while despite already appearing to have maxed out physically. Even if he does lose a step with age (and it will probably happen at some point), I expect Moncada to retain impact plus speed into his late 20s or early 30s, even if he’s no longer an elite runner at peak.\n\nThat speed is going to give Chicago some room to consider Moncada’s defensive options. His performance at second base was mixed throughout his tenure with Boston. He certainly has the physical capability to play the position easily. His range and arm strength (an easy 70 on the scouting scale) are both more than enough to play anywhere on the infield, but his work around the bag, general defensive footwork, and sometimes awkward arm action have all led to some inexcusable miscues that most scouts hope will be ironed out with time and reps. Moncada is now 21 and some of those defensive hiccups were prevalent throughout his tenure in the Arizona Fall League, where Moncada continued his late-season transition to third base. I believe, with time and instruction, that he’ll be fine at either second or third, though some scouts are less enamored of his feel for the infield and would like to see him tried in center field, where he has the raw physical ability to be a plus defender.\n\nRegardless of where Moncada ends up on the defensive spectrum, his offensive capabilities are going to profile there. He generates plus-plus bat speed from the left side and is able to hit for opposite-field power despite a swing geared for low-ball contact, something I don’t recall seeing from a prospect before. His bat control is mediocre right now, and I think this is part of why he has struck out so much (30% of the time at Triple-A, 60% in a short big-league stint) during his career. Moncada’s swing from the right side is more conservative, a bit more stiff than his cut from the left side, and lacks big extension. He’s more strength than bats peed as a right-handed hitter but still has plus raw power from that side.\n\nEven with a worse-than-average strikeout rate factored into his hit tool’s grade, I think Moncada is a future plus hitter because, when he does connect, he’s vaporizing baseballs into play and his career-long BABIP and ISO are evidence of that. I think it’s reasonable to say Moncada’s career BABIP rate will rest, at the very least, comfortably above the league-average .300 mark when you factor in his speed and the quality of contact he makes when he does connect.\n\nMoncada is not a finished product, but the raw material is the most impressive in baseball. I think with time he’ll be one of baseball’s best players.\n\nThe White Sox also acquired RHP Michael Kopech, he of the 105-mph-fastball lore and occasional off-field dust-up. I saw Kopech several times during the Arizona Fall League (to which he was sent after dealing with injuries this season), and he’s also an incredible physical specimen with some of the most exceptional raw talent in the minor leagues. During my looks at Kopech this fall, he sat 96-100, touching 101 with some of the most incredible arm acceleration I’ve ever seen from a pitching prospect. His arm action is explosive, though not always well timed, and his arm sometimes is finishing its part of the delivery before the rest of his body is. The overall timing and inconsistent pacing of Kopech’s delivery are what I believe to be the chief cause of his strike-throwing inconsistency to this point, though he sometimes lands off line relative to the plate as well. Despite some effort to the delivery (he throws 100, there’s going to be some effort), there are no real mechanical red flags that indicate long-term strike-throwing issues, no overly violent delivery that seems impossible to iron out. Even if Kopech’s velocity backs down to the 94-98 range under a full-season workload, the fact that he could conceivably command that kind of velocity is kind of terrifying.\n\nKopech’s secondaries are raw but promising. He has poor feel for locating his slider right now, but the pitch flashes plus in the 86-90 mph range and has atypical two-plane movement for a pitch at that velocity when he’s locating down and to his glove side. It projects to plus. His changeup, 91-93 in my viewings, flashes above average despite essentially being an average fastball, because hitters are geared up for 96-plus and see arm speed that indicates that sort of velo out of Kopech’s hand. It also projects to plus and could end up being Kopech’s best pitch.\n\nThere’s obviously a non-zero chance that Kopech, despite his athleticism and young age, never throws enough strikes to start; many scouts with whom I’ve spoken think he ends up in a bullpen, where he’d be a high-octane freak. His off-field issues concern scouts, too. Kopech lost six weeks of his season after fracturing his hand in a March fight with a teammate and missed 50 games in 2015 due to an amphetamine suspension. He carries a bit more risk than a pitching prospect of this caliber otherwise would, which is already a substantial amount of risk due to the velo. I think the ceiling here is that of a No. 2 or 3 starter.\n\nArguably the most interesting prospect in this deal is OF Luis Alexander Basabe, who elicits a wide range of opinions from scouts — opinions that usually hinge on whether they think he’s going to hit. He’s undoubtedly tooled up, a 60 runner with a 60 arm and potentially above-average raw power. His feel for hitting, especially from the left side, is raw. Basabe has issues with timing, getting his weight forward, tracking, and swing length from the left side, though he showed some improvement in his balance and timing as the season progressed. He’s more balanced and controlled from the right side and has better bat control, but there’s still excessive noise in the hands that leads to swing and miss. I’ve spoken with scouts who don’t like Basabe at all, but the defensive profile is favorable and, even if he doesn’t hit, it’s easy to envision Basabe as a fourth outfielder or even a low-end regular who hits at the bottom of the lineup. The upside is, realistically, that of an average everyday player if Basabe shows enough progression with the bat in the coming years. I’m skeptical.\n\nRighty Victor Diaz will also touch 100, sit 94-98, and has very little feel for either of his secondaries with the slider flashing above average while consistently sitting a grade below it. He’s raw for a 22-year-old, both in his feel for secondaries and ability to throw strikes. He profiles as a relief arm whose effectiveness will be dictated by the progression of one of his secondary pitches. If the slider becomes consistently above average, he has a chance to be a setup man, but the control/command profile is probably too raw to hope for much more than that right now. As noted above, he’s an arm-strength lottery ticket.",
      "Folder": "Feedly",
      "Timestamp": "1481076745",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.743360Z"
}