{
  "id": "250aef68254041d3a475ee65ad212ae5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/tldr/2018/11/22/18108195/apple-siri-iphone-donald-trump-penis-wikipedia-fail-vandalism-editing",
      "Title": "Siri thinks Donald Trump is a penis The Verge",
      "Selection": "I’m not even American, but I just spat out a turkey dinner. Apple’s Siri digital assistant thinks that President Donald Trump is a penis. If you use an iPhone to ask Siri how old Donald Trump is, you’ll be greeted with a picture of a penis instead of a photo of the President. At the time of writing, the penis picture keeps coming and going. Presumably, someone is editing the Wikipedia page associated with Donald Trump, or gaming the algorithm that Siri uses to source images.\n\nEither way, it’s an odd bug that has created various incorrect answers in the past. The most memorable Siri fail was when it erroneously thought the Bulgarian national anthem was Luis Fonsi and Daddy Yankee’s “Despacito,” before Apple quickly fixed the result. There’s a whole subreddit dedicated to daily examples of Siri acting crazy, but today’s failure is particularly surprising given it’s Thanksgiving in the US. Today is probably not a good day to ask Siri about Donald Trump in front of the family dinner table.\n\nA Wikipedia editor, speaking to The Verge over direct message, confirmed it was indeed vandalism at play, and from more than one editor. “They have now been blocked indefinitely,” the editor tells us. You can also observe the pubic Wikipedia edit history for Trump’s page to see the back and forth edit war. \n\nUpdate 11/22, 6:05PM ET: Added comment from an editor of Wikipedia confirming the vandalism and informing us that the rogue editors have been blocked. ",
      "Folder": "Feedly",
      "Timestamp": "1542941394",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.451437Z"
}