{
  "id": "2629992e9857412ba9750ff4dd31851b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2016/10/18/13306136/spotify-playlists-tips-tricks-discover-weekly-new-releases",
      "Title": "How to make the most of Spotify playlists The Verge",
      "Selection": "A playlist is one of the best gifts you can give yourself. \n\nPlaylists — where emotions lurk in every shadow and the mysterious alchemy of memory is constantly bubbling and brewing! Playlists — where you can cut the filler tracks and go all killer, all the time. Playlists — not only remind you of your past selves but existential roadmaps to your future self. \n\nThe secret to best consuming music, I believe, is the playlist, formerly known as the mixtape, and before that known as “all the songs dad knows how to play on the harpsichord.” But if you’re like me, playlists are a bit messy, clogging up your Spotify like a mysterious clump of dog hair in your shower drain. How did they get here? And how can I clean this up?\n\nHere are some tips for assembling, organizing, and better enjoying playlists on Spotify.\n\nMake playlist folders\n\nPlaylists are helpful for organizing songs, but what happens when you have so many playlists, you need to organize them? Folders, of course. \n\nYou can start the folder process by right-clicking any pre-existing playlist and selecting “Create Folder.” From there, fill the folder up by dragging and dropping playlists onto the folder.\n\nI find sorting my playlists by seasons to be very helpful, mainly because, like many people, seasons are the way I organize musical memories in my brain. \n \nSeasonal folders are useful for when you’re living in one season, but feeling another. For example, right now it is October, but I’m in a winter mood due to the utter heinousness of this fall. Thanks to my winter playlist folder, it’s been easy to find and listen to a lot of Cat Power and moody covers of “Have Yourself a Merry Little Christmas,” while really chilling the heck out. Don’t let anybody tell you when you can and can’t listen to Christmas music.\n\nIf you’re someone for whom memory is less of a constant, persistent pain that you need to revisit with your listening habits, you might want to sort your playlists by genre or tone.\n\nRecover playlists that you deleted by accident, in a fit of rage, or as an act of self-disgust\n\nOn your Account page, there’s a handy little option to Recover playlists that you’ve deleted. It’s unclear how far back the recovery option goes, but I can still see playlists that I deleted in May. \n\nI restored a playlist today just for kicks. I’m very happy to have 37 Jack’s Mannequin bonus tracks back in my library. \n\nWhy would you do this? Sometimes we delete playlists because they remind us of people or moments we’d rather forget. But like banishing every photo of an ex from Facebook and Instagram, there may come a time down the line when you regret throwing out the memory baby with the bad boyfriend bathwater.\n\n(I really had far too many slightly different Rilo Kiley playlists!) \n\nThink of Discover Weekly as Re-discover Weekly\n\nI’m not sure where the whole “Discover Weekly is incredible” myth got started. Maybe by the sponsored tweets that are now cropping up in subway ads, maybe by my co-workers who won’t stop talking about it and who have praised it on this website and into my ear day after day. \n\nDiscover Weekly isn’t bad. It’s just a little boring, because its algorithms serve you music that sounds like the stuff you already like. In fact, that may be its most useful application. Discover Weekly, by virtue of knowing what you’ve already enjoyed on Spotify, often recommends music you’ve enjoyed elsewhere, like on the radio, or at some impossibly trendy boutique, or off your parents vinyl collection which they unloaded on you when they consolidated to a smaller home when you left for college.\n\nDiscover Weekly: the place where you hear Fleetwood Mac’s Tusk for the first time in a decade, and think, “Hey, this is still the best.”\n\nUse Release Radar\n\nRelease Radar and New Music Friday are the only Spotify-curated playlists that bring me a deep and pure joy. They’re thrilling. You can find them in the New Releases section of Spotify’s Browse tab, and between the two, you’ll get a nice mix of new music from artists you care about and from artists you don’t, but may or may not feel socially obligated to. It’s the best way to stay on top of things, and it’s how I accidentally became addicted to a Nick Jonas song called “Bacon,” which is or isn’t a sex thing and I still don’t know! \n\nThe genre-specific “Early Bets” playlists that Spotify curates, located in the same area, that can also be useful if you’re looking for the “new thing” in indie pop or R&B. \n\nImport all of your long-forgotten Shazam finds\n\nAll those songs that briefly piqued your interest at the club or in a Forever 21 still live in your Shazam account, and you can bring them home to Spotify. The resulting playlist is like a brief, fragmented history of moments in your life that were boring enough to warrant pulling out your smartphone and opening Shazam. \n\nIn the settings of your Shazam app, just select “Connect to Spotify.” Shazam should automatically make you a Shazam-only playlist, which will help you take a trip down memory lane and hang out in the overcrowded high school carpools of yesteryear for an afternoon. \n\n20 remixes of a song you love is a fine workout playlist \n\nAn underrated feature of most streaming services is the absolute glut of remixes of popular songs. Spotify has become known as a haven for these largely because it doesn’t host album exclusives and therefore often lags on getting the rights to big releases. To fill the gap: bizarre remixes and covers. They’re great for jogging until your stomach falls out your butt! All you have to do to get started is hit the search bar with “Can’t Help Falling in Love cover.” (That playlist will be for crying, not jogging.)\n\nMake playlists for your dad if you can’t afford to buy him a birthday present\n\nUse Song Radio, not Spotify’s designated Genre playlists. That way, if you know your dad loves Bruce Springsteen, and you want him to love Frank Ocean, you can play a fun game of six degrees of separation (or 12, and you might have to fudge it a little bit. It’s still a fun exercise!) and thereby manipulate him into getting there. Just go to a track you know your dad already likes, click the three white dots all the way to the right, and select “Go to Song Radio” to see a bunch of related tracks. \n\nHere’s an example playlist I just made for my dad, Jim: \n\nDon’t forget to add a mission statement for your playlist in the description box, and design some custom artwork! \n\nLast but not least: import all of your old iTunes playlists \n\nNow might not feel like the time to step back into your 19-year-old headspace, but that’s fine. It might be the time later, and you’re going to want to be ready. (File -> Import Playlists -> iTunes.)\n",
      "Folder": "Feedly",
      "Timestamp": "1476835063",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.766770Z"
}