{
  "id": "26582f62ec344c1885994e57dffb01cb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1321254/want-to-love-your-job-read-this-article/",
      "Title": "Want to love your job Read this article Quartz",
      "Selection": "The new dream job is none at all. A contingent of ambitious upper-middle-class types are devoting themselves single-mindedly to achieving early retirement, with the goal of liberating themselves from work to later travel the world or pursue a creative passion.\n\nPerhaps the contemporary quest for future unemployment stems from the fact that many jobs seem meaningless and unfulfilling. According to anthropologist David Graeber, author of the recently published book Bullshit Jobs, much work today features a lot of unnecessary busywork. Society didn’t consciously design work this way, Graeber argues, but it’s preventing people from making a “meaningful contribution to the world.” In his 2013 essay, “On the Phenomenon of Bullshit Jobs,” Graeber explains:\n\nHuge swathes of people, in Europe and North America in particular, spend their entire working lives performing tasks they secretly believe do not really need to be performed. The moral and spiritual damage that comes from this situation is profound. It is a scar across our collective soul. Yet virtually no one talks about it.\n\nSo let’s talk about it. Is your job bullshit? I’d argue that it’s not—no matter what you do. The scar across our collective soul comes not from the work itself, but from our perceptions of meaninglessness.\n\nAny job is better than none\n\nI say this as someone who’s had lots of jobs. Some were so meaningful, in fact, that I quit after a few years because the weight of working to solve serious problems became unbearable. Here is a partial list of the positions I’ve held: maid, hotel receptionist, waitress, store clerk, line cook, barista, personal assistant, English teacher, writer of all kinds, lawyer of many stripes, language interpreter, translator, studio manager, and bookkeeper.\n\nHaving done all this stuff, and been unemployed on several occasions, I can safely say that the only thing worse than working is not having a job. That’s a bit of wisdom my friend Kalim Shabazz shared with me when I was 28, in New York, complaining about needing meaningful work. At the time, Shabazz was a master’s student in psychology at Fordham University and a DJ, and I was writing at ABCNews.com. I should have been pretty pleased, but I wanted to do something “real.” Reporting seemed to be merely describing the work of others.\n\nSo I joined the Peace Corps, where I had plenty of time to ponder meaning in a remote Senegalese village of 43 people, 30 of whom were small children. There, I discovered that Shabazz was right. In the village, my role was amorphous. I was supposed to help people with agroforestry and health projects, but the efforts often went awry. It’s fair to say that most of the time the villagers helped me more than I did them.\n\nWhen I returned to the US, my notions about work were completely transformed. Although I’ve had many jobs since, and feelings about them all, I’ve done each with utter conviction for a time. My friend’s wise words stayed with me.\n\nSolving puzzles\n\nIt’s not the job itself that gives us a sense of purpose, but the pleasure of work. Yes, that’s right. Pleasure. Because work at its best—whether it’s pouring coffee or defending the indigent accused in a county jail—is a kind of play. In the moment of doing, meaning doesn’t matter, just the task. That’s a relief from spending time dwelling on the big picture: who you’re meant to be and what you should try to achieve in your life.\n\nWhen we’re working, we’re doing what’s needed, which in some jobs, some of the time—like clerking at any empty hotel—is just being there. When we perform our task well, we’re successful in ways big and small. That feels momentarily great. Your work may not change the world. But your approach to it makes a meaningful difference in how you and those your work with, and serve, feel.\n\nThe pleasure of work “lies partly in flow, in the process of losing oneself in a puzzle with a solution on which other people depend,” Ryan Avant argues in The Economist’s 1843. He believes work is fun, and likens professionals to “master craftsmen of the age” creating “bespoke” products.\n\nHowever, Avant’s view is limited. He believes that “middling wage service workers” don’t have access to the same kind of pleasure. He takes a position similar to that of 19th century philosopher Karl Marx—being occupied by “good work” is living well, and purposeful occupation enables people to realize their full potential.\n\nIt would be fantastic if we all found our best and highest use on the job. But dismissing all service work misses an important point. The puzzle we’re all constantly solving is survival, ideally with minimal friction and conflict and the maximum positive exchanges. When a supermarket bagger makes the effort to pack your shopping in a way that ensures the eggs don’t break, or offers to carry your stuff, that’s a plus. It doesn’t change the course of humanity, but it sure is nice—and ought to make you appreciative of the person doing the job. The bagger, with every customer, solves the puzzle of packing and earning a wage, hopefully making their portion of the world run smoothly.\n\nWhat’s more, it’s impressive when anyone does anything with verve. Just ask Michael Gates Gill, author of the 2008 riches-to-rags tale How Working at Starbucks Saved My Life. There’s dignity in doing whatever must be done, according to the former advertising executive. Gill, who became a barista in his fifties, says his younger coffeeshop boss taught him an appreciation for occupation. She offered him a job interview when he was unemployed, depressed, and buying a latte as consolation—not planning to ask for work. He was shocked to discover he was incredibly grateful for the opportunity, and envious of the young woman’s confidence and pride in her position. He clinched the interview by describing how he’d handle customers in tough situations—in other words, proving that he was up to solving the puzzles that service work presents.\n\nPerhaps, as Avant himself points out in his essay, he’s overly-identifying with his great writing job. For him, work is a delightful “prison” he doesn’t wish to escape. But work isn’t exclusively satisfying when you’re paid a lot and can feel a bit smug about your wonderful position.\n\nDifficult, thankless, low-paid work may be undervalued societally, but it’s critical to everyone. And every job has some possibilities, not recognized by snobs. When I worked as a maid at Israel’s only ski resort in the Golan Heights, it wasn’t fun scrubbing toilets. But it was an interesting location and soon enough, my manufactured zeal for cleaning led to a job at the front desk, where I spent a lot of time talking to local Druze workers who I never would have met otherwise.\n\nIn a similar vein, Gill’s boss at Starbucks, who grew up poor, went from barista to store manager, and she was proud of her position. She was able to help a seemingly privileged man in a fancy suit get his bearings again when he was sick and broke, although neither of them would have imagined she’d ever be able to help someone like him.\n\nNo exit\n\nJohn Danaher argues in The Philosopher’s Magazine that all this talk of jobs and purpose is precisely the problem with postmodern society. In his recent essay, “The Case Against Work,” Danaher, a law lecturer at the National University of Ireland in Galway, contends that—love it or hate it—we’re all obsessed with work. People either humblebrag about their busyness, or they “virtue signal” defiance of the societal preoccupation with labor by boasting about work-life balance. “I think we have got caught up in game that deadens our spirits and limits our horizons. We need to escape,” he writes.\n\nThere’s that word again—escape. Instead of playing this necessary game with spirit, Danaher argues that we should understand work as “bad.” He—like Avant and Graeber—believes that only a few workers have it good, and so on behalf of all those who don’t have the supreme fortune to be academics, journalists, or “master craftsmen,” everyone should consider work problematic.\n\nDanaher defines work as “the performance of an activity for economic reward or in the hope of receiving some such reward.” He believes that work is bad because many employment contracts allow employers to undermine worker freedom. But because jobs are increasingly precarious, workers accept this awkward position, as we need to make a living. Then, our brains are “colonized” by work, Danaher contends, contemplating employment even when we aren’t paid to labor.\n\nBut as anyone who has been under- or unemployed knows—which is many of us, thanks to the very vagaries of employment Danaher discusses—much worse than work is worry about its absence. Struggling to figure out how to pay for food and shelter, wondering when or if you’ll work again, and trying to avoid spending money leaves little mental space for creativity and is more tedious than bitching about office politics or a boring gig.\n\nFor most of us, work is necessary. Treating our working years like a kind of purgatory and dreaming of early retirement is perhaps fine if you’re a magical being with a guarantee that you’ll live a long time. But you probably aren’t, so you’re better off learning to live, work, and play now.\n\nThe answer isn’t escape from a “voluntary prison,” but a new way of thinking about how we spend our working days and breaks—making today matter, both on the job and during time off. The quality of our lives depends, in part, on our perception of existence. Or, as William Shakespeare wrote in Hamlet when the Danish prince called his land a prison, “There is nothing either good or bad but thinking makes it so.”\n\nThat’s not to say that all jobs are so great that you should stay in them forever. You probably couldn’t even if you wanted to. Change is the only constant on the postmodern career path, and job security is a thing of the past.\n\nBut working isn’t inherently bad. It’s labor that makes free time so great, for example, and—if it’s lucrative, or if you’re frugal—what allows you to pursue travels and passions.\n\nThe gift of contrast\n\nContrast—as the Tao Te Ching teaches—is key. “Clay is made into vessels; but it is on their empty hollowness that use depends. The door and windows are cut out to form a house; but it is on empty space, that its use depends. Everything is shaped by nothing,” according to the Taoist sage Lao Tzu. Labor gives leisure time flavor—it is because you hustle on the job that days off doing nothing but reading or hanging with friends are fun.\n\nMoreover, whatever your job, it has some satisfying aspects, even if only because it lets you pay your way. That is nothing to scoff at—in a capitalist society, people who prize freedom can surely be pleased when they don’t need the assistance of a government reluctant to give.\n\nMore than that, you have a vested interest in finding ways to appreciate even the most boring work. Perhaps with time, you will find a perfect way to spend your days. But for now, dwelling perpetually in dissatisfaction will only compound unhappiness and make you less likely to find your way.\n\nWe shouldn’t, in the words of transcendentalist writer Ralph Waldo Emerson, “shun the rugged battle of fate, where strength is born.” His classic 1841 essay “Self-Reliance” scoffs at those who need to immediately and obviously succeed or be special. Instead, he exalts the “sturdy,” someone “who in turn tries all the professions, who teams it, farms it, peddles…in successive years, and always, like a cat, falls on his feet.” That admirable person, “does not postpone his life, but lives already,” according to Emerson.\n\nDisrespect for your own work can lead you to disrespect the work of others, too.  If you can only admire the few powerful people who make it big, you’re dissing almost everyone and missing out on humanity’s dignity.\n\nBeing adaptive is a critical life skill that’s practiced at work, whatever job. Understanding this, you can take an interest in pretty much anything for some time and, as a result, become more interesting and accumulate experiences that will inform your next steps. As Stanford psychologist Carol Dweck points out, interests aren’t inherently fixed. Having a growth mindset, being open, is wiser than pinning your hopes on a single passion; it makes you more resilient, creative, intelligent, and happy.\n\nEven if you’re not naturally passionate about serving cranky customers, for example, or reading corporate law documents, you can discover that these puzzles, too, present fascinating discoveries and solutions. Service work is a kind of diplomacy training ground that helps you in office jobs and beyond. Doing temporary legal document review projects in New York—considered by many to be the saddest drudgery of lawyering—ended up leading me to a job at Google headquarters in California. There I got to read the privileged mail of some of the world’s most powerful technologists, among other delicious private business records. Not only was it fascinating, it taught me all about the brave new world we live in.\n\nCultivating appreciation for the mundane is also good preparation for the dreamed-of moment of freedom. Assuming you can someday retire, you’ll need to be practiced at the fine art of keeping yourself busy and fulfilled. Your empty days may be very painful if you can’t manage to appreciate small pleasures.\n\nIt is what it is\n\nThe point of your work doesn’t have to be earth-shattering or dramatic. It just has to matter to you because you’re doing it, and some things must be done.\n\nAs the eighth-century Chinese Zen master Chao Chou told a monk who sought philosophical secrets, “Wash your bowl.” The exchange is sometimes thought to explain the spiritual significance of simple tasks, but it’s not that complex.\n\n“To attribute meaning to an event or to a lifetime of events is an expression of dissatisfaction with things as they are,” writes author and Chico State University Buddhist ethics professor Lin Jensen. What Zen teaches, by contrast,  is that reality is sufficient. “We’re not here to represent something else. We’re here in our own right. A human being, or a garden hoe for that matter, is complete in itself,” writes Jensen. He believes Chao Chou is showing the monk that everything he seeks to know or be is already present in him.\n\nWork is a game, like Danaher says. So treat it like grown-up play, not something to escape. It can be fun, but it doesn’t have to be so important or representative of anything. That’s okay too.\n\nGiven the precariousness of employment today, you may find yourself needing to do something new soon enough anyway. Then, when the robots take over the job you don’t hate, you’ll be flexible enough to figure out your next steps and do whatever else must be done with admirable aplomb.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1530893527",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.455527Z"
}