{
  "id": "27b3622d485c4afb83f07fd3170f1114",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/southern-california-family-road-trip/",
      "Title": "12 Stops to Make on Your Southern California Family Road Trip The Points Guy",
      "Selection": "We’re all California dreamin’ once in a while, so when the Golden State calls you for a visit, bring along this handy list of hot spots for a family road trip with kids stretching from San Diego to Santa Barbara.\n\nOne caveat: There is so much to do in Southern California, that it can be overwhelming. Take it from a local — don’t make yourself crazy trying to hit everything in one trip. Plan for at least five nights so your family can properly enjoy the sights and avoid being stuck in the car the whole time.\n\nThe view at sunrise from Santa Barbara’s East Beach.\n\nSan Diego\n\nStart with flying into the super easy San Diego International Airport (SAN) and hop the shuttle to its brand-new rental car facility. Once settled into your vehicle, you and your family will be ready to roll on over to some of the great experiences San Diego has to offer.\n\nWarm Sands: Visit La Jolla Shores Beach for warm sand, clean beaches and family-friendly waters. You can bring a picnic lunch and spread out on the grass, or walk into the nearby village for sandwiches or tacos. Up the road a bit is the stunning Scripps Institute of Oceanography and the UCSD Birch Aquarium. (Entrance to the aquarium is $19.50 for adults, $15 for kids 3–17 and free for kids 2 and under.)\n\nWild Animals: San Diego is famous for the zoo, and it is really an amazing place. However, the San Diego Zoo Safari Park is a less-crowded and very interesting alternative when you have a car. (A one-day pass is $56 for adults and $36 for kids 3–11.) The safari park is about 32 miles from downtown San Diego, and well worth the drive to see wild animals in their natural habitats. Giraffes, gazelle, rhinos and more all graze on open acres of hilly grasslands. For an extra fee, consider the Caravan Safari package that allows families an even closer view of the animals. ($125 per person plus park admission; participants must be 6 or older.)\n\nGet up close and personal with the animals at San Diego Zoo Safari Park.\n\nLegos for Days: If your kids are younger, Legoland California is an all-time favorite. Exhibits and characters made completely of Lego bricks dot the park landscape. Rides and shows are geared to an audience 12 and under, but parents and older siblings will have a pretty great time here too. For an amusement park, the food is pretty darn good and there is plenty to keep you busy for the whole day. Legoland is in Carlsbad, about a 40-minute drive from downtown San Diego. (Admission is $90 for kids and $95 for adults if bought in advance online.)\n\nRelated: The Best Credit Cards for Entertainment Spending\n\nAnaheim\n\nJust over an hour up the coast from San Diego, Anaheim is home to the Disneyland and Disney California Adventure parks, among other attractions. It would be hard to drive past the Matterhorn and Space Mountain without stopping for a visit, so by all means stop and stay a spell.\n\nAlways a favorite — everyone loves the Mad Tea Party ride at Disneyland (except Dad — ugh).\n\nSo Much Disney: Anaheim would be a sleepy orange grove without the dreams of Walt Disney, and his Disneyland and Disney California Adventure Park are a magical legacy. The parks, just down the road from Disney studios, are a little more quaint and OG than Florida’s Disney World. Buy the two-day Park Hopper Pass as you simply cannot do it all in one day, though three days might be too many unless this is your only destination. Admission to Disneyland parks varies. (Here’s where to stay at Disneyland.)\n\nKnott’s Berry Farm: Amusement park junkies should consider including a quick visit to Knott’s Berry Farm. Just 10 minutes from Disneyland in Buena Park, Knott’s is one of our kids’ favorites for straight-up thrill rides. Without all the Disney hoopla, this park does a great job with crowd management and plenty of entertainment (and some stomach-dropping rides that had us all in laughing fits). Plus, they have darn good berry pie a la mode — it is the same family that started the jam empire. (Daily admission for ages 3 and up starts at $49 per person.)\n\nRides for both daredevils and littles are easy to access at Knott’s Berry Farm.\n\nTrendy Food Hall: When you grow weary of amusement park food, drive 10 minutes to the Anaheim Packing District for decent grub. A converted orange-packing warehouse, this collective is a group of interesting food vendors spread across two large floors. We love this place because the food is fresh, healthy and diverse, so we can all get different things and still sit together in the center court.\n\nLots of great food choices at Anaheim Packing District.\n\nLos Angeles\n\nBroadly known as “LA,” the Los Angeles area is vast. It’s comprised of many cities and neighborhoods that run together in a jumble. A car and much patience is necessary for getting around this area, and a good mapping app on your smartphone will help you gauge traffic flow. (Don’t make these mistakes that travelers make in Los Angeles.)\n\nThe rides on Santa Monica Pier\n\nCarnival Over Water: The Santa Monica Pier and surrounding beach, often used for TV and movie scenes, are a must-see. On the sand near the pier, locals and visitors can show off their skills bouncing on a springy tightrope, rolling across the sand in giant inflatable “hamster balls” and swinging on giant monkey bars. On the pier, enjoy the rides at Pacific Park throughout the day and into the night. Restaurants and shops help entertain those who might be less ride-inclined. You can buy a wristband that entitles you to unlimited rides all day for $32 (ages 8 and older) and $17 for kids 7 and under. Otherwise, pay per ride. Admission to the park itself is free.\n\nGlass Slide Above Downtown: Not for the faint of heart, OUE Skyspace is part Hollywood museum/part observatory/part thrill ride as it perches 70 stories above Downtown LA. The views from here are exceptional, with outdoor balconies sporting nearly 360-degree views of the Hollywood sign, Santa Catalina Island, the sometimes-snowcapped San Gabriel Mountains and more. But that slide! Curving around the outside of the building, the slide is completely made of high-strength glass. Sliding down that tunnel means stomach-dropping views through the floor to the streets more than 1,000 feet below ($25 for adults and $19 for kids 3–12, plus $8 per person for the slide).\n\nIt’s unnerving to slide on glass 1,000 feet in the sky.\n\nPlanets Day or Night: At the famous Griffith Observatory, our solar system and galaxy are on display in various entertaining and scientific ways. Exhibits feature discoveries about the planets, space and our views of them throughout human history. The huge telescope was not in operation when we visited, but good timing might allow guests a peep into the stars. Along with an excellent planetarium ($7 for adults, $3 for kids 5–12 and free for those under 5) and various shows throughout the day, this is a different kind of star-struck Hollywood experience. (BTW, the Hollywood sign is directly adjacent and looks enormous up close.) Note that the observatory is closed April 22–May 6, 2019.\n\nThe first telescope Griffith J. Griffith used to view the stars, on display at Griffith Observatory\n\nSanta Barbara\n\nOne of our favorite cities in California, Santa Barbara, is about two hours up the coast from LA. The view as you hit Ventura and drive up along the beaches and oceanfront is one of the most beautiful highway vistas on the West Coast and well worth the drive. (You could plan to fly out of Santa Barbara Airport (SBA) or choose to drive back to Los Angeles and depart from LAX.)\n\nThe Queen of Missions: Built in 1786, the Santa Barbara Mission is the 10th of 21 constructed as part of Father Junipero Serra’s sojourn from Mexico to Northern California. Every California fourth grader learns about the missions of California, which means our kids could recite interesting facts about how adobe bricks are made and the fine art of basket weaving. This stunning mission is so well preserved that guests can really get an authentic feel for mission life in early California. Time your spring visit to coincide with Santa Barbara’s I Madonnari Italian street painting festival, when renowned artists paint masterpieces on the pavement outside the mission steps.\n\nVisiting the Santa Barbara Mission on the right day, we enjoyed the chalk painting festival.\n\nBicycle Built for Two (or Four or Six): On the waterfront near Stearns Wharf, a variety of two- and four-wheeled cycles are available for rent by the hour (prices vary). The ride along the paved boardwalk is one of the most beautiful in California, with wide beaches, waving palms and gorgeous ocean views. For families with younger kids, the four-wheel buggies might be the best bet. On our last visit, we left our kids asleep in the hotel room and rented bikes for an early morning view of the local fishing boats heading out for the day’s catch.\n\nA ride along the Santa Barbara beach boardwalk is a great way to enjoy this city.\n\nFood and Photos: Near the wharf, a once-blighted warehouse district has been reclaimed as the Funk Zone. Wine-tasting rooms, trendy restaurants and fun art exhibits have given this area a lot of character. We explored the Funk Zone by taking a great food tour called “Eat This, Shoot That!,” an combination of a walking eat-a-thon and food photo class. Our tour guide instructed us on how to take great pictures of food with our smartphones while we tasted and sipped our way through the streets. (The tour costs $99 for adults and $89 for non-drinkers and kids 6–21.)\n\nOn the Eat This, Shoot That! walking food tour, we sample great dishes.\n\nWhere to Stay\n\nWe’ve done this drive a few times now, discovering new things to do each time we visit. Along the way, we’ve stayed at some great hotels. If you’re planning your own Southern California road trip with kids, you may want to choose one hotel group for the entire vacation to consolidate using elite status or earning points via various promotions. We chose Hilton, largely because of its extensive Hilton Honors program that allowed our family to cash in points for some stays while amassing new points at other properties.\n\nEvery view is fantastic from the Hilton San Diego Bayfront.\n\nSan Diego\n\nHilton San Diego Bayfront: Downtown on the waterfront, this high-rise hotel is centrally located with all the conveniences. Award rates from 31k–60k points per night.\n\nHilton La Jolla Torrey Pines: Overlooking the famous Torrey Pines Golf Course and ocean beyond, this hotel is near beaches and a fun hang glider port. Award rates from 43k–50k points per night.\n\nAnaheim\n\nHilton Anaheim: Across the street from Disneyland, the Hilton Anaheim is in the midst of it all and slightly removed from the bustle of Disneymania. (Here’s some information if you’re debating staying on-site at Disneyland or at an off-site property.) Award rates from 33k–50k points per night.\n\nLos Angeles\n\nHilton Los Angeles/Universal City: Literally walking distance to Universal Studios and Universal Citywalk, this large hotel also is very close to Hollywood. Award rates from 50k–60k points per night.\n\nThe Beverly Hilton: Steeped in Hollywood history, the Beverly Hilton is an original grand dame and host to the Golden Globe Awards each year. Award rates from 60k points per night.\n\nThe Beverly Hilton Hotel has been host to many celebrities over the years.\n\nSanta Barbara\n\nHilton Santa Barbara Beachfront Resort: This hotel is right across from the city’s main beach and is a short walk to the wharf, Funk Zone and more. From 59k–80k Hilton award points per night.\n\nThe view from our room at Santa Barbara Hilton.\n\nIf you’d like to stay at Hilton properties on your Southern California road trip too, there are some good welcome bonuses available for its cobranded credit cards.\n\nCredit Card\n\n Welcome Bonus\n\nTPG Bonus Valuation\n\nAnnual Fee\n\n   Elite Status\n\nHilton Honors American Express Aspire Card\n\n150,000-point bonus after you spend $4,000 in the first three months. Terms Apply.\n\nTPG values the bonus at $900\n\n$450 annual fee (See Rates & Fees)(up to $500 in annual travel credits)\n\nHilton Diamond status\n\nHilton Honors American Express Ascend Card\n\n125,000-point bonus after you spend $2,000 in the first three months. Terms Apply.\n\nTPG values the bonus at $750\n\n$95 annual fee (See Rates & Fees)\n\nHilton Gold status\n\nHilton Honors American Express Business Card\n\n125,000-point bonus after you spend $3,000 in the first three months. Terms Apply.\n\nTPG values the bonus at $750\n\n$95 annual fee (See Rates & Fees)\n\nHilton Gold status\n\nHilton Honors American Express Card\n\n75,000-point bonus after you spend $1,000 in the first three months. Terms Apply.\n\nTPG values the bonus at $450\n\n$0 annual fee (See Rates & Fees)\n\nHilton Silver status\n\n \n\nWant to read more about family road trips? Here are a few related articles:\n\n6 Tips for Surviving a Road Trip With a Large Family\n\n10 Remarkable Road Trips in the U.S.A.\n\n5 Epic Road Trips Across America\n\n9 Ways to Help Your Children Remember Family Trips\n\nBest Credit Cards for Road Trips\n\nJon Bailey covers LGBT family travel for TPG and blogs at 2DadsWithBaggage.com. Follow Jon and his family’s adventures on Facebook and Instagram.\n\nAll images courtesy of 2DadsWithBaggage.com\n\nFor rates and fees of the Hilton Aspire Card, click here.\nFor rates and fees of the Hilton Ascend Card, click here.\nFor rates and fees of the Hilton Honors Business Card, click here.\nFor rates and fees of the Hilton Amex Card, click here.",
      "Folder": "Feedly",
      "Timestamp": "1556417085",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.380903Z"
}