{
  "id": "288075fbff9946bc853705271d5f5eaa",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2018/4/10/17215440/deficits-rising-congressional-budget-office-ceo-debate",
      "Title": "Deficits are rising. What’s to blame Does it even matter Vox - All",
      "Selection": "On Monday, the Congressional Budget Office released its latest budget projections, predicting how much the US will tax and spend over the next 10 years.\n\nThe headline finding is rough: As a result of recent policy changes, primarily the Trump administration’s tax reforms, deficits are going to be about $1.85 trillion bigger over 10 years than previously projected, a 17.5 percent increase above what they’d be without the law. If the law’s cuts were made permanent, then the deficit would instead add another $722 billion, for a total cost of about $2.6 trillion over 10 years.\n\nThe data gives new relevance to a debate that’s been simmering among policy-minded economists for weeks, about how serious a problem the US federal debt is and about whether the best way to tackle it is by attempting to undo the Bush and Trump tax cuts, or by taking a run at cutting Social Security and Medicare substantially.\n\nA group of conservative economists, including veterans of the Reagan, Bush I, and Bush II administrations, took to the Washington Post to make a version of the latter argument, calling the tax bill a “good first step” and “not by itself a budget buster.” The Hoover Institution’s Michael Boskin (also chair of the Council of Economic Advisers under Bush I), John Cochrane, John Cogan, George Shultz (also Nixon’s Treasury secretary and Reagan’s secretary of state), and John Taylor (who served under both Bushes) argued that any deal to reduce the long-run deficit must focus on cutting “entitlements”: Social Security, Medicare, Medicaid, and veterans’ health care, principally.\n\nA group of liberal economists from the Clinton and Obama administrations issued a reply, acknowledging that a debt crisis could be coming, but arguing that the biggest cause is a lack of tax revenue. “There is some room for additional spending reductions in [entitlements], but not to an extent large enough to solve the long-run debt problem,” wrote Martin Neil Baily, Jason Furman, Alan Krueger, Laura Tyson, and Janet Yellen, all former Democratic chairs of the Council of Economic Advisers and, in Yellen’s case, the immediate past Fed chair.\n\nBut a growing number of left-ier economists think even that stance concedes too much, that the economy could still use a boost from federal spending, and that the conditions when a deficit hurts economic growth just don’t obtain in America in 2018. Under this perspective, the tax cuts might have been wasteful, or harmful because they encourage income inequality, but the deficits they create aren’t a serious problem at all. Nor is increasing spending on Social Security and Medicare as the baby boomers age.\n\nThe basic facts of the deficit\n\nWhile the tax bill made the deficit considerably larger, the CBO report is clear that the US would have seen large and growing deficits even without it. Since the last surpluses of the late Clinton administration, Congress has passed and, with some exceptions for the rich, made permanent two rounds of large tax cuts (in 2001 and 2003). It has financed two large-scale wars in Afghanistan and Iraq. It endured the financial crisis and recession, which necessitated massive fiscal stimulus, increased the cost of safety net programs that saw greater usage, and reduced tax revenue as incomes fell.\n\nAs this classic 2013 chart from the Center on Budget and Policy Priorities shows, the Bush tax cuts, the wars in Iraq and Afghanistan, and the economic downturn accounted for basically all of the deficit by Obama’s second term in office, with the Bush tax cuts driving the lion’s share:\n\n        Center on Budget and Policy Priorities\n\nIt is no longer 2013, and spending increases approved under both Trump and Obama, as well as Trump’s tax cuts, have together expanded the deficit beyond what the above projections show. But it nonetheless functions as an important account of how we got to this point.\n\nThis analysis suggests a very obvious answer to the deficit problem (if it even is a problem, about which more in a second): raise more revenue. The deficits are overwhelmingly driven by sharp reductions in revenue caused by Bush’s and Trump’s tax cuts, as well as past spending binges (principally the wars in Iraq and Afghanistan) that need to be paid off. Either way, the natural response is to raise taxes and bring in more money. Just returning to the Clinton-era tax code would get you most of the way there. That’s the main conclusion of the group of Democratic economists.\n\nThe disagreement: how to handle rising health care costs and population aging\n\n        Congressional Budget Office\n\nThe problem, from the point of view of deficit hawks, is that future deficits are likely to be driven substantially by factors other than the tax cuts and wars. America is an aging country, which means that programs like Social Security and Medicare, which mostly serve the elderly, as well as programs like Medicaid that disproportionately serve the elderly, are likely to grow in size, relative to the nation’s economy. And the whole suite of government health programs, from Medicare and Medicaid to veterans’ health care to the Obamacare exchange subsidies, are likely to grow more expensive because the cost of health care has, in recent years, grown faster than inflation.\n\n        Congressional Budget Office\n\nThe latest CBO report finds that Social Security’s cost, as a share of the economy, will grow from 4.9 percent to 6 percent over the next 10 years; the cost of major health programs (Medicare, Medicaid, the Children’s Health Insurance Program, and Obamacare subsidies) will grow from 5.3 percent to 6.6 percent. Offsetting that increased cost would require 2.4 percent of GDP worth of new revenue, or $722 billion in 2028 alone. That’s more than double the annual cost of the Trump tax cuts in their first few years, before major provisions start expiring.\n\nTo conservatives, this means one thing: You have to cut entitlement programs, principally Social Security and Medicare. In practice, those programs are immensely popular, and Republican politicians typically default to targeting less universally beloved programs directed more toward the poor (like Medicaid and food stamps), but Social Security and Medicare, as the largest entitlements, have to be targeted for cuts if the goal is to balance the budget. \n\n“Taxes alone cannot solve our budget problem,” the Hoover economists write. “Funding programs as they are currently structured will require high taxes for all income levels, taxes that would sharply reduce economic opportunity and growth, which in turn will make funding entitlements that much harder.”\n\nTo liberals who are nonetheless concerned about the deficit, the diagnosis differs. Social Security and Medicare are guarantees we’ve made to seniors, and on health care, the government should be doing more, not less, to cover people. Sure, there might be savings to be had by changing how much doctors and other providers are paid, or bargaining for better prescription drug prices, but any spending cuts should be balanced, or swamped, by revenue increases necessary to pay for an aging population.\n\nThe Democratic economists write that Social Security needs “only modest reforms to restore its 75-year solvency, and these should include adjustments in both spending and revenue,” and that Medicare should focus on “reforms to payments and reformed benefit structures” rather than reducing access to care. Above all, these changes have to be paired with tax increases of a scale capable of handling rising health care costs and an aging nation.\n\nThe Center on Budget and Policy Priorities’ Paul Van de Water argues that the CBO report is a cause for “concern, not alarm.” He notes that the report finds that in 2019, federal revenues will drop to 16.5 percent of GDP, “well below their 40-year average of 17.4 percent. Restoring the federal revenue base should therefore be the major goal of fiscal policy in the next few years.”\n\nShould we be worrying about deficits at all?\n\n        Congressional Budget Office\n\nVan de Water also notes that “today’s low real interest rates justify a higher debt-to-GDP ratio than was appropriate when the government faced much higher borrowing costs.” He has a point. Interest rates on government debt are at historic lows, and have been for several years now. That suggests that unlike in the 1980s and ’90s, when rates spiked over fears of inflation and out-of-control deficits (respectively), the investors financing US deficit spending aren’t really worried about it getting too high in the near future.\n\nThat raises a more fundamental question: If the bond market is almost giving money away to the US, why not take it? Why start winding down the deficit at all?\n\nThe conventional answer is to take a look at the above chart and see when the US last reached debt levels this high. Our only previous experience with debt in excess of 100 percent of GDP was in the aftermath of World War II, when the US experienced a historic growth explosion fueled in part by strong population growth and the large-scale entry of women into the workplace. Unless the US starts getting much more tolerant of immigration much more quickly, that’s not really something we can replicate. Moreover, World War II was an honest-to-God emergency, and the kind of thing large deficits exist to finance. What similar emergency justifies accumulating that much debt now?\n\nThere might be such an emergency, though: secular stagnation. The theory, popularized by former Treasury Secretary Larry Summers, is that for a variety of reasons, from the rise of the middle class in the developing world to population aging in the developed world to sluggish productivity growth, we are currently experiencing an excess of savings globally. There’s too much savings, and not enough genuinely productive investments in which to place it, so investors need somewhere to park their money.\n\nThat somewhere is US federal bonds. Best of all, US deficit spending should, on this theory, boost the domestic economy too, which is suffering from a chronic lack of demand and spending brought on by the excess of savings. So by continuing to run deficits and accept that money, the US is actually doing the world economy, and the US economy, a service.\n\nEven more heterodox theories, like Modern Monetary Theory (MMT), are even more skeptical of the need to tame deficits. MMT argues that because modern governments control their own currencies, they can never really “run out of money.” The reason we have taxes, then, is not to pay for stuff but to keep people using the government’s preferred currency rather than, say, bitcoin. In some rare cases, consumer demand gets too high, so sellers raise prices and inflation ensues. Then you need to raise taxes to cool down the economy. But the theory holds that this eventuality is pretty rare.\n\nStephanie Kelton, a prominent MMT economist and former staffer to Bernie Sanders, has admonished Democratic economists for conceding we need to tame long-run deficits at all. We still have plenty of fiscal room, she argues, and should be trying to expand Medicare and Social Security, not shrink them.\n\nYou don’t have to go as far as Kelton to think that concerns over deficits are overblown. Even if, in the long run, large deficits do economic harm, they have to be weighed against other concerns:\n\nThe real possibility that cutting Social Security and Medicare will meaningfully harm the well-being of seniors and disabled people on those programs\n\nThe squeeze that deficit reduction packages put on non-defense discretionary funding, which covers everything from the FBI and law enforcement to the National Institutes of Health and scientific research\n\nThe need to rebuild national infrastructure, improve water delivery, remove harmful lead pipes and lead residue from soil, build green public transit in more cities, etc., all of which is easier to do with deficit spending\n\nThe likelihood that any revenue package capable of covering our deficit will need to raise taxes on the middle class substantially in a way that could seriously depress the median American’s take-home income\n\nNone of those is a reason to ignore the deficit entirely. But each is a concern that might outweigh the need for particular kinds of deficit reduction, or might temper the urgency of deficit reduction as a goal, given other goals society has.\n",
      "Folder": "Feedly",
      "Timestamp": "1523400646",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.522616Z"
}