{
  "id": "288668e74fea4a6baded330f8755712a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1077425/egypts-tourism-looks-to-revive-after-years-of-sluggish-growth/",
      "Title": "Egypt is trying to get the tourists back to see the pyramids after years of security fears Quartz",
      "Selection": "Cairo\n\nFor generations, Mohammed Ahmed’s family made a living offering tourists visiting the Egyptian pyramids in Giza a ride on their gaily decorated horses. But in the years since the Arab Spring uprising in 2011, as arrivals dwindled from over 14 million in 2010 to just 9 million in 2015, Ahmed experienced a change of fortune. Fierce competition arose among the horsemen—and camel owners—for customers, and whatever fees and baksheesh they collected were not enough to pay bills or save for another day.\n\n“It’s been very tough for us,” Ahmed said on a recent sunny afternoon while eyeing a group of Chinese tourists alighting from a tour bus. “You cannot imagine how life has changed.”\n\nFor decades, Egypt was the main draw for international tourists visiting North Africa. But the country’s tourism industry has suffered a critical blow following a string of political misfortunes, a major airline disaster, terrorist attacks, and church bombings. The failed revolution of 2011 and the military’s violent reassertion of power dampened growth in the sector, sent tourists packing, and turned luxury resorts into abandoned “ghost hotels.” At one point in 2013, the political upheaval in the country was costing the tourism sector $400 million in monthly revenues, according to estimates from JP Morgan analysts.\n\nThe situation was exacerbated in 2015 after the Islamic State took responsibility for downing a Russian airliner over Sinai, killing all 224 people—most of them tourists—on board. Russia put an indefinite ban on all air travel to Egypt, while a number of European airlines and governments placed flight restrictions over security concerns. Terrorists also stabbed tourists in the Red Sea town of Hurghada, and gunmen opened fire on a tourist bus in Cairo. Deadly attacks on churches in the bustling seaport of Alexandria and the city of Tanta also put a dent on Egypt’s image as a favorite tourist destination.\n\nThe rubble from a blast inside the Islamic Art Museum. (Reuters/Mohamed Abd El Ghany)\n\nEgypt’s ancient sites, museums, and parks have also experienced trouble, with several of them looted, deserted and artifacts stolen. A car bombing also damaged the façade and exhibits at the Museum of Islamic Art in 2014, forcing it to close for up to two years.\n\nThe Aquarium Grotto Garden in Cairo, which was once home to a rare collection of African fishes, is now almost empty. On a recent visit, most of the water tanks were devoid of any aquatic life, and couples strolled in the grotto caves strewn with garbage and Cola cans.\n\nMost of the aquatic life has not been sustained at the Fish Garden in Cairo. (Photo/Abdi Latif Dahir)\n\nAll these negative trends have coalesced to harm tourism, significantly reducing international flight bookings to Egypt, and pushing visitors to look to countries like Spain as alternative holidaying destinations. The low number of inbound tourists has also affected the economy, which looks to the sector as a crucial source of hard currency. To augment this and to secure funding for research and restoration activities, the government increased ticket prices to enter these parks and museums. Egypt’s government also received a three-year, $12 billion loan from the International Monetary Fund and devalued its currency by almost half against the dollars in order to combat the severe economic crisis,\n\nFor ordinary citizens like Ahmed, the devalued Egyptian pound has meant rising inflation rates and a weak purchasing power. “The currency means nothing,” Ahmed said. “You get it, you spend it, and then you have none of it.”\n\nGlimmer of hope\n\nFor the first time since the uprising, the government believes the number of tourists visiting Egypt in 2017 could come close to the levels seen before the 2011 revolution.\n\nTo stimulate growth, Egypt has been offering incentives and reducing levies for airlines and tour operators in order to bring more tourists into the country. The government, pressed hard with security reforms, has spent millions of dollars upgrading security at its airports. Officials have also publicized the high-profile visits by Germany’s chancellor Angela Merkel and Hollywood star Will Smith to the pyramids as a way to boost the sagging tourism sector.\n\nThe government also launched a campaign dubbed Wahashtouna (“We have missed you” in Arabic) in order to attract more visitors from the Arabian Gulf. These Arab visitors have continued to boost hotel bookings in key tourist cities like Cairo, Hurghada, Sharm El Sheikh, and Alexandria, according to estate agency, Colliers International.\n\nBut before the tourism sector can revive from its current slump, its sluggish growth will continue to harm many people who depend on it for income. These include small hotel owners, tour guides, drivers, and souvenir shop owners who benefit from the streaming flock of tourists. Hossam Abdullahi, who had his horse-drawn carriage by the Sphinx, says he’s however optimistic about the future. “It’s going to take a long time before everything is fine,” Abdullahi said, “but we are patient. And the good days will come back God-willing.”\n\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1505464326",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.632453Z"
}