{
  "id": "28d2a7152fd847279d58b2b403d79360",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.getrichslowly.org/spend-safely-in-retirement-strategy/",
      "Title": "The Spend Safely in Retirement Strategy Get Rich Slowly",
      "Selection": "Last month, the Society of Actuaries (a group I was born to belong to!) published a mammoth (84-page) report entitled “Viability of the Spend Safely in Retirement Strategy”. Despite its opaque title, this report (written by Steve Vernon, Joe Tomlinson, and the estimable Wade Pfau) contains some interesting info about planning for retirement income.\n\nOn the surface, this report's advice seems stupid simple: To optimize retirement income, delay Social Security and make the most of required minimim distributions from tax-advantaged accounts. Isn't this pretty much what most of us plan to do? Maybe so, but I doubt that anyone else has crunched the numbers like this.\n\nPlus, this strategy provides a specific plan for folks who haven't considered how to approach retirement income. As the authors note, most retirees fall into two camps.\n\nThere are the people who are scared to spend their savings, so they sacrifice current lifestyle.\n\nThere are those who “wing it”, spending without a plan.\n\nThe Spend Safely in Retirement Strategy is useful for both groups. It shows the specific steps needed to maximize retirement income. Those steps might seem obvious to those of us who read and write about personal finance every day, but they are not obvious to our family and friends.\n\nHere's a quick overview of the Spend Safely in Retirement Strategy (or SSiRS).\n\nThe Spend Safely in Retirement Strategy\n\nVernon, Tomlinson, and Pfau introduced the concept of the SSiRS in their 2017 report through the Stanford Center on Longevity: “Optimizing Retirement Income by Integrating Retirement Plans, IRAs, and Home Equity”. (You can download a PDF of the paper from Stanford.)\n\n“This strategy has a significant advantage,” they wrote. “It can be readily implemented from virtually any IRA or 401(k) plan without purchasing an annuity.”\n\nThat 2017 publication was mostly theoretical. There wasn't a lot of info on how to approach their strategy from a practical perspective. This new project is more about actual implementation.\n\nThey write:\n\nThe SSiRS includes two key steps:\n\n1. Optimize expected Social Security benefits through a careful delay strategy; in this case, many middle-income retirees may have all the guaranteed lifetime income they need.\n\n2. Generate retirement income from savings using the IRS required minimum distribution (RMD) rules, coupled with a low-cost index fund, target date fund, or balanced fund.\n\nThe authors stress that the SSiRS is meant to be a baseline strategy, a starting point from which retirees (and/or their financial advisors) can build a more customized plan. It's like a basic bread recipe that yields good results every time. If you want to make fancier bread, you're free to do so. But you don't have to.\n\nLet's look at these two key steps in more detail.\n\nOptimizing Social Security Benefits\n\nIn the November 2017 study in which they introduced the SSiRS, the authors discussed the power of Social Security payments. They suggest that Social Security can act as an annuity replacement. (With an annuity, you pay an insurance company a lump sum. They turn around and issue you regular payments. I don't know much about them, honestly.)\n\nBut a lot of new retirees don't understand the power of patience. They're eager to access benefits now, so they draw on Social Security as soon as they're able. As a result, they receive far less than they could.\n\nThe authors argue that:\n\nThe optimal way to increase retirement income is to delay tapping into Social Security and personal savings until age 70. Have an income source until then. (This simply reinforces research into the power of working longer.)\n\nThe next-best option is to use a portion of your savings for living expenses, but still delay Social Security benefits as long as possible. The obvious downside to this approach is that it depletes your capital.\n\nThe authors also looked at using reverse mortgages to smooth monthly income in retirement. Although not appropriate for all circumstances, a reverse mortgage can be a useful tool for some retirees.\n\nUltimately, there's no one right solution. Everyone's situation is different. But undestanding the tools available and optimal solutions can help you figure out the retirement income strategy that works best for you. In most cases, however, you'll want to delay taking Social Security benefits as long as possible.\n\nGenerating Retirement Income from Savings\n\nTheir new paper suggests several ways to generate retirement income from savings. The authors propose a three-pronged approach.\n\nFirst, establish an emergency fund. If your goal is to live on a steady, predictable stream of income in retirement, then unplanned expenses are your enemy. An emergency fund prevents you from tapping into the capital you're using for your regular income. Your emergency fund should be in something like a certificate of deposit or a savings account.\n\nNext, set up a “retirement transition fund”. This fund is meant to provide a small stream of income before you enter full retirement, the state where you're no longer working for money. Most people enjoy a phase of semi-retirement, during which they're working less and living more. For young retirees especially, this money doesn't have to be in your primary retirement account(s) (although it could be). It just needs to be deliberately differentiated the money you'll eventually use for regular retirement income.\n\nFinally — and most importantly — take your required minimum distributions (RMDs) from your tax-advantaged retirement accounts. This is a non-optional step, obviously (thus the word “required”), but it's important to plan. Understand how your RMDs fit into your retirement income stream.\n\nBecause RMDs don't start until age 70-1/2, the authors have calculated faux RMDs for younger retirees. They've worked backward to age 60. If, like me, you're only 50 and want to implement their approach, you'll have to to some math of your own. (But if you're 50 and retired, you probably have the time and motivation to do this on your own!)\n\nFinal Thoughts\n\nThe full paper covers the Spend Safely in Retirement Strategy in much greater detail, obviously. It also addresses topics like uneven expense flows in retirement (also known as: my life), unexpected income flows, “alternative health scenarios”, and investment considerations.\n\nHow should the RMD portion of income be invested with this strategy? That's a great question!\n\nIn one of these papers (I don't remember which, sorry), the authors write that Social Security can be viewed as the bond portion of your investment portfolio. Plus, Social Security tends to make up a significant portion of most people's retirement income.\n\nBecause of this, it's possible to be more aggressive with the portfolio from which you'll be withdrawing RMDs. A stock-heavy approach has the advantage of increasing expected retirement income — but it does increase volatility too.\n\nIn the world of financial independence and early retirement, there's a lot of discussion about safe-withdrawal rates. How much can a person reasonably expect to draw from her investments each year without risk of running out of money?\n\nThis is an important question, and there's no easy answer.\n\nMost folks in the early retirement community plan for their financial futures using some the so-called four-percent rule (or some variation of it). This rule guideline, first put forth in 1994 by financial adviser William Bengen, says that, generally speaking, it's safe to withdraw 4% from your investment portfolio every year without risk of running out of money. There's a lot of debate about whether 4% is the magic number — or 3.5% or 4.5% or something else — but there's no debate about the general concept.\n\nMini-rant: For some reason, folks in the early retirement community have decided that the 4% rule originated with the “Trinity Study”, an article published in the February 1998 issue of the Journal of the American Association of Individual Investors. This is incorrect. It makes the FIRE movement as a whole look bad when adherents keep claiming this. If we can't get simple, verifiable facts right, then why should people trust us on the bigger, more important stuff?\n\nBut how do retirement withdrawals actually work? How should they be structured? How does Social Security fit into all of this? There's far less talk about the practical implementation of retirement spending strategies than there is advocacy for the four-percent rule.\n\nThat's why I like to see research like this. The Spend Safely in Retirement Strategy might seem simplistic, but if's an actual plan for retirement spending rather than an abstract model based on past market results. It's a real-world tool that's useful to everyone, both people pursuing traditional retirement and those who want to retire early.\n\nThe post The Spend Safely in Retirement Strategy appeared first on Get Rich Slowly.\n",
      "Folder": "Feedly",
      "Timestamp": "1565197579",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.354961Z"
}