{
  "id": "2a5517132b2147b88757f77965f327f9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/2017/12/15/easy-4000-amex-membership-rewards-points-for-staying-at-marriott-targeted/",
      "Title": "Easy 4,000 AMEX Membership Rewards Points for Staying at Marriott (Targeted) Million Mile Secrets",
      "Selection": "Via Miles to Memories,  there is a valuable new AMEX Offer!  You’ll receive 4,000 bonus AMEX Membership Rewards points when you pay $300+ for a Marriott stay by February 28, 2018.\n\nAMEX Offers are an easy way to save on purchases you might make anyway.  Just add the offers to your AMEX card and use that card for your spending!\n\nUse Your Eligible AMEX Card to Book a $300+ Stay at the Fort Lauderdale Marriott Harbor Beach & Spa and Earn 4,000 AMEX Membership Rewards Points\n\nAMEX Offers are targeted, so sign-in to your American Express online account to see which deals you qualify for.\n\nAMEX Offer for Marriott Stays\n\nWhen you spend $300+ on a Marriott stay, you’ll earn 4,000 bonus AMEX Membership Rewards points.  Here’s what you need to know:\n\nMinimum spend can be completed with both room rate and room charges\n\nYou must pay for your stay by February 28, 2018\n\nValid only for hotels located in the US and US territories\n\nYou must make your reservation through an official Marriott channel (Marriott website, mobile app, etc.)\n\nExcludes The Ritz-Carlton®, EDITION®, Bulgari®, Marriott Executive Apartments®, Marriott Vacation Club®, Protea Hotels®, and all SPG® Participating Hotels & Resorts brands\n\nThis deal should stack with Marriott’s MegaBonus promotion, or any other promotions they may publish.\n\nAMEX Offers are a unique perk to American Express cards.  And a great way to offset any annual fees you’re paying!\n\nAmerican Express cards that are eligible for AMEX Offers include:\n\nThe Platinum Card® from American Express\n\nThe Business Platinum® Card from American Express OPEN\n\nPremier Rewards Gold Card from American Express\n\nThe Business Gold Rewards Card from American Express OPEN\n\nAnd don’t forget, if you have multiple AMEX cards, here’s the trick to get these discounts more than once.\n\nBottom Line\n\nI love saving money with AMEX Offers!  Sign-up for our newsletter and I’ll alert you whenever there are deals worth checking out!\n\nLog-in to your AMEX account to see if you qualify for this offer.  Then load the offer to your AMEX card, and use that card to make your purchase!\n",
      "Folder": "Feedly",
      "Timestamp": "1513495674",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.560756Z"
}