{
  "id": "2ac040014c384957a3c3b5c822c51d15",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://work.qz.com/1174454/nobody-ever-asks-my-husband-how-do-you-do-it-all/",
      "Title": "The question we ask every mom (but never dads) Quartz",
      "Selection": "As a mother and the founder and CEO of a digital health company, I frequently get asked about “work-life balance.” My husband, Lee Teslik, an executive at Google, who changes as many diapers as I do, has had a very different experience. We’ve never really talked about this dynamic before, so one recent Sunday afternoon while our son was napping, we tape-recorded a conversation about the subject. The following is an excerpt—with all expletives, politics, and tears edited out.\n\nKate: Since becoming a parent, how many times have you been asked, “how do you do it all?”\n\nLee: I’ve never been asked that.\n\nKate: Wow, really? I get asked that like once per week. Why do you think that is?\n\nLee: I don’t know, but there’s clearly an overall expectation that the burden of raising children falls primarily to women. And, obviously, people think that for a reason—which is that most women actually do spend more time than their husbands on childcare. But the assumption also reinforces the gender dynamics.\n\nKate: This is kind of fun, we’ve actually never directly talked about this.\n\nLee: What are your reactions when you get asked that question?\n\nKate: It depends on the context. If I’m at a work dinner and I’m talking about work and life in a one-on-one conversation, I’m happy to talk about it and learn about whomever I’m talking to from that same lens, man or woman. But when I’m talking on a panel or in a group situation about business, and I’m the only woman, and someone asks me specifically, I get uncomfortable because it’s distracting from what I’m there to talk about.\n\nLee: …which is business.\n\nKate: Yeah, exactly. If you were asked that question by strangers in a business setting, how would you respond?\n\nLee: I would be surprised. But I would probably say two things. First, that I’ve actually made some career choices to enable me to be a better and more present parent. In my old job [at McKinsey & Company], I used to travel almost all the time.\n\nKate: I hated that.\n\nLee: Yeah, seriously. That’s why I left. I’d also probably talk about how it’s a constant negotiation between the two of us. Like who is going to be home at 6:30 on any given night? When we have conflicting work events, whose work event trumps the other? Or do we need a babysitter? It’s just constant communication—which I think we’re fine at, but probably could be better.\n\nKate: Yeah, actually, I just had a board meeting and Theo [our son] was up all night puking, and you stayed home with him that morning! Thanks for that.\n\nLee: And you? How do you answer the “how do you do it all” question?\n\nKate: Well at this point, it follows a script [Laughs] I usually say “not gracefully” and then change the subject back to whatever I was talking about. Or, if it’s too awkward to answer it like that and I need to get into it more, I usually say something about having a supportive husband, family, and community.\n\nKate: Do you think our parental duties are even?\n\nLee: No. But I’m also not sure that’s the right way to frame it.\n\nKate: Please elaborate.\n\nLee: I think you and I have a wide variety of administrative tasks for our household— which includes a lot of childcare but also a lot of other things, like cooking, work around the house, and dealing with the car. I think the real question isn’t the split of childcare but the split of all that activity. I get frustrated at articles that frame this question solely around childcare. That said, I do think net/net you do more, and we definitely could be more even.\n\nKate: Do you think it will change as our kids get older?\n\nLee: I hope it does. I feel like you had such a strong biological bond with Theo in the first year, and there were some things, like breastfeeding, that you naturally had to spend more time on.\n\nKate: Right. And it’s important to acknowledge those things. I get annoyed sometimes when I am talking to people about women’s health in the prenatal and postpartum period and they try to make it an equal endeavor between men and women to physically grow a child, have the child, and then feed the child. My body did all that work! It fundamentally is different, and I think dads, companies, and more broadly society can do more to make this incredibly important time better for mothers.\n\nLee: So let’s talk about that. Google gives more leave to women than men, which I would say is fair. But how do you ensure women don’t get screwed on the back-end of that because they’re missing more work?\n\nKate: You need good back-to-work programs and manager training – that’s a core part of our maternity program at Maven and how we work with companies. You need to help the culture of a company understand the pregnancy penalty and the issues moms face.\n\nLee: But tactically. How do you do that? How do you make sure women don’t get implicitly punished in their career progression for taking more time off?\n\nKate: Maven can help! No really, it’s a complicated issue, and I actually just asked my friend this the other night. She took 12 months off at a major investment company after having her daughter, and she said she had an exceptional manager who made sure her work wasn’t swallowed up by her colleagues and always checked in with her to keep her in the loop. I think you need to systematize this and not have it be based on one-off managers.\n\nLee: So you’re pregnant again right now. What have you done differently this time around from a work context?\n\nKate: I have thoughts but am curious for yours first. What am I doing differently?\n\nLee: I think you’re less nervous this time around for being judged negatively for being pregnant, which maybe is a function of Maven being bigger. For instance, you hid it longer the first time around.\n\nKate: I was showing this time at 3 months! I had no choice. I think you’re right, I am basically more fatalistic about it. If I’m judged, I’m judged. Whereas the first time around, I tried to assert more control over that. There’s only so much you can control in life!\n\nLee: That makes it sound like you think it’s just inevitable that you’ll be judged.\n\nKate: That’s right. [Pause]. OK, let’s move on to rapid fire questions: Who drinks more?\n\nLee: You\n\nKate: Who sleeps more?\n\nLee: Me\n\nKate: Who goes out more?\n\nLee: You\n\nKate: How often do you exercise?\n\nLee: Not enough.\n\nKate: What percentage of doctors’ appointments do you come to?\n\nLee: Most.\n\nKate: Who deals with child care emergencies more?\n\nLee: I honestly think it’s a good mix and that your family is critical here too. Wait, I have some for you!\n\nLee: What do you miss most about being a non-parent?\n\nKate: Spontaneous travel.\n\nLee: How many times per week do you FaceTime with Theo?\n\nKate: Oh god, a lot. Even sometimes when I’m just catching the subway home and I’ll see him in 20 minutes. I’m obsessed with him.\n\nLee: Okay, final question. How do you do it all?\n\nKate: Not gracefully.\n\nKate Ryder is the CEO of Maven.\n",
      "Folder": "Feedly",
      "Timestamp": "1515462089",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.508419Z"
}