{
  "id": "2aed65254f1b4679b11f05b981bf986e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://ritholtz.com/2019/09/investing-for-the-elite/",
      "Title": "Investing for the Elite The Big Picture",
      "Selection": "Where Wealthy Families Are Invested\n\nSource: Institutional Investor\n\n \n\n \n\nThe chart above is utterly fascinating: It is based on a survey commissioned by UBS Group of family offices globally. These ultra-wealthy families accidentally revealed a mindset that seems to be counter-productive.\n\nIt goes something like this:\n\n“We’re special, and we prefer a more ‘sophisticated’ form of investing, one that is complex and nuanced and holds the promise of greater performance (even if it might underperform).”\n\nI have been debating this crowd for at least a decade. I created a presentation called “Romancing Alpha, Forsaking Beta” for an event of ultra high net worth investors at Tiger 21. It was a very soft admonition that the approach taken by many family offices was complicated, expensive, and failed to deliver alpha.\n\nIt was an inoffensive data-filled  discussion that suggested family offices take a closer look at their actual, post tax, net of fees performance. “If you are fortunate enough to have invested in the top 2% of alternatives — hedge funds, venture capital or private equity — then great, keep your money there.” But everyone else should perform a review to see how they would have done with a simple 60/40 allocation (including munis). And to repeat, run your comparisons and results on an after fee, post tax basis.\n\nThat argument failed. Many seem to be convinced their investments were top 2% (hence the suggestion to audit the actual numbers). I doubt I persuaded anyone in the room.\n\nIn fact, since then, this allocation to alternatives has gotten even greater. The biggest winner of flows is private equity. Institutional Investor has the data: “Alternative assets account for a large portion of family office allocations, rising 1.4 percentage points last year to more than 40 percent of their portfolios.”\n\nThe ultra-wealthy have more than 40% in alternatives!\n\nMeanwhile, Mom & Pop have become fee-sensitive, moving billions to Vanguard and Blackrock.\n\nThey win.\n\nThe ultra-wealthy have doubled down, pursuing sexy, pricey alpha at the expense of cheap, effective beta. The consultants still rake in fees. The smart money has become dumb. Wall Street is perplexed. The dumb money is no longer dumb, and are kicking everyone else’s ass.\n\nMaybe it is time to retire the phrase “dumb money — at least as applied to main street investors . . .\n\n \n\nThe post Investing for the Elite appeared first on The Big Picture.\n",
      "Folder": "Feedly",
      "Timestamp": "1569504533",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.370675Z"
}