{
  "id": "2b416662128e497fa9769669408b0940",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/776628/shane-smith-how-a-single-native-advertising-deal-with-intel-intc-built-the-vice-media-behemoth/",
      "Title": "How a single deal with a decidedly unhip tech company built the Vice media behemoth Quartz",
      "Selection": "In 2009, when most media outlets were selling display ads for pennies per click to support their burgeoning web businesses, Vice was cutting a multi-million dollar advertising deal that would become the foundation of its media empire.\n\nAt the time, Vice—which had print magazines, websites, online videos, and other media properties—was making the bulk of its digital advertising revenue from banner ads, like everyone else. That is, until, it was approached by computer-chip maker Intel, the Wall Street Journal revealed (paywall) in a profile on CEO Shane Smith (and his $23 million Californian estate).\n\nIntel was growing out of touch with young audiences and was desperate to reach the millennials who were Vice’s bread and butter, the publication reported. The company’s then-chief marketing officer Deborah Conrad asked Vice for ideas on how to connect with them.\n\nIt was Vice’s first foray into native advertising—ads that reflect the look and feel of the media they’re in and are often created by the media firm itself— but certainly not its last. Smith says:\n\nThat program built the company. You learn, holy shit, we could do a $40 million deal with Intel where we actually create content that we like, and they don’t give notes! Why were we doing banner ads? Those $40 million deals have turned into $100 million deals.\n\nIntel and Vice partnered on a $40 million Vice-produced series funded entirely by Intel that showcased the work of contemporary artists called the Creators Project. It launched in 2010 with a website as well as print and television content, and events in five global cities. And Intel’s logo was featured modestly on all of it, so as not to mislead young audiences who were wary of covert ads and endorsements.\n\nThe Creators Project is still around today. Intel is listed as a founding partner on the project, which is also sponsored by other brands like Adobe, and includes daily video and editorial content, a YouTube channel, artwork commissions, and events.\n\nMeanwhile, Vice has grown into a media behemoth with its own cable TV network, HBO programming, and deals with media brands like Verizon and Snapchat. It’s reportedly worth $4 billion and Vice expected to earn nearly $1 billion in revenue in 2015 (paywall). The company has not yet revealed its actual revenue for the year.\n\nVice is not the only digital publisher to turn to native advertising in recent years. Buzzfeed, which doesn’t sell banner ads and makes earns most of its revenue from branded content, is largely considered the modern innovator of native advertising, which has its roots in the past.\n\nOther digital publications like Mashable (and Quartz) have also used branded content to build up their businesses, and legacy newspaper brands like the New York Times and the Wall Street Journal have in-house custom content shops today.\n",
      "Folder": "Feedly",
      "Timestamp": "1473378679",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.716025Z"
}