{
  "id": "2b4e617261304290b4e29b2e6c583ec9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://frequentmiler.boardingarea.com/2017/10/10/20-off-amazon-w-1-point-targeted-50-max-discount/",
      "Title": "20% off at Amazon w 1 point [Targeted, $50 max discount] Frequent Miler",
      "Selection": "In yet another promotion for using American Express Membership Rewards points to pay at Amazon, you can get 20% off your Amazon purchases when you use at least 1 Membership Rewards point to pay for part of your order (up to a maximum of $50 in savings — i.e. $250 total in orders). This offer is targeted, but is widely available.\n\nThe Deal\n\nPay for part of your order with American Express Membership Rewards points (using at least 1 point to pay $0.01) and you will get 20% off up to a total of $50 off (which can be split over multiple purchases)\n\nDirect link to this promotion (our affiliate link – but keep in mind that you can shop through JetBlue TrueBlue for 3 miles per dollar. See more here,)\n\nKey Terms (From Amazon.com)\n\nOffer expires at 11:59 p.m. (PT) October 23, 2017.\n\nOffer only applies to products sold by Amazon.com (Look for “sold by Amazon.com” or “sold by Amazon Digital Services LLC” on the product detail page). Products sold by third-party sellers or other Amazon entities will not qualify for this offer, even if “fulfilled by Amazon.com” or “Prime Eligible”.\n\nOffer does not apply to digital content.\n\nOffer good while supplies last.\n\nShipping charges and taxes may apply to the full value of discounted promotional items.\n\nOffer may not be combined with other offers.\n\nThe maximum benefit you may receive from this offer is $50.\n\nOffer applies only to the purchase of items made with a Membership Rewards eligible American Express card, where Membership Rewards points are used for at least a portion of the purchase and the promotion code is applied at checkout.\n\nOffer is non-transferable and may not be resold.\n\nOffer discount will be allocated proportionally among all promotional items in your order.\n\nIf any of the products or content related to this offer are returned, your refund will equal the amount you paid for the product or content, subject to applicable refund policies.\n\nPromotional discount may not be redeemed for Amazon Gift Cards or third-party gift cards.\n\nAmazon reserves the right to modify or cancel the offer at any time.\n\nIf you violate any of these terms, the offer will be invalid.\n\nQuick Thoughts\n\nDAmex seems to be making a push to get their cards in position for your Amazon spend. Last month, there was the Fire Sale of sorts (See: Can I interest you in 40 Amazon Fire tablets?). There was another $25 off of $50 that surfaced in the interim and now this 20% off discount. This discount can be split over several purchases up to a maximum benefit of $50 off. In other words, whether you place a single order for $250 in items or you place 5 orders that are $50 each, you’ll have gotten 20% off and will be capped. That said, it’s nice that this works on multiple purchases, so you don’t need to hunt for the perfect use to max it out all at once.\n\nDon’t forget to go to Amazon and click to activate this promotion (as seen in the screen shot above) before making your purchase. If you were targeted, you should see the “click to activate” button when visiting that link.\n\nNote that this promotion is only valid with American Express Membership Rewards points. This one is not compatible with Discover points or Citi Thank You points.\n\nDoctor of Credit lists some good ideas for items to purchase to take advantage of this discount. Check their post for more details.\n\nH/T: Slickdeals\n\nQuick Deal posts are intended to alert readers to deals big and small, with little or no analysis. Quick Deals are NOT recommendations. Readers should always use their own judgment as to whether or not a deal works for them.\n\nEarn Miles Without Flying: START HERE\t\n\nThe post 20% off at Amazon w/ 1 point [Targeted, $50 max discount] appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1507730698",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.539779Z"
}