{
  "id": "2b854bc18cc144e1b647b1746fad9bd7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/42901/Making-an-Affordable-Luxury-Candle",
      "Title": "Making an Affordable Luxury Candle Core77",
      "Selection": "It should come as no surprise that somewhere in Brooklyn there exist two bearded men in a giant warehouse running a candle start-up. While the story reads like something out of a hipster fairy tale, the road to starting your own candle franchise is littered with more than just scented wax and wick debris—there's a Kickstarter campaign, too. Harry Doull and Stephen Tracy are the force behind Keap, which aims to make better, more affordable candles while also making the world a better place.\n\n\"We began discussing the need for a better candle a year ago,\" Tracy says. \"Harry and I had been roommates, so we often gravitated toward the topic of home design. We loved well-designed candles for their power to transform any space into a home through form, scent and light, but we were frustrated by how much the really good ones cost.\" Both ex-Google employees, Doull and Tracy quit their tech jobs last July to pursue candle-making full-time.\n\n\"We spoke to manufacturers initially,\" Tracy says. \"We found that they wanted us to stick to the status quo. This meant the same old materials and very large order volumes. We wanted to ask questions, to iterate, to fail and learn fast, so this was a dead end.\" Instead, Doull and Tracy turned to their own kitchens, where they began developing a candle recipe from scratch. \"We started with two critical principles: simplicity and sustainability,\" Tracy says. \"We did not want to use anything unless it was truly necessary, and we wanted to find materials that were not part of unsustainable industries.\"\n\nReading up on the process, the duo scoured forums and their personal networks for ideas on waxes, vessels and fragrances, learning through trying, failing and—quite frequently—\"spilling wax everywhere,\" Tracy says. \"We developed a system of recording what worked well: We noted how the candle looked, how well it burned, how it smelled and so on. We tried everything from beeswax and jojoba wax to rice-bran wax.\" Their final candle material is a pure blend of coconut wax, with no dyes or additives, that is sustainable and clean-burning and that lasts longer than paraffin or soy wax.\n\nThe Keap founders tested a variety of base materials before settling on a pure blend of coconut wax.\n\nPerfume testing \n\nValuing fragrance above everything else, Doull and Tracy took evening classes in perfumery at Pratt and brought on an expert perfumer to help. \"We found an amazing, family-run perfumer in the Bronx who has been operating for three generations and was a perfect fit for our scientific approach,\" Tracy says. \n\nThe perfume-making process kicked off with Doull and Tracy presenting ten \"fragrance concepts,\" each inspired by the kind of warm, happy memory that anyone could relate to. \"The process of creating a perfume is highly iterative,\" Tracy explains. \"You start with a creative concept, and next arrive at a specific idea, such as 'Waves.' You spend a lot of time identifying what specifically you are trying to evoke. Is it the saltiness of the sea air, or the dryness of the dune grass? The perfumer needs to understand this to have a hope of creating the scent you're after.\" From there, the perfumer creates a \"first modification,\" or his best attempt to translate the idea into a fragrance. Then everyone lives with the scent for a while, and returns to the table for discussion and further modifications. This process can continue for quite a while. \"We've made many, many modifications of each of our perfumes to get to the final variants,\" Tracy says.\n\nDoull testing one of the perfumes\n\nAssembling the candles in Keap's Brooklyn headquarters\n\nIn the end, the team came up with four aromas: Hot Springs, Green Market, Waves and Wood Cabin. Since online shoppers can't smell Keap's wares, the company has tried to get creative with how to \"break the scent barrier online,\" Tracy says. The founders invited a friend and poet, Rawaan Alkhatib, to describe each scent—leading to descriptions such as \"water sings around you in cascades and ripples,\" \"open jam jars whisper sweet nothings as you stroll by\" and \"glittering sun-lit scatter diamonds in the peripheries of your vision.\" (Editor's note: That last one is a spot-on description of how the Core77 office smells.)\n\nKeap's founders also put a lot of thought into their candle vessel. After researching and testing a range of shapes, thicknesses and materials, including copper, ceramics and concrete, the team opted for a glass container that could also function as a whiskey tumbler. \"It is simple to clean out any remaining wax, and perfect for your favorite tipple,\" Tracy says. Each wick is hand-applied using beeswax (rather than glue), so the wicks are easy to remove when the candle is done.\n\nChopsticks are used to hold the wicks in the center of the glass during the wax pouring. \n\nDoull and Tracy pouring wax\n\nTo make each candle, Doull and Tracy first prepare the glass containers for pouring. Next, wax is measured out and melted in a wax-melting stove at 170ºF to ensure that any air trapped in the wax is released. Then the perfume is measured out. For each fragrance, Keap uses a different ratio of perfume to wax, as each fragrance has different properties and intensity. Once the wax has cooled (generally to around 150–160ºF), the perfume is lightly blended with a whisk.\n\n\"Manufacturing candles is much like baking—it involves the combining of a series of ingredients and the close control of temperature,\" Tracy says. (And, for now, he and Doull are doing all the manufacturing themselves, in the work space they rent in Brooklyn's Industry City.) Once the wax and perfume blend is ready, it's hand-poured into the glasses. A chopstick is used to hold the wicks in the center of the glass vertically to prepare for wax pouring. Then the candles are left to cool and cure for two days.\n\nPackaging concepts\n\nOnce the candles have cured, Keap hand applies each label and packages the candles with inserts, boxes and matches designed by the London studio Gunter Piekarski—and then they're ready to ship out to customers. Doull and Tracy brought on Gunter Piekarski early in the process, to help refine their vision and provide artistic direction on the final packaging and design. Since Keap's main point of purchase will be online, the team decided to reduce the amount of text appearing on labels, opting instead for icons that reflect each fragrance. \"Of course, it's no good if they're glued on, leaving a mess on the whiskey tumbler,\" Tracy says, \"so they use no glue and peel right off the glass when the candle is fully consumed.\" Not the types to miss a detail, the team also created Keap matchboxes and matchbooks, hand-assembled in the U.S.\n\nSo what about the price? Keap has strived to create an affordable \"luxury candle\" primarily by cutting out the middlemen. With most high-end candles, traditional retail markups and middleman fees lead to bloated pricing for a product that doesn't actually cost too much to make. By selling directly to consumers online, the startup can offer its candles at a fraction of the price—$28 for one eight-ounce candle as opposed to around $70 from most luxury-candle purveyors.\n\nIn addition to providing a more affordable product, Doull and Tracy describe themselves as the \"Warby Parker of candles\"—with each candle purchased, the fledgling chandlers support the distribution of solar lamps through SolarAid. Keap is also founded as a public-benefit corporation with a built-in social mission to bring light to those off the grid. Solar lamps provide a clean, sustainable solution (as opposed to many kerosene-burning lamps, which are inefficient and can be a health hazard). \"Right now, we're really happy with our one-for-one program: every candle sold supports the distribution of a solar lamp,\" Tracy says. \"But we want to do more than just be a charitable donor for SolarAid. We have a great relationship with them, and we want to re-think how companies and charities can work together more closely.... This is something that makes us really excited about growing Keap.\"\n\nMeanwhile, Kickstarter users are embracing the idea—Keap has so far raised almost twice its goal of $25,000—so it looks like they'll be keeping the lights on a little longer.\n",
      "Folder": "Feedly",
      "Timestamp": "1447774530",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.824473Z"
}