{
  "id": "2b98dd45d2bb4f79878cfdb864dd3fc1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://skillet.lifehacker.com/have-you-heard-the-good-news-about-cornstarch-eggs-1835699803",
      "Title": "Have You Heard the Good News About Cornstarch Eggs Skillet",
      "Selection": "Being subjected to rubbery, overcooked scrambled eggs is enough to ruin the genre, but properly cooked scrambles are creamy, indulgent piles of comfort. I have long been a fan of the super-slow scramble, but I only enjoy them about once a month, as they take a full 45 minutes to cook. \n\nScrambled eggs are easy to make, but they’re kind of difficult to make perfectly. Rubbery, dry…\n\nRead more Read\n\nI can barely get it together enough to shower before noon, so standing over a stove for the better part of an hour is simply not an option during the workweek. But I do long for custardy, creamy eggs more mornings than I care to admit, which is why I will name my first child after Mandy of Lady & Pup’s, the woman who let the world know (via Food52) about the sheer and utter genius of adding cornstarch to scrambled eggs. (Just kidding, I’m never reproducing.)\n\nCornstarch—a common thickening agent—works wonders here, letting you cook eggs that seem slow-cooked in a fraction of the time. The curds are larger than the truly slow bois, but texture is just as rich, and still has that whole “cheesy without cheese” vibe going for it which, in my esteemed, highly-valued opinion, is the whole point of the slow scramble. These eggs are so creamy and so good that, after taking my first bite, all I could manage was a very quiet, very sincere, “well, fuck me.”\n\nJust like any other recipe that uses cornstarch as a thickening agent, this one has you make a slurry. Mandy recommends milk, but I used heavy cream, because it’s what I had. Stir the slurry until there are no lumps, creating an almost non-Newtonian fluid, then whisk it in with some beaten, salted eggs. The mixture noticeably thickens and, after a quick spell in a very hot pan, you have a pile of tender, velvety, creamy scrambled eggs. To make them yourself, you will need:\n\nEggs, at least 3\n\nCornstarch, 1/2 + 1/8 teaspoon for each egg\n\nMilk (or cream), 1 tablespoon for each egg\n\nSalt to taste\n\nButter, 1 tablespoon for each egg\n\nBeat the eggs and, in a separate bowl, beat the starch and dairy. Combine, season with salt, and beat into a uniform mixture. Heat a pan over high heat, then add the butter and, once it’s melted and foaming, add the eggs. Leave them alone until the edges start to set, then turn off the heat, move them to a cool burner if you’re using an electric stove, and push them around in circular, sweeping motions until they are just set, but still look not quite done. I had to move the pan back to the off-but-still-hot burner a couple of times, as the residual heat of the pan was not enough to finish the job. If you’ve been stirring your eggs for over half a minute, and they’re not quite done, pop ‘em back on low heat for a moment. Once they start to look “almost done,” spoon ‘em on a plate, and enjoy with lots of crisp, buttered toast.\n",
      "Folder": "Feedly",
      "Timestamp": "1561183538",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.394012Z"
}