{
  "id": "2bde13145e2b4243a4deb57c4b061557",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/24096-h-mart-korean-grocery-store",
      "Title": "14 Things to Buy at H Mart, America's Favorite Korean Grocery Store Food52",
      "Selection": "Happy May! It's Asian Pacific American Heritage Month. All month long we've got recipes, stories, and long reads to celebrate the generations of Asian and Pacific Islanders who make America what it is today.\n\nI noticed there was a shift. I started seeing Shin Ramyun everywhere in New York City—drugstores, supermarkets, and even corner bodegas. In a local dollar store in Washington Heights, I watched a girl rush out of line (“Will you save my spot?”) to grab a couple packs of the stuff, flashing a smile at me as she returned with the red squares, “I’m obsessed with these.”\n\nI grew up with this Korean brand of instant ramen. It’s so iconic in Korean pop culture that, if there’s ever a food scene in a television drama, more often than not the character is eating Shin Ramyun out of this ramen pot. (Watch the members of K-pop sensation Girls’ Generation slurp Shin Ramyun for a whole 6-minute television segment.) To think that this grocery-store staple has become so ubiquitous would’ve been unfathomable back in the late ‘80s and ‘90s, especially where I grew up in the suburbs of Atlanta, Georgia.\n \nBut then again, so much has changed since then.\n \nIn 2004, H Mart came to Duluth, Georgia, and it was a sign that Korean immigrants had truly arrived. In that same year, the Italian restaurant where I had my first date with an old girlfriend became a Korean fried chicken restaurant, and the local Blockbuster turned into a Korean bakery. Koreans were finally establishing their own community in the predominately white Georgia suburbs of Fulton County—not just a place for them to shop for groceries, but also a communal space for them to see friends, neighbors, and fellow Koreans.\n\nH Mart is to Korean immigrants in America as Patel Brothers is to Indian immigrants in America: a grocery store, of course, but also a marker of a moment in time and space, when a cultural need for belonging gave way to venture capital.\n \nIn the time since H Mart first opened back in 1982, Sandra Oh has won an Emmy, the word gochujang has been added to the dictionary, and Yakult has flown off the shelves because of a Netflix film based on a novel written by a Korean-American writer. Like these cultural moments, the ubiquity of H Mart, too, is a sign that Korean food is on its way to becoming mainstream.\n \nAnd so, with unbridled excitement in my Korean-American heart, I offer you my veritable list of the very best things to buy at H Mart, America's most-beloved Korean grocery store.\n\nPhoto by Amazon \n\nPhoto by H Mart \n\n1. Short-grain white rice\n \nIt’s the first thing you’ll see when you walk in: a wall of short-grain rice options. My favorite brand is Kokuho Rose sushi rice—but just go for the cheapest. Fun fact: The packaging will all look Japanese, but that’s because most Korean rice is, historically, Japanese.\n \n2. Kimchi\n \nContrary to popular belief, most Koreans don’t actually make their own kimchi. It might be a seasonal activity for certain home cooks, but many just buy their everyday stash at H Mart. Even my mother! That's because H Mart makes perfectly good kimchi, as long as you wait till it ferments before eating (usually a couple weeks in the fridge, or if you're really impatient, overnight on the counter). There are many varieties: kkakduki (\"Country Style Cubed Radish Kimchi,\" the label might read), chonggak (young \"bachelor\" radish), and regular cabbage kimchi (with or without oysters).\n\nPhoto by Amazon \n\nPhoto by H Mart \n\n3. Instant ramen\n \nAgain, Shin Ramyun is the go-to, but I often get Shin Ramyun Black, which has thicker noodles and an extra seolleongtang bone broth soup mix packet that adds nice depth. Or sometimes I opt for Ichiban (beef flavor) because it's what my mom would cook for my brother and me after long days at the pool. There are so many varieties and brands of instant noodles at H Mart that are worth exploring. My cousin Becky goes to H Mart just to see what's new on the shelf: These days you can get instant jjajangmyeon, jjamppong, and even carbonara-inspired ramen.\n \n4. Roasted seaweed snack\n \nAlso known as gim, seaweed snack is Korean-style nori that's been brushed with sesame oil, salted, then roasted. We ate it as a side dish growing up, or as a vehicle for leftover rice balls in the morning. As an adult, I've learned to incorporate it into my recipes because I find that it adds a nuanced salinity that salt or soy alone can't provide. You'll find it in my avocado toast, deviled eggs, and even scrambled eggs. The Great Wall of Gim at H Mart is proof enough of this pantry item's lasting importance in the Korean diet.\n\nThe gim selection at H Mart takes up nearly an entire aisle. Photo by Eric Kim \n\n5. Korean snacks, chips & candies\n \nMy brother shops at H Mart for one thing and for one thing alone: the snacks. See below for a few of our personal favorites growing up: Goraebab, which translates to \"whale food,\" is an umami-packed tomato-flavored chip that's dangerously good (1); Shrimp Flavored Cracker is a classic, and exactly what it sounds like (2); Sweet Potato Snack is a lovely sweet cracker studded with black sesame seeds (3); and Onion Flavored Rings are a cleaner-tasting Funyun (4).\n \n\"Also, I never make it out without at least one thing of Hi-Chew,\" Software Engineer Micki Balder tells me.\n\n1. Goraebab \n\n2. Shrimp Flavored Cracker \n\n3. Sweet Potato Snack \n\n4. Onion Flavored Rings Photo by H Mart \n\n6. Korean ice cream\n \nKorea has great ice cream, too. I'm particularly fond of the Samanco cake cone ice cream sandwiches filled with sweet red bean (there's also a strawberry version that I sometimes prefer). Another favorite is Melona, a creamy ice pop flavored with honeydew. You can also stock up on green tea and red bean ice cream at H Mart—and don't leave without those little mochi ice cream bites.\n \n5. Pantry staples & specialty ingredients (depending on who's asking)\n \nH Mart is where I come to stock my Korean pantry: sesame oil, soy sauce, gochujang (red pepper paste), gochugaru (red pepper powder), black bean paste, tofu, and miso. They have a wide selection of Japanese pickles, as well, which are lovely to keep on hand. “I like to get containers of pickled ginger from the fridge section,\" Lifestyle Writer Ella Quittner says. \"I eat it as a snack, sometimes dipped in a bit of soy.\"\n \nSenior Social Media Manager Connor Bower buys those \"large, teabag-like packets filled with dried anchovies, kelp, and shiitake mushrooms used to make anchovy stock two cups at a time.\" Many a Korean recipe starts with anchovy stock, including tteokbokki, gyeranjjim, and budae jjigae. \"It's been so useful to have on hand whenever I want to make one dish,\" Connor admits, \"as I'm not sure I'd be able to go through large quantities of the anchovies and kelp by myself.\"\n\nA miso for all of my personalities. Photo by Eric Kim \n\n\"I love buying the golden curry packets, fish balls, and fish sauce,\" Account Manager Rebekah Daniels chimes in.\n \n\"I got amazing mushroom soy sauce when I was in Thailand,\" VP of Finance Victoria Maynard adds.\n \n\"Sweet chili garlic sauce,\" Micki waxes lyrical. \"That stuff tastes good on everything, but I especially like it lacquered on fish.\"\n \n9. Really fresh seafood\n \nSpeaking of fish, H Mart's fish selection is very good. I love getting the individual salmon fillets—always center cut, but sometimes, if it's available, I get the cheek and roast it low and slow. Tastes incredible with fresh white rice.\n \n\"I get my blue crabs from there,\" says Sales Director Lizzie Greene. \"They also have pre-packaged crabs with their roe and fat saved for making crab stock or butter.\"\n \n10. Bones for bone broth\n \nOne of my favorite Korean dishes is the aforementioned seolleongtang, a milky bone broth made from brisket and difficult-to-find cuts of beef, namely knee, leg, and shin bones. Head to the H Mart freezer section, where they sell these bones, labeled \"Beef Bones,\" either in large plastic bags or packaged like this.\n\n H Mart is to Korean immigrants in America as Patel Brothers is to Indian immigrants in America: a grocery store, of course, but also a marker of a moment in time and space, when a cultural need for belonging gave way to venture capital. \n\n11. Fruits & vegetables\n \nMy cousins and I joke that H Mart produce is twice the size of regular fruits and vegetables (but it really is, and often cheaper too). Plus, H Mart is a great source for the harder-to-find varieties like dragonfruit, jackfruit, papaya, durian, Korean Concord grapes, melons, and Asian pear. So don't forget to stock up on fresh fruit while you're there, and if you are one of those go-getters who plans to make their own kimchi at home, this is where you can buy all of that fresh napa cabbage and the FATTEST scallions you've ever seen.\n\nFancy prepackaged tropical fruit, I love you. Photo by Eric Kim \n\nJust two or three of these, paired with a bowl of white rice, and you've got yourself a whole meal. Photo by Eric Kim \n\n12. Prepared banchan\n \nThere's a whole wall of prepared foods and banchan, or small Korean side dishes, such as: pickled garlic, fried anchovies, spicy octopus and squid, spinach, black beans, lotus root, perilla leaf, seaweed salad, brined cod roe, and even little Korean-style omelets and pancakes, or jeon.\n \n13. Frozen dumplings\n \nThink: Trader Joe's dumplings, but way better. And more variety, too: Korean mandoo, Japanese gyoza, Chinese baos and shumai, etc.\n \n14. Home goods\n \nThough this seems less intuitive, H Mart's kitchen selection is pretty extensive. It's where nearly every newly minted Korean adult will go to buy a couple of key items for a starter pack to life: a rice cooker and this lightweight plated aluminum pot (which brings water to a boil way faster than a regular pot, making it ideal for instant ramen). Also, stock up on pretty chopsticks, spoons, forks, and little rice and soup bowls. Or if you're like me and secretly love kawaii things, don't miss THIS totally cute cat tea cup!\n\nMeow. Photo by Eric Kim \n\nDo you live by an H Mart? What are your favorite things to buy there?\n\n All products are independently selected by our editors, and Food52 may earn an affiliate commission. \n",
      "Folder": "Feedly",
      "Timestamp": "1556855900",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.375698Z"
}