{
  "id": "2cda5d926f224d9d89c3923d4eb5a753",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1513164/the-21-biggest-retail-trends-to-look-out-for-in-2019/",
      "Title": "The 21 biggest retail trends to look out for in 2019 Quartz",
      "Selection": "A lot is shifting in the retail business. Stores are changing, new technology is emerging, retail space is shrinking, phones are an increasingly popular way to buy pretty much everything, and who even knows if Sears—a 125-year-old retailer that once defined how Americans shopped—will exist for much longer.\n\nBut of all the trends that have emerged over the past few years as contenders for a piece of retail’s future—experiential brand temples! on-demand in-store production! mini-stores!—not all are realistically going to have a marked effect in 2019. Some are still in their early stages, while the value of others is uncertain to both brands and shoppers.\n\nCB Insights, a strategic intelligence firm, gathered up the biggest trends in retail and analyzed where they stand as the year gets underway. The resulting matrix, based on what CB Insights calls its NExTT framework, offers a picture of the changes set to have a high impact in the near term, and the ideas that are likely to become increasingly important in the future. On one axis is how widely adopted the trend is, taking into account factors such as the momentum of startups in the space. On the other is the trend’s “market strength,” determined by the quality and number of investors behind it, investments in R&D, forecasts of its market size, and other indicators.\n\nFrom that data, CB Insights grouped the trends into four different categories:\n\nExperimental: Trends that are in their early stages or have proofs of concept, but that haven’t produced many useful products or aren’t widely adopted in the marketplace yet.\n\nTransitory: Ideas that retailers have been rolling out, but where there’s still a lot of uncertainly about their value and how retailers can best use them.\n\nThreatening: These have a large potential market and investment capital flowing into them, but only the earliest adopters have so far put them into practice.\n\nNecessary: The stuff with a clear, understandable value that lots of retailers have already put into place and shoppers are actively using. At this point, companies should already have plans for how to make use of these in 2019.\n\nThe dot colors in the chart refer to what part of the retail industry the trend affects. Blue is product, purple is merchandising, and orange is supply chain and distribution.\n\nThe value of stores that are destinations in themselves, as opposed to just places to transact sales, and of brand private labels is well-established by now. The same goes for personalized marketing, which allows brands to tailor things like ads and emails to the person receiving it, greatly increasing the chance of it being effective, and small-format stores, which make sense as e-commerce grows and giant stores become a burden. These rank among the “necessary” trends of 2019, according to CB Insights.\n\nMeanwhile, some of the trends with the greatest breakout potential are in the “threatening” category, since they’re receiving a good deal of interest and investment but aren’t common yet, such as in-store tech tech and data collection. The ColorIQ technology that beauty retailer Sephora launched some years ago is an example. Customers can use the handheld device to scan their skin in order to “precisely match skin tones to available products online and in-store,” CB Insights explains. “Each time customers scan their skin in-store, Sephora saves this data to personalize in-app and online product assortments.” That sort of data is invaluable to retailers, for personalized marketing and more. But not many retailers have been able to find opportunities like Sephora has.\n\nAlibaba’s “Smile to Pay” system at a KFC in China.\nMore radical possibilities for in-store tech and data collection emerging, though. In China, Alibaba has invested in companies developing facial-recognition technology, allowing it to do things like allow customers in a KFC to pay for meals with their faces. Due to privacy concerns, the US regulates facial-recognition technology more than China does. But, CB Insights notes, “If this type of technology does ever gain traction in the US, it could set a precedent for the types of data (down to consumers’ facial expressions) that retailers and other companies may be able to capture. This could help retailers bring personalization to an entirely new level—tailoring each consumer interaction based on data (for instance, an individual’s mood interpreted from a facial expression) to drive consumer interest and loyalty.”\n\nMore common, however, are other “threatening” trends, such as visual search, which a number of retailers have launched lately, including the fashion retailer Farfetch, which partnered with AI startup Syte to enable visual search in its iOS app. Another is in-store mobile commerce. One recent example: At the new Nike flagship in New York, shoppers can make their purchases through Nike’s app.\n\nFarfetch’s visual search function, powered by Syte.\nNot all trends worth paying attention to are things customers see. “One thing I’ve really been trying to zero in on and bring out in my research is the importance of supply chain and logistics to retailers,” says Natan Reddy, senior intelligence analyst at CB Insights. Notable in that group is inventory management, an obsession of retail’s for some time that means brands better optimizing how much of their products they make, when they make them, and where they distribute them. Companies such as Zara are expert in this arena, making them highly efficient and profitable.\n\nThe top supply-chain and distributions trends that are still “experimental,” according to CB Insights, include autonomous last-mile delivery and what Reddy calls “the perfect use case” for blockchain: monitoring the supply chain.\n\n“There tends to be a lack of communication between different players along the supply chain, whether that is a warehouse and manufacturer in China, a shipping company that’s shipping stuff over from China to the US, for example,” he says, noting that these tend to be disparate companies spread over different geographies. “What blockchain provides is a centralized platform for the different players to actually track where along the process that particular shipment or item is, and it reduces fraud, paperwork, and a whole other laundry list of things that create a lot of delays and cost.”\n\nBut that idea only works if brands and suppliers can get on the same platform. Instead, a number of separate pilot programs are in the works, which is why blockchain is still in the “experimental” category. Though Reddy adds that shipping giant Maersk and IBM have one promising project in the works that’s drawing many major global suppliers.\n\nWhat about the trends less likely to make a mark in 2019? “At-home voice assistants aren’t the game changer for at-home shopping that some may have hoped for,” CB Insights says in its report, noting that only about 2% of Amazon Alexa users had shopped using voice in 2018, according to a report from the summer. The situation could still change as the technology develops and more households around the world buy smart speakers.\n\nAnother is social commerce, depending on the country. In China, Pinduoduo has been a huge success with its mix of social media and e-commerce. American shoppers, however, have tended to treat those as distinct activities, which is why, despite many efforts over the years by companies such as Pinterest, Twitter, and Facebook to make social commerce work in the US, “most of the time it hasn’t gone well,” Reddy says. In 2019, it’s still not likely to.\n",
      "Folder": "Feedly",
      "Timestamp": "1546543555",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.438664Z"
}