{
  "id": "2cff19d65b2645aba02bdb247684680c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/target-redcard-worth-it/",
      "Title": "This Is Why You Should Consider Getting the Target Debit REDcard The Points Guy",
      "Selection": "Before there was Amazon, there was Target — that’s pronounced tar-ZHAY for those who like to fancy things up a bit. There’s still a place for Target, even in the age of Amazon Prime Now. The store with its distinctive red logo is the place we go when we’re out of toilet paper and toothpaste — and then walk out with a home’s worth of updated seasonal decor — potentially without the two items we actually need. It’s where we take our teething babies to get out of the house, our preschoolers who “earned” a trip to toy aisle or to just enjoy some Starbucks and in-real-life aisle browsing. Where some brick and mortar stores have shriveled up, Target is still very much a part of shopping culture in 2019.\n\nIn addition to offering instant shopping gratification, Target offers its VIP shoppers bonus savings: 5% off just about everything, free two-day shipping for online purchases of any amount when paying with the REDcard — plus a bonus 30-day window for returns. \n\nIf you love Target, you may already have the REDcard. If you don’t have it, now is a great time to consider signing up for one, because Target is offering a coupon for $35 off a $70+ purchase for new card holders who sign up by June 15, 2019.\n\nImage courtesy of Target\n\nTarget REDcard Facts\n\nFirst, know that there are two REDcards: a debit and a credit card. The debit card debits from your checking account and the credit card racks up a balance and sends you a monthly bill.\n\nBoth types of Target REDcard holders enjoy the following perks:\n\n5% off virtually anything in-store or online (A few exceptions apply, including prescriptions, eye exams and some gift cards) (But the 5% discount totally works on some third-party gift cards — such as for trips to Disney.)\n\n15% off and free shipping on subscriptions for select brands of formula, diapers and wipes\n\n5% savings at Target Starbucks locations\n\nFree two-day shipping on all purchases\n\nExclusive offers such as “buy two, get one free” books\n\nEarly access to fun, limited-edition items such as the Funko POP! Star Wars: Red Chrome Darth Vader\n\nAn extended return period (30 extra days) on all eligible items\n\nAs a general rule, many store credit cards are terrible on several fronts because they charge high APRs and offer poor benefits without any type of purchase protections. Furthermore, they often offer low credit limits.\n\nRelated: Best Credit Cards for Purchase Protections\n\nHowever, the Target REDcard debit card is a notable exception to some of these rules, because it offers savings and perks without triggering a credit pull or affecting any other aspect of your credit. The Target REDcard challenges our usual rule of thumb to avoid debit card spending because just about each dollar spent on this card earns you an effective minimum of 5% off, even before taking into account additional perks such as free shipping and limited-time offers or stackable coupons. Most debit cards don’t come close to those sort of rewards.\n\nWhy I Got the Target REDcard Debit Card\n\nThe $35 off $70 new card holder promotion prompted me to bite the bullet and apply for my own REDcard of the debit variety. (The coupon will be mailed to you when approved and valid until July 20, 2019.) I held off getting a REDcard until now because I never bothered to read the fine print, assuming that traditional rewards credit cards always offer the best bonus-earning potential. Now that I’m approved, I plan to use my REDcard primarily for online purchases under $35, which will allow me to take advantage of the free two-day shipping perk. It may be a silly reason, but sometimes Target offers $2 OPI nail polishes or similar sales on small items that wouldn’t be worth paying a $5+ shipping fee or a making a separate trip to the store.\n\nWhen I shop online, I also double-dip on my savings by checking CashBackMonitor.com and using whichever shopping portal is paying the best rewards at the time.\n\nHow to Get the Target REDcard\n\nFrom the Target.com homepage, navigate to the REDcard link at the top right corner. Once there, you’ll see application links for both the debit card as well as the credit card. Again, we generally suggest opting for the debit card version if you care about rewards cards, since there are credit cards that are much better for overall shopping and you probably don’t want to risk a Chase 5/24 slot.\n\nThe debit card application process was straightforward, but not super simple. I had to share my SSN, driver’s license and bank routing and checking account information. \n\nSince my REDcard is tied to a checking account, Target warned that I might initially find a spending limit imposed on my card, especially for the first few purchases. I was also warned that there would be daily-limit triggers based on the number of card uses per day, presumably for my financial protection.\n\nAfter I finished the application for the debit card, I had the option of verifying my account instantly by logging into my bank, or going the traditional route of waiting for Target to make a couple of tiny deposits with me verifying the amounts on the website.\n\nI thought this was a nice feature, since it would have allowed me to shop online immediately after sign up. Unfortunately, I was too eager to screen shot the page above, so I lost the ability to verify my account immediately. I will have to exercise patience.\n\nI’m really looking forward to seeing what sort of fun (and occasionally frivolous) purchases will now be more affordable with a few keystrokes or a trip to the local Target. Of course, I’m still responsible for keeping a keen eye on my spending — as I would be with any card, store-branded or otherwise. If you’re as tempted by the dollar aisle as I am, don’t forget to stack your earnings by signing up for Target Circle, a rewards program that is not tied to having the REDcard.\n\nFeatured photo by Eduardo Munoz Alvarez/VIEWpress/Corbis via Getty Images.",
      "Folder": "Feedly",
      "Timestamp": "1558776086",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.401845Z"
}