{
  "id": "2d578044c58841119b6b36b774206795",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://work.qz.com/1283784/how-to-negotiate-anything-the-common-verbal-tells-worth-listening-for/",
      "Title": "You can be a better negotiator just by listening for verbal tells Quartz",
      "Selection": "“You rarely learn anything while your mouth is open,” says Simon Letchford, managing director of Scotwork, a consulting company that specializes in corporate negotiations.\n\nThe truism is top of mind right now as he watches US president Donald Trump prep for a summit meeting with Kim Jong Un, leader of North Korea, over denuclearization. Neither leader is exactly known for his ability to stop talking and listen, Letchford says. But he’s observed executives with decades of negotiation experience in high-pressure situations nevertheless make the same mistake: “They tend to confuse negotiating with persuasion,” he says.\n\nRather than trying to convince people of your world view, Letchford argues, “there’s usually much more value to be had in a deal by being curious about the other side’s needs and priorities. And, he adds, you’re more likely to walk away from a bargaining discussion feeling satisfied if you can train your ear for “verbal tells,” which can betray a person’s position in ways they may not be aware of. Paying attention to these easy-to-miss signals can be the difference between reaching a deal or not.\n\nEven the most guarded negotiating partner will offer a few tells—for instance, with word choice. When a person says, “That would be really difficult,” most of us hear that as a “no,” but we ought to remain curious. As Letchford notes, difficult is not the same as impossible. So ask, “What would make that possible?”\n\nThe fact is, we commonly ignore hedging words like “about” or “around” that we mentally discount as fillers, because we’re primed to pay more attention to negative messages. If someone says, “I need it to come down by about 12%,” says Letchford, “what they’re really saying is, ‘I don’t need 12%.’”\n\nIndeed, one tiny qualifier can radically change the tenor of a discussion. That’s why Carol Dweck, the Stanford University professor behind the “growth mindset” theory, encourages managers to tack on the word “yet” when offering feedback, to keep clear “a pathway to the future” that can be signaled to the recipient of the feedback. It’s also just the sort of sentiment that could take a negotiation to a new level, if you’re listening for it.\n\nIn many cases, one sentence will contain several tells that likewise could serve as signposts. Take: “I can’t do that right now,” Letchford offers, which could be interpreted in a handful of ways.\n\nWhat most people will hear is “no,” which would close off unexplored avenues. But a better negotiator will say, “Okay, you can’t do that right now, so maybe later? What would make that happen?” says Letchford. An even more alert negotiator, he continues, would seize on the “I.” Maybe you need to bring in someone else who can make your request happen. Finally, a champion deal maker would be attuned to the “that.” If not “that,” you might respond, is there something else that could be done?\n\nThat kind of listening is a skill that used to come naturally to us, says Letchford. Children, he says, are inherently more curious, and typically not embarrassed to ask questions that reveal what they don’t know. Adults are far more addicted to their own Kool-Aid, and are more fearful of being exposed for not being in the know on something, for instance when they hear an acronym they’ve never encountered before. As we age, Letchford says, we lose “the art of really actively hearing what the other side is saying.”\n\nIn their training sessions, Scotwork’s consultants will film clients in mock negotiations and analyze the tape with them afterward, looking for missed opportunities. Watching the playback, most people are stunned to see what they missed when they believed they were listening—which is why, Letchford says, it’s always prudent to have an extra pair of ears on a call, or at the table.\n\nLately, computational analyses of large data banks of text have uncovered surprising language patterns. We now know, for instance, that people with depression use certain words more often than others do, including personal pronouns (“I,” “me,” and “myself”) and absolutist words (“always,” “nothing,” “completely”). In minutes, we can detect bias in textbooks and measure voter sentiment toward election candidates.\n\nUntil we figure out how to bring the same computational power to the negotiating table, you can train yourself to scan language for patterns just by paying attention.\n",
      "Folder": "Feedly",
      "Timestamp": "1527023620",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.468258Z"
}