{
  "id": "2d729ca0e5674701937a2f4ce8b39cda",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2016/7/18/12216406/colorize-black-and-white-photos-algorithmia-tool-image-editing",
      "Title": "This tool will instantly colorize your black-and-white photos The Verge",
      "Selection": "Have you ever thumbed through vintage postcards at a flee market and come across black-and-white photographs of a town or monument livened with a layer of water color or colored pencil? A new service on Algorithmia uses a deep learning algorithm to accomplish a similar result.\n\n\nTo give it a try, simply paste the URL of a black-and-white image and tap \"colorize it.\" After a few seconds of processing, a comparison of the original and colorized images appears. From our limited experimentation, it seems like Alogirthmia’s tool works best with images of faces, simple landscapes, and clear skies.\n\n\n\nHere are two examples we created. The first image is the original image, the second is a greyscale version, and the third is the colorization by Algorithmia.\n\n\nThe algorithm fails to differentiate the people and the setting, resulting in a muted-brown wash. Of course, this was meant as a curveball to test the tool’s limits. The results were much better when the original image featured faces and unobstructed bodies.\n\n\nSome folks on Reddit have found even better results. From user TheFeatheredFish, here are the before and after results of a classic photograph of an American city.\n\n\nThe colorization tool is just one part of Algorithmia’s API, which does everything from summarizing English text to detecting nudity in pictures. We first saw a method for colorizing black-and-white photos in April when researchers from Waseda University published their method along with a number of samples.\n",
      "Folder": "Feedly",
      "Timestamp": "1468886345",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.731814Z"
}