{
  "id": "2d8d9fa789bc40588978ce7178a7490a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.fangraphs.com/blogs/the-white-sox-big-bets-on-risk/",
      "Title": "The White Sox’ Big Bets On Risk FanGraphs Baseball",
      "Selection": "On Tuesday, the White Sox completed their latest trade, sending Todd Frazier, David Robertson, and Tommy Kahnle to New York for a trio of prospects and Tyler Clippard, who was included as a salary offset. In the span of four major trades, the team added 15 minor leaguers, including most of their best-ranked prospects now. And when you look at where these guys rank on the Baseball America mid-season Top 100, it’s easy to see why White Sox fans are excited about the organization’s now-bright future.\n\nCHW’s Recently Acquired Prospects\n\nBA Rank\n\nPre-Season Rank\n\nPlayer\n\nPosition\n\n1\n\n1\n\nYoan Moncada\n\n2B\n\n5\n\n11\n\nEloy Jimenez\n\nOF\n\n20\n\n24\n\nMichael Kopech\n\nSP\n\n36\n\n37\n\nBlake Rutherford\n\nOF\n\n59\n\n23\n\nReynaldo Lopez\n\nSP\n\n75\n\n40\n\nLucas Giolito\n\nSP\n\n83\n\n90\n\nDylan Cease\n\nSP\n\nThat’s seven Top 100 guys, and by BA’s pre-season rankings, seven top 40 guys. The Braves are the only other team to even put seven guys in the top 100, much less trading for seven top 100 guys in the span of eight months. And we’re not even including international signing Luis Robert, who BA ranked 45th. Throw him into the mix and the White Sox basically created an elite farm system from scratch in less than a year.\n\nRick Hahn deserves a lot of credit for the moves he’s made in rebuilding the White Sox, and the team certainly has a brighter future now than they did at the end of last year. That said, there’s also a pretty clear pattern emerging among the guys the White Sox have acquired; the perceived upside outstrips the actual performance record right now. Put simply, the White Sox have repeatedly bet on guys whose hype isn’t quite yet supported by actual performance.\n\nLet’s take a look at those same prospects again, only instead of looking at BA’s rankings, let’s look at how they rate by Chris Mitchell’s KATOH system, which is based solely on a player’s performance record. We’ll also include their KATOH+ ratings, which adds in BA’s rankings for an attempt at a holistic stats-and-scouting blend.\n\nKATOH’s View of New CHW Prospects\n\nPlayer\n\nKATOH\n\nKATOH Top 100\n\nKATOH+\n\nKATOH+ Top 100\n\nYoan Moncada\n\n8.6\n\n20\n\n15.6\n\n3\n\nEloy Jimenez\n\n4.7\n\n87\n\n11.5\n\n12\n\nMichael Kopech\n\n3.2\n\n5.1\n\n60\n\nLucas Giolito\n\n3.8\n\n4.3\n\n80\n\nDylan Cease\n\n2.2\n\n2.7\n\nBlake Rutherford\n\n1.0\n\n2.7\n\nReynaldo Lopez\n\n2.1\n\n2.6\n\nFor every one of the main pieces returned in the team’s four big trades, the stats-only version of KATOH is lower than the KATOH+ version, which incorporates BA’s rankings. And not in small ways. Based solely on their performance data to this point, Moncada and Jimenez project to produce about half of the value compared to when you include their BA rankings. And Rutherford stands out as the biggest outlier of all, ranking as a top-tier prospect in both the pre-season and mid-season BA lists, but grading out as a fringe prospect at best by his actual performance record to this point.\n\nOf course, stats-only models are ignoring hugely important factors in a player’s development, and no one should look at KATOH’s numbers and think those are the right ones. Performance record is important, but it’s definitely not everything, and you’re always better off including as much good information as you can, which is why KATOH+ will do a better job of projecting players than the stats-only model.\n\nBut it’s also not a coincidence that these were the guys who weren’t off limits in negotiations. While it’s not like the Red Sox were eager to give up Yoan Moncada, his performance — specifically his contact rate — raised some red flags, and made him a bit more of an offensive question mark that the usual type of players who are rated as the best overall prospect in the game. The upside is obvious, but as Chris Mitchell noted this morning, the bust potential here is also high enough that KATOH isn’t quite as high on him as everyone else.\n\nThe same is true of Jimenez and Rutherford, both of whom project as corner outfielders, and will have to hit really well to be legitimate stars in the big leagues. Jimenez is doing actual damage against low-minors pitchers, but Rutherford isn’t yet showing much power, and both of these guys are basically nothing if they don’t hit. And the history of guys who have to hit in order to be valuable big leaguers is strewn with top prospects who didn’t pan out. Again, plenty of risk here.\n\nThen there are the arms. Michael Kopech still has serious control problems. Reynoldo Lopez still doesn’t miss as many bats as you’d like from a guy with his stuff. Giolito has started getting strikeouts lately, but his walk rate is too high, and he’s still giving up home runs. Thanks to Tommy John surgery slowing down his career, Cease is still in low-A ball at 21, and like all these other guys, walks too many hitters right now.\n\nThese seven guys all have really impressive physical tools, but they also each have pretty significant flaws at the moment, most of them revolving around the strike zone. Certainly, these guys can improve from what they currently are, but part of the reason the White Sox were able to acquire all these guys is that their development is anything but guaranteed. Rick Hahn prioritized upside in his acquisitions, and while he’s done a great job picking up guys that have obviously high ceilings, we also shouldn’t be surprised when most of these guys don’t make it.\n\nObviously, there are risks with every prospect, and saying that a bunch of them are going to fail isn’t breaking news. But it’s notable that the White Sox have landed risky prospects even by prospect standards, and the performance records of the guys Hahn has been acquiring don’t yet match up with their prospect rankings. For these deals to work out as well as the White Sox hope, their player development system is going to have to take some raw materials and turn them into polished big leaguers.\n\nThe White Sox system is now very strong, and their future is bright. But it’s pretty clear that Hahn has targeted upside over performance in trades, and that means he’s had to accept a lot of risk to get these returns. Pretty soon, the White Sox might want to start adding some guys who have a bit lower ceilings but better chances of turning into Major Leaguers, because as this teardown shows, having a few stars surrounded by a bunch of busts doesn’t really equal a winner.",
      "Folder": "Feedly",
      "Timestamp": "1500591541",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.649726Z"
}