{
  "id": "2db4d883d2844865b1668465e395caf2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/991766/j-crew-plans-to-lower-its-prices-to-revive-itself-ceo-mickey-drexler-says/",
      "Title": "To be less “elitist,” J.Crew plans to lower its prices Quartz",
      "Selection": "A decade ago, J.Crew was a defining force in the way Americans dressed. In 2008, its colorful, unfussy prep reached a milestone, when Michelle Obama wore one of the brand’s yellow cardigans on The Tonight Show with Jay Leno. That cardigan signified accessibility. Everyone could—and did—wear J.Crew, up to and including the first lady of the United States.\n\nJ.Crew has since fallen dramatically from that position. For more than two years now, sales at stores open at least a year have been dropping. Its image has changed too. Once accessible, J.Crew now believes it has become too “elitist,” as CEO Mickey Drexler framed it in a recent interview with the Wall Street Journal (paywall).\n\nAs J.Crew does all it can to stabilize its business—some analysts fear that it won’t be able to pay off its $2 billion of debt—it’s working to counter the problem by lowering prices and changing the way it markets itself. It’s already slashing price tags on around 300 items, and using data analytics to determine the best prices for its offerings.\n\nThe retailer also wants to return to being the brand for everyone it once was. The general feeling among former fans is that it got too eccentric in its product and image, especially the styling of its beloved catalogs. The blame is usually put on former creative director Jenna Lyons, who guided the brand’s ascendance, but kept pushing it toward more fashion-forward territory. Shoppers complained that prices got too high, climbing to hundreds of dollars for an item such as a cashmere skirt, and the cool, creative look didn’t match their ordinary lifestyles.\n\n“We gave a perception of being a higher-priced company than we were—in our catalog, online and in our general presentation,” Drexler told the Journal. “Very big mistake.” In April, J.Crew shook up its organization, parting ways with Lyons and cutting about 250 jobs, primarily from its headquarters.\n\nIt’s also looking to cheaper sourcing options than China and trying to speed up how quickly it can get products into stores. Quicker, cheaper fast-fashion competitors have dominated the market for several years, and J.Crew admits it didn’t foresee how much speed and price would influence what shoppers did—and didn’t—buy.\n\nAccessibility, in both look and price, is J.Crew’s goal now, as it tries to convince people to return to it for their clothes, and without waiting for one of the sales J.Crew seems to have perpetually going on. It won’t be easy. Shoppers expect everything cheaper than ever, and J.Crew faces tough competition from fast fashion.\n\nThings have changed a lot since that yellow cardigan.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1495754958",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.669049Z"
}