{
  "id": "2de11511e3324cc194e58a27d007fad6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://quartzy.qz.com/1133090/the-most-influential-pop-music-artists-of-all-time-according-to-social-network-analysis/",
      "Title": "The simple statistical analysis that explains the entire history of popular music Quartz",
      "Selection": "In national security, social network analysis is used to identify potential terrorists. In marketing, it can uncover the Instagram influencers who are best positioned to sell a company’s product.\n\nBut social network theory—the study of how different people or things interact with one another, often revealing the most influential and well-connected people among a certain population—can also, unexpectedly, explain the entire history of popular music.\n\nQuartz recently highlighted the musicians who affect our lives the most by looking at the artists whose work has influenced the most number of other artists, using information supplied by online music database AllMusic. Here are the top 25:\n\nDigging deeper, we can get even more profound insights into the trajectory of popular music by looking at measures outside of direct influence.\n\nFor instance, one simple measure is how much an artist has influenced multiple “generations.” The following chart combines musicians’ number of direct influences with the number of artists that those people have in turn influenced; think of the musicians topping the list as the “grandparents” of pop music, inspiring singers and songwriters decades down the line. Looking at the data this way, rock pioneers like Chuck Berry, Elvis Presley, and Little Richard rise in the rankings.\n\nTo go even further, we can also look at the artists that serve as the connectors amongst other artists—a term known as “betweenness centrality.” This measures, essentially, the artists that would be most frequently brought up in a game of six degrees of separation. The artists that jump the most in the rankings by this metric are James Brown, Stevie Wonder, Prince, Michael Jackson, and Frank Zappa.\n\nMatthew Denny, a social network analysis researcher at Penn State University, explains the stylistic pattern behind these numbers: “A high betweenness centrality suggests you were more important in passing on traditions. Also, someone who created their own branch of music would score higher by this metric.” James Brown, for example, was influenced by early blues, rock, and jazz musicians and went on to inspire a generation of funk and hip-hop artists. His central place in music history stems from his role as a conduit for a range of musical traditions.\n\nBetweenness Centrality Ranking\n\nRank\n\nArtist\n\nChange in rank vs. direct influence\n\n1\n\nThe Beatles\n\n=\n\n2\n\nBob Dylan\n\n=\n\n3\n\nJimi Hendrix\n\n+5\n\n4\n\nMiles Davis\n\n+8\n\n5\n\nJames Brown\n\n+12\n\n6\n\nThe Rolling Stones\n\n-3\n\n7\n\nJohn Coltrane\n\n+9\n\n8\n\nBrian Eno\n\n+5\n\n9\n\nDavid Bowie\n\n-5\n\n10\n\nThe Velvet Underground\n\n-4\n\n11\n\nKraftwerk\n\n+4\n\n12\n\nElvis Presley\n\n+11\n\n13\n\nStevie Wonder\n\n+16\n\n14\n\nSonic Youth\n\n=\n\n15\n\nLed Zeppelin\n\n-4\n\n16\n\nPrince\n\n+15\n\n17\n\nThe Beach Boys\n\n-12\n\n18\n\nPink Floyd\n\n+4\n\n19\n\nJoni Mitchell\n\n+8\n\n20\n\nNeil Young\n\n-13\n\n21\n\nThe Clash\n\n-2\n\n22\n\nDuke Ellington\n\n+14\n\n23\n\nMichael Jackson\n\n+30\n\n24\n\nMarvin Gaye\n\n+9\n\n25\n\nFrank Zappa\n\n+33\n\nAnother measure commonly used in social network analysis is “closeness centrality”: how many steps it would take for one person to reach all the other people in a given population. In music, this means that the artists who flit from genre to genre—or create their own sounds that defy categorization—are ultimately more influential than ones who rise to the top of one specific genre.\n\nNeil Young and the Beach Boys are both regarded as seminal figures in musical history, but they fall in this ranking, while Prince, a singer who actively eschewed genre, rises in impact. Others getting a boost by this measure include foundational rockers like Chuck Berry and Little Richard, as well as more idiosyncratic artists like George Clinton’s Funkadelic and German experimental group Can.\n\nCloseness Centrality Ranking\n\nRank\n\nArtist\n\nChange in rank vs. direct influence\n\n1\n\nThe Beatles\n\n=\n\n2\n\nJimi Hendrix\n\n+6\n\n3\n\nBob Dylan\n\n-1\n\n4\n\nThe Rolling Stones\n\n-1\n\n5\n\nDavid Bowie\n\n-1\n\n6\n\nJames Brown\n\n+11\n\n7\n\nThe Velvet Underground\n\n-1\n\n8\n\nMiles Davis\n\n+4\n\n9\n\nChuck Berry\n\n+23\n\n10\n\nBrian Eno\n\n+3\n\n11\n\nLed Zeppelin\n\n=\n\n12\n\nPink Floyd\n\n+10\n\n13\n\nElvis Presley\n\n+10\n\n14\n\nLittle Richard\n\n+100\n\n15\n\nJohn Coltrane\n\n+1\n\n16\n\nThe Stooges\n\n+2\n\n17\n\nFunkadelic\n\n+70\n\n18\n\nThe Who\n\n+2\n\n19\n\nThe Beach Boys\n\n-14\n\n20\n\nPrince\n\n+11\n\n21\n\nNeil Young\n\n-14\n\n22\n\nKraftwerk\n\n-7\n\n23\n\nThe Byrds\n\n-13\n\n24\n\nCan\n\n+24\n\n25\n\nSex Pistols\n\n+3\n\nUnfortunately, the available data is not granular enough to project this analysis forward, revealing which musicians active today will prove most influential in the future. Yet the basis for such work is there, with the patterns of influence in pop music history as clearly identifiable as the chorus of a song.\n\nWhat’s also clear is that whoever emerges in the rankings in the years to come—don’t bet on the Beatles being dethroned anytime soon.\n",
      "Folder": "Feedly",
      "Timestamp": "1511183784",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.568586Z"
}