{
  "id": "2e46ee7d00ec402b8b98a1c686e6a13c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://ritholtz.com/2018/05/tlc-medallion-owners-created-uber/",
      "Title": "How the TLC & Medallion Owners Created Uber The Big Picture",
      "Selection": "Taxi Cab Owners and Regulators Created Uber\nThe number of cars for hire didn’t rise with demand. What would you expect?\nBloomberg, May 4, 2018\n\n \n\n \n\nOn this day May 4, 2011, Uber NYC launched. It filled an enormous, artificial void that was created by the Taxi and Limousine Commission at the behest of the Yellow Cab medallion owners.\n\nIn New York, Uber has been thrust back into the news after several Yellow Cab driver suicides (read this or listen to this) and indebtedness and families of survivors are blaming the stress of competing with smartphone ride-hailing services. The New York City Council is looking to limit or perhaps even reverse the expansion of app-based rides.\n\nThis is a terrible idea.\n\nThis is because it was market forces — plain, pure and simple — that created the demand for ride services like Uber, Lyft and others. 1 Indeed, these companies might not have achieved the wild success they found in New York but for the combination of the TLC’s aggressive incompetence and the medallion owners’ unbridled greed. Since the 1970s, these two groups have made taxi service in New York abysmal while enriching themselves. They did this by keeping the number of taxi medallions at an artificially low number and ignoring demand, much to the eternal dismay of anyone trying to hail a cab.\n\nA little history: The TLC was created in 1971 to “wrest control of taxi industry regulation away from the [New York City] Police Department,” according to Biju Mathew, 2 author of “Taxi!: Cabs and Capitalism in New York City.” This change took curbside ride-hailing from bad to worse and the TLC began a rich epoch of corruption and failure, marked by indictments and convictions.\n\n \n\nContinues at: Taxi Cab Owners and Regulators Created Uber\n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1526040694",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.509119Z"
}