{
  "id": "2e480738d9d14e9f9bd669c1108344df",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://work.qz.com/1181261/womens-march-leader-linda-sarsour-stop-telling-me-to-go-back-to-my-country-im-from-brooklyn/",
      "Title": "Women’s March leader Linda Sarsour Stop telling me to go back to my country. I’m from Brooklyn Quartz",
      "Selection": "“I stand here before you unapologetically Muslim-American. Unapologetically Palestinian. Unapologetically from Brooklyn, New York. Sisters and brothers, you are what democracy looks like,” Linda Sarsour told half-million protesters on Jan. 21, 2017, at the Women’s March on Washington.\n\nAs one of the three co-leaders of what was likely the largest single-day demonstration in US history, Sarsour made a promise to the massive crowd: “You can count on me, your Palestinian-Muslim sister, to keep her voice loud, keep her feet on the streets, keep my head held high, because I am not afraid.” Fear, she stated, is a choice. And having become an outspoken civil-rights activist after 9/11, Sarsour epitomizes what it means to choose empowerment over fear.\n\nIn an era when Muslim women are being systematically discriminated against, Sarsour refuses to tone down her anger or her universal call for love. She wears a hijab proudly, and in the words of Barack Obama’s White House, “shatters stereotypes of Muslim women.” In profound yet accessible language, she articulates why liberation and safety for Muslim Americans is not complementary to, but rather essential to, liberation and safety for all Americans.\n\nNow national co-chair of the Women’s March and executive director of MPower Change, a grassroots movement rooted in diverse Muslim communities across the US, Sarsour has been at the forefront of major local and national social-justice campaigns over the past two decades. She was formerly the executive director of the Arab American Association of New York, co-founder of Muslims for Ferguson, and a member of the NY Justice League. In 2011, she was honored by then-president Obama as a “Champion of Change.” Writing in Time, New York senator Kirsten Gillibrand credited Sarsour and her Women’s March co-chairs as “the suffragists of our time,” driving the “rebirth of the women’s movement.”\n\nIn an interview with Quartz, Sarsour explains why liberation depends on intersectionality, the native Brooklyn grit that fuels her success, and the freedom of giving without expecting gratitude in return.\n\n1. What’s your big idea that other people aren’t thinking about or wouldn’t agree with? Why is it so important?\n\nWe cannot win if we do not organize across communities, issues, and movements. Intersectionality is a term introduced to us by Dr. Kimberley Crenshaw, and now the implementation of her vision is the key to winning elections in 2018 and long-term, systemic changes. We have to begin seeing ourselves as whole human beings who are impacted by a multitude of issues, so our approach must be holistic and inclusive. Alleviating suffering of the most marginalized communities must begin with assessing the needs of entire communities and allowing the most marginalized to lead the strategy. My belief is those closest to the pain are closest to the solution.\n\n2. What behavior or personality trait do you most attribute to your success?\n\nI have a very resilient Brooklyn personality that allows me to stay thick-skinned and focused on my mission and goals. As an activist, organizer, Palestinian, and a Muslim-American woman, I have faced many obstacles in the industry I work in. I often have to fight for my seat and representation for the communities I represent. I also face intense criticism, vicious hate, and threats—so my Brooklyn grit, take-no-crap attitude has helped me succeed, has grounded me in why I do the work I do, and kept me focused on winning campaigns centered around justice for communities in New York City and nationally.\n\n3. If you could make one change to help women at work, what would it be?\n\nWomen need to find the courage to demand what they rightfully deserve. Women should be paid for the same work as their male counterparts, ask for promotions, and stand in their power in their place of employment, whether they are in a boardroom or in the movement. Women need to reprogram the work culture we have been fed that says women shouldn’t be so aggressive and “bossy.” Taking initiative and leadership is what women have always been good at when given the opportunity and space.\n\n4. At the start of your career, what do you wish you had known? What, if anything, do you wish you had not believed?\n\nAt the start of my career as a full-time activist and organizer, I wish I would have known how time consuming and physically and emotionally draining the work to fight for civil and human rights for all people is, but especially for Muslim Americans in a post-9/11 America. I wish I would have known that I too would experience trauma, and to have better prepared myself. I believed in people and their will to stand up against powerful forces and for the most marginalized, but as I got deeper into the work, apathy was everywhere and very discouraging.\n\n[series-recirc]\n\n5. When in your career did you feel most despondent, and what did you do to turn it around?\n\nI find myself feeling despondent often under this new administration. I work with families who are separated due to the Muslim ban or undocumented youth who fear deportation or friends and family who need their healthcare to survive. I find hope in spending time with those most marginalized by organizing and resisting against this administration, and reminding them that they still have power and we have their back. The continued protests from the Women’s March, the airport protests to welcome refugees, and working against the tax-reform bill gave me the fortitude to keep moving forward.\n\n6. A key part of success is building strong professional relationships. What practice do you use to cultivate them with your colleagues?\n\nAs an organizer, I see the power of the one-on-one: This is an organizing tool where you meet people individually to understand their goals, their values, and the things they care about. My most prized possessions are open, honest relationships based on respect and dignity where my colleagues feel that I am there for them professionally and personally. I enjoy coffee meetings, drinks (non-alcoholic for me), and dinners with my co-workers. This helps with team building, trust, and more productive work environments.\n\n7. What’s the best advice you’ve ever received?\n\nThe best advice I ever received was from one of my mentors, Dr. Ahmad Jaber, who told me to never expect or wait for anyone to thank me for doing good by others. This work for justice is more to take care of my heart and my soul, and eventually I will be rewarded when I least expect it.\n\n8. If there’s one thing men can do to improve women’s life at work, it would be…\n\nIf there’s one thing men can do to improve women’s life at work, it would be to treat women with the utmost respect and give up their seats and opportunities when appropriate to a woman, especially women of color who often go unnoticed.\n\nBonus Questions:\n\nThe mountain I’m willing to die on… is a marathon of Seinfeld.\n\nI wish people would stop telling me… to go back to my country. BROOKLYN IS MY COUNTRY.\n\nThis interview is part of How We’ll Win, a project exploring the fight for gender equality at work. Read more interviews with industry-leading women here.\n",
      "Folder": "Feedly",
      "Timestamp": "1518138147",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.496645Z"
}