{
  "id": "2fd7a080a87c49418fa51fb6d08a1c70",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1429371/a-new-study-shows-how-middle-america-is-really-doing/",
      "Title": "Middle America is doing a lot better than you think Quartz",
      "Selection": "The forgotten Americans that helped elect Donald Trump are now getting a lot of attention from economists and policy analysts that once overlooked the region.\n\nThis week, the Walton Family Foundation, along with the Brookings Institution, contributed to the growing field of research with The State of the Heartland Factbook, which collects more than 20 socioeconomic indicators across 19 states in the middle of the country. It’s an attempt to move beyond the “the proliferation of red vs. blue maps and apocalyptic talkshow punditry” that its authors say have made it harder to understand the region.\n\n“Let’s look at the facts and not allow perception to rule the day,” said Ross DeVol, a Walton Foundation fellow who contributed to the report. And the data show that many parts of the heartland are doing just fine.\n\nIncome equality\n\nAs defined by the authors, the heartland includes Ohio, Michigan, Indiana, Illinois, Wisconsin, Missouri, Kansas, Iowa, Minnesota, Nebraska, South and North Dakota, Kentucky, Tennessee, Alabama, Mississippi, Arkansas, Oklahoma, and Louisiana. Many of the indicators included in the factbook show that in some areas, the region hasn’t fared any worse than the rest of the country. In others, like wage growth, it has done better.\n\nThe differences between the coasts and the middle aren’t as stark as public perception suggests. Adjusted for purchasing power, average wages in the heartland were $48,000 in 2016, just $1,000 lower than in the rest of the country.\n\nWhile the region remains significantly more rural than the rest of the country, its large metros—places like Nashville, Minneapolis-Saint Paul, and Oklahoma City—are adding people at a faster pace than in the rest of the country.\n\nWinning exporters\n\nWhile Trump has focused on the manufacturers that left, many remain in the heartland. More than 12% of the area’s GDP is based on exports, higher than the 9.6% in the rest of the country.\n\nThe heartland is particularly strong in the high-tech manufacturing that produces good-paying jobs. The sector makes up nearly 10% of the economy compared to a little above 6% in the rest of the country, and it’s been growing much faster too.\n\nThe region’s farmers, which produce 55% of all crops in the country, are also strong exporters, though the president’s tariff-driven trade policy is making their line of business iffier.\n\nMore education, fewer tariffs\n\nThe state of the heartland starts looking less bright when it comes to education and innovation. Research and development spending as a share of GDP is 2% vs. 2.9% elsewhere. It has only 25 of the top-100 research universities—which can develop commercial applications for technology—though it makes up 30% of the country’s population. The research universities it does have are not evenly spread; six heartland states don’t have any.\n\nOver the past couple of decades, the heartland has been getting a dwindling share of the available venture capital in the US, with most of it being poured along the coasts.\n\nBut perhaps more worryingly, the region’s residents are far behind their counterparts elsewhere in more basic ways. Nearly 7% of them don’t have access to broadband, almost double than the rest of the country. They also lag in education: the share of adults with a bachelor’s degree is 28% vs. nearly 33%. The gap gets a lot wider depending on the state—in Mississippi and Arkansas, university graduates make up closer to 22% of the adult population—or by race and ethnicity.\n\nHeartland Summit\n\nThe study’s authors, along with some 350 entrepreneurs, investors, academics, and business executives will be discussing what kinds of policies need to be put in place to address those challenges at the Heartland Summit, a three-day event in Bentonville, Arkansas. (Its motto: “Meet in the Middle.”) From the get-go, it’s pretty clear that trade tariffs won’t cut it.\n\n“More people are recognizing that if you don’t widely share economic growth geographically it can pull countries and places apart,” said DeVol.\n",
      "Folder": "Feedly",
      "Timestamp": "1540023249",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.462430Z"
}