{
  "id": "3011fb589f43470791dfb82b851790b9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/amex-business-platinum-wework-benefit-sign-up/",
      "Title": "You Can Now Sign Up for the Amex Business Platinum’s WeWork Benefit The Points Guy",
      "Selection": "American Express has slowly been refreshing its card portfolio, introducing new benefits and increasing earning with cards like the American Express® Gold Card and the American Express® Business Gold Card. Most recently, the card issuer announced changes to the Business Platinum® Card from American Express, adding up to $200 in statement credits toward Dell purchases each year, and a yearlong membership to WeWork. These additional perks come with a higher annual fee: $595, up from $450.\n\nIf you’ve never heard of WeWork, it’s a rapidly growing real estate company that provides flexible office space with amenities, hip decor and events to entrepreneurs and startup companies around the world.\n\nUntil today, we did not know exactly what type of membership card holders would receive other than that WeWork and Amex claimed it was a benefit worth $2,700.\n\nThe lobby of WeWork branch in Shanghai, China. (Photo by Xinhua/Pei Xin via Getty Images)\n\nAmex has shared the details of the benefit, which you can now register for here. Note that this is not an ongoing benefit, and will only be valid for one year after you register.\n\nBusiness Platinum card holders will receive 12 months of WeWork Platinum Global Access. Platinum Global Access is only available to Business Platinum card holders, meaning those without the card will not be able to purchase this type of membership.\n\nWhat exactly do you get with Platinum Global Access? WeWork describes it as such:\n\nPlatinum Global Access includes access to WeWork’s 300+ locations around the world, during local business hours. This includes access to open workspace and premium amenities, including Wi-Fi, phone booths, and refreshments, like coffee, tea, and fruit water. Platinum Global Access members also get a dedicated member support team and invites to exclusive Platinum Global Access-only events.\n\nWhen I started working at TPG in 2016, we were actually based in a WeWork in downtown Manhattan (oh, how things have changed). WeWorks generally have a common area with tables, couches and a kitchen — adjoining these areas are private offices that are rented out by individuals and companies. With Platinum Global Access, you’ll only have access to these common workspaces, not a private office.\n\nThis seems similar to WeWork’s basic “Hot Desk” option that starts at $220 a month — that’s likely where the $2,700 valuation comes in ($220 x 12 = $2,640). Although unlike other memberships, Platinum Global Access grants entry to all locations without any additional fee.\n\nWeWork says that Platinum Global Access will only allow access to WeWork buildings during normal business hours, from 9 am to 6 pm, Monday through Friday. While common spaces typically close at 6pm, Amex notes that office hours do vary by location so you may be able to spend more time there, especially if you’ve already entered the building. You’ll have access to conference rooms and printing, but you’ll have to purchase credits if you want to use either.\n\nFinally, you can book a hot desk in advance, which can be done in as little as an hour ahead of time. Members can still swipe into a WeWork without advanced notice but there may be times when a location is at capacity, so booking ahead can help guarantee a space to work, an Amex representative told TPG.\n\nWhen to Sign Up\n\nYou can sign up for the benefit here, and although the official launch date isn’t until Feb. 15, Amex confirmed with us that you can start using the offer immediately. Once enrolled, you’ll receive a welcome email from WeWork (two to three business days after signing up) which will notify you that you can start booking space at one of WeWork’s 425 locations around the globe.\n\nOnly primary card holders are eligible for the benefit, so any authorized users won’t be able to get a membership of their own.\n\nAnother important thing to consider is when to enroll. You’ll have to sign up by Dec. 31, 2019 — after that the benefit will no longer be available — but your yearlong membership will begin on whatever date you enroll. It may make sense to wait to sign up until you know when you’re actually going to start using WeWork.\n\nFor more on the Business Platinum Card from American Express, see:\n\nCredit Card Review: The Business Platinum Card From American Express\n\nAmex Business Platinum Now Offers WeWork Access and Has a Higher Fee\n\nFeatured image courtesy of WeWork.\n",
      "Folder": "Feedly",
      "Timestamp": "1549688691",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.401657Z"
}