{
  "id": "3036890b0bc64e78b698f53a23a496c1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.getrichslowly.org/2018/01/22/salary-negotiation/",
      "Title": "How to negotiate your salary (and earn an extra half-million dollars in your lifetime) Get Rich Slowly",
      "Selection": "Some folks claim that if you do what you love, the money will follow. Others say that a job is just a job — you’re not meant to like it. The truth lies somewhere between these two extremes. There are few things worse than a job you hate; and many people enjoy fun, fulfilling careers while earning a good living.\n\nWhatever the case, any job is more bearable if you’re paid well. Plus, a high wage means more money to pursue your goals and dreams. One of the best ways to increase your income is at the source: during salary negotiations when you land a job.\n\nWhy You Should Negotiate Your Salary\n\nFor many people, salary negotiations are awkward or scary. But in his book Negotiating Your Salary: How to Make $1000 a Minute, career coach Jack Chapman argues that those few minutes during which you ask for more money in an interview can make a difference of tens of thousands of dollars over your lifetime. Maybe even hundreds of thousands. He says you can literally earn $1,000 per minute if you do this right.\n\nResearch backs him up. According to a 2010 study conducted by George Mason University and Temple University, failing to negotiate on an initial job offer could mean missing out on over $600,000 in salary during a typical career.\n\n“We spend years thinking about what we’ll be when we grow up,” Chapman writes. “But when it’s time for a raise, most of us just accept whatever we’re offered. How many minutes do we spend negotiating the money? Zero.”\n\nOnly about half of all applicants negotiate their salary; don’t be one of these folks. If you don’t ask for more money, your employer certainly won’t just give it to you.\n\nBefore we look specifically at negotiating salary, let’s review the basics of negotiation in general.\n\nYou Can Negotiate Anything\n\nIn his book You Can Negotiate Anything, Herb Cohen writes that there are three crucial variables in every negotiation:\n\nPower, or the ability to get things done. In salary negotiations, you gain power from perceived expertise or legitimacy. The better qualified you are for a position, the more leverage your have. You also gain power through persistence, attitude, and taking calculated risks. You have power if you’re willing to walk away; if you’re not, the company can name its price.\n\nTime. In negotiations, the side with the most time generally has an advantage. No matter how much pressure you’re under, always keep your cool, maintaining an appearance of calm. Having other options buys you time. You’re in a better bargaining position if you already have a job (or job offer) and don’t need to accept his one. When you believe you have to have something, the other side can easily manipulate you.\n\nInformation is the final piece of the puzzle. The more you know, the stronger your position. Do your research before you negotiate. During negotiations, act on whatever new info comes to light. The interviewer’s questions, responses, and attitude all give you valuable information.\n\nNow let’s look at two (very similar) methods for negotiating your salary.\n\nNote: Remember that these techniques are generally applicable for discussions during a performance review. You can use these ideas to ask for a raise, not just to negotiate your salary for a new position.\n\nHow to Negotiate Your Salary\n\nIn Negotiating Your Salary, Jack Chapman offers five rules for getting what you want.\n\nFirst, postpone salary negotiations until after you’ve been offered a job (or finished a performance review). Chapman says the hiring (or evaluation) process consists of two phases: judging and budgeting. You can only hurt yourself by dealing with salary when the employer is judging instead of budgeting.\n\nSecond, let the other side make the first offer. According to Chapman, it’s tough to win by being the first to name a number. For many people, it can be awkward to evade direct questions about salary expectations. Chapman recommends preparing for this situation. His website includes a short video on how to answer the question, “What are you earning?” (You might also read Penelope Trunk’s advice on how to answer the toughest interview question.)\n\nWhen you hear the offer, repeat the top value — and then be silent. “The most likely outcome of this silence is a raise,” Chapman writes. This technique buys you some time to think while putting pressure on the employer.\n\nNext, counter the offer with a researched response. Your next move is to make a counter-offer based on what you know about yourself, the market, and the company. Before you go into the interview, have a minimum salary in mind. Base this on careful research using tools like LinkedIn, Salary.com, CareerBliss.com, PayScale.com, and GlassDoor.com. Also take the time to ask friends and colleagues for confidential feedback on what the position you want ought to pay. This information will give you power.\n\nFinally, clinch the deal — then deal some more. The final step in salary negotiations is to lock in the offer, and then negotiate additional benefits. This is like locking in the price of the car you’re buying before you begin negotiating the value of your trade-in.\n\nThe Noel Smith-Wenkle Salary Negotiation Method\n\nChapman isn’t the only one espousing these techniques. My research shows that all effective headhunters and coaches essentially advocate the same salary negotiation process.\n\nFor instance, Noel Smith-Wenkle was a job headhunter during the 1980s. He developed the following method to get as much money for his clients as possible during salary negotiations (which, in turn, meant a greater commission for him).\n\nSmith-Wenkle’s number-one rule is: never tell the employer how much you’ll take. Let the company name the first number. (Chapman gives the same advice. So does almost every other negotiation coach.)\n\nThe Smith-Wenkle Salary Negotiation Method involves four carefully prepared responses:\n\nIf the company asks for a salary expectation on the application, leave it blank.\n\nWhen the company verbally asks how much you want, say, “I’m much more interested in doing [type of work] here at [name of company] than I am in the size of the initial offer.” Smith-Wenkle says this will work about 40% of the time.\n\nIf the company asks a second time, your answer should be: “I will consider any reasonable offer.” This is a polite stalling tactic, and Smith-Wenkle says this will work another 30% of the time.\n\nAbout 30% of the time, you’ll have to respond again. (Smart hiring managers know they shouldn’t be the first to make an offer.) Again, your response is a polite refusal to answer the question: “You’re in a much better position to know how much I’m worth to you than I am.” This is your final answer, no matter how many times the company tries to get you to go first.\n\nThe sole purpose of this method is to get the company to be the first side to name a number. Once the company makes an offer, you have two options. If the offer is above your minimum, take the job. If it’s below your minimum, tell them it’s too low — but don’t say by how much.\n\nMore Info on Salary Negotiation\n\nOver the past decade, I’ve talked to several people about how they’ve successfully negotiated their salaries. All of them have stressed two factors: preparation and practice.\n\nRemember that the purpose of a job interview (or performance review) is to sell yourself. If you don’t believe you’re worth the price you’re asking, your employer won’t believe it either.\n\nDraft a list of ways you’ve helped current and past employers. Measure your achievements in dollar terms, if you can. (For instance: “By finding a new supplier for our packaging supplies, I’ve saved the firm $50,000 over the past year.”) Create a written list of talking points and use this to make your case for a higher salary.\n\nIf you’re just starting out – you’re a recent university graduate or moving to a new career – you might not have hard numbers to prove your worth. In that case, pitch your enthusiasm and work ethic.\n\nAnd the practice portion? Don’t let the actual interview be the first time you try your “flinch” or try to deflect questions about salary. As silly as it might sound, take some time to role-play with your spouse or a friend. Have them take the role of hiring manager and ask them to grill you so that you can see what it feels like to handle common questions. (For added fun, turn the tables and you take the role of hiring manager.)\n\nNegotiating your salary is one of the best ways to improve your financial position. And it’s a move that can have an enormous impact on your financial future. When you negotiate a better salary on this job, that number will help you when you negotiate the salary for your next job. It’s like a giant snowball of money! And it’s a snowball you can directly influence by making it as big as possbile at the beginning.\n\nWant more info on how to negotiate salary? Pick up a copy of Jack Chapman’s Negotiating Your Salary (which has helped many GRS readers over the years). Also take a look at this free PDF report from the Program on Negotiation at Harvard Law School. The “Ask a Manager” blog is packed with employment tips, including this article on what to say when you negotiate salary. Finally, Ramit Sethi offers a free one-day mini-course on negotiation, which includes tips for negotiating your salary.\n\nThe post How to negotiate your salary (and earn an extra half-million dollars in your lifetime) appeared first on Get Rich Slowly.\n",
      "Folder": "Feedly",
      "Timestamp": "1516638866",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.552311Z"
}