{
  "id": "3110803bf97741928167978e38d67dbd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.slate.com/toolbar.aspx?action=print&id=2280265",
      "Title": "Print",
      "Selection": "JURISPRUDENCE\nHow Conservatives Could Revive the Public Option\nWithout meaning to.\nBy Adam D. Chandler and Luke Norris\nPosted Friday, Jan. 7, 2011, at 1:26 PM ET\nWhen Judge Henry Hudson ruled last month that part of President Obama's signature health care reform law was unconstitutional, he gave conservatives a big boost. But the ruling has potential side effects that might make conservatives want to reconsider their elation. By calling the health care law unconstitutional because it requires people to purchase private insurance, the law's opponents could unwittingly resurrect another alternative they won't like—the \"public option.\"\n\nConservatives argue that for Congress to require all Americans to buy private health insurance exceeds its regulatory powers under the Constitution's Commerce Clause. Before Judge Hudson, they distinguished the health care law's individual mandate from government programs like Social Security. The Social Security program is designed so that Americans pay taxes directly to the government, which pools the money and disburses future Social Security benefits. In contrast, the novelty of the health care law is that it requires Americans not to pay a tax, but rather to buy their health care insurance privately. The government's involvement is a step removed, and this is what Judge Hudson found to be constitutionally defective.\n\nBut here's the catch: If the part of the health care law that's unconstitutional is the part telling people to buy private insurance, an obvious solution is to pass a health care law including a public health plan, which would operate like Social Security and Medicare. In other words, the public option. With a public option as part of the law, people who don't want to buy insurance from a private health care company would pay into a government fund in exchange for an insurance benefit, just as they do with Social Security and Medicare.\n\nOpponents could still argue that any law requiring universal coverage is beyond Congress' reach. But they'd run into a big wall: Supreme Court decisions that place Social Security and Medicare, along with a list of other entitlements, squarely within the constitutional ambit of Congress. Like we said, the public option and Social Security and other entitlements are structurally quite similar—indeed, the public option is essentially a form of Medicare. So to strike down the public option would require reversing a lot of well-established precedent. Courts would have to return to the laissez-faire ideology of a century ago, epitomized by the 1905 Supreme Court case Lochner v. New York. That ruling infamously limited the extent to which the government could intervene in the private sphere, leaving legislatures unable even to set minimum-wage laws, for example. And courts long ago repudiated it.\n\nNow suppose that conservatives succeed with their current, safer legal strategy, and knock out the individual mandate. Because the private-only mandate had been the middle, compromise position, Congress would be left with the two more extreme options on health care—either a plan that includes something like the public option, or the status quo. As costs rise and more Americans go uninsured, will the public really want to roll back reform? When Americans are asked about the current health care law, a majority say they either favor it or wish it were even stronger. Making the public option the only option would fulfill the wish of those wanting a stronger bill.\n\nIf resurrecting the public option sounds politically far-fetched, think back to the New Deal. The National Industrial Recovery Act of 1933 allowed for private industries to create codes to govern labor standards through collective bargaining. Like the current health care law, it harnessed the private sector in order to limit government intervention. It was a compromise between progressives like Sen. Robert Wagner from New York who wanted the federal government to ensure the right to collective bargaining and conservatives who were opposed to legislating on this at all.\n\nConservatives challenged the NIRA in court, and the Supreme Court ultimately held it was unconstitutional. But the public had grown attached to the right to collective bargaining, and they started to join unions in record levels to demand it. This opened the way for FDR to push for even stronger legislation, which gave the government, rather than businesses, the role of guaranteeing collective bargaining rights and preventing employers from obstructing them. In the end, Wagner and progressives got what they asked for: The Wagner Act of 1935 provided federal rights of collective bargaining and gave labor a new set of legal tools to ensure that this right was upheld. It was a conservative nightmare they themselves had conjured.\n\nThe lesson is that opponents of the health care law should be careful what they wish for. Their diagnosis of the current law's ailments could be a prescription for a whole new pill.",
      "Folder": "Archive",
      "Timestamp": "1295239700",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:27:00.117558Z"
}