{
  "id": "31208946237847be9250e5aedc731451",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/72059/Rescue-Drone-Saves-Two-Boys-from-Drowning-on-Its-First-Day-in-Service",
      "Title": "Rescue Drone Saves Two Boys from Drowning on Its First Day in Service Core77",
      "Selection": "Imagine being in the ocean, trapped in a swell some 700 meters from shore. Suddenly a yellow package drops out of the sky as if sent by a god, hits the water next to you and expands into a flotation device.\n\nThat was the experience of two unlucky, then lucky teenage boys off the coast of Lennox Head in Australia last week. Someone spotted the boys in distress and called it in, but the nearest lifeguard station was a kilometer away. Just that morning, however, Lennox Head had brought their new lifesaving drone into service.\n\nIn a little over a minute, a lifeguard supervisor had launched the drone, spotted the boys, flew it over to them, and remotely dropped the flotation device. The boys were able to grab it and swim to shore. Here's the footage:\n\nThe drone is manufactured by a company called Little Ripper Lifesaver, founded by Kevin Weldon after he witnessed a drone canvassing the streets of New Orleans after Hurricane Katrina and realized its lifesaving potential. The Marine Pod dropped over Lennox Head contained a water-triggered flotation device, which is repackable and reusable. The company is now testing a saltwater-activated electromagnetic shark repellent device, with plans to include that in future kits.\n\nLittle Ripper also makes a Land Pod, which contains an automatic defibrillator, a location beacon, a thermal blanket, a radio, a highly-visible rescue banner and a first aid kit. Lastly they make a Snow Pod, which adds skin warmers and energy bars to the Land Pod.\n\nLennox Head received the drone as part of a trial set up by an organization called Surf Life Saving NSW and the New South Wales Government. According to ABC News,\n\nSurf Life Saving NSW project manager for unmanned aerial vehicles (UAV), Kelvin Morton, said the project was a world-first.\n\n\"These UAVs that we're using to drop these inflatable pods is innovative, and we know that most or all of the lifesaving organisations around the world are stepping back and waiting to see how this goes.\"\n\nMr Morton said the drones gave surf lifesavers a new advantage. \"It gives them eyes across the water at a height of 60 metres and they can move at 50 kilometres an hour,\" he said. \n\n\"They've never had that ability before. They can see things in the water that a jet-ski simply cannot.\"\n",
      "Folder": "Feedly",
      "Timestamp": "1516642266",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.504794Z"
}