{
  "id": "326deff934c7450285c3b51e3e29d12f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/863349/the-single-best-interview-question-for-pretty-much-any-job-in-tech/",
      "Title": "The single best interview question for pretty much any job in tech Quartz",
      "Selection": "This question originally appeared on Quora: What is the best interview question ever? Answer by Wade Myers, Inc 5000 entrepreneur and managing director of Boldmore Growth Partners.\n\nWhen it came time to interview candidates for programming, development, and strategy positions, there was one question I always loved to ask: Einstein’s Riddle. This brainteaser is a fantastic way to assess interviewees whose roles would require structured thinking and rigorous mental horsepower.\n\n“Einstein’s Riddle” is a logic puzzle whose creation is often credited to a young Albert Einstein (though there is no hard evidence to support this claim), and it demands patience and logical processing to be properly solved. I would offer interviewees the question in writing and offer them a whiteboard and marker to show me their work.\n\nHere’s the riddle in three pieces:\n\nBackground:\n\nThere are five houses in five different colors\n\nA person with a different nationality lives in each house\n\nThe five owners each drink a certain type of beverage, smoke a certain brand of cigar, and keep a certain pet\n\nNo owners have the same pet, smoke the same brand of cigar, or drink the same beverage\n\nClues:\n\nThe Brit lives in the red house\n\nThe Swede keeps dogs as pets\n\nThe Dane drinks tea\n\nThe green house is on the left of the white house\n\nThe green homeowner drinks coffee\n\nThe person who smokes Pall Mall rears birds\n\nThe owner of the yellow house smokes Dunhill\n\nThe man living in the center house drinks milk\n\nThe Norwegian lives in the first house\n\nThe man who smokes Blend lives next to the one who keeps cats\n\nThe man who keeps the horse lives next to the man who smokes Dunhill\n\nThe owner who smokes Blue Master drinks beer\n\nThe German smokes Prince\n\nThe Norwegian lives next to the blue house\n\nThe man who smokes Blend has a neighbor who drinks water\n\nThe Question:\n\nWho has fish for a pet?\n\nMost applicants completely gave up in exasperation and didn’t even attempt to answer the riddle because they either thought it was impossible to answer, or they couldn’t seem to figure out that you just need to start digging in and nail down one detail at a time.\n\nThe few candidates that were really, really good with frameworks and logical processing wrote out a grid and continued to loop through the clues until they filled it in. The reason for the numerous loops is that many of the clues are not useful until you’ve filled in what you already know.\n\nI had one 20-year-old candidate for a project manager position go to my white board and answer it in about three minutes flat. I was stunned. Not only did I hire him on the spot, but within 18 months he was the managing director of my entire European operation—he grew a beard to look older because he feared that our European clients would never want to work with a 21 year old managing director. By 22 years old he was at Stanford Business School getting his MBA (I wrote a letter of recommendation, so I get some credit, right?). He was truly in the top 2% of anyone I’ve ever met or worked with.\n\nHow to answer Einstein’s Riddle\n\nThe easiest way to solve this puzzle is start with a grid like this and begin filling it in with clues:\n\nClues 8 and 9 allow us to fill in cells directly:\n\nClue 14 places the blue house next to the Norwegian, and the green and white houses as 4 and 5:\n\nClue 1 says that the Brit lives in a red house, which rules out all but 3. By process of elimination, the first house is yellow, and clue 7 adds that the owner smokes Dunhills:\n\nClue 11 places horses next to the Dunhill house. The beer drinker smokes Blue Master, the Dane drinks tea, and milk and coffee are in houses 3 and 4. So the Norwegian—who smokes Dunhill—drinks water. And the water drinker’s neighbor smokes Blend. With the only beverages remaining being tea and beer, and knowing that the beer drinker smokes Blue Master, the second house has the tea drinking Dane:\n\nThe last beverage, beer, goes in house 5 with its Blue Masters. The German Prince-smoker must therefore be in House 4. This leaves the Swedish dog owner for House 5, then the bird-rearing Pall Mall smoker for House 3:\n\nSince the cat owner lived next the Blend smoker, we can see that there is only one slot left: in the German’s house. So it is the German who keeps the fish:\n\nIf you have a candidate that can solve this, you need to hire them!",
      "Folder": "Feedly",
      "Timestamp": "1481848501",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.738321Z"
}