{
  "id": "32d2bf29d784449fb2833cf5e874a57f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/837794/a-new-council-will-unite-jewish-and-muslim-american-groups-in-a-us-alliance-after-the-election/",
      "Title": "A new council will unite Jewish and Muslim-American groups in a US alliance after the election Quartz",
      "Selection": "Among the muted glimmers of hope that Americans can come together at a divisive time in US history is this: Prominent Jews and Muslims in business, religion, culture, and politics are banding together to form a new alliance in Washington.\n\nThe American Jewish Committee and the Islamic Society of North America announced a seemingly unlikely interfaith alliance on Monday (Nov. 14) called the Muslim-Jewish Advisory Council, an organization they say is committed to working for causes dear to both groups.\n\nThe council, comprised of 31 initial members, will include politicians including former senator Joe Lieberman, religious clergy like Imam Mohamed Magid, and academics like Deborah Lipstadt. Stanley Bergman, CEO of Henry Schein, and Farooq Kathwari, president and CEO of Ethan Allen, will serve as the council’s co-chairs.\n\nThe announcement comes amid growing concern among US minorities about civil liberties.\n\nThis is a big deal, especially at this moment: American Jewish Committee and Islamic Society of North America launch Muslim-Jewish Council http://pic.twitter.com/B307tjcZPj\n\n— (((Yair Rosenberg))) (@Yair_Rosenberg) November 14, 2016\n\nThe organization says its creation has been months in the making, and that it held its initial meeting in New York on Nov. 3. “This was not a reaction to the election,” says Bob Silverman, director of Muslim-Jewish relations at AJC. “We saw a strategic need for these two communities to come together. They have been working on parallel tracks on many issues, so why not work together?”\n\nThe council’s focus, it says, will be addressing bigotry, protecting religious minority rights in the US, and highlighting both groups’ contributions to American society. It also wants to confront prejudice between American Muslims and Jews. How it will accomplish this is still in the works, according to Silverman, but it starts with bi-partisanship and diverse political views.\n\nThe group is considering legislation to protect religious rights at work and stronger laws against hate crimes. “There’s no specific law currently saying you can’t fire someone for wearing a yarmulke or a hijab,” says Silverman. “There’s good hate crime legislation at the state and federal levels, but it’s not being enforced.”\n\nAs a group with many immigrant co-chairs and members, it plans to oppose any attempts to ban immigrants solely on the basis of religion.\n\nNotably absent from the agenda is president-elect Donald Trump, despite fears that his election campaign stoked xenophobia and that his appointment of alt-right news executive Steve Bannon as chief strategist will exacerbate anti-semitism and white nationalism.\n\nThe council says it’s striving for diplomacy. “We are going to work with whoever is in power to get things done and have influence,” says Silverman, who added that the council will host a reception for the new congress in February. “We will call them out when we need to. If issues come up that are contrary to the interest of these two communities, we will be vocal.”\n",
      "Folder": "Feedly",
      "Timestamp": "1479261195",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.754907Z"
}