{
  "id": "33206b97cf3a4ddeb0706bba6c73aee3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/the-big-idea/2017/7/12/15955782/health-care-senate-conservative-ideas-universal-catastrophic-coverage",
      "Title": "What a good conservative health care plan would look like Vox - All",
      "Selection": "Senate Republicans have fallen short in their first attempt to attract 50 votes for their health care bill. Small wonder. The Better Care Reconciliation Act, as it is called, is remarkable in many ways, but perhaps most remarkably of all, it fails to draw on a large body of constructive conservative ideas about what real health care reform should look like. As a result, it fails to fix the flaws of Obamacare that conservatives most often complain about.\n\nNow the Senate’s Republican leaders have a second chance. Instead of more secret meetings and backroom deals, they could use the extra two weeks they’ve given themselves in August to hold hearings on health care reform. If they did so, they would have a chance to hear day after day of testimony from conservative scholars and policymakers on serious proposals for improving the US health care system. Here are some key points that testimony would make, if it had a chance to be heard.\n\nSome of that testimony would focus on the top end of the spending curve. As the chart below shows, just 1 percent of the population accounts for 20 percent of all personal health care spending, and the top 5 percent of population for half of all spending. Many people in that range suffer from one or more chronic conditions like diabetes, kidney failure, or AIDS that require expensive treatment year after year. Their medical needs are literally uninsurable by traditional standards. They are not just at high risk of needing care; they are certain to need it. And even if an insurer could be persuaded to cover them, an actuarially fair premium would exceed the annual income of all but the very wealthiest among the chronically ill.\n\nPreserving coverage for people with preexisting conditions is popular among both liberal and conservative voters. A recent poll from Politico showed that only 42 percent of Republicans favored allowing states to opt out of a requirement to cover people with such conditions.\n\nConservatives policy experts have made some very reasonable proposals for dealing with those at the top of the cost curve. One of the most attractive is universal catastrophic coverage, or UCC for short. UCC would cover the top-of-the-curve health care needs of all Americans, subject to a deductible that limited out-of-pocket expenses to a substantial, but not impossibly high, percentage of their income.\n\nUniversal catastrophic coverage has an impeccable conservative pedigree. It was proposed back in the 1970s by Martin Feldstein, who would go on to serve as Ronald Reagan’s chief economic adviser. In 2004, Milton Friedman, then a fellow at the Hoover Institution, endorsed the concept. An up-to-date version, specifically designed to address the problems of the ACA, is outlined by Kip Hagopian and Dana Goldman in National Affairs.\n\nWhat a universal catastrophic coverage plan might look like\n\nThe exact parameters of the program would be subject to negotiation, of course, but let’s sketch some possibilities, for the sake of discussion. Suppose the deductible is set at 10 percent of the amount by which a household’s income exceeds the Medicaid eligibility level, now about $40,000 for a family of four. Under that formula, a middle-class family earning $85,000 a year would face a deductible of $4,500 per family member, with a cap of twice that amount for households of more than two people. By the same formula, the deductible for a household with $1 million of income would be $96,000.\n\nThe high-deductible policy might be provided directly by the government, as an extension of Medicare. Alternatively, following the Swiss example, people could choose among private insurers offering policies meeting the program’s standards. In that case, UCC would resemble an expanded version of Medicare Advantage — originally a Republican idea but one that now enjoys bipartisan support.\n\nPeople could choose among several ways to meet their out-of-pocket costs. As you can see from the examples above, for middle-class families, out-of-pocket costs would be comparable to those now faced under individual policies purchased on ACA exchanges, while for high-income families they would be substantially higher.\n\nOne option for meeting those costs would be to buy supplemental insurance to cover all or part of the UCC deductible. Such supplemental coverage would cost far less than policies now sold in the market for individual insurance, since the UCC deductible would set an automatic ceiling on claims for which the insurer would be responsible. Alternatively, consumers could pay out-of-pocket expenses from funds accumulated in a tax-deductible health savings account — yet another conservative idea, and one that is already on the books.\n\nVery likely, many middle-income families would decide simply to cover all of their routine health care costs out of pocket. After all, as the chart shows, the healthiest 50 percent of the population accounts for less than 3 percent of all personal health care spending, and the next 20 percent of the population for only another 7 percent of spending. People on the bottom half of the spending curve could reasonably pay their routine health care costs in cash, just as they now pay for oil changes or wiper blades for their cars. (After all, no one assumes that automobile insurance covers routine maintenance.)\n\nHow to remove one costly distorter of the health insurance market\n\nFiscal conservatives might, quite properly, ask how UCC could be financed. A large chunk of it could be paid for with another proposal favored by many on the political right — abolishing the tax deductibility of employer-sponsored insurance (ESI), which currently costs the federal budget an estimated $235 billion per year. That oddity of the US health care system is a holdover from World War II, when employers lavished in-kind benefits on scarce workers to evade wartime wage controls. Both its liberal and conservative critics say it is long overdue for repeal.\n\nLiberals object to ESI because it’s inequitable. Suppose the cost of health insurance to your employer is $10,000 per employee. If that were taxed as ordinary income, you would pay more tax — but how much depends on your tax bracket. If your taxable income is $200,000 a year, putting you in the 33 percent bracket, the exclusion saves you $3,300 annually. At $35,000 a year, placing you the 15 percent bracket, the exclusion saves you just $1,500. The inequity is even greater for minimum wage workers.\n\nThat’s because higher-paid workers (or their unions) often negotiate compensation packages that take advantage of the tax deduction by slowing the growth of cash wages while increasing the share of health benefits. However, for workers who are already at the minimum wage, there is no room for negotiation. Wages for such workers cannot be cut (and they must rise when the legal minimum increases). As a result, the entire cost of employer-sponsored insurance falls on employers. That is one reason minimum wage jobs are less likely to include health benefits.\n\nConservatives have other objections. For one, ESI imposes disproportionately large administrative burdens on small businesses, which, unlike large corporations, cannot afford to self-insure. And ESI produces job lock. Workers who have jobs with good insurance fear to leave them for jobs elsewhere that would make better use of their skills but might not have the same health benefits. Quitting a job with ESI to work as an independent contractor or start a small business of one’s own is even riskier.\n\nThe BCRA, like the House bill, takes a baby step in the right direction by lifting the employer mandate that makes ESI compulsory for businesses with 50 or more workers. However, as long as the tax preference remains in place, workers and many employers still have an incentive to stick with ESI, shifting part of its cost to other taxpayers, low-wage workers, the self-employed, and would-be entrepreneurs.\n\nAnd what about the poor? Liberal critics look at the way the BCRA slashes Medicaid and conclude that Republicans simply don’t care whether the poor have access to health care or not. Maybe that is true for some, but not all. Medicaid is simply not the only way to provide health care for people with low incomes.\n\nFor the poor, an alternative to Medicaid\n\nFor example, the Hagopian-Goldman variant of universal catastrophic coverage could be implemented in a way that would render Medicaid unnecessary. Suppose, as in our earlier example, the UCC deductible is set at 10 percent of the amount by which household income exceeds $40,000, roughly the Medicaid threshold for a family of four. The deductible for families below the threshold would therefore fall to zero. These families would get “first dollar” coverage from their UCC policy, so there would be no need for Medicaid as a separate program. (Such a scheme would also increase work incentives for low-income households, who would no longer have to worry that extra earnings would cause them to lose Medicaid benefits.)\n\nWe haven’t even touched yet on measures to control cost. As everyone knows, medical services, from cancer drugs to bags of saline solution to hospital stays, cost more in the United States than anywhere else. Conservative policy experts have many ideas for cutting costs without cutting quality of service.\n\n Had Mitch McConnell (R-KY) held hearings for the health care bill, he might have heard some fresh ideas from conservative health care experts. Chip Somodevilla / Getty Images\n\nEncouraging greater price transparency is one such idea. As a report from the Commonwealth Fund demonstrates in detail, health care is unlike any other market. Patients rarely know what they'll pay for services until they've received them; health care providers bill different payers different prices for the same services; and privately insured patients pay more to subsidize the shortfalls left by uninsured patients. Prices for the same service vary widely, even though there is little evidence that higher prices are linked to higher quality. Already, some 30 states have policies to encourage more transparent pricing, although those policies are not uniformly effective. Recently, Reps. Michael Burgess (R-TX) and Gene Green (D-TX) introduced legislation at the federal level to promote greater price transparency.\n\nThere is some evidence that consumers have not always made use of health care price information even when it has been available. That is understandable at a time when most people received coverage through their employers that had only modest deductibles and copays. But it seems already to be changing as employers impose greater out-of-pocket costs on ESI beneficiaries. A system that introduced universal catastrophic coverage and replaced ESI with individual tax credits and health savings accounts would encourage greater use of comparative price information if it were available.\n\nTransparency is not the only cost-saving reform backed by conservatives. They also favor more competition among hospitals and physician groups, tort reform to control the high cost of malpractice insurance, the option for small businesses to form groups to buy health insurance, and more. Often conservative cost-cutting ideas are the same as those advanced by liberals. Last year, polar opposites Sens. Ted Cruz and Bernie Sanders co-sponsored a bill that would have allowed Americans to import cheaper drugs from Canada. Why were none of these ideas included in the BRCA, or even openly discussed as the bill was being formulated?\n\nNone of these reforms is a magic bullet. Even among conservatives, each has critics as well as supporters. Liberal reformers have ideas of their own that many people like even better, ranging from sweeping measures like Sanders’s Medicare-for-all to small tweaks in procedures for approving new drugs. Still, these are serious proposals with backing from reputable scholars and policymakers.\n\nThe scandal is that the secretive process by which the BCRA was drafted did not even consider them. Really, is it too harsh to say that the Better Care Reconciliation Act is not about better care at all?\n\nEd Dolan is a senior fellow at the Niskanen Center.\n\nThe Big Idea is Vox’s home for smart discussion of the most important issues and ideas in politics, science, and culture — typically by outside contributors. If you have an idea for a piece, pitch us at thebigidea@vox.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1499865458",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.653407Z"
}