{
  "id": "3360dd2affed417aa70cd7051cb76245",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1745815/sesame-streets-50th-season-will-focus-on-mistakes-and-resilience/",
      "Title": "Sesame Street turns 50 and celebrates children’s right to make mistakes Quartz",
      "Selection": "The 50th season of Sesame Street kicked off yesterday (Nov. 9) with a new message for kids: Failure isn’t always a bad thing.\n\nThis season, the popular cast of muppets will focus on the role that making mistakes can play in building young children’s resilience. Entitled “Oops and Aha!: Embracing the Power of Possibilities,” this theme is especially relevant in the US, where preschool-aged children are increasingly pressured to meet “school readiness” standards and where pediatricians have to prescribe play time to over-scheduled kids.\n\n“Today’s preschool kids are under an unprecedented amount of stress and pressure to meet certain academic and social-emotional benchmarks, often before they’re developmentally ready,” Rosemarie Truglio, Sesame Workshop’s senior vice president for curriculum and content, said in a release. “That result-oriented mindset can make kids afraid to take even the safest risks—never trying to pour their own milk for fear of spilling it.”\n\nYUCK I hate celebrations. Have a rotten 50th birthday Sesame Street… #Sesame50\n\n— Oscar the Grouch (@OscarTheGrouch) November 10, 2019\n\nBetween birth and age school age, children’s brains develop quickly, and science shows play can help them learn to focus attention, communicate, problem-solve, and work with others. Sesame Street has long touted the benefits of play and pressure-free learning environments for kids. But in a world where hyper-competitive education systems can sometimes determine a child’s future before they are even born, that message is all the more important.\n\nThe show’s 50th season will focus on the role that caregivers can play in allowing—and even at times encouraging—kids to make mistakes and learn to bounce back from them. According to Sesame Workshop, one episode will feature 3-year-old muppet Rudy Cadabby getting upset when he “ruins” a drawing. Alan Muraoka, the current owner of Hooper’s Store, then encourages Rudy to keep trying, and Rudy eventually makes a new drawing inspired by his mistake.\n\nThe goal is to model important values like confidence, perseverance, and resilience—values that researchers say today’s preschoolers are lacking.\n",
      "Folder": "Feedly",
      "Timestamp": "1573418054",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.329088Z"
}