{
  "id": "337284e7118b4453bc8e90548ca3e266",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.boardingarea.com/amazon-save-20-on-up-to-250-of-spend-when-redeeming-1-membership-rewards-point/",
      "Title": "Amazon Save 20% On Up To $250 Of Spend When Redeeming 1 Membership Rewards Point Frequent Miler",
      "Selection": "Amazon has relaunched one of its best offers, giving a 20% discount on up to $250 of purchases when you redeem at least 1 Membership Rewards point when checking out. Unlike similar past offers though, this sadly doesn’t seem to be working on gift cards.\n\nThe Deal\n\nSave 20% on Amazon on up to $250 of spend when redeeming at least 1 Membership Rewards point.\n\nDirect link to offer (our affiliate link)\n\nKey Terms\n\nThis is a limited time offer. This is a limited time offer. The promotion will end on the earlier of (a) 11:59 PT on 4/20/2020, or (b) the time at which 40,000 customers have redeemed the offer. The promotion button will expire concurrently.\n\nAmazon.com reserves the right to cancel or modify this offer at any time.\n\nOffer is available by invitation only, is non-transferable, is not redeemable for cash, and may not be resold.\n\nOffer applies only to the purchase where Membership Rewards points are used for at least a portion of the purchase and the promotion is applied at checkout.\n\nOffer only applies to products shipped and sold by Amazon.com. Products sold by third-party sellers or other Amazon entities will not qualify for this offer, even if they are “fulfilled by Amazon.com” or “Prime Eligible”.\n\nMaximum benefit you may receive from this offer is $50 per eligible Membership Rewards enrolled card per one account\n\nOffer may not be combined with other offers.\n\nShipping charges may apply to discounted promotional items.\n\nOffer does not apply to purchase of digital content.\n\nOffer discount will be allocated proportionally among all promotional items in your original order. If any of the items in your original order are subsequently returned, your refund will equal the original price of the product, less the proportional amount of the discount. The total discount on the unreturned amount of your original order will then be less than $50.\n\nIf any of the products related to your original order are returned, subject to Amazon’s refund policy, you will receive a refund of the amount charged to your card first, followed by Membership Rewards points.\n\nPromotional codes (including those placed directly in accounts) may not be redeemed for Amazon Gift Cards.\n\nThis promotion is available only to Amazon.com customers with an eligible Membership Rewards points card issued in United States.\n\nPromotional credit is applied before taxes and fees.\n\nIf you violate any of these terms, the offer will be invalid.\n\nQuick Thoughts\n\nA lot of people are avoiding bricks & mortar stores right now, so being able to save up to $50 when ordering on Amazon is a great offer. Be sure to only redeem 1 Membership Rewards point when using this offer as using any more than that is a poor use of your points.\n\nIn the past it was possible to buy $250 worth of gift cards to get the $50 discount, but that doesn’t seem to be working this time. Miles to Memories noticed this difference and I didn’t have any luck ordering a few different types of gift card either. That’s a shame as it was an easy way to max out the offer, but I’m sure many of you can still get the full $50 discount when buying merchandise.\n\nSomething important to note is that only items both shipped and sold by Amazon.com are eligible for the discount. That reduces your selection, especially seeing as there are so many third party resellers on Amazon, but there are still tons of eligible items to choose from. In case you’re not sure how to determine whether an item is eligible or not, look for where it says “Ships from and sold by Amazon.com”. This can appear in a couple of places – sometimes it’s in the main description area…\n\n…while other times it’s in the sidebar beneath the Add To Cart / Buy Now buttons.\n\nIf it says that, you’re good to go. Other times it’ll say that it’s sold by a third party reseller and fulfilled by Amazon – it’s those types of products that aren’t eligible for the 20% discount.\n\nh/t Miles to Memories\n\nQuick Deal posts are intended to alert readers to deals big and small, with little or no analysis. Quick Deals are NOT recommendations. Readers should always use their own judgment as to whether or not a deal works for them.\n\nEarn Miles Without Flying: START HERE\n\nThe post Amazon: Save 20% On Up To $250 Of Spend When Redeeming 1 Membership Rewards Point appeared first on Frequent Miler.\n",
      "Folder": "Feedly",
      "Timestamp": "1585104845",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.304998Z"
}