{
  "id": "344157fd058a4b9bad09f4b534f52f33",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/identities/2017/7/18/15958214/age-of-white-christian-america-over",
      "Title": "The age of white Christian America is ending. Here's how it got there. Vox - All",
      "Selection": "And here’s what comes next.\n\nIn the introduction to his 1987 Cultural Literacy, E.D. Hirsch Jr. laments the loss of a shared American culture — a body of knowledge, from Shakespeare to the Bible, that united Americans.\n\nHe recalls his father’s propensity for quoting a particular truncated line from Shakespeare’s Julius Caesar whenever encouraging his colleagues to act swiftly: “there is a tide [in the affairs of men / which taken at the flood leads to fortune].” His colleagues — educated men themselves, Hirsch implies — would understand the reference, and so cultural communication would function smoothly. This shared consciousness, he suggested 20 years ago, was on its way out.\n\nHirsch’s nostalgia may seem even more dated now than it did in 1987. The idea of a “canon” of a shared cultural shorthand has been challenged as outmoded and exclusionary, unfitting for a pluralist society. Likewise, among the “neoreactionaries” of the alt-right in particular, the shared shorthand of (white, Judeo-Christian) cultural literacy is symbolic of a disappearing, homogenous “West” to which we can and must return.\n\nThree decades later, in the fascinating, complex 2016 book The End of White Christian America, the Public Religion Research Institute’s founder and CEO Robert Jones traces the decline not merely of a demographic, but of the racial and religious contours of that very culture. Jones described the decline of \"a shared aesthetic, a historical framework, and a moral vocabulary … [a] lingua franca.”\n\nThough the book begins and ends with a mock eulogy for white Christian America (WCA), it’s not quite a eulogy, nor is it gleeful grave stomping. Rather, it is a sensitive, nuanced look at the decline of a world \"where few gave a second thought to saying ‘Merry Christmas!’ to strangers on the street ... a world of shared rhythms that punctuated the week: Wednesday spaghetti suppers and prayer meetings, invocations from local pastors under the Friday night lights at high school football games, and Sunday blue laws that shuttered Main Street for the Sabbath.”\n\nThe loss of these traditions reflects WCA’s demographic decline through the rise of a more ethnically and religiously diverse America. But it also indicates that we’ve lost a wider “shared” (if not universally) sense of cultural understanding in the public sphere: both on the smaller scale of the town hall on and on the large scale of the White House.\n\nJones traces WCA’s decline as a culturally powerful institution, however, not just as the result of demographic change but rather as the result of white Protestant churches failing to adapt to a multicultural, multiracial America. Jones casts his eye on a complacent mainline Protestant church that failed to hold on to the fervor of its members, and an evangelical church that sailed to the “moral majority” on issues of segregation and race.\n\nPRRI itself is known for its careful cultural analysis of everything from the United Methodist Building in Washington, DC, once a de facto monument to the mainline cause célèbre of Prohibition, to Macklemore’s celebration of “same love” at the Grammy Awards. Blending the kind of exhaustive data PRRI touts, Jones traces two intertwined cultural histories: that of mainline Protestantism — careful, ecumenical, less fervent in the culture wars — and its sometime rival evangelical Protestantism, whose fervent and uncompromising reactionary approach to hot-button political issues from segregation to LGBTQ issues was responsible for both its rise and, he says, its downfall.\n\nJones traces the history not just of evangelicals but also of mainline Protestantism\n\nAs Jones tells it, while mainline Protestants took a careful, interfaith approach to social issues, quietly emphasizing social justice on an institutional level, evangelical groups edged their way into public prominence by a more conservative approach to doctrine, a focus on salvation, and a patriotic Christianity deeply indebted to the idea that the United States should be an “explicitly Christian nation.”\n\nMainline Protestantism declined first, as it lost ground to secularism and to the evangelical right, which was quicker to raise the political pulse. But as the culture wars of the ’80s and ’90s gave way to certain permanent shifts in American culture — most religious Americans now support same-sex marriage, and among young evangelicals support is likewise increasing — evangelicals found themselves, too, at sea.\n\nBooks, articles, and think pieces about the “religious right” are thick on the ground. Yet Jones’s nuanced take is most fascinating when it deals not with the flashier evangelicals and their celebrity-studded megachurches, but with their narratively drabber cousins. Mainline Protestants, regardless of political affiliation, tend to fade into the background in discussions of religion in America. Still, Jones highlights their importance, not just in their own right — from the history of abolition to the temperance movement — but as a perpetual foil to evangelicals.\n\nIt would be easy for Jones to set up a neat dichotomy in which mainline Protestants are the “good guys” — focusing on social justice and inclusion even as their brethren in the South supported segregation. And it’s certainly true that he is unsparing when it comes to evangelicals’ uneasy historical alliance with racism. He reminds us that “articles in the leading evangelical magazine Christianity Today encouraged Christians to root out racism in their own lives, but also criticized integration. Separating people of different races through law was not portrayed as a moral evil — in fact, some argued that it was necessary to maintain peace in the South. One author declared that supporters of integration were espousing a kind of ‘Christian communism.’” (Christianity Today’s mainline counterpart, the Christian Century, meanwhile, named Martin Luther King Jr. an editor at large.)\n\nFor Jones, we are living in the twilight days of what was once known as white Christian America\n\nBut Jones recognizes, too, that mainline Protestantism largely squandered its enormous political, social, and financial advantage over its evangelical cousins to the South, inadvertently ceding its status as the mouthpiece of American Christendom. After all, he says, mainline Protestantism’s contributions to civil rights \"were ultimately more symbolic than revolutionary, and more focused on the press than grounded in the pews.\"\n\nOverall, the age gap reflects this disparity: According to PRRI’s research, almost seven in 10 seniors identify as white Christians, versus fewer than three in 10 young adults. The recent decline in (white) mainline numbers in particular is striking: from 24 percent of the population in 1988 to just 14 percent in 2012.\n\nJones’s interest in WCA is cultural, rather than theological, and at its most incisive when he’s chronicling the death of a certain identity: one far more tied into whiteness and the rote wishing of a “Merry Christmas” than any particular theological stance. (If anything, this is the book’s one weakness. Other than a brief mention of Walter Rauschenbusch's “social gospel,” very little of Jones’s approach to WCA investigates how differences in actual theology or the structure of worship services might reflect, or tie into, the cultural differences that separate mainline Protestants from evangelicals, and from everybody else.)\n\nHe’s incisive, too, when describing the cultural segregation still at play in America — quoting a PRRI survey that the core social networks of white Americans are 91 percent white and only 1 percent black. He’s likewise dubious about the possibility for remedying this, pointing out that \"America has virtually no large-scale, widely distributed civic institutions that are equipped to nurture strong relationships across racial divides.”\n\nIn such a paradigm, it’s easy to understand how, say, white evangelical Protestants can at once perceive themselves to be under attack and possess such strong institutional power within their own communities: both things, in a fragmented America, are possible. Jones even elicits sympathy for those evangelical Christians who, witnessing their gradual media irrelevance over culture-war battlegrounds like LGBTQ issues, do find themselves, like Hirsch, at a cultural sea, unable to navigate a society whose new shibboleths they do not know.\n\nYet Jones raises the possibility that Christianity can only function effectively as a religion in the absence of its dominance in culture, which is to say, as the underdog. Just as Southern evangelicals came to dominance as a response to the perceived diminishing of Christianity in the public sphere among the pluralistic tendencies of the 1950s, so too, Jones suggests, must any effective Christianity of today — one capable of firing up its members — respond against the dominant culture.\n\nHe cites several recent examples of thinkers who have advocated just that, from Rod Dreher’s “Benedict option” of focused seclusion to Baptist firebrand Russell Moore’s embrace of Christianity as counter-“cultural.” He writes, \"As Christianity seems increasingly strange, and even subversive, to our culture, we have the opportunity to reclaim the freakishness of the gospel, which is what gives it its power in the first place.”\n\nIt is that paradox that lies at the heart of The End of White Christian America, and in discussions of Christianity and public life more generally. How can a religion often defined as a religion of outsiders — one whose sacred texts embrace the overturning of the money changers in the Jerusalem temple and celebrate those who leave their families behind to follow a wandering preacher — ever function in a dominant paradigm without losing its distinctive character?\n\nIt is that question that Jones’s book leaves us wondering: whether the death of White Christian America, as a cultural construct, is a good thing for Christianity, the religion. For a religion that was once subversive, Jones hints, being countercultural may just be the ideal way to be.",
      "Folder": "Feedly",
      "Timestamp": "1500414622",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.572576Z"
}