{
  "id": "353cb42299094043b5df54ddee454e96",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.seriouseats.com/2020/08/grillgrate-upgrade-for-gas-grills.html",
      "Title": "The GrillGrate An Upgrade Almost Every Gas Grills Needs Serious Eats",
      "Selection": "The GrillGrate will improve the performance of just about any gas grill. Bonus: if you drop an asparagus spear, it won't fall down into the grill's depths. [Photographs: Vicky Wasik]\n\nThere's a lot to like about gas grills, and by a lot, I really mean one thing: They're easy. No matter how much we might celebrate a live charcoal fire, the bottom line is it can't compete with the convenience of turning on and off the burner dials of a gas grill. For casual weeknight grilling, that convenience is worth an awful lot.\n\nAnd yet how many nights have I stood before a gas grill at a friend's house or vacation rental, pushing meat and vegetables around the grate in search of the one or two zones just barely hot enough to actually get a good sear? Too many.\n\nThis is probably the moment when someone fires off a #notallgasgrills, and yeah, sure, there are exceptions. But the uneven heating and underpowered performance is, in my experience, the norm. Even with lengthy preheating with the lid closed, searing-level heat is short-lived; before long, the cool food begins to win out, dropping the heat on much of the grill. Then you're back to the same old ritual, rotating ingredients through those few precious hot spots to eke out a result that kinda-sorta resembles grilled food.\n\nSo last year, when AmazingRibs.com's Clint Cantwell included a product called the GrillGrate in his guide to essential grilling gear, I knew I needed to try it for myself. We have a small one-burner gas grill in one of the cooktops in the Serious Eats test kitchen, making it easy to try out.\n\nI did my tests, we took photos, and I intended to write it up, but by then grilling season* was slowing down so I decided to wait until after winter. When coronavirus hit in early spring, right when I should have been publishing this, I forgot all about it. Now here we are, thankfully still with enough time left in grilling season for this to be helpful to many of you.\n\n*I know, I know: \"Every season is grilling season.\" Do this job long enough and you, too, can anticipate every cheeky comment before some clever reader has had the chance to hit \"post.\"\n\nAnd now I can finally tell you what I've told pretty much every single gas-grill owner I've talked to since I ran my tests: If you really want to turn your grill into a beast, you need to get a GrillGrate. (Yes, I sound like a shill. No, this is not an ad—I really am this enthusiastic about it.)\n\nThere are two problems with most gas grills. First, the burners tend to run in rows with spaces in between, creating alternating hot and cold spots across the width of the grill. Second, those burners are rarely hot enough to maintain ideal searing temps. The best spots are usually in the back close to where the lid attaches to the grill by its hinge, possibly because the lid manages to trap more heat back there. But it's never a big enough hot zone to get a good sear on most of the food, especially not meats that are at risk of overcooking if they're left on too long.\n\nThe GrillGrate doesn't just sear evenly, it cooks hotter by trapping the gas grill's heat.\n\nThe GrillGrate's design fixes this. Each GrillGrate is a sheet of aluminum that has raised fins running along its length on one side—these fins act as the bars on a standard grill grate. The aluminum sheet manages to trap much more heat under it than the wide-open spaces of a traditional grill grate can, building significantly more heat and searing ability. And the aluminum itself is a great conductor of heat—much, much better than the cast iron and stainless steel common to the grates on most grills—which helps even out those hot and cool spots.\n\nBetween the fins, meanwhile, are perforations in the aluminum sheet, which allow hot air and smoke to travel up from below, paving the way for the kinds of combustion and smoke that make grilled food taste grilled. And yet, once again thanks to that aluminum sheet, dripping fats are largely prevented from flowing down onto the grill's flames, reducing flare-ups and the unpleasant flavors that come with them.\n\nGas grills are infamous for uneven browning and charring, such as on the chicken here. Flare-ups, meanwhile, are common when liquified fats drop down onto a gas grill's flames, as seen here. The GrillGrate's perforated aluminum sheet evens out cooking and suppresses flare-ups for better results.\n\nThere are some other cool tricks you can do with a GrillGrate. You can, for example, sprinkle some wood pellets down into the troughs between the fins for some quick blasts of smoke. And you can flip the GrillGrate over so that the perforated flat aluminum sheet becomes the top side, turning it into a pretty kick-ass plancha. And depending on whether you want to even out the heating across the entire surface of your grill or create distinct high- and low-heat zones, you can either link the GrillGrate panels together so that they conduct heat into each other, or disconnect them so that one set over a higher burner won't spread its heat into an adjacent one set over a burner set to a lower heat.\n\nIn my tests, the differences in results were clear. On our gas grill's standard grill grate, meat and vegetables blackened excessively in some spots while under-searing in others. On the GrillGrate, everything seared quickly and evenly all over.\n\nOn the GrillGrate, chicken and asparagus browned evenly all over.\n\nSetting the GrillGrate up on your grill is easy. The company offers a number of configurations pre-cut to fit many popular grill models, but you can also go the custom route by measuring your own grill and having them cut the pieces to fit. You can then set the GrillGrate on top of your existing grill grate, or remove the old one and replace it.\n\nOnce the GrillGrate enters the picture, gas grills make quite the compelling argument: Convenient to use, with amazing results. The case for charcoal just took a big hit.\n\nAll products linked here have been independently selected by our editors. We may earn a commission on purchases, as described in our affiliate policy.\n",
      "Folder": "Feedly",
      "Timestamp": "1596860295",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.308544Z"
}