{
  "id": "35dd94681fb74f049ca406545a1eec79",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.seriouseats.com/2020/07/kenji-makes-pan-pizza-video.html",
      "Title": "Watch Kenji Demonstrate How Foolproof His Pan Pizza Recipe Really Is Serious Eats",
      "Selection": "[Video: J. Kenji Lopez-Alt, with editing by The Serious Eats team]\n\nThis foolproof, no-knead pan pizza recipe is easily my most popular recipe. It’s also the recipe I make most frequently at home, especially now that there’s a toddler who both loves pizza and loves cooking in the house. Indeed, it’s so popular with her that it inspired me to write a children’s book called Every Night is Pizza Night (that book will be out this September, and if you preorder it, or any of my other books, from my Bookshop.org shop, 10% of proceeds go to independent bookstores across the country, and 100% of my sales commission will go towards producing and serving coronavirus relief meals).\n\nYou can read all about the science and process of making pan pizza here, and you'll also find a video on that page that distills the process in about 10 minutes. This video, on the other hand, is almost 30 minutes long, which seems pretty long for a cooking video, but it contains every single active step you need to make this recipe from start to finish, including making a few mistakes along the way.* (You can find a slightly longer original on my YouTube channel.) That means if you gather your ingredients and tools, you can start the video and cook right along with me. It'll be like I'm standing right there in your kitchen, only less creepy. And the best part? You don't even have to share the pizza with me when it's done (but please do share with toddlers and other loved ones).\n\n*I actually went back and checked the active time estimates I gave for both the New York pizza sauce recipes and guess what? They add up to 30 minutes, so I'd say my estimates were spot-on.\n\nAll products linked here have been independently selected by our editors. We may earn a commission on purchases, as described in our affiliate policy.\n",
      "Folder": "Feedly",
      "Timestamp": "1594936381",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.289839Z"
}