{
  "id": "3619d9b6c2f74cd48b6ab31aee012902",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.artofmanliness.com/2016/10/13/how-to-track-a-human/",
      "Title": "How to Track a Human The Art of Manliness",
      "Selection": "It’s a common trope in classic Westerns. A posse is rounded up to find some bad guys who’ve headed out into the desert to hide. To help track them down, they bring on an Indian scout. To the astonishment of the cowboys, the native guide can determine how many people are in the bad guy’s gang, how long ago they camped at a particular spot, and that one of the ruffians is injured. It almost seems like magic.\n\nBut it’s not.\n\nThe scout was simply using a set of keen, field-developed senses, and practicing good forensics.\n\nA few years ago when I did the ITS Tactical Muster, one of my favorite classes at the event was on human tracking, taught by professional combat tracker John Hurth. In just a few short hours, John was able to show us how to know what’s going on with someone on the lam and where he or she is headed simply by looking at their footsteps or noticing a broken branch.\n\nWhy would you need to know how to track a human? You’ll probably never have to go on a manhunt for a fugitive, but it’s a handy skill to have nonetheless. Maybe your kid wanders away from your house, or you lose a buddy in a remote wilderness area. Instead of wandering frantically and aimlessly, calling their name, you can know how to search for them effectively and efficiently.\n\nPlus, once you know how to track a human, you can reverse engineer the process as well; that is, you’ll better be able to make your own escape without leaving a trail. You know, just in case you find yourself on an island, being chased by a stalker playing “the most dangerous game.”\n\nBelow, we provide a primer on tracking humans. Keep in mind, to really learn how to do this stuff, you need to practice it and practice it for years. But with some dedication, you may eventually reach the level of tracking evinced by the crack trackers in Butch Cassidy and the Sundance Kid, of whom the protagonists repeatedly said with exasperation, “Who are those guys?”\n\nDevelop Your Situational Awareness\n\nThe most important attribute a tracker must develop is his situational awareness. Without it, clues and signs that would lead him to his target go unnoticed.\n\nSituational awareness comes down to two things: 1) observing, and 2) correctly interpreting your observations.\n\nLearning how to become more observant takes time and dedication. It requires changing your mindset, training your memory and senses, and daily practice in truly noticing what you see. Fortunately, we have some fantastic guides on how to do all of those things:\n\nHow to Develop the Situational Awareness of Jason Bourne\n\nThe Sioux Guide to Situational Awareness\n\n10 Tests, Exercises, and Games to Heighten Your Senses and Situational Awareness\n\nOnce you sharpen your powers of observation, you next need to know how to correctly interpret what you see, in order to reach correct conclusions about what’s going on. To do that, you must broaden and deepen your mental models.\n\nBroaden and Deepen Your Mental Models\n\nMental models are simply ways of looking at and understanding the world. These paradigms create our expectations for how the world works — helping us grasp what’s happened before, what’s happening now, and what’s likely to happen next.\n\nFor a tracker, the mental models he needs to broaden and deepen the most are the ones that will better help him find his target. These fall into two main categories: environment and psychology/habits.\n\nEnvironment\n\nThe most obvious subject a tracker needs to know inside and out is the environment in which he is tracking. He needs to understand things like how snow keeps a track changes depending on whether it’s more wet or dry. He needs to know that spiders usually spin their webs late in the evening (if footprints are beneath an unbroken spider web, the tracker can assume that the target passed the point earlier in the day). He needs to know about the fauna and rocks in the area. He needs to know how the wind blows. He needs to know the usual temperature of embers a certain number of hours after a campfire has burned out.\n\nHe also needs to know how stuff ages in an environment. A skilled tracker can look at objects or signs in his surroundings and roughly gauge how long ago they were left there by his target. He knows how long it takes for paper to start to brown or a plastic bottle to become discolored after being discarded in a desert or forest. He should be able to look at a broken branch and, based on the color of the exposed wood, roughly guess when it was broken. He even knows what human feces look like 1, 2, 3 days after it was excreted by his target. Developing these mental models will come with practice and time, but one way to build them up before you need them is to make “aging stands.”\n\nAging Stands: The Tracker’s Experiment\n\nAging stands are described by expert combat tracker John Hurth as “science experiments” for trackers. You make a one-row grid on the ground out of branches and place different objects into its squares. Ideally, each square will be exposed partly to direct sunlight and partly to areas shaded and protected by trees. In week one, you put items that you want to test in the first square: footprints, paper, broken twigs, water bottles, and yes, even poop. You want to make sure you have duplicate samples in the shaded and unshaded part of the square.\n\nEach day, visit your aging stand and take notes on how things have changed. How have the exposed branches changed color? Has the paper started fading? What’s happened to the poop? Have the impressions of the footprints changed over time?\n\nThe next week, move to the next square in the grid and put fresh samples of the same items in it. Compare them to the samples in the first week’s square. Take notes on differences. The next week put new samples in the third square. Compare them to the first and second week’s squares. Over time, you’ll get a rough idea of the aging progression undergone by both natural and manufactured items.\n\nYou’ll want to conduct aging stand experiments at different times of the year — spring, summer, fall, and winter — to learn how seasonal variations in humidity, temperature, and precipitation affect the aging process. It’s a laborious exercise, but it’s essential for creating the mental models you need to successfully track someone.\n\nHuman Psychology & Behavior\n\nA tracker needs to not only know what’s going on in the environment in which he’s following a target, but what’s going on in the target’s head as well. He needs to develop mental models that deal with human behavior, and this means having a robust knowledge of human psychology and sociology. Knowing the mindset and cultural background of your target can help you know how he’ll act and lead you to where he is. The famous scout Frederick Russell Burnham had this to say about developing these kinds of mental models:\n\n“It is imperative that a scout should know the history, tradition, religion, social customs, and superstitions of whatever country or people he is called on to work in or among. This is almost as necessary as to know the physical character of the country, its climate and products. Certain people will do certain things almost without fail. Certain other things, perfectly feasible, they will not do. There is no danger of knowing too much of the mental habits of an enemy. One should neither underestimate the enemy nor credit him with superhuman powers. Fear and courage are latent in every human being, though roused into activity by very diverse means.”\n\nBesides general cultural and psychological mental models, you need to develop mental models for your particular target. Does he like to eat certain foods? Does he have any medical conditions? Does he smoke or bite his nails? Is he familiar with the outdoors or is he a city dweller? Does he have any particular fears or insecurities? Does he know anyone in the area?\n\nKnowing this sort of information about your target will inform the way you conduct your search and interpret the evidence you find in the field. For example, if you know your target smokes, you’ll be on the lookout for cigarette butts. If he has diabetes, and you come across a puddle of urine that smells fruity, you’ll know you’re on the right track.\n\nScan and Search: Taking in Your Environment\n\nNow that you’re working on increasing your situational awareness by becoming more observant and developing appropriate mental models (this is in fact an exercise that should never end), it’s time to start actually tracking.\n\nWhen you’re out tracking, you’ll be engaging in two visual modes: scan and search.\n\nScan\n\nWhen you scan the landscape, the goal is to get a general, big-picture overview of your surroundings. Keep an open focus. Don’t have any particular thing you’re looking for, as that will cause “target blindness” and result in your missing other pieces of evidence. Visually sweep the area for possible anomalies in your environment like tracks, litter, blood stains, etc.\n\nRather than scanning an area haphazardly, tracking experts David Diaz and V. L. McCann recommend dividing it horizontally into thirds:\n\n“Imagine the territory in front of you is a two-dimensional canvas of a painted nature scene. The top boundary is the horizon; the bottom boundary is the ground in front of you. Now divide that canvas into three equal parts: the foreground, the mid-distance, and the far ground…\n\nIn order to ‘see’ everything in such a vast area, it must be scanned systematically. With a horizontal movement of your eyes, sweep the foreground from left to right, right to left, and left to right, moving your line of vision up just enough to slightly overlap the area above the last sweep.”\n\nIn this way, you methodically work your way up to the far ground and ensure that you don’t miss anything — distant or near — lying before you.\n\nSearch\n\nDiaz and McCann describe searching as “in-depth analysis of an area or object.” You can begin searching at any point in the scanning process once you’ve noticed an anomaly. Searching involves looking at the anomaly more closely and recording it in your mind or notebook for later analysis.\n\nJust because you’ve searched one anomaly, doesn’t mean you should stop your scan of the area. Keep scanning and looking for more anomalies that you can more closely examine. As you continue your scan and search, take extra caution to avoid contaminating signs that you’ve uncovered. Leave litter where you found it, and don’t walk on footprints. You want to leave things in their original locations so you can put the pieces together and construct a story based on the evidence found.\n\nUsing Light for Scanning and Searching\n\nAs you scan and search, use the light available to you to better locate possible anomalies. For example, in the morning and evening, the sun casts long shadows over impressions in the ground, bringing them into sharper relief. To better see these shadows, position yourself so that the tracks you’re following are between you and the light source. This will require you to change your position in relation to the tracks. Be mindful of not contaminating them with your own prints as you do so.\n\nTracking at night is possible with the assistance of a light source like a flashlight. You’ll want to use a colored light like green or red to avoid disrupting your night vision. (Side note: red used to be the preferred nighttime light color, but many operators are switching to green because it allows them to see objects more clearly without reducing night vision that much.)\n\nWhen you’re searching at night, if you look directly at the object you’ve identified, you’ll likely stop seeing it. Looking directly at objects requires you to use the cone area of the retina, and that’s not very active during low-light settings. To make up for this deficiency, you’ll want to use what Diaz and McCann call “off-center vision.” Instead of looking directly at the object you’ve identified, you’ll want to look left, right, above, and below it, pausing at times to verify the properties of the object.\n\nKnow What To Look For\n\nAs you scan and search your environment, you want to be on the lookout for a few indicators that will help you track your target. Hurth suggests being on the lookout for the following visual indicators (I haven’t included all of them — check out John’s book for the complete, exhaustive list):\n\nGround Indicators (on the ground)\n\nFootprints\n\nVehicle tracks\n\nTrampled grass\n\nBoot and shoe scuffs\n\nTurned over dead leaves\n\nDisturbed grass or soil\n\nMud, soil, sand, and water transferred from footwear onto another medium\n\nTrack Traps: The Honey Pot of Ground Indicators\n\nHurth suggests being on the lookout for “track traps.” These are areas on the ground that do an excellent job of capturing your target’s tracks. He calls them “honey pots” because they leave so much information behind. Mud, sand, soft dirt, and snow are great examples of track traps. Bodies of water or oil spills can be track traps too. A target who steps in water or oil will likely leave footprints on the ground after stepping in the fluid.\n\nAerial Indicators (above your ankle)\n\nBroken cobwebs\n\nDetached or missing leaves\n\nBroken branches that point in the direction of the target\n\nScratches or scuffs on trees\n\nCut or broken vegetation\n\nTall grass or vegetation pushed down into an unnatural position\n\nClothing fabric in branches\n\nHair in branches\n\nLitter Indicators (objects discarded intentionally or unintentionally)\n\nCigarette butts\n\nCandy and food wrappers\n\nSpent ammo casings\n\nUsed medical supplies\n\nGum/tobacco\n\nClothing\n\nBlood Indicators\n\nYour target might be injured and consequently leaving blood stains. The color of the blood stain can tell you a lot about the injury he or she has and how long it’s been since they left the blood stain there.\n\nDark red drops of blood. Indicates a venous wound. Non-life-threatening.\n\nBright red streaks of blood. Indicates a possible arterial wound. Life-threatening.\n\nPink, frothy blood. Indicates a possible wound to the lungs.\n\nLight red, foul-smelling blood. Indicates a possible wound to the stomach.\n\nBlood changes color over time as it’s exposed to the elements. Initially, blood spots will be brighter but will eventually fade to a brown or rust color.\n\nBodily Discharge Indicators\n\nVomit, poop, pee, snot — these bodily discharges may not be pleasant to contemplate, but they can not only help lead you in the direction of your target, but also paint a picture of his current condition.\n\nVomit and poop can tell you what sort of food your target’s been eating. If there’s a lot of liquid, clear vomit or you see diarrhea, there’s a chance he could be dehydrated.\n\nIf you find a urine spot that has a very fragrant ammonia smell, the target is likely dehydrated. If it has a fruity smell, there’s a chance he’s diabetic.\n\nMan peeing\n\nWoman peeing\n\nThe relation of a urine stain’s position to a set of footprints can tell you if it came from a man or a woman. If the urine stain is in front of the footprints, probably a dude. If the stain is in the middle of the footprints or near the heels, likely a lady who popped a squat to do her business.\n\nAudio and Olfactory Indicators\n\nAs a tracker, you can’t just rely on your sight to track down your target. Sounds — heavy breathing, talking, crying, movement in brush, coughing, etc. — can provide insights as to where your target is.\n\nSmells can also provide useful clues. The smell of smoke can lead you to a campfire where the target is currently or has been recently. If the target’s been without a shower for a couple of days, he might also be giving off some pungent body odor.\n\nBottom line: as you scan and search with your eyes, don’t take your nose and ears offline. They can provide useful information you’d be missing using sight alone.\n\nIdentifying and Interpreting Footprints\n\nWhile you should be scanning and searching for signs and indicators like blood, trampled grass, and broken cobwebs, footprints will be one of your primary ways of following and tracking your target.\n\nA professional tracker is so adept at tracking footprints that he can identify individuals simply with a glance at the impressions in the ground. They can also immediately tell if the person is running, carrying a load, carrying another person, or even walking backwards.\n\nThe ability to create this dossier on a target simply by looking at their footprints requires some careful observation. Here’s what to look for when identifying and interpreting footprints.\n\nCollect Information on a Footprint Data Card\n\nA footprint data card is your police sketch of your target’s footprint. (John has a template in his book.) You’ll draw the pattern of the sole of his footwear on the card, determine if it’s a boot, shoe, or sandal, and make measurements that include the length of the print overall, the width of its heel (and its length if it’s a boot), and the width of the ball of the foot. You’ll also note if the impression reveals any manufacturer or sizing labels and if the toe is rounded, square, or pointed. You’ll want to record the time and location you located the print and the direction of travel as well.\n\nHurth recommends putting a nickname on top of the footprint data card based on its salient characteristics. So if you see a “Vibram” logo in a print, you can call that print “Vibram.”\n\nIf the target is barefoot, you’ll want to note whether he has a high arch, regular arch, or is flat-footed. You’ll want to measure the width of the ball of the foot and the heel. Make notes about their toes too — missing digits? Hammer toe?\n\nInterpreting Footprints\n\nIf you look closely enough at footprints, they can tell you a lot about what your target was doing when he left them.\n\nFor example, the spacing and depth of the impressions can tell you about the target’s gait — whether he was running or walking. Impressions that are far apart from each other and deeper in the toe or the heel indicate that the target was running; impressions that are shallower and closer together indicate walking.\n\nIf the gait is shorter and the impressions are deeper, the target was likely carrying a load like a backpack. If you see a short gait and deep impressions, along with intermittent additions of another set of prints next to the target’s, you can deduce that he was carrying a person (and occasionally putting them down for breaks).\n\nA set of impressions that have a circular indention to the side indicates that the target is using a walking cane or stick.\n\nIf one foot leaves a deeper impression than the other, it likely means the target is favoring that leg and that the other leg is injured.\n\nSo as you look at footprints, don’t just stop with the observation phase. Try to put together a story of what your target was doing, as this can help you develop a theory as to what he’s likely to do next.\n\nDetermining the Number of People in a Group by Footprints\n\nSometimes counting the number of people in a target group is easy because there are distinct sets of footprints that you can count. But often the footprints overlap and mix together. How do you get a count then?\n\nOne way is to use the Box Method to get an estimate. Draw a line behind one print and then measure 48-60 inches forward and draw another line. Count all full and partial prints between those two lines (round up if you end on an odd number). Divide the total print count by two, and you’ll have a rough estimate of the number of people in your target group.\n\nPractice Reading Footprints\n\nReading and interpreting footprints is a skill that can be acquired through practice. A great way to do that is to create an artificial track trap out of sand and then have your friends walk through it in different ways while you’re not looking. They can run, limp on one leg, carry each other, walk and then kneel, drag a body, pretend to fight each other, etc.\n\nAfter they’ve left their tracks, go to the track trap and interpret what they did by looking at the tracks. After you’ve recreated the scenario your friends acted out, use a rake to clear the track trap’s slate and have your buds walk through it again.\n\nI did this exercise with Hurth at the ITS Tactical Muster and had a blast. It’s pretty cool to be able to determine whether a fight went on or if someone was carrying a rifle simply by looking at footprints.\n\nPutting It All Together: Creating a Story of Your Target\n\nTracking requires you to be hyper observant of your environment while simultaneously orienting your observations to the mental models in your head. This back and forth observing and orienting allows you to create a story of what’s going on with your target even though you weren’t there to observe them firsthand. By creating this story about your target as you collect evidence, you’ll be in a better position to figure out where they’re headed so you can find them.\n\n_____\n\nSources\n\nCombat Tracking Guide by John Hurth (If you get the chance, take a course from John. He’s extremely knowledgeable and a great teacher.)\n\nTracking Humans by David Diaz and V.L. McCann\n\nThe post How to Track a Human appeared first on The Art of Manliness.\n",
      "Folder": "Feedly",
      "Timestamp": "1476413399",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.705946Z"
}