{
  "id": "36527f785ced4818bf4d0b70d016779c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.boardingarea.com/not-targeted-for-the-amazon-amex-deal-try-this/",
      "Title": "Not Targeted For The AmazonAmex Deal Try This. Frequent Miler",
      "Selection": "Amazon launched a new promotion a few days ago that offers a 20% discount on up to $250 of spend when paying with at least 1 Membership Rewards point. See: Get 20% off at Amazon w/ 1 Membership Rewards point [YMMV]\n\nIt’s a great deal, but it’s also targeted. My wife and I were 0/2 with our accounts as we both received the following message saying that we’re not eligible.\n\nWe found ourselves in the exact same scenario last year when Amazon ran a similar promotion, albeit with a higher $500 spending limit. Back then, neither of us were targeted for the $100 savings, but we managed to get ourselves targeted by following a few different steps.\n\nCurious as to whether following the same steps would work again, I did just that a few days ago. I checked the next day to see if I was targeted – I wasn’t. I checked again the following day – still no joy. It was third time lucky though as I checked again yesterday and saw this shining beacon of wonderfulness.\n\nYep, I’d gotten myself targeted. To make sure the $5 million redemption limit didn’t get hit before I had a chance to take advantage of the deal, I immediately bought $250 worth of Airbnb gift cards.\n\nIf you’d received the same message saying that you’re not eligible, try following the same steps that I took. I can’t guarantee that you’ll definitely be targeted, but it worked on both mine and my wife’s accounts once again.\n\nStep 1\n\nFirst of all, delete all of your Membership Rewards-earning accounts from your Payment Options on Amazon. To do that, click on each applicable card, then click ‘Remove’.\n\nStep 2\n\nAdd at least one Membership Rewards-earning card back on as a payment option.\n\nStep 3\n\nNow that your Amex card is added back on, you’ll need to re-enroll in Shop With Points (our affiliate link). Click on the ‘Get Started’ button on that page and select your card. On the subsequent screen, make sure you select ‘Off’ where it asks if you want to apply Membership Rewards by default. Otherwise, you might accidentally pay for an entire order with Membership Rewards which is terrible value.\n\nStep 4\n\nCheck again to see if you were targeted for the 20% off promotion (our affiliate link).\n\nStep 5\n\nIf you weren’t targeted immediately, don’t give up – try that link every day. Like I mentioned earlier, it took three days before I became eligible for the offer, so hopefully you’ll have the same success in a few days time.\n\nEarn Miles Without Flying: START HERE\t\n\nThe post Not Targeted For The Amazon/Amex Deal? Try This. appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1561915284",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.392351Z"
}