{
  "id": "36c048a449a74981a650915bd1977213",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theatlantic.com/business/archive/2016/12/unions-wisconsin/509798/",
      "Title": "How to Kill the Middle Class The Atlantic - Business",
      "Selection": "Back in 2009, Rick Erickson was happy with his job as a teacher in one of the state’s northernmost school districts on the shores of Lake Superior. He made $35,770 a year teaching chemistry and physics, which wasn’t a lot of money, but then again, he received stellar healthcare and pension benefits, and could talk honestly with administrators about what he needed as a teacher every two years when his union sat down with the school district in collective bargaining sessions.\n\nThen, five years ago, Wisconsin passed Act 10, also known as the Wisconsin Budget Repair Bill, which dramatically limited the ability of teachers and other public employees to bargain with employers on wages, benefits, and working conditions. After Act 10, Erickson saw his take-home pay drop dramatically: He now makes $30,650. His wife is a teacher, too, and together they make 11 percent less than they did before Act 10. The local union he once led no longer exists, and so he can’t bargain with the school district for things like prep time and sick days. He pays more for health care and his pension, and he says both he and his wife may now not be able to retire until they are much older than they had planned.\n\n“We still haven’t recovered from Act 10,” Erickson, who was Wisconsin’s 2014 High School Teacher of the Year, told me. “It’s definitely changed things.”\n\nBeginning with the elections of 2010, when a wave of Tea Party, anti-government candidates won statewide offices across the country, states have passed legislation to diminish the power of unions, and that’s had a very real effect on middle-class Americans like the Ericksons. Wisconsin passed Act 10 in 2010, and Indiana and Michigan both became right-to-work states in 2012, meaning that unions can’t require members pay dues as a condition of employment. Wisconsin also became a right-to-work state in 2015.\n\nNow, after another big GOP victory in November, unions will likely face more challenges at the state and national levels. Lawmakers in Missouri, which replaced its Democratic governor with a Republican one, have already said they plan to pass a right-to-work law in the state in the new year. And Congress may consider a national right-to-work law as well, said Gary Chaison, a professor of industrial relations at Clark University. Republicans will also control the National Labor Relations Board, which oversees worker-employer disputes, and Trump could reverse Obama’s executive orders, including those which required federal contractors to provide workers with paid sick leave. Chaison says he expects these developments to further erode the economic security of many middle-class workers. “The middle class is going to find it has no voice in determining their wages and working conditions,” he said.\n\nThat’s already the case for many public employees in Wisconsin. In fact, in many ways, Wisconsin is a sobering preview for what may happen in the rest of the country. Data suggests that Erickson is by no means unique. Total teacher compensation in Wisconsin has dropped 8 percent, or $6,500 since Act 10, according to an extensive study by Andrew Litten, a Ph.D. candidate at the University of Michigan who used state data showing compensation of all teachers in the state of Wisconsin. What’s more, he found that the most experienced and highest-paid teachers experienced the biggest reduction in benefits. Litten’s research confirms what labor advocates have said for decades: A lack of bargaining power can have a profound effect on what workers receive from their employers.\n\nThis, of course, is not something special about Wisconsin. “While Wisconsin is one of the most dramatic examples of a renewed regulatory focus on public sector unions, it should be considered an important part of an ongoing trend, rather than a one-off event,” Litten wrote, in the paper.\n\nAct 10 had a number of specific provisions that eroded public-employee compensation and benefits in Wisconsin. It required that public employees pay at least six percent of their wages towards pensions, and stipulated that they pay half the costs of their pensions. Many employees, like Erickson, had not had to contribute at all to health-care costs previously, so the law meant a 12-percent pay cut. It also limited contracts to one year, and stipulated that employees and employers could only bargain over cost-of-living salary increases, and not over benefits at all. After Act 10, if districts wanted to raise teacher pay above cost-of-living increases, they would have to hold a referendum to do so, and there was really no way for teachers to achieve better benefits.\n\nAct 10 also required that public-sector unions hold recertification elections every year, meaning a majority of all people represented had to show up to a vote and agree that they wanted the union to continue to exist. Many public-sector unions have ceased to formally exist since that rule went into place. Just 8.3 percent of all workers were members of a union in Wisconsin in 2015, down from 15.2 percent in 2009. That means there’s a lot less union money spent on advocating for workers. According to the Wisconsin State Journal, the Wisconsin Education Association Council, one of the main teacher’s unions in the state, spent $1.5 million on lobbying during the 2005-2006 legislative session. In 2015-2016, it spent $109,888.\n\nBecause of the changes, especially the lower compensation, some teachers are working multiple jobs just to make ends meet, according to Christina Brey, a spokeswoman for the Wisconsin Education Association Council. Rick Erickson knows people who have left the state for Minnesota or other nearby places where teachers are treated better. Others have gone overseas. That’s led to a shortage of qualified educators in Wisconsin—this year, Erickson’s district couldn’t find a certified applicant for a position as a biology teacher in the middle school, so they had to hire someone who was not certified as a teacher.  Another district, North Fond du Lac, has had trouble recruiting qualified teachers in subjects such as math, Aaron Sadoff, the superintendent there, told me. The only way teachers can get raises now is to switch districts, because they can’t negotiate salary increases except for cost-of-living in their own districts. Districts now compete against each other, trying to poach the qualified teachers that remain.\n\n“It’s like the wild west,” Sadoff said.\n\nFor many workers, falling wages and benefits aren’t the only problem with laws that target union members. They say that they feel resentment from others who mistakenly think they have used unions to get wage and salary benefits that they don’t deserve. Now that anti-union laws have passed and stayed in place, there is low morale among the people that unions represented. “What I heard a lot of was that teachers and public employers have been getting whatever they wanted for the past 30 years,” Erickson said. “That was a slap in the face.”\n\n“The nobility of going into public service, or teaching, is not viewed as highly as before,” Sadoff, the North Fond du Lac superintendent, said.\n\nOf course, Act 10 has saved some school districts money, because they have more leverage in what they pay employees. In the first year after Act 10, for example, the New Berlin School District shifted teachers to a medical plan with high upfront deductibles, which saved $1.25 million, according to the Milwaukee Journal-Sentinel. The superintendent of the Mequon-Thiensville School District told The New York Times that the district was able to save $400,000 a year by increasing employee contributions for health care, and that it saved even more by freezing teacher salaries for two years. But there’s no evidence those savings translated into better educational outcome for students.\n\nWisconsin isn’t the only state where anti-union rules have changed how workers interact with unions. In Indiana, which passed a right-to-work law in 2012, fewer private-sector employees are choosing to pay union dues, according to David Dilts, a professor emeritus of economics at Indiana University-Purdue University Fort Wayne. Some unions, including the UAW-AFT Unity Team Local 9212, no longer exist. The fallout is concentrated in unions like the United Food and Commercial Workers, which covers grocery workers, Brett Voorhies, the president of the Indiana AFL-CIO, told me. “For some of these kids, it’s, ‘Do I pay my cell phone bill or my union dues?” he said. This means that although unions must represent all employees in bargaining, they have less money with which to conduct business. As unions raise less money from the people they represent, they are less likely to conduct training and advocate for apprenticeships, Dilts said. With less support from workers, unions also have less leverage. A 2015 study from the left-leaning Economic Policy Institute found that wages in right-to-work states are 3.1 percent, or $1,558 lower, than they are in non-right-to-work states. Non-unionized workers are often affected by union pay, because non-unionized workforces are pressured to raise wages or lose workers to union shops, studies show. “People are concerned about incomes not going up,” Dilts said.  “One of the reasons they’re not going up is the right-to-work law.”\n\nMany Americans have mixed views about unions, but the example of Wisconsin at least makes one thing clear: Unions do have real positive consequences for their members. It’s possible to argue, of course, that employers will be motivated to treat their employees well because they want happy employees. But the situation in Wisconsin does not bear that out.\n",
      "Folder": "Feedly",
      "Timestamp": "1481156555",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.683544Z"
}