{
  "id": "3719b35f16a6478ba6d7df076fd20d88",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2021/1/11/22225548/mode-smart-cannabis-device-dosing-algorithm-ces",
      "Title": "Mode aims high for the perfect puff of weed The Verge",
      "Selection": "Mode says its smart cannabis device lets you control your dosage | Mode\n\nFor people who use cannabis for medicinal purposes, such as pain management, anxiety, and sleep, vaping the drug can be a bit of a trial-and-error process since you can’t be totally sure of the exact dose you’re getting like you can with a standard edible or pill. The makers of the Mode smart cannabis device say it solves the dosing problem, using a high-res pressure sensor to determine how much a user is inhaling and a prediction algorithm that determines how many micromilligrams a user is getting per puff based on the cartridge.\n\nThe company says it’s run hundreds of cannabis cartridges through its testing machines to identify each one’s unique characteristics, and the device has an accuracy rate of over 75 percent even without letting the app know which cartridge you’re using. (It’s in the high 80 percent range for known cartridges, the company claims.) Mode is compatible with thousands of standard 510 threaded cannabis cartridges, and it can be locked manually or remotely with the companion app. The company says the algorithm is still improving, and you'll be able to download a new version to the device over Bluetooth.\n\nPeople treat many different medical conditions with cannabis, some using different varieties to treat more than one condition. For example, a user may need a different dose — and likely a different blend — of cannabis to treat anxiety during the day than they would use as a sleep aid at night. That’s why being able to fine-tune the number of milligrams would come in handy.\n\n“This is not just another vape device you’re hitting and blowing out clouds all day,” Mode co-founder Izzy Kirsch said in a demonstration over Zoom during the Consumer Electronics Show. “You can get a milligram pill, so to speak, and go on with your day.”\n\nSo let’s say you’re using cannabis for sleep and you know what dosage you want. Put your cartridge into the Mode device, set it to a dosage between 1 and 5 milligrams, and inhale. The device turns off its heater and vibrates, giving haptic feedback, when you’ve reached your desired dosage.\n\nMode co-founder Mark Wagner said during the CES demo that the company is software-oriented, so rather than building a special sensor to measure dosage, it’s working on fine-tuning the algorithm, which was developed in part by a former data science lead at Jawbone. In addition to a pressure sensor, Mode has temperature, motion, and orientation sensors that help create the ideal dose.\n\nThe device also has a mobile app that lets users track their dosage over time, which is helpful information if you’re testing out a new strain or if you decide your dosage is too strong or too weak. The device bases its measurements on the cartridge manufacturer’s information. For people buying cartridges at a dispensary where the product is a known quantity, the Mode device relying on manufacturer info seems reasonable. However, it’s worth noting that black market and counterfeit cartridges may not provide the same level of accurate info (and can potentially lead to serious illness).\n\nIn the relatively new medical cannabis marketplace, patients can end up going through a lot of trial and error finding a strain and a cartridge that gives them the amount they need — even the batteries used with standard cannabis cartridges can vary wildly in how they deliver your dosage. So a device that gives more user control over how much you’re consuming is a welcome addition.\n\nMode says its device is made with medical-grade materials, including a tear-resistant silicone air passageway that goes all the way from the bottom of the device through to the cartridge, separate from all its electronics except for the pressure sensor. It uses high-grade stainless steel on the heat shield in the tube, and the outer case is raw ABS plastic; the company says it’s staying away from paint, which can lead to emissions.\n\nMode uses USB-C charging, with a 385mAh custom battery. It can provide between a week and two weeks of battery life for a user taking 5 to 20mg per day, “not someone who’s continually crushing through cartridges,” Kirsch notes.\n\nMode is available for preorder and will retail for $100 when it’s available later this year. The company's targeting early summer.\n",
      "Folder": "Feedly",
      "Timestamp": "1610431954",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.216939Z"
}