{
  "id": "37bdee61d5a748e48172a08b00fd87c2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1642062/sci-fi-set-in-space-is-posing-a-problem-for-our-oceans/",
      "Title": "We should care more about the deep sea than we do deep space Quartz",
      "Selection": "For millennia, the ocean has been an inspiration for generations of storytellers and poets, novelists and artists. Throughout history, it has served as a ubiquitous backdrop for stories of adventure and exploration: Treasure Island, The Rime of the Ancient Mariner, and Twenty Thousand Leagues Under the Sea to name a few.\n\nIn recent decades, however, public interest in the deep sea seems to have been replaced by deep space. The internet went wild when the first published photos of a black hole were published in April. Every SpaceX mission makes global headlines, including the recent launch of the Starlink constellation of satellites in May. And now even your elderly grandmother probably knows about gravitational waves.\n\nBut for the sake of the planet, we need to stop exclusively looking to the stars for inspiration and dive a bit deeper instead.\n\nA literary sea change\n\nThe golden age of nautical storytelling was born from the real-world golden age of nautical exploration. Some milestones in this era include the historic voyage of Christopher Columbus across the Atlantic Ocean in 1492, Ferdinand Magellan’s circumnavigation of the world in 1519, the invention of the submarine in 1620, James Cook’s scientific expedition to the Pacific Ocean in 1768, and Charles Darwin’s exploration of the Galapagos Islands on the HMS Beagle in 1831.\n\nArt imitated life, and during this time nautical fiction was a predominant literary genre. Two works that best represent this era are John Milton’s Paradise Lost (1667) and Samuel Coleridge’s The Rime of the Ancient Mariner (1798). This trend continued into the 19th century, which produced Herman Melville’s Moby-Dick (1851), Jules Verne’s Twenty Thousand Leagues Under the Sea (1870), Robert Louis Stevenson’s Treasure Island (1883), and Joseph Conrad’s Heart of Darkness (1899).\n\nBut then something happened in the mid-20th century: The great unknown of space overtook the vastness of our ocean, both as a place of wonder and as a territory to be conquered. Ships and submarines were replaced by spaceships and rockets, and ocean-faring pop-culture references evaporated.\n\nThe meteoric rise of space stories\n\nHumanity has always been enamored with the night sky. Gazing at the stars—dreaming of what’s out there—is an almost innate aspect of the human condition, agnostic of language, geographic location, socioeconomic class, or culture.\n\nHowever, space was rarely a setting for storytelling until the mid-20th century. With a few exceptions of prescient writers such as H.G. Wells and Jules Verne, the zeitgeist didn’t contain space stories until we became a spacefaring species. Once the public realized we could go to space, we started telling stories about it. Art began imitating life once again.\n\nIn the 1950s and 1960s, we read Ray Bradbury’s The Martian Chronicles (1950), Isaac Asimov’s Foundation (1951), Kurt Vonnegut Jr.’s The Sirens of Titan (1959), Robert Heinlein’s The Moon is a Harsh Mistress (1966), and Arthur C. Clarke’s 2001: A Space Odyssey (1968). On TV, we watched the premiere of The Jetsons (1962), Lost in Space (1965), and Star Trek (1966). On the big screen, we saw The War of the Worlds (1953), Planet of the Apes (1968), Star Wars (1977), Close Encounters of the Third Kind (1977), and Alien (1979).\n\nAt around the same time as real-world space exploration and the emergence of space in popular culture skyrocketed, public interest in the ocean receded with the tides.\n\nWhy have we moved on? Why does space now capture the imagination and the ocean does not?\n\nThe true final frontier\n\nWhat if the Golden Age of ocean exploration is in front of us, not behind us?\n\nAn estimated 95% of the ocean hasn’t been seen by human eyes. We have better maps of the surface of the Moon—and of Mars—than we do of our ocean floor.\n\nThe ocean is just as much of an alien environment than the aliens we search for in the cosmos. It houses an abundance of life—literally hundreds of thousands of species as yet discovered by humans—geological features unparalleled throughout our entire known solar system, and a veritable collection of scientific discoveries and pharmacological cures just waiting to be found. While space contains the veiled threat of a once-in-a-millennium meteorite, the health of the sea directly enables and facilitates all life on Earth right now; more than half the oxygen we breathe comes from the ocean, and the ocean absorbs an estimated 25% of all atmospheric CO2 we emit each year.\n\nThe artifacts of thousands of years of human civilization litter the ocean floor, making it by far the world’s largest museum, albeit a completely inaccessible one. While 571 people have traveled to space, only four have descended to the deepest-known point of our ocean, the Mariana Trench, which is more than a mile deeper than Mount Everest is tall.\n\nThere is a delta in modern times between the level of public interest in space compared to the level of public interest in the ocean. As a result, an unimaginable amount of money and resources have been devoted to furthering our knowledge of space, while only a fraction of that has been invested in understanding the ocean.\n\nWe need to re-mysticize the ocean—to remind people just how little we know about it. We need to re-spark public curiosity, especially at a time when the ocean’s health is in danger. If public interest in the ocean increases, so will the investment in research and exploration, which can result in increased awareness and protection.\n\n* * *\n\nIn a little-known speech by US president John F. Kennedy in 1963, less than four months before his assassination, he extoled the value of the ocean, calling its protection “of the utmost importance to man everywhere.” He committed the US to a long-term “vigorous program” to research and protect the ocean—a program that, due to his untimely death, went nowhere.\n\nIn an alternate universe (or perhaps in a Stephen King novel), this deep-sea program would have been the one that persevered instead of deep space, positively impacting and inspiring generations to come about the importance and power of our oceans.\n\nBut in this universe, in which we went to space instead, we need to re-stimulate a public discourse about the ocean. Funding for scientific research is critical and international agreements and cooperation are paramount. But we must also tell stories—stories that remind us about the mystery and majesty of our ocean, and the critical need for discovery and stewardship.\n",
      "Folder": "Feedly",
      "Timestamp": "1561180328",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.394415Z"
}