{
  "id": "3850c48b12554f2382694a666ce90726",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/15416-remembering-elena-parker-longtime-food52-videographer-columnist-and-friend",
      "Title": "Remembering Elena Parker, Longtime Food52 Videographer, Columnist, and Friend Food52",
      "Selection": "We were saddened and stunned to learn yesterday that Elena Parker—Food52's videographer and correspondent on everything to do with film and food in the early, scrappy years—had passed away unexpectedly of a pulmonary embolism at the age of 30.\n\nWe'd kept in touch with Elena over the years—last week, she and Merrill were chatting on Instagram after she visited our Holiday Market—and were thrilled to see her career take off. She'd finished her Master's from NYU's Interactive Telecommunications Program, and most recently, she was the Manager of Interactive Development at Campfire and an adjunct professor at NYU. She had spoken at SXSW earlier this year, and received her first feature film credit, as Co-Writer and Co-Producer of the HBO Documentary Make Me Young: Youth Knows No Pain. None of this surprised us.\n\nWhile Elena worked with us from 2010 to 2011, we were constantly impressed with her flexibility and grace in tackling any request we threw her way. When she signed up, it was to film and edit our weekly contest videos (like this one), but soon she was helping us measure ingredients when we were running late, and accompanying Amanda & Merrill all over the city—to shoot anything from our favorite cheese biscuits and baked doughnuts, to an epic 5-part series on custard with pastry chef Shuna Lydon, to a visit with a serious home coffee roaster on the Upper West Side.\n\nDinner & a Movie: Amélie\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: Some Like It Hot by elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: Bright Star\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: The Hangover\nby elenakathryn\n\n♥\n\n+\n\nWe heard about the movie-themed dinner parties Elena threw with her friends, and asked her to turn them into a column—one of our first, Dinner & a Movie. During Oscar season, she was the only person we knew who'd actually seen all the films, so we tapped Elena to produce both recipes and, in a visually delightful twist, dress pairings.\n\nElena's work built our library of technique videos (you might have learned how to fold and how to roast any winter squash from her) and also gracefully documented our recipe contest system, making it all look purposeful and interesting, despite a Google spreadsheet appearance. She even went in front of the camera to teach us—and aspiring bloggers and cooks everywhere—how to make cooking videos quickly and inexpensively.\n\nBy her count, Elena made over 110 videos for Food52 in the 18 months she worked with us. We are heartbroken at the loss of our talented friend, and hope that you'll join us remembering her. Start by reading our 2011 Q&A with her, then watch and cook from some of her favorite films below.\n\nDinner & a Movie: Singin' in the Rain\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: My Best Friend's Wedding\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: City Lights\nby elenakathryn\n\n♥\n\n+\n\nDinner and a Movie: The Age of Innocence\nby elenakathryn\n\n♥\n\n+\n\nDinner and a Movie: Vicky Cristina Barcelona\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: Spirited Away\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: Jaws\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: To Kill a Mockingbird by elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: Hot Fuzz\nby elenakathryn\n\n♥\n\n+\n\nDinner & a Movie: A League of Their Own\nby elenakathryn\n\n♥\n\n+\n",
      "Folder": "Feedly",
      "Timestamp": "1451339714",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.850020Z"
}