{
  "id": "3949e675a5e842dc85c1e968ecd8a8bc",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://awealthofcommonsense.com/2016/09/the-john-bogle-expected-return-formula/",
      "Title": "The John Bogle Expected Return Formula A Wealth of Common Sense",
      "Selection": "The John Bogle Expected Return Formula\n\nPosted September 13, 2016 by Ben Carlson\n\nI caught Vangaurd’s John Bogle on a recent Bloomberg interview discussing his simple formula for estimating future stock market returns:\n\nI have a reasonable expectations kind of formula that I’ve been using for 25 years and it’s worked the whole 25 years almost perfectly. There’s some decades where it doesn’t work as well as it should but for the full period the reasonable expectations have been almost exactly the same as the returns actually delivered by the S&P 500. And it’s a simple system.\n\nAnd that is you’ve got a dividend yield that’s 2%. Going back a long time it was four and a half or five percent, so there’s a loss right there, suggesting lower returns in the future. Earnings growth has been about 5%. I think it’s going to be very tough to do that in the future, maybe we can do 4%. And stocks are highly priced. The first two are what I call investment aspects of the investment return and the second one is the speculative return — that is what will people pay for a dollar’s worth of earnings. \n\nBogle’s formula is this:\n\nFuture Market Returns = Dividend Yield + Earnings Growth +/- Change in P/E Ratio\n\nHe says this formula currently gives him an estimate of stock market returns in the 4-6% range, well below the long-term average that falls in the 8-10% range. You could quibble with some of the details here but I like the fact that this is such a simple model.\n\nBogle has actually outlined this one before on many occasions. In his book Don’t Count On It he even provided a long-term look at how this formula has played out by decade going all the way back to 1900. Here’s the data (with an update by me through the end of 2015):\n\nDividend yields are much lower now than the were in the past (something that can be partially explained away by the increase in share buybacks) while earnings growth and the P/E multiple expansion or contraction have been somewhat more volatile.\n\nWhat’s interesting here is how inconsistent the change in P/E has been decade-to-decade. At times high earnings growth has led to multiple expansion while other times it led to a contraction in the multiple people were willing to pay for earnings. Fundamentals matter over the very long-term but even over decade-long stretches investor sentiment can trump all. And the reason for this is because the P/E change is really a gauge of investor sentiment or emotions.\n\nWhen investors are feeling good they are willing to pay a higher multiple of earnings for stocks. When they are feeling nervous they are willing to pay a lower multiple of earnings for stocks. The problem with trying to forecast stock returns is that you’re really trying to guess how people will feel in the future.\n\nYou could come up with a reasonable approximation of the impact of dividends and earnings growth over the coming decade and still be way off depending investor allocation preferences or where we’re at in the emotional phase of the cycle.\n\nAnd Bogle said as much in his interview. He admitted, “I can’t forecast the future, let’s be honest about that. But I can make judgments using reasonable expectations about the future and it seems to me the handwriting is on the wall for lower returns than we’ve had historically.”\n\nAnd that’s all you can really hope for as an investor when dealing with an uncertain future.\n\nSo what if Bogle’s formula is right over the coming years or even decades?\n\nA few thoughts:\n\nAdjust your expectations.\n\nHave a contingency plan in place if your expectations aren’t met (save more, work longer, spend less, start a side business, take on a new career, etc.).\n\nPlan for lower returns either way. If you plan for lower returns and it happens you’ll be ready for it. If you plan for lower returns and it doesn’t happen you’ll be even better off. But if you don’t plan for lower returns and it does happen you’re probably out of luck.\n\nIf you’ve missed out on the huge bull market in U.S. stocks since 2009, don’t expect to jump in now and see similar performance.\n\nDiversify more broadly beyond U.S. equities in areas that have higher expected returns.\n\nBehavior and fees will matter more than ever in a lower return environment.\n\nSource:Vanguard’s Jack Bogle on Index Funds, Negative Rates\n\nFurther Reading:Does a Change in Expectations Require a Change in Strategy?\n\n*Returns used here are nominal and don’t factor inflation into the mix, another potential reason for the changes in P/E multiples over time.\n\n \n\n\n\n\n\t\t\t\t\t\t\t\t\t",
      "Folder": "Feedly",
      "Timestamp": "1473806127",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.777475Z"
}