{
  "id": "396a149939c74f54909705184a1e3573",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/17885-a-duvet-cover-hack-we-re-stealing-from-hotel-bedding",
      "Title": "A Duvet Cover Hack We're Stealing from Hotel Bedding Food52",
      "Selection": "I recently divulged to 1 million readers of the popular lifestyle blog Cup of Jo a juicy bedroom secret: I sleep without a top sheet. The responses ranged from confusion—“what’s a top sheet?,” asked a European reader—to mild hygiene horror: “how often do you wash your duvet?”\n\nI wash my duvet every week. Is it a pain? Kinda. The duvet requires its own dryer cycle or else, 55 minutes of high-efficiency heat blasting later, everything is still wet. If you detest duvet cover maintenance (the extended dryer cycle; corner ties designed for nimbler fingers than mine; the upside-down buttons) the hotel industry has its own bedroom secret to share: triple sheeting.\n\nTriple sheeting is the practice of sandwiching a duvet or blanket between two layers of top sheet. (Plus a fitted sheet makes three, hence “triple.”) Top sheets are more cost effective and less labor intensive for hotels than duvet covers, and triple sheeting also offers guests hygienic assurance, as their skin avoids contact with insulating items that are not necessarily washed between each guests’ stay.\n\nWhile hygiene may be less of a concern at home, the cost-effective angle is appealing—especially now that linen bedding is trending. I like linen’s breathability, its connotations of rusticity, its rumpled quality, and how a textured weave irregularly traps light to create a subtle ombré effect. I am less enthusiastic about linen’s price point.\n\nI can, with some self-cajoling, wrap my head around the price of a sheet. A duvet is twice the material, three to four times the labor—the businessperson inside my head understands the delta. But emotionally, I can’t will my (aforementioned inadequately agile) fingers to drag a linen duvet into my shopping cart.\n\nIf the price of a linen duvet chafes you too, here’s how to apply the triple sheeting method to ensconce a duvet in linen top sheets.\n\nWhat you’ll need:\n\nOne fitted sheet\n\nTwo linen top sheets\n\nYou can play with the color combinations. To imitate a conventional duvet cover, use two top sheets of the same color (above, I used the Hawkins Stonewashed Linen Sheets in Peacock). Or, create a reversible look by mixing and matching colors.\n\nHow to do it:\n\n1. Put the fitted sheet on the bed.\n\nNo secret here. The elastic pockets stretch over the corners of the mattress… You know the drill.\n\n2. Drape one of the flat sheets over the bed.\n\nReady the sheet that will become your bottom layer by draping it over the mattress. Align the top of the sheet with the head of the mattress. If your sheet has a “right-side-up” and a “wrong-side-up” (i.e. if there is exposed stitching on the underside), drape it wrong-side-up for now. This will be folded later to reveal the finished side.\n\n3. Drape the duvet over the bed.\n\nReady the duvet by draping it over the bottom top sheet, aligning the top of the duvet with the head of the mattress.\n\n4. Drape the top layer over the bed.\n\nReady the sheet that will become your top layer by draping it over the mattress, concentrating about a 10 to 12 inches of excess fabric towards the head, depending on how much you like your duvet turned down. You want to concentrate a little more than twice the length of the turn-down fold.\n\nDrape it right-side-up, as we’ll be folding this layer twice.\n\nHere's what comes next:\n\n5. Fold the top layer around the duvet.\n\nFirst, fold the excess 10 to 12 inches of the top sheet once, towards the foot of the mattress. Next, fold the duvet once in the same direction, approximately 5 to 6” over the top layer. Finally, fold the remaining 5” to 6” inches of top layer back over the duvet, in the direction of the head of the bed. Tuck an inch or two under the duvet to secure it.\n\nGot it? Watch the GIF above to see it in action!\n\n6. Now, fold the bottom sheet over the duvet.\n\nFold the bottom sheet over the duvet (and over top layer fold) once, approximately 5” to 6” inches, in the direction of the foot of the bed. In this step, you fold the top sheet just like you would in a standard turn-downed bed scenario.\n\n7. Tuck… or don’t!\n\nIn the hospitality context, the tuck—straightjacket tight—is critical. It locks in the insulating layer thus insuring hygiene. At home, you have options. If you, like Seinfeld’s comfort connoisseur George Costanza, like to have lots of room to “swish and swirl,” don’t tuck. We left the top sheets untucked even pooling it on the floor to achieve a relaxed, draped look (in the photo at the top of this post).\n\nUntucked!\nPhoto by Mark Weinberg\n\nYou too can leave the linen bedding loose and free flowing, though in doing so, you accept an elevated risk of the duvet slipping out in the night. This risk positively correlates with the vigor of your swishing and swirling. If you want to secure your duvet sandwich, tuck both sheeting layers under the mattress as if they were one, beginning at the turn-down fold and ending with hospital corners.\n\nIf bedclothes origami intimidates you, here are two plug-and-play methods of incorporating linen bedding on a budget:\n\nProp a linen bolster against a stack of percale pillow shams;\n\nConceal your percale-clad pillows with two linen euro shams;\n\nPair a linen top sheet with a percale duvet; or,\n\nMix two linen pillow shams with two percale shams.\n\nTags:\nbedding, laundry, sheets, \n\n💬 View Comments () Share this Article Tweet this Article\n",
      "Folder": "Feedly",
      "Timestamp": "1473814103",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.776939Z"
}