{
  "id": "3999e8cd332f4050b29eb6ab0b8620e4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.capitalnewyork.com/article/culture/2011/02/1329494/aol-huffpo-acquisition-means-production-without-being-revolutionary-?page=1",
      "Title": "AOL-HuffPo - Acquisition of means of production without being revolutionary at all",
      "Selection": "AOL-HuffPo - Acquisition of means of production without being revolutionary at all\n\nAOL-HuffPo: Acquisition of means of production without being revolutionary at all\n\n\nTim Armstrong and Arianna Huffington. Screen shot via AllThingsD.com\n\nBy Tom McGeveran\n\n11:49 am Feb. 7, 2011 | Tweet this article\n\nIt’s not a marriage, this purchase of The Huffington Post by AOL. It’s more like Arianna Huffington and Tim Armstrong have decided to bunk up so they can move to nicer real estate at lower prices.\n\nWhat Huffington Post started out as—a Drudge Report for the left with an overlay of “columns” by influential people who saw posting opinion pieces to the site as analogous to making television appearances to talk about those same things (seldom a paid proposition after all!)—is not really what it is today. Today, looking at it, you could be forgiven for believing an alternate story of its development: that it was started by an online search engine, or an Internet service provider, or a social network, as a way to get in on the advertising game without shouldering the burdens and costs of a real editorial operation.\n\nHuffington Post already acts and feels like a slightly higher-rent version of the AOL homepage.\n\nFrom the readers’ point of view, Choire Sicha makes the most important point in a critique of the New York Times’ piece on the purchase.\n\nWhat’s rather shocking is that the New York Times said of this purchase that AOL is “betting on news.” Why an actual news-gathering organization thinks that is bizarre. They have confused content with news.”\n\nThat’s exactly right, in the sense that what Huffington Post offers is mostly “original content” consisting of interested parties’ takes on the news (Kathleen Sibelius or Alec Baldwin or whatever) mixed with links to and aggregation of news that has already appeared elsewhere.\n\nPeter Kafka writes:\n\nHuffington Post still has the reputation as a left-leaning political site written by Arianna Huffington’s celebrity pals. In reality, it is most concerned with attracting eyeballs anyway it can. Sometimes it’s with well-regarded investigative journalism, and much more often it’s via very aggressive, very clever aggregation. And sometimes it’s by simply paying very, very close attention to what Google wants, which leads to stories like “What Time Does The Super Bowl Start?“\n\nThis is a game that AOL was failing at and that Arianna Huffington was succeeding at. It is a bet on news in one sense, though: It’s a bet that people want news badly enough that a secondary product, a middleman, is needed to guide them through it all. What value does Huffington post add to the news?\n\nA guy I generally don’t agree with on feelings about media but almost always agree with on facts about the media, Jeff Jarvis, put it pretty well:\n\nOne wonders why big, old media companies didn’t buy Huffington Post. The better question is why they never started their own HuffPos. Only one did: The Guardian. When it saw HuffPo, I remember, its response was, ‘shit, we should have done that.’ So they did, starting Comment is Free as as vehicle to change its relationship with the public (more than as a business strategy). The New York Times or Washington Post are still too tied to their views of themselves as the founts of all fonts; as far as they may have come, the HuffPo model remains a populist leap too far. TV is is wrapped up in its makeup. I tried to convince many publishers in Germany that they should start HuffPo and not one bit.\n\nWhat is it about the environment of traditional journalism that makes it so that readers are more likely to interact with the Huffington Post reblog of a New York Times article than they are with the article itself? Some of the answers are more obvious than others. And here’s where we depart from Jarvis, who scolds “old media” for its aversion to social news and defends the “link economy” from traditional journalists who see it as a separation of the costs of journalism from the profits. That’s what it is, incidentally, for better (Jarvis’ view) or worse (these unnamed old journalists’ view).\n\nThe slowness of traditional journalism organizations to adjust to the “social” part of that equation is only partly attributable to their inertia as businesses. It’s also because their very existence is justified by their obligation to readers to vouch for the content they produce. And like it or not, when you’re directing the fire hose of Twitter, Facebook, and unapproved user-uploaded content at your comments section, you are producing their content.\n\nWhat separates the journalist from the commenter or the unpaid contributor? The journalist is being paid a wage to produce the content for an organization whose purpose is to produce content it can vouch for; the journalist is separated from his or her means of living if he breaks trust with the reader. The journalist gets fired.\n\nFrom that point of view, it’s not just a question of traditional news organizations out-muscling Arianna Huffington on her ability to create and monetize engagement with their news; it would be a question of rewriting their rules of doing business from the ground up.\n\nSo it is about values. The initial value proposition for the Times is that it disseminates information that it believes in and will defend, and that it feels accountable to the reader, beyond newsstand sales, to deliver them something of value. To do that, it’s not enough for their audience to believe it’s good. Anyone can find an audience. You have to also believe yourself that it’s good.\n\nArianna Huffington has not signed on to that initial value proposition, so the ones that follow from it don’t apply to her, any more than Ikea is responsible for making furniture that will last for generations, as long as they don’t put a sticker on their kitchen cabinets guaranteeing they will.\n\nThe current space occupied by Arianna Huffington and by other “portal” sites is not just an opportunity lost to major media organizations.\n\nIf, theoretically, CBS and NBC and The New York Times Company could decide to muscle in on this turf (and they probably can’t, at this late date, but stay with me), would they? If they wouldn’t, then aggregation will always be big business, as surely as real-estate brokers or insurance brokers or investment banks or any of the other middlemen that make fantastic money connecting civilians to products will be with us forever.\n\nNext question: Will all this end in tears? Possibly. Arianna Huffington is now an employee of AOL. What she’s had to do at Huffington Post is cover costs and earn a profit. What she will have to do at AOL is make a meaningful contribution to the bottom line against that company’s plummeting value as an Internet service provider. Tim Armstrong tried to commit resources to making AOL a content organization that lived on ad revenue. And the consensus is that it isn’t happening, or isn’t happening fast enough. So much so that AOL sees $315 M. of value in what the Huffington Post is doing.\n\nThe problem when a startup is acquired by a great big behemoth like AOL is that the accounts get muddled. Good days for the Huffington People at AOL will be ones where cost overruns and failed projects in other parts of AOL’s sprawling business are not so egregious as to put sudden clamps on spending they need to make their product. Ken Lerer, Arianna Huffington and a few other people just got quite rich. (Well, quite a lot richer.) But in exchange, the millstone of AOL is now hanging round their necks.\n\nI’m not a banker, so I’ll leave it to smarter people than I to judge the prudence of this deal. It does seem like a very high multiple to pay $315 million for a company with $10 million in profits on $50 million in revenue. But one such smarter person, the aforementioned Kafka, is worth reading on why this makes sense for AOL. His take on why it makes sense for the Huffington Post, though, is short enough to be excerpted here:\n\nHuffPo’s “pro” list is much shorter, but only because there’s not much to think about for them: Huffington, co-founder Kenneth Lerer and their backers get a nice return on the five years and $37 million they put into the company. And those who stay on get to leverage the benefits of a much larger acquirer–access to more eyballs and more advertisers. Easy enough to understand.\n\nArianna Huffington has said it’s like stepping off a fast-moving train onto a supersonic jet. That’s fine and well, as long as the jet isn’t heading into a mountain.\n\nOver at NewsBeast (itself a bit of a pioneer in S.E.O.-forwardness), Dan Lyons dumps all over the deal, extending the metaphor to call it “a slow-motion train wreck.”\n\nMost of what he says is expected, from an old-journalism hardliner: True (Most of the content on Huffington Post is actually pretty terrible! So is most of the content on AOL!) but beside the point, because Lyons is not a guy who thinks about whether quality matters from a business point of view. For that he quotes Nick Denton, whose Gawker Media is now the largest independent blogging empire: “AOL has gathered so many of our rivals—Huffington Post, Engadget, Techcrunch—in one place. The question: Is this a fearsome Internet conglomerate or simply a roach motel for once lively websites?”\n\nDenton is in it to win, as a business. When he talks about quality, he’s not taking a hard line on journalistic values. (It’s not his style, anyway.) Denton does not underestimate the value of quality in the long-run. Today’s redesign of the Gawker sites is proof enough of that.",
      "Folder": "Archive",
      "Timestamp": "1298226586",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:27:00.097388Z"
}