{
  "id": "39e04fd77bea4727b23cd731a5ca138b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://work.qz.com/1201856/the-ux-of-why-people-hate-their-new-job-after-three-months/",
      "Title": "The UX explanation for why you hate your new job after three months Quartz",
      "Selection": "My first-day advice to new members of the team boils down to, “Don’t worry, you are going to be totally miserable in about three months.”\n\nWe all know the excitement of that first day at work. There are new people to meet, new projects to learn, and new roles and responsibilities to master. Part of the intoxication of those early weeks is they are often the only time in our adult lives we are allowed to ask stupid questions and not have to pretend to know everything.\n\nAnd despite that opportunity, our learning plan is often simply, “Give me a few weeks to get up to speed and I will own the place.” That approach boosts our short-term confidence but also sets unrealistic expectations for our ability to quickly understand and master the complexity of the organization and its needs.\n\nIn user experience design (UX) research, we think a lot about mental models — how a user believes a process works vs. the system model of how it was actually designed; and framing — the context in which an interaction is interpreted. In essence, your satisfaction within an experience can depend a lot on your initial expectations.\n\nFor new employees, the expectation we need to set is that while the initial learning curve is steep, the on-boarding process actually never ends nor does it move in a predictably straight line.\n\nI describe it like this:\n\nThe first month is like sitting in a waiting-room. There are lots of doors with people passing through, plenty to read, and free coffee if you can figure out how to operate the machine.\n\nAnd while reading and caffeinating is great, you will soon be excited to pick a door, enter a side room, and get down to work. This is a most glorious time. You will start to feel productive, in control, valued and effective.\n\nThen one afternoon, maybe three months later, you will inevitably walk up to another door. Behind it lie some unpleasant new realities. Maybe your first big project missed a deadline and you feel responsible. Or your boss has grown distant since those early days of interviewing, training and goal setting. Or your commute is worse than you thought. Whatever the cause, the honeymoon is over and some early doubts creep in.\n\nDeciding how to open this door is key. Because everyone experiences it. And after months of gaining competence and confidence, you are going to feel a bit miserable realizing you don’t know nearly as much as you thought. How could you have been so mistaken? So self-deluded? So in the wrong career? It can feel like an actual crisis in the moment.\n\nFortunately, at this point most of us actively re-invest in the job. With effort, the organization reveals new puzzle pieces (system model) and we improve our understanding (mental model) of how to navigate the challenges. We open the door, discover new skills and grow more confident and productive than we had before.\n\nBut here is the trick: This cycle repeats itself endlessly. Maybe first at three months, then 18 months, then four years. Each time the door seems heavier and the crisis more dire. Each time you will feel miserable and each time you will wonder if you should go update your LinkedIn profile.\n\nWe can’t avoid the doors and we can’t avoid some amount of psychic pain and misery each time. But learning to recognize the pattern is transformative. It can turn a month’s worth of anxious lunch hours lost to checking monster.com into a few days of introspection followed by a fulfilling action plan.\n\nThe challenge is, people often think their crisis of confidence in these situations is a personal failing. That their impostor syndrome is showing. That they have picked the wrong job or career. This is almost never true. So how do we avoid people falling for that conceit?\n\nTell them well in advance you know they will find some doors too heavy to open alone. “Don’t worry, you are going to be totally miserable in about three months. But it won’t last — if you see it coming.”\n\nTell them how you think it might happen and when. Set the expectation so they can recognize the pattern. And then give them a hand when they do. In this case, knowing is half the battle.\n\nThis article was originally published on KIESOW 8.0.\n",
      "Folder": "Feedly",
      "Timestamp": "1518158139",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.495914Z"
}