{
  "id": "3a5c112d165244969afb7409f181b98b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2020/4/9/21210353/coronavirus-health-insurance-biden-sanders-medicare-for-all",
      "Title": "It’s time to move past employer-based health insurance Vox - All",
      "Selection": "Joe Biden holds a virtual campaign event on March 13, in Chicago, Illinois. The scheduled in-person campaign event was canceled due to Covid-19. | Scott Olson/Getty Images\n\nThe coronavirus shows tying health insurance to jobs is a disaster. Let’s fix it. \n\nAccording to a new analysis by the consulting firm Health Management Associates (HMA), the Covid-19 crisis could lead to between 12 million and 35 million people losing employer-sponsored health coverage due to job losses.\n\nNot all of them will tumble into the ranks of the uninsured. Some will be caught by Medicaid, by Obamacare, or by other safety net programs. Some will find new jobs, with new insurance. But millions will fall through the cracks, particularly in states that have refused to expand Medicaid. In a scenario where unemployment hits 25 percent — calamitous, but plausible — HMA forecasts that as many as 11 million people could find themselves uninsured. That wipes out about half of Obamacare’s coverage gains, practically overnight.\n\n Health Management Associates\n\nHere, as elsewhere, Covid-19 is worsening a policy problem that long predates the virus. Tying health insurance to employment is now, and always has been, a disaster. It gives bosses too much power over workers, reduces entrepreneurship, saddles businesses with health costs they can’t control and insurance problems they don’t understand, makes the tax structure more regressive, reduces wages, bloats administrative spending, and drives up costs throughout the system.\n\nIt has also, as Paul Starr writes in Remedy and Reaction: The Peculiar American Struggle Over Health Care Reform, created a “policy trap” that has stymied health reformers over and over again: About 160 million Americans get insurance through their employers, and for all the system’s flaws, they are mostly pretty happy with that insurance, which makes them resistant to disruptive change.\n\nBut disruptive change is here, whether anyone wants it or not. It won’t just be felt in the rising ranks of the uninsured, in the millions of people who lose the insurance provided by their workplace and have to scramble, desperately, for an alternative. It will also be felt by those who keep their job-based insurance, only to see it degrade as their employer rushes to cut costs.\n\nAccording to the Kaiser Family Foundation, average premiums for employer-based insurance have risen 54 percent over the past decade — far outpacing wages or inflation. Cost-sharing has increased, too: Average annual deductibles have doubled in the past decade. Employers have been shunting health costs onto employees in both good times and bad, and these are the worst times. Many of those who keep their employer-based insurance will see their premiums and deductibles rise, their networks narrow.\n\n Kaiser Family Foundation\n\nThis is a crisis. But it is also, perhaps, an opportunity to solve the policy trap and finally move beyond employer-based insurance.\n\nThe two poles of the Democratic health care debate\n\nThe Democratic primary was defined by the debate over Bernie Sanders’s Medicare-for-all plan, which, in its expansive and uncompromising ambition, rolled a number of health reform debates into one. But one of its best features, substantively, was that it ended employer-based insurance forever.\n\nThe problem is that canceling 160 million insurance plans is likely to be a political catastrophe. When polled, it routinely turned people against Medicare-for-all. Most members of Congress — including some co-sponsors of Sanders’s bill — blanched at that level of disruption. House Speaker Nancy Pelosi dismissed it, as did the Senate Democrats who will lead the next health care push. The logic was straightforward: If the problem you’re trying to solve is that people hate losing the insurance their employer gives them, forcibly taking it away from them isn’t likely to go over well.\n\nMoreover, the tax increases necessary to move the entirety of the employer-based system onto the federal budget would be eye-popping. That’s what killed the statewide single-payer push in Sanders’s home state of Vermont, and Sanders never said how he’d solve it nationally.\n\nBut if the political weakness of Sanders’s plan is that it upends too much of the current system, the substantive weakness of Biden’s plan is that it does too little to transform the current system.\n\nBiden’s plan leaves the current system more or less intact, but adds a subsidized, Medicare-based public option available to individuals and small businesses. Under the Biden proposal, the employer-based system remains, but if you lose your job, or simply don’t like or can’t afford the insurance offered by your employer, you have another option. The plan would also serve low-income Americans in states that refused to expand Medicaid, giving them an option they desperately need.\n\nBut the Biden team made a series of policy choices to limit the impact their public plan would have on employer-based health insurance. Large employers are not allowed to buy into the new public option. Individuals can’t use the money their employer is spending on private health insurance to buy into the public option. What they’ve built isn’t a glide path to Medicare-for-all, or even to a new hybrid system. Instead, they’ve created a backstop to reinforce the current system, with all its flaws. And over the next year, the coronavirus is going to make those flaws gruesomely apparent.\n\n BernieSanders.com via Getty Images\n\nSen. Bernie Sanders announces the suspension of his presidential campaign on April 8.\n\n John J. Kim/Chicago Tribune via Getty Images\n\nJoe Biden campaigns in Flint, Michigan, on March 9.\n\nThe Biden team’s fear is that opening the public option to all employers would destabilize the employer-based system — companies with sicker, older workforces would rush into the public system, driving up its costs, or perhaps they would nudge their older, sicker employees to enter into it so they could offload their spending onto taxpayers. These concerns are reasonable, but they’re also manageable. Whether you choose to solve them reflects whether you think the American health care system is fundamentally broken or just needs to be patched up.\n\nBiden’s plan would require far less in new taxes than Sanders’s plan — the Committee for a Responsible Federal Budget estimated the 10-year cost of Biden’s proposal at $2.25 trillion while Sanders’s bill clocked in at $30.6 trillion — but even pre-coronavirus, CRFB estimated that it would still leave 10 million to 15 million people uninsured. Post-coronavirus, it will leave millions more uninsured, and it will have little to offer those who keep their employer-based plan but find themselves paying more and more for less and less.\n\nWith Sanders’s exit from the race, Biden is a lock to win the Democratic nomination. But his win will leave many progressives disappointed. Biden needs a way to reach out to them. A good place to start would be a better health care plan — one that’s truly universal and that ends employer control over health insurance.\n\nI think the disunity might be driven by real cleavages such as the fact that millions of people are currently getting kicked off their private health insurance in the middle of a public health crisis and Joe Biden stubbornly opposes a policy to untether insurance from employment\n\n— Meagan Day (@meaganmday) April 8, 2020\n\nBiden isn’t going to embrace Sanders’s Medicare-for-all plan. But he can do better than his current health care proposal, and he should. I can even suggest a place for him to start.\n\nMedicare Extra is the middle ground Democrats need\n\nBack in July, the Center for American Progress released its “Medicare Extra” proposal. As I wrote at the time, the plan was, and is, an intriguing synthesis of left and moderate ideas on health reform. It’s universal, it uses Medicare’s pricing power to hold down costs, it rebuilds the health system around public insurance — and it gives everyone, everywhere, a true choice between public and private options, no matter what their employer is offering. In all those ways, it goes much further than Bidencare.\n\nAt the same time, Medicare Extra retains private insurance options, allows employers to continue offering insurance to employees if they think they can provide something better than the public option, and it holds the total price tag to somewhere in the $2.8 trillion to $4.5 trillion range. Which is to say, it’s not nearly as disruptive as Sanders’s Medicare-for-all bill, and it only requires about a tenth of the tax increases.\n\nHere’s how it works:\n\nMedicare Extra builds a new public insurance program called, well, Medicare Extra. The new plan shares Medicare’s name, but its benefits are much more expansive: It includes, for instance, vision, dental, and reproductive health coverage.\n\nEveryone in the system, from individuals getting insurance from their employer to traditional Medicare enrollees, could choose to purchase Medicare Extra instead, and they’d be eligible for normal subsidies and employer cash-outs if they did so. So unlike in Biden’s plan, employers could buy Medicare Extra for their employees, and even if they didn’t, employees could take the money their employer is spending on private insurance and use it to buy Medicare Extra.\n\nPremiums are on a sliding scale, with Americans under 150 percent of the poverty line paying nothing and those making 500 percent of the poverty line or more seeing their total contribution capped at 9 percent of income. Cost-sharing, too, varies by income, with total out-of-pocket spending, even for the richest, capped at $5,000.\n\nNewborns would automatically be enrolled in Medicare Extra, as would the uninsured and every legal resident upon turning 65. Medicaid and Obamacare would be folded into the new program, and anyone on traditional Medicare, Medicare Advantage, Tricare, Veterans Affairs coverage, the Federal Employee Health Benefits Program, the Indian Health Service, or employer-sponsored coverage could opt in.\n\nThe plan saves money by expanding Medicare’s pricing power throughout the system — including to employer-provided private insurance. It’s the first of the major Democratic proposals to rely on a version of all-payer rate setting.\n\nThere are plenty of details and decisions in this plan worth debating. But something like Medicare Extra offers a middle ground that this moment demands. It eases the disruption of reform without reinforcing the dysfunctions of the status quo; it makes employer-provided health insurance one option people can freely choose, if they prefer it, rather than making it the only option most people have; and it creates a system that, while not single-payer, is far more integrated than anything we have now: a public system with private options, rather than a private system with fractured public options.\n\nSo far, Biden has done a good job releasing plans and making statements about how he would manage the coronavirus crisis. What he hasn’t done is reveal a vision for rebuilding in its aftermath. He’s offering a candidacy to feel relieved about, rather than inspired by. But coronavirus, and the damage it will unleash on an already broken health care system, demands more than that.\n\nFinding a synthesis in the health reform debate, one that respects the moderate’s fear of disruption, the leftist critique of the status quo, and the post-coronavirus reality that now surrounds us, would be a good place to start.\n\nSupport Vox’s explanatory journalism\n\nEvery day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires. Please consider making a contribution to Vox today.\n",
      "Folder": "Feedly",
      "Timestamp": "1586486551",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.332639Z"
}