{
  "id": "3bb12113cc104f4d826c7526a7744e43",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theatlantic.com/business/archive/2017/11/future-retail/546119/",
      "Title": "The 4 Reasons Why 2017 Is a Tipping Point for Retail The Atlantic - Business",
      "Selection": "When Warby Parker was founded in 2010, the pitch was simple: Don’t buy expensive designer eyeglasses in stores; buy cheaper ones on the internet.\n\nIt was a good pitch. It was also a financial necessity: The founders had no outside capital and it was far cheaper to build a national brand online than to open a dozen storefronts in malls across the country with debt. But as Warby Parker grew to become a darling of online retail, the founders had a funny idea. Maybe they should undisrupt the brick-and-mortar industry by opening a store or two.\n\nWithin a year, there were eight Warby Parker brick-and-mortar locations nationwide. They weren’t just turning a profit. They were averaging $3,000 a square foot annually, higher than Tiffany, Ralph Lauren, and practically every company not named Apple. By the end of this year, the company will have about 80 storefronts.\n\nSo, is Warby Parker still an “online retailer”? Obviously, no: More than half of its sales now occur in physical stores. But also, yes: As founder Dave Gilboa told PBS, “about 75 percent of our customers that shop in our stores have been to our website first.”\n\nWarby Parker’s success is extraordinary. But this story is becoming quite ordinary, indeed. Online shopping is having an offline moment, as more e-commerce companies, such as RentTheRunway and Bonobos, invest in the very sort of physical stores they once made seem obsolete. Leading the trend is Amazon, the undisputed king of online shopping, which spent $14 billion to buy Whole Foods and its nearly 500 physical locations. According to internal documents, the company believes there is support for another 2,000 Amazon Fresh–branded grocery stores.\n\nThis throwback revolution is happening in the midst of what otherwise feels like a “retail apocalypse.” Bankruptcies are rising among clothing chains, like Wet Seal, and retail icons, like Toys “R” Us, which are stuck with a glut of shopping space and squeezed between stagnating sales and large debt obligations. The labor market in retail, once the powerhouse of the service economy, is having its worst year of the century.\n\nIn short, the retail industry is at an inflection point, where several brick-and-mortar companies with large footprints are struggling while e-commerce companies that once launched pop-ups as mere marketing tools have realized the value of storefronts. Indeed, Amazon sees an uptick in online shopping in regions where it’s opened a physical store, according to CNBC. “Five years from now, we won’t be debating whether ‘e-tailers’ are taking share from ‘brick & mortar retailers,’” Citi Research analysts recently wrote, “because they are all the same.” The trend even comes with an inevitable, and regrettable, catchphrase: “bricks and clicks.”\n\nThese trends are well known among retail analysts and writers. Less considered is how this inflection point in retail will affect the national economy, regional inequality, and the labor force more broadly. As department stores close in malls with lower sales-per-square foot—so-called Class C and D malls—regional shopping centers may shut down, turning once vibrant areas into urban blights. As richer urban and suburban stores revamp to appear more like showrooms, the role of the cashier—the second-most-common job in America—may be outsourced to websites. Here are four implications of this shift.\n\n1. The new youth shopping slogan: “Let’s go to the mall to buy stuff online.”\n\nLast year may have been the peak for the sheer amount of mall space in America, according to Cowen and Company, an investment bank. J.C. Penney, Macy’s, and Sears, which often “anchor” malls as the largest leasers, have each announced more than 100 store closures this year.\n\nAs mall landlords lose their legacy anchors, they are plugging vacancies with restaurants, fitness centers, and new storefronts for formerly “online” retailers. According to Sandeep Mathrani, the CEO of the mall operator GGP, the ideal modern mall isn’t built around one department store, but rather a supermarket, a Tesla store, and businesses that started out online, such as Warby Parker.\n\nAmong the nation’s top 300 malls, brick-and-mortar space occupied by retailers that started online has grown by approximately 1,000 percent since 2012, according to the real-estate data company CoStar Group. While they currently account for a minuscule part of mall volume, landlords increasingly consider them critical to attracting Millennials to these malls in the first place.\n\nAt Century City, an open-air mall in Los Angeles with a new billion-dollar makeover, tenants include Bonobos, the apparel store recently bought by Walmart, Untuckit, which was founded selling casual men’s shirts, Warby Parker, and Amazon Books.* Some of these stores, like Bonobos, don’t have inventory that shoppers can buy and take out of the store. Instead, shoppers place orders that are filled at fulfillment center and shipped to their doorstep. It may be increasingly common to leave a mall having spent a couple hundred dollars without one bag to take to the car.\n\nCentury City is in West Los Angeles, one of the richest and most retail-friendly zip codes in the country. Not every mall is so lucky …\n\n2. The brick-to-clicks transformation will accentuate retail’s regional inequality problem.\n\nOnline stores like Warby Parker and Bonobos prefer to open stores in their most profitable zip codes. Amazon’s purchase of Whole Foods gives the company a footprint in rich downtown areas and high-income suburbs.Today’s new retailers “need fewer stores, but in good locations, as those stores become that much more important to distribution,” according to Citi Research.\n\nMeanwhile, suburban malls in lower-income areas are truly struggling. Cowen and Company projects that up to 400 malls may close in the coming years, and they will be almost all Class C and D malls. Department store closings are already concentrated in the low-income suburbs of Kentucky, Ohio, and Pennsylvania. When an anchor store like J.C. Penney closes, it triggers a downward spiral, where fewer shoppers means less foot traffic for adjacent retailers. That’s why many stores have clauses in their contracts that allow them to leave a mall if an anchor disappears. (Some high-income areas have a related problem: The many “available for lease” signs plastered around SoHo, New York City, may suggest a gap between the demands of new retailers looking for flexible short-term space and the real-estate owners holding out for longer-term leases.)\n\nA dead mall is more than just a hollowed-out commercial space. In many suburbs, malls are critical to the local economy and the community. Their death hurts jobs and local tax revenues. It’s possible that some of these defunct mall spaces may be reclaimed as fulfillment centers for e-commerce. Indeed, some of Amazon's largest fulfillment centers are in places like Kenosha, Wisconsin, and Ruskin, Florida.\n\nBut the “retail” workers there will do very different jobs …\n\n3. The fall of the cashier, the rise of the box filler.\n\nThe cashier is one of the most common jobs in America, with more than 3.5 million workers in the U.S. As more high-end shopping takes place in showrooms where shoppers can place online orders, there will be less need for cashiers. The Bureau of Labor Statistics expects the total number to decline over the next 10 years.\n\nThe cashier job was buoyed by the last evolutionary stage of retail, the rise of the big-box store. These superstores, like Walmart, were a boon for low prices and all low pay. Retail productivity doubled between 1987 to 2007, but average real wages for retail workers declined during this time. E-commerce, however, makes shopping even more productive, mostly by replacing the vast majority of consumer “work.”\n\n“Americans spend 1.2 billion hours each week driving to the mall, finding a parking space, wandering around the aisles, checking out, and driving home,” the economist Michael Mandel writes. All of that unpaid activity is being turned into paid work in fulfillment centers. These warehouses, where online orders are filled and shipped, have added more than 400,000 jobs in the last decade. Some of Amazon’s largest fulfillment centers have more than 2,000 permanent employees with up to 1,000 seasonal workers.\n\nFrom a wage perspective, this may be a positive shift. Mandel’s research estimates that fulfillment centers pay 30 percent more than cashiers for work that still only requires a high-school degree. But companies like Amazon are spending billions of dollars on automation technology in fulfillment centers that may limit the growth of these jobs in the next decade.\n\n4) Self-driving cars are going to change everything, all over again.\n\nSelf-driving cars are a futurist’s paradox. They are universally predicted by both software companies and auto manufacturers; and yet, the way they will be integrated into our lives and streets remains unpredictable.\n\nBut one potentially exciting (or concerning) vision is that retail companies will see an autonomous vehicle as the ultimate commercial real estate. Why drive to a pop-up store, they will say, when the pop-up store can drive to you? The proliferation of self-driving cars would be of obvious use to companies like Walmart and Amazon, who need cheap ways to move products to people’s doorsteps. But they may prove to be helpful to both the Goliaths and the Davids of commerce. Retail start-ups of the self-driving age may start with an autonomous truck full of boutique merchandise that makes scheduled stops in highly trafficked areas but leaves “bookable time” for shoppers to order the merch to their front door.\n\nLeft unregulated, self-driving delivery trucks and autonomous retailers could further empty urban and suburban malls, flood the streets, and cause traffic mayhem for noncommercial drivers—that is, ordinary people. It’s impossible to know exactly how city regulations and autonomous technology will conspire to change e-commerce. But one can imagine how, in several decades, today’s online shopping companies, having changed shopping forever, will eventually find themselves to be the nation’s legacy retailers, struggling to adopt to the era’s new disruptive technology.\n\n*This article originally described the Century City mall as newly opened. It is newly renovated. We regret the error.\n",
      "Folder": "Feedly",
      "Timestamp": "1510881848",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.526224Z"
}