{
  "id": "3bda747ec27c450c91a91409a474e72a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1070110/the-friends-you-make-in-the-first-year-of-college-can-impact-how-well-you-do/",
      "Title": "The friends you make in the first year of college can impact how well you do Quartz",
      "Selection": "College freshmen turn to empathic people during stressful times, research shows.\n\n“The transition to college can be tumultuous,” says Jamil Zaki, an assistant professor of psychology at Stanford University and coauthor of the study. “Whom you end up making friendships with can play a significant role in how you’ll deal with the stress and hardship of freshman year.”\n\nA 2008 poll conducted by the Associated Press and mtvU found that 40% of college students said they felt stress regularly—and almost one in five seriously considered dropping out of school.\n\nWith those high stress levels in mind, the researchers, including Stanford economics professor Matthew Jackson and former Stanford doctoral candidate Desmond Ong, put nearly 200 Stanford freshmen—who had recently moved into first-year dorms—through a battery of personality tests and questionnaires. Students also answered questions related to social networks within their dorms, for example, “Who usually makes you feel positive?” or “Who do you turn to when something bad happens?”\n\nTheir goal was to determine which students occupied central roles in these different networks—notably groups based on trust, fun, and excitement. The researchers found that individuals were more particular about whom they included in their trust networks compared to groups related to fun and excitement. In those selective trust networks, freshmen were more likely to include highly empathic students.\n\nIn contrast, when students wanted to feel positive and have fun, they were more likely to seek out dorm mates high in happiness. This suggests that students’ personalities are related to the different roles that they play in supporting their communities.\n\n“What we find here is not only that people’s networks of fun-based friendships are denser than their more trust- and stress-based networks,” Jackson says, “but also that more central people in a network have personalities that match the purpose of that network in intuitive ways. ”\n\nJust as you need the right outfit for a particular occasion, college freshmen need certain friends for certain situations.\n\nWhen you need a dose of fun, engaging with a positive and happy friend can lift your mood. But that friend may not be the best person to go to when you need someone to confide in. An empathic friend, on the other hand, may be just the right person for helping you through difficult and challenging times.\n\n“Empathic individuals were more likely to help their dorm mates and provide support during difficult times,” says Sylvia Morelli, an assistant professor of psychology at the University of Illinois at Chicago and lead author of the study. “These freshmen became magnets for close relationships in their new dorms.”\n\n“Empathic people are the ears and shoulders of these communities,” Zaki says.\n\nThis research shows that people know the difference between these two types of individuals. They spend time with individuals high in positive emotion, but target empathic individuals when they are stressed.\n\n“The study offers an opportunity for college students to examine their own relationships,” says Morelli, a former postdoctoral fellow in Stanford’s Social Neuroscience Lab, “especially against the landscape of social media where they can have seemingly countless ‘friends’ across the country and the world. Our work suggests that people will turn to only a small handful of these friends when things get stressful, and that they will trust their friends who show empathy and concern.”\n\nAn additional coauthor of the study is Rucha Makati of the University of Illinois at Chicago. The National Institute of Mental Health, the National Science Foundation, and an A*STAR National Science Scholarship supported the work.\n\nThis article was originally published in Futurity. Edits have been made to this republication. It has been republished under the Attribution 4.0 International license.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1505998678",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.629248Z"
}