{
  "id": "3be97bca7033483286de6ad1eaaadd95",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2018/01/2017-safest-year-in-air-travel/",
      "Title": "2017 Was the Safest Year on Record For Commercial Air Travel The Points Guy",
      "Selection": "Billions of passengers took to the skies on commercial flights in 2017, and almost every one of them made it safely to their destination. According to Dutch aviation consultants from To70, 2017 was the safest year on record for commercial aviation worldwide.\n\nTo70 searched through the records of commercial flights worldwide for all aircraft with a takeoff weight of more than 5,700 kilograms (12,566 pounds), which is less than a third of the weight of the smallest Embraer ERJ used in regional operations by US airlines. The group found just 111 accidents in 2017, with only two of those leading to a loss of life:\n\nAn Embraer Brasilia lost control in flight in Angola after reportedly suffering an engine failure.\n\nA Czech-built Let 410 crashed on landing at Nelken in Russia.\n\nThe total loss of life across those two fatal accidents: 13 people.\n\nThis exceptionally low number of fatal accidents calculates to 0.06 fatal accidents per million flights in 2017. Put another way, the chance of a commercial flight being involved in a fatal accident during 2017 was 1 in approximately 17 million.\n\nThat’s not to say that there weren’t some concerning air travel incidents in 2017:\n\nClose calls: In February, actor Harrison Ford almost landed a plane on top of an American Airlines aircraft while landing on a taxiway, and a United flight had to make evasive maneuvers to avoid hitting a small aircraft. But, the most noteworthy near miss was certainly the Air Canada flight that almost landed on top of a line of large aircraft on a San Francisco (SFO) taxiway.\n\nUncontained engine failures: In September, an Air France A380 spectacularly blew an engine over the Atlantic, but the crew was able to land the aircraft safely. Earlier that same month, TPG‘s Emily McNutt was on a Japan Airlines flight that blew an engine.\n\nToo low: In a near crash of an A380, an Emirates superjumbo dropped to just 400 feet off of the ground eight miles downrange of Moscow’s Domodedovo airport (DME). And in a concerning trend, another Emirates A380 dropped below 500 feet during a turn on approach to JFK before pulling up.\n\nExtreme turbulence: An Aeroflot flight left passengers and crew severely injured near Bangkok (BKK), while 10 American Airlines passengers were taken to the hospital after an extreme turbulence event near Philadelphia (PHL). And 11 EVA Air passengers and crew ended up in a Chicago hospital after an incident off of Japan.\n\nAlso, plenty of planes hit objects in the air — if history has held true, 1 in 2,000 flights incurred a bird strike, including this noteworthy birdstrike in Miami. A Virgin Australia flight had the remarkable experience of striking both a bird and a rabbit in the air. And there was whatever damaged the nosecone of the Delta charter flight carrying the Oklahoma City Thunder — a bird strike, strike by another object or a structural failing of the nose cone.\n\nThen there were the on-ground issues. In May, a massive IT outage cancelled over 700 British Airways flights, affecting over 75,000 travelers. During the fall, floods and hurricanes cancelled thousands of flights and even led to the complete evacuation of aircraft from Florida. And just a couple of weeks ago, a power outage in Atlanta crippled flights out of Delta’s key hub.\n\nSo, while air travel wasn’t always smooth during 2017, it was still remarkably safe. For the eighth year in a row, there wasn’t a single death from an accident on a US flagged commercial flight. And one of the worst injuries on a US-based aircraft was dealt by Chicago airport security in response to an overbooked United flight. In the Americas, there were more deaths from jet blast than commercial aviation accidents.\n\nH/T: Independent\n",
      "Folder": "Feedly",
      "Timestamp": "1514898362",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.557662Z"
}