{
  "id": "3c18c522e3cd4fd29c9f19cb56cf4a95",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2020/1/16/20991816/impeachment-trial-trump-bannon-misinformation",
      "Title": "“Flood the zone with shit” How misinformation overwhelmed our democracy Vox - All",
      "Selection": "Steve Bannon in Rome, Italy, on March 25, 2019. In an earlier interview with the journalist Michael Lewis, Bannon said, “The Democrats don’t matter, The real opposition is the media. And the way to deal with them is to flood the zone with shit.” | Alessandra Benedetti/Corbis/Getty Images\n\nThe impeachment trial probably won’t change any minds. Here’s why.\n\nNo matter how President Trump’s impeachment trial plays out in the Senate, one thing is certain: Despite the incontrovertible facts at the center of the story, the process will change very few minds.\n\nRegardless of how clear a case Democrats make, it seems likely that a majority of voters will remain confused and unsure about the details of Trump’s transgressions. No single version of the truth will be accepted.\n\nThis is a serious problem for our democratic culture. No amount of evidence, on virtually any topic, is likely to move public opinion one way or the other. We can attribute some of this to rank partisanship — some people simply refuse to acknowledge inconvenient facts about their own side.\n\nBut there’s another, equally vexing problem. We live in a media ecosystem that overwhelms people with information. Some of that information is accurate, some of it is bogus, and much of it is intentionally misleading. The result is a polity that has increasingly given up on finding out the truth. As Sabrina Tavernise and Aidan Gardiner put it in a New York Times piece, “people are numb and disoriented, struggling to discern what is real in a sea of slant, fake, and fact.” This is partly why an earth-shattering historical event like a president’s impeachment has done very little to move public opinion.\n\nThe core challenge we’re facing today is information saturation and a hackable media system. If you follow politics at all, you know how exhausting the environment is. The sheer volume of content, the dizzying number of narratives and counternarratives, and the pace of the news cycle are too much for anyone to process.\n\nOne response to this situation is to walk away and tune everything out. After all, it takes real effort to comb through the bullshit, and most people have busy lives and limited bandwidth. Another reaction is to retreat into tribal allegiances. There’s Team Liberal and Team Conservative, and pretty much everyone knows which side they’re on. So you stick to the places that feed you the information you most want to hear.\n\n Robert Alexander/Getty Images\n\nHouse Speaker Nancy Pelosi reading totals of a vote approving articles of impeachment.\n\nMy Vox colleague Dave Roberts calls this an “epistemic crisis.” The foundation for shared truth, he argues, has collapsed. I don’t disagree with that, but I’d frame the problem a little differently.\n\nWe’re in an age of manufactured nihilism.\n\nThe issue for many people isn’t exactly a denial of truth as such. It’s more a growing weariness over the process of finding the truth at all. And that weariness leads more and more people to abandon the idea that the truth is knowable.\n\nI call this “manufactured” because it’s the consequence of a deliberate strategy. It was distilled almost perfectly by Steve Bannon, the former head of Breitbart News and chief strategist for Donald Trump. “The Democrats don’t matter,” Bannon reportedly said in 2018. “The real opposition is the media. And the way to deal with them is to flood the zone with shit.”\n\nThis idea isn’t new, but Bannon articulated it about as well as anyone can. The press ideally should sift fact from fiction and give the public the information it needs to make enlightened political choices. If you short-circuit that process by saturating the ecosystem with misinformation and overwhelm the media’s ability to mediate, then you can disrupt the democratic process.\n\nWhat we’re facing is a new form of propaganda that wasn’t really possible until the digital age. And it works not by creating a consensus around any particular narrative but by muddying the waters so that consensus isn’t achievable.\n\nBannon’s political objective is clear. As he explained in a 2017 Conservative Political Action Conference talk, he sees Trump as a stick of dynamite with which to blow up the status quo. So “flooding the zone” is a means to that end. But more generally, creating widespread cynicism about the truth and the institutions charged with unearthing it erodes the very foundation of liberal democracy. And the strategy is working.\n\nWhat flooding the zone actually means\n\nFor most of recent history, the goal of propaganda was to reinforce a consistent narrative. But zone-flooding takes a different approach: It seeks to disorient audiences with an avalanche of competing stories.\n\nAnd it produces a certain nihilism in which people are so skeptical about the possibility of finding the truth that they give up the search. The fact that 60 percent of Americans say they encounter conflicting reports about the same event is an example of what I mean. In the face of such confusion, it’s not surprising that less than half the country trusts what they read in the press.\n\nBannon articulated the zone-flooding philosophy well, but he did not invent it. In our time, it was pioneered by Vladimir Putin in post-Soviet Russia. Putin uses the media to engineer a fog of disinformation, producing just enough distrust to ensure that the public can never mobilize around a coherent narrative.\n\n Mikhail Svetlov/Getty Images\n\nRussian President Vladimir Putin appears onscreen during a press conference in Moscow on December 19, 2019.\n\nIn October, I spoke to Peter Pomerantsev, a Soviet-born reality TV producer turned academic who wrote a book about Putin’s propaganda strategy. The goal, he told me, wasn’t to sell an ideology or a vision of the future; instead, it was to convince people that “the truth is unknowable” and that the only sensible choice is “to follow a strong leader.”\n\nOne major reason for the strategy’s success, both in the US and Russia, is that it coincided with a moment when the technological and political conditions were in place for it to thrive. Media fragmentation, the explosion of the internet, political polarization, curated timelines, and echo chambers — all of this allows a “flood the zone with shit” strategy to work.\n\nThe role of “gatekeeping” institutions has also changed significantly. Before the internet and social media, most people got their news from a handful of newspapers and TV networks. These institutions functioned like referees, calling out lies, fact-checking claims, and so on. And they had the ability to control the flow of information and set the terms of the conversation.\n\nToday, gatekeepers still matter in terms of setting a baseline for political knowledge, but there’s much more competition for clicks and audiences, and that alters the incentives for what’s declared newsworthy in the first place. At the same time, traditional media outlets remain committed to a set of norms that are ill adapted to the modern environment. The preference for objectivity in political coverage, in particular, is a problem.\n\nAs Joshua Green, who wrote a biography of Bannon, explained, Bannon’s lesson from the Clinton impeachment in the 1990s was that to shape the narrative, a story had to move beyond the right-wing echo chamber and into the mainstream media. That’s exactly what happened with the now-debunked Uranium One story that dogged Clinton from the beginning of her campaign — a story Bannon fed to the Times, knowing that the supposedly liberal paper would run with it because that’s what mainstream media news organizations do.\n\nIn this case, Bannon flooded the zone with a ridiculous story not necessarily to persuade the public that it was true (although surely plenty of people bought into it) but to create a cloud of corruption around Clinton. And the mainstream press, merely by reporting a story the way it always has, helped create that cloud.\n\nYou see this dynamic at work daily on cable news. Trump White House adviser Kellyanne Conway lies. She lies a lot. Yet CNN and MSNBC have shown zero hesitation in giving her a platform to lie because they see their job as giving government officials — even ones who lie — a platform.\n\nEven if CNN or MSNBC debunk Conway’s lies, the damage will be done. Fox and right-wing media will amplify her and other falsehoods; armies on social media, bot and real, will, too (@realDonaldTrump will no doubt chime in). The mainstream press will be a step behind in debunking — and even the act of debunking will serve to amplify the lies.\n\nUC Berkeley linguist George Lakoff calls this the “framing effect.” As Lakoff puts it, if you say “don’t think of an elephant,” you can’t help but think of an elephant. In other words, even if you reject an argument, merely repeating it cements the frame in people’s minds. Debunking it is still useful, of course, but there’s a cost to dignifying it in the first place.\n\nThere is some research that points to the utility of fact-checking. Political scientists Brendan Nyhan and Jason Reifler have shown that repeated exposure to fact-checking does tend to increase the accuracy of beliefs. But the issue with zone-flooding is an overabundance of news, which diminishes the importance of any individual story, no matter how big or damning.\n\nIn this environment, there are often too many things happening at once; it’s a constant game of whack-a-mole for journalists. And we know that false claims, if they’re repeated enough, become more plausible the more often they’re shared, something psychologists have called the “illusory truth” effect. Our brains, it turns out, tend to associate repetition with truthfulness. Some interesting new research, moreover, found that the more people encounter information the more likely they are to feel justified in spreading it, whether it’s true or not.\n\nFlooding the zone, polarization, and why many people still don’t know what Trump did\n\nThis all intersects with political polarization in troubling ways. One consequence of pervasive confusion about what’s happening is that people feel more comfortable siding with their political tribe. If everything’s up for grabs, and it’s hard to sift through the competing narratives to find the truth, then there’s nothing left but culture war politics. There’s “us” and “them,” and the possibility of persuasion is off the table.\n\nIt’s worth noting that this polarization is asymmetric. The left overwhelmingly receives its news from organizations like the New York Times, the Washington Post, or cable news networks like MSNBC or CNN. Some of the reporting is surely biased, and probably biased in favor of liberals, but it’s still (mostly) anchored to basic journalistic ethics.\n\nAs a recent book by three Harvard researchers explains, this just isn’t true of the right. American conservative media functions like a closed system, with Fox News at the center. Right-wing outlets are less tethered to conventional journalistic ethics and exist mostly to propagate the bullshit they produce.\n\nAll this has created an atmosphere that has helped Trump. The Trump administration has been remarkably successful at muddying the waters on Ukraine and impeachment, and Republicans in Congress have helped by parroting the administration’s talking points.\n\n Drew Angerer/Getty Images\n\nReps. Guy Reschenthaler (R-PA), Jim Jordan (R-OH), and Louie Gohmert (R-TX) look on as fellow Republicans speak to the press after the House Judiciary Committee approved articles of impeachment against President Trump on December 13, 2019.\n\nThe fact is, Trump did what Democrats have accused him of doing. We know, with absolute certainty, that the president tried to get a foreign government to investigate a family member of one of his political rivals. And we know this because of the witnesses who testified before the House Intelligence Committee and because Trump’s own White House released a record of the call proving it.\n\nYet all the polling data we have suggests that public opinion on Trump and Ukraine has basically held steady. Again, some of this is pure partisan recalcitrance. But there’s good reason to believe that the right’s muddying of the waters — making the story about Ukraine and Hunter Biden, pushing out conspiracy theories, repeatedly trumpeting Trump’s own version of events, etc. — has played a role.\n\nThe issue is that the coverage of the trials, in both the mainstream press and right-wing outlets, ensures that these counternarratives are part of the public conversation. It adds to the general atmosphere of doubt and confusion. And that’s why zone flooding presents a near-insoluble problem for the press.\n\nThe old model is broken\n\nThe way impeachment has played out underscores just how the new media ecosystem is a problem for our democracy.\n\nIt helps to think of zone-flooding less as a strategy deployed by a person or group and more as a natural consequence of the way media works.\n\nWe don’t need a master puppeteer pulling the media’s strings. The race for content, the need for clicks, is more than enough. Bannon or Conway can shake things up by feeding nonsense into the system.\n\n John Lamparski/Getty Images\n\nFox & Friends hosts Steve Doocy, Ainsley Earhardt, and Pete Hegseth interview former US Army Lt. Clint Lorance on November 18, 2019.\n\nTrump can dictate an entire news cycle with a few unhinged tweets or an absurd press conference. The media cycle is easily commandeered by misinformation, innuendo, and outrageous content. These are problems because of the norms that govern journalism and because the political economy of media makes it very hard to ignore or dispel bullshit stories. This is at the root of our nihilism problem, and a solution is nowhere in sight.\n\nThe instinct of the mainstream press has always been to conquer lies by exposing them. But it’s just not that simple anymore (if it ever was). There are too many claims to debunk and too many conflicting narratives. And the decision to cover something is a decision to amplify it and, in some cases, normalize it.\n\nWe probably need a paradigm shift in how the press covers politics. Nearly all of the incentives driving media militate against this kind of rethinking, however. And so we’re likely stuck with this problem for a very long time.\n\nAs is often the case, the diagnosis is much easier than the cure. But liberal democracy cannot function without a shared understanding of reality. As long as the zone is flooded with shit, that shared understanding is impossible.\n",
      "Folder": "Feedly",
      "Timestamp": "1579224461",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.347137Z"
}