{
  "id": "3df57054947a4e70ba654b48fd0d4e3e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1278138/many-american-men-are-disappointed-with-fatherhood-it-doesnt-have-to-be-this-way/",
      "Title": "Many American men are disappointed with fatherhood. It doesn’t have to be this way. Quartz",
      "Selection": "This question originally appeared on Quora: What are some ways that men imagined themselves as fathers before they had children that turned out to be off-base? Answer by Josh Levs, Author of All In: How Our Work-First Culture Fails Dads, Families and Businesses.\n\nWhen your dream becomes real, it becomes very real.\n\nThat’s a line I came up with when my career took off. But it applies just as much to parenthood—life’s greatest adventure for those who wish to partake in it.\n\nOf course, there are ways we all idealized what parenthood may be like and how we’d handle some of the challenges. That said, adages about everyone inevitably repeating their parents’ mistakes are false and ridiculous.\n\nToday’s fathers are carving out new terrain for a new era. Having done loads of research and interviews, including for my book All In, I see how incredibly far fatherhood has come. For generations, many women and some men have fought for gender equality. Our generation is now the beneficiary. One of the gifts we’ve received is that dads are free to build emotional, deep connections with our children—and most of us, by far, are making efforts to be there for all the moments.\n\nBut a powerful set of structures remain that prevent dads from having as much time with their kids as they hoped for: a network of laws, policies and stigmas that are straight out of the Mad Men era. This is where many fathers, and mothers as well, find that what they imagined turned out to be off-base.\n\nMany people in my generation (I’m in my 40s) grew up thinking gender equality was going to be real, allowing us truly equal opportunities at work and at home. The girls I knew were just as capable and driven. And in college, when we talked about how we envisioned our futures, we spoke in similar terms about work and family.\n\nBut while we were shaped by a new era, workplaces are still stuck in the past.\n\nFor example, the lack of paid maternity leave in the US, as I explained at the United Nations, is based on the assumption that women should stay home while men make all the money.\n\nThe net result is that the US is the only nation with any kind of developed economy—almost the only nation in the world—that doesn’t make sure that when a child is born, it has a parent at home and food on the table for at least a block of weeks.\n\nNext, men often don’t have access to any paternity leave. About 40% of workers are not covered by the Family and Medical Leave Act, which requires unpaid leave. Many companies that do fall under FMLA aren’t providing paternity leave anyway. And only 15% of companies offer any paid paternity leave. Most families can’t afford unpaid leave.\n\nBut even more powerful than the laws and policies are the stigmas. Men have been fired, demoted, and lost job opportunities for taking paternity leave or seeking a flexible schedule. Far too many people in power still operate on the assumption that men should stay at work and women should be responsible for caregiving at home. They believe that a man who seeks time for caregiving is really just being lazy.\n\nSo from the day their kids are born, many dads don’t have as much time at home as they wanted to. And the overall gender pay gap—in which men much more often have higher-paying jobs—leave men working more and more hours for pay, while women do more at home. This isn’t what today’s dads and moms hoped for. It’s a vicious cycle.\n\nThe key is for us to break out of the cycle by fixing the problem on all three fronts. We need a national paid family leave insurance program, which is supported by the vast majority of the country, including majorities of Democrats and Republicans. It is not a requirement on businesses to pay people when they’re off. And it has proven great for business in the states that have it.\n\nBusinesses have financial incentive to offer paid family leave as well, since it attracts and retains employees amid a war for talent. In my work with companies, I show them how to construct these policies in ways proven to increase profits.\n\nAnd it’s time for all of us to stand up to the stigmas. We need to speak out, take legal action when necessary (as I did), and most importantly, communicate with each other about these challenges. The more we make the truth about today’s dads known, the faster the outdated structures will disintegrate.\n\nWhen we do that, we’ll make sure that the way today’s children envision themselves as parents has a bigger, better shot at coming to fruition.\n\nYou can follow Quora – the place to gain and share knowledge, empowering people to learn from others and better understand the world, on Twitter, Facebook, and Google+. \n\nMore from Quora:\n\nWhat can men do to support women in the workplace and at home? What makes a keynote speech compelling? What incentive does an individual company have to change its parental leave policies?\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1526448933",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.504657Z"
}