{
  "id": "3e09e57f10644d84a629c518c0770a8c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1079537/body-shaming-why-skinny-shaming-is-not-the-same-as-fat-shaming-and-masks-thin-privilege/",
      "Title": "Conflating “skinny shaming” and “fat shaming” of women masks the often forgotten issue of thin privilege Quartz",
      "Selection": "Thin celebrities are partly responsible for inventing a new term: “skinny shaming.”\n\nProminent model Jaime King (pictured above) accused French fashion houses LVMH and Kering, who own brands like Gucci, Louis Vuitton, and Dior, of “body shaming” earlier this month, after they announced a ban of size-zero models from their catwalks. After decades facing accusations of promoting unhealthy body images, not to mention well-documented health issues among models, companies are now complying with the French government’s new law that requires models to obtain a doctor’s certificate before they walk down the runway.\n\n“I think it would be radically unfair to say if you’re a size zero, then you can’t work, just like it’s unfair to say that if you’re a size 16, you can’t work,” King told the New York Post. “I’m naturally really thin and sometimes it’s really hard for me to gain weight. When people on Instagram say, ‘Go eat a hamburger’, I’m like, ‘Wow, they’re body shaming me for the way I look’.”\n\n“Body shaming,” the act of humiliating someone for their size, can happen to anyone. However, equating the trials and tribulations of a model told to “eat a hamburger,” with the treatment of someone perceived as overweight is a dangerous conflation. To be called “thin,” in much of the Western world, is generally a compliment. To be “fat,” by contrast, means facing a stigma on a daily basis, particularly about one’s health. Though studies have shown that those with an elevated Body Mass Index (BMI) have a higher mortality rate, the health concerns of overweight and obese people are highly complex.\n\n(The BMI is a calculation to determine if someone is underweight, normal weight, overweight, obese, or morbidly obese. Even though there are huge problems and limitations of using BMI to measure for “ideal” weight, doctors, scientists, and researchers continue to use it. Because of the BMI’s ubiquity in the scientific and medical literature, its classifications are common definitions of “fat,” and therefore used in this article.)\n\nTo be fair, King’s livelihood depends on an industry that is regulating her body out of it. Even if your work promotes fantastical and unrealistic ideals for the female form, that is a bitter pill to swallow. But as with any privilege, it’s difficult for those favored to see their advantages. Privilege doesn’t protect anyone, King included, from personal upsets, hardship, or traumas. Privilege, by definition, incurs more advantages, more opportunities, the benefit of the doubt, and quicker recovery from setbacks.\n\nBeing fat, on the other hand, is more likely to hurt your career, wealth, mental health, and love life. To conflate “skinny shaming” and “fat shaming” is to obscure the real shame in that.\n\nBeing overweight makes it harder to get a job\n\nAlmost half of employers in a survey said they were less inclined to recruit a candidate at the interview stage if the applicant was obese. (Reuters/Jacky Naegelen)\n\nUK-based Crossland Employment Solicitors polled people with hiring responsibilities at 1,000 employers in 2015 and found that almost half of those surveyed (45%) said they were less inclined to recruit a candidate at the interview stage if the applicant was obese. “They wouldn’t be able to do the job required” and “they’re lazy” were just two of the reasons cited.\n\nA 2016 study by psychologist Stuart W. Flint of Britain’s Sheffield Hallam University found that obese women were less likely to be hired than obese men, and both groups were at a disadvantage to thinner people because employers believed the obese were “less physically capable and slothful.” In 2009, Dan-Olof Rooth of Kalmar University in Swedensent fake applications to real job openings, using pairs of photos of the same person but digitally altered them to look more or less obese. He found that the callback response for obese women was eight percentage points lower than their thinner counterparts.\n\nBeing overweight makes it harder to get a promotion\n\nIn a 2016 study, Eden King of George Mason University and others showed that being overweight has an adverse impact on the perceived leadership performance of top managers. The larger the waist, the more it undermines evaluations of leadership ability, therefore hurting the chances of a promotion.\n\nWhat’s more, a study Eva Muenster of the University of Mainz and others showed that overweight and obese people believe their jobs are at risk more than those who are thin. “Job insecurity might lead employees into a vicious cycle,” the researchers wrote in a paper published in 2011. “Job insecurity might represent an important psychological burden which again might trigger obesity and other diseases.”\n\nOverweight women are more likely to earn less\n\nA 2004 study by John Cawley of Cornell University found that a 65-pound weight gain in white women was associated with a 9% drop in wages. The effect of weight on other gender-ethnic group combinations were not as statistically significant.\n\nA study by Jennifer Shinall at Vanderbilt Law School, meanwhile, revealed in 2014 that overweight women are “more likely to work in lower-paying and more physically demanding jobs; less likely to get higher-wage positions that include interaction with the public; and make less money in either case compared to average size women and all men.”\n\nThe system is stacked against the overweight from the beginning\n\nOverweight or obese young people are likely to experience psychological problems. (Reuters/Brendan McDermid)\n\nOverweight people don’t just have to fight the system during their working life; the battles start in childhood. A 2005 study led by Janet Latner of the University of Canterbury in New Zealand showed children and adolescents are less accepting of overweight and obese peers than adults.\n\nBefore reaching adulthood, overweight or obese young people are likely to experience psychological problems, such as depression and low self-esteem. A 2015 study led by Tilda Farhat of the US National Institutes of Health hammered home just how much overweight and obese people are set up to be vulnerable later in life:\n\nOverweight status in adolescence has been associated with sexual risk behavior (Akers et al., 2009), social exclusion (Chen & Brown, 2005), peer victimization (Pearce et al., 2002), and a lower likelihood of establishing romantic relationships (Chen & Brown, 2005; Halpern, King, Oslak, & Richard Udry, 2005; Pearce et al., 2002), all developmental milestones particularly salient for adolescence.\n\nAnd there is respite when overweight people start dating. The pool of people they are likely to get to know intimately is shallow, and the relationships they fall into have a higher chance of being abusive.\n\nThe non-thin are told every waking moment they’re not ideal\n\nThe weight loss industry is worth $60 billion a year in the US alone. (Reuters/Danny Moloshok)\n\nThey may have to endure the occasional request to “eat a hamburger,” but at least skinny people do not wake up every day constantly being told that they need to change themselves, unless they are clinically underweight, which can lead to weakened immune systems, fragile bones, and organ failure.\n\nIt’s hardly surprising that the overweight are trying to take up less space in the world. In popular entertainment, there’s the fat best friend trope, who usually provides comic relief or is simply a bit crazy. And there’s often only room for one or two token big girls, epitomized by Taylor Swift and her “girl squad” tacking on Lena Dunham in the role of the token one that does not look like a catwalk model.\n\nSo the next time someone tries to appropriate the term “body shaming” to equate it to “skinny shaming,” remember it isn’t the same and that thin privilege is very real. In fact, as many doctors and scientists have pointed out, discriminating against fat people is the last form of acceptable social bias.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1506026288",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.548573Z"
}