{
  "id": "3f364b3117114bf6bf3a10b5196c6cdf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.getrichslowly.org/better-resume/",
      "Title": "Building a better resume Get Rich Slowly",
      "Selection": "Building a better resume\n\n posted by J.D. Roth on 18 July 2018  Leave a Comment \n\nYesterday at the Financial Careers forum on Reddit, a user named /u/unfoldcareers posted some useful advice for job-seekers. “I’ve reviewed and screened thousands of resumes,” /u/unfoldcareers writes, “and I’m sharing my preferred resume format…along with my best resume advice.”\n\nThe poster notes that “bad resume format” leads most folks to get little or nor response to their job applications. To help current job hunters, /u/unfoldcareers created a free resume template that can be downloaded via Google Docs.\n\nThe Reddit post itself contains a number of useful tips. To craft a better resume, you should:\n\nBe precise. Don’t speak in general terms, but include specific numbers and metrics. Instead of saying, “Was top salesperson at my company,” note how many people were on the sales team, how much better you performed than everybody else, and for how long.\n\nEmphasize impact. According to /u/unfoldcareers, too many people focus on their achievements when they should really emphasize the impact they had on their company or team.\n\nStick to one page — unless you really do have decades of experience.\n\nMake it scannable. “A hiring manager will review your resume for approximately 10 seconds or less,” writes /u/unfoldcareers. Be sure that they’ll be able to scan all of the important info quickly.\n\nExplain gaps. Don’t leave a mystery. If you took time off to be a stay-at-home parent, say so.\n\nRemove the “objective” line. It’s irrelevant. (I did a very little hiring for our family’s box factory. I never did understand why people put an objective on their resume.)\n\nRemove references. It’s fine to create a separate document that contains your references so that you can provide them if asked, but don’t include them on the resume itself.\n\nThe full post on Reddit includes more info, of course, along with the reasoning behind some of the recommendations.\n\nFrom my experience, most people forget is that a resume isn’t really about you. That might sound strange, but the truth is that a resume is about how well your skills and experience match an employer’s job requirements. Because of this, the best resumes are individually tailored to specific jobs.\n\nSure, you might create a “base” or “default” resume that serves as a framework when applying for work. But you’ll have greater success with your job hunt if you take the time to make subtle tweaks to this default each time you apply for a different job.\n\nAlso: I believe strongly that, whenever possible, you should hand-deliver your resume.\n\nObviously, this doesn’t work for online-only applications or for positions outside your local area. But I know that when we hired at the box factory, we paid more attention to folks who had come by in person than those who simply mailed their resume. (And from watching Kim go through a couple of job searches now, I’d say that one of the reasons she has such success is that she literally goes door to door, dropping her resume off at different dental offices.)\n\n\n\n",
      "Folder": "Feedly",
      "Timestamp": "1532154232",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.487922Z"
}