{
  "id": "401507e6221747b297065c1c6f9696ba",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.newyorker.com/arts/critics/atlarge/2012/01/30/120130crat_atlarge_gopnik?currentPage=all",
      "Title": "The Caging of America",
      "Selection": "The scale and the brutality of our prisons are the moral scandal of American life. Every day, at least fifty thousand men—a full house at Yankee Stadium—wake in solitary confinement, often in “supermax” prisons or prison wings, in which men are locked in small cells, where they see no one, cannot freely read and write, and are allowed out just once a day for an hour’s solo “exercise.” (Lock yourself in your bathroom and then imagine you have to stay there for the next ten years, and you will have some sense of the experience.) Prison rape is so endemic—more than seventy thousand prisoners are raped each year—that it is routinely held out as a threat, part of the punishment to be expected. The subject is standard fodder for comedy, and an uncoöperative suspect being threatened with rape in prison is now represented, every night on television, as an ordinary and rather lovable bit of policing. The normalization of prison rape—like eighteenth-century japery about watching men struggle as they die on the gallows—will surely strike our descendants as chillingly sadistic, incomprehensible on the part of people who thought themselves civilized. Though we avoid looking directly at prisons, they seep obliquely into our fashions and manners. Wealthy white teen-agers in baggy jeans and laceless shoes and multiple tattoos show, unconsciously, the reality of incarceration that acts as a hidden foundation for the country.",
      "Folder": "Starred",
      "Timestamp": "1329713846",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:27:00.013925Z"
}