{
  "id": "405b3ee62ece4d42a5294891e5b2aac9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/work/1520476/should-your-resume-be-one-page-or-two/",
      "Title": "Should your resume be one page or two Quartz",
      "Selection": "Q: Should my resume be one page or two?\n\nDear Upwardly Mobile,\n\nConventional wisdom suggests that you should keep it short: According to job hunting site The Ladders, recruiters spend roughly six seconds reviewing most resumes. However, new findings by resume writing service ResumeGo suggest that doubling page counts can actually improve your chances of getting hired, with recruiters 2.3 times likelier to prefer two-page documents, and prone to spending more time reviewing these write-ups.\n\nSo what’s the right answer? It all depends on how much background and experience you have that’s directly relevant to the position, and how much space you need to clearly and concisely get the message across that you’re a candidate worth considering.\n\nThink of a resume like the back of a book or a trailer for a movie: It’s a quick summary of your background and accomplishments, designed to tease readers into wanting to get the full story. In effect, it’s a brief biographical narrative that quickly tells the story of your professional life, highlights your achievements, and why the position you’re applying for makes a logical fit. Like any good teaser, it shouldn’t just be accessible and compelling. It also should be only as long as needed to pique the viewer’s interest.\n\nBefore beginning, keep a couple helpful rules of thumb in mind. At a minimum, your resume should fill out a full page—if it’s too short or light on detail, recruiters may assume that you’re lacking in skills or experience. And if hasn’t been formatted into easily digestible subheads, sidebars, and bullet points, and still exceeds two pages in length, they may also skip over it because it’s too daunting and probably bloated anyway.\n\nAll of which points to an ideal solution which lies somewhere in the middle: A smart, punchy, 1- to 1.5-page document that succinctly summarizes information about you, underscores what makes you unique, and exceeds a single page only if there’s relevant work experience or honors and awards to present. A two-page resume is typically the sort that’s reserved for individuals with a highly accomplished history and extensive experience, e.g. 10 to 20 years of work, in a related field.\n\nHere are a few tips that can help you size your resume the right way when you’re crafting the document:\n\nDon’t attempt to pad or inflate: The faster you cut to the chase, the better for busy hiring managers.\n\nKeep readability in mind. Resumes should be legible, laid out well, and neatly spaced. Avoid the temptation to shrink fonts to cram in more data. Instead, focus on capturing the reader’s eye and getting important points across at a glance.\n\nFocus on telling a clear, simple story about your background and experience and how your work relates to the prospective position, highlighting two to three key differentiators that set you apart from other applicants.\n\nDon’t forget that visual representations such as infographics, charts, and images can help you quickly convey complex information, often while saving  space and standing out. Graphic elements should be eye-catching, professional, and representative of the image you wish to convey to potential employers. However, before you include any visuals, the culture of the organizations you’re applying to should be considered (more conservative firms may find such touches less endearing).\n\nInclude search engine keywords—terms that a recruiter may be likely to punch into a computer (e.g. are they looking for “business analysts” or “market research” pros). Working these terms into your document can help ensure you pop up in queries and improve chances of success.\n\nBe specific when promoting your achievements. Did you grow sales by 300% in Q4? Add 20,000 monthly new visitors to an organization’s blog? Oversee the rollout of a $1 million advertising campaign that generated 20 million impressions? Skip generalities and show what you can do for an employer.\n\nConsider where overviews and shortlists make sense. A bullet-point rundown of certifications, publications, courses taken, etc. often provides enough general information to pique recruiters’ interest—they can always follow up if they have additional questions.\n\nWhile the ideal length of a resume differs depending on the individual candidate, position, and employer involved, the general rule is that less is more. The faster and more succinctly you can make a case for yourself as a prospective candidate, and highlight key career achievements, the better your prospects of getting hired will be.\n\nScott Steinberg is the author of The Business Etiquette Bible.\n\nDo you have a workplace etiquette question? Submit to Scott by emailing work@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1547239749",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.409525Z"
}