{
  "id": "40f770befaee42eaa627b052e675c300",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/874179/un-security-council-resolution-2334-the-un-security-council-called-israels-bluff-on-its-non-existent-palestinian-peace-process/",
      "Title": "The world has finally called Israel’s bluff on its non-existent Palestinian peace process Quartz",
      "Selection": "Israeli prime minister Benjamin Netanyahu has long based his settlement strategy on the assumption that the international community will ignore the plight of the Palestinians. But the United Nations proved him wrong on Dec. 23, passing Security Council resolution 2334, which reaffirms the longstanding UN ruling that all Israeli settlements built outside Israel’s pre-1967 borders violate international law.\n\nIsrael has reacted with predictable fury to the UN resolution, with Netanyahu engaging in theatrical attempts to humiliate the resolution’s supporters. Netanyahu has also jousted verbally with US secretary of state John Kerry over the Obama administration’s reasons for withholding its veto, presumably hoping to impress his domestic political audience with an almost comical display of assumed international authority.\n\nBut even though Israel has made it clear that the non-binding resolution won’t restrain its continued settlement construction on the ground, the tone of its response reflects a well-grounded anxiety over the potential consequences of renewed international engagement on the conflict.\n\nDespite Netanyahu’s confidence that the incoming Trump administration will back Israel on its settlement enterprise, the fact that not a single Israeli ally voted against the resolution deals a staggering blow to the prime minister’s core belief that Israel can normalize its international standing while denying the rights of millions of Palestinians. Netanyahu frequently boasts of Israel’s diplomatic gains, claiming it has made common cause with Sunni Arab states against Iran. But these statements are based on the unspoken assumption that amid more dramatic developments elsewhere, the world will simply forget about the Palestinians’ plight.\n\nNetanyahu’s outrage over the UN vote was clearly a response to being proved embarrassingly wrong on that count. Not that it should have come as a surprise: Israel’s international standing has, in fact, always been premised on the achievement of Palestinian rights and sovereignty.\n\nA little bit of history is important here. Israel first claimed and won recognition as a nation-state from the United Nations in 1949 as the partial fulfillment of 1947’s UN Resolution 181. That resolution proposed portioning historic Palestine into a Jewish and an Arab state. Israel was accepted into the community of nations as one part of a two-state solution.\n\nProspects for a two-state partition were reinvigorated in the late 1980s, when the Palestine Liberation Organization (PLO) leadership embraced the goal of statehood in the Palestinian territories occupied by Israel during the 1967 war. At the same time, a combination of the first Palestinian intifada and the end of the Cold War prompted Washington to initiate the Madrid talks—precursor to the Oslo Peace Process in the 1990s.\n\nIsrael enjoyed unprecedented diplomatic rehabilitation as a result of Oslo and its implied promise of Palestinian statehood. Netanyahu and his Likud Party, however, have always ferociously opposed Oslo. Even when, in 2009, he was forced out of diplomatic necessity to rhetorically accept the principle of Palestinian statehood, Netanyahu hastened to make clear to the party faithful that he had no intention of ever implementing it. Six years later, he once again made the pledge to prevent a Palestinian state part of his campaign for reelection.\n\nAll along, Netanyahu has justified his opposition by promising that determined defiance would eventually convince the international community to accept Israel’s violation of UN rulings. Last week’s Security Council vote shows just how badly the Israeli leader misjudged international sentiment. Without the illusion of a “peace process,” Israel will likely face more international pressure over the occupation.\n\nWhat US president Barack Obama did last week—and secretary of state John Kerry also emphasized in a pointed State address yesterday—was to call Israel’s bluff. There is no longer any process underway for ending the occupation and achieving a two-state solution based on the 1967 lines, as Israel’s continued settlement in occupied territory makes clear. And no credible process means no diplomatic shield protecting Israel from the consequences of its actions.\n\nMeanwhile, despite the hawkish posture of the incoming administration, Donald Trump in fact offers Israel little protection. The positions taken by the president-elect on the issue are so far outside the international consensus that he won’t command the moral or diplomatic authority necessary to restrain others from acting against the occupation.\n\nSenior Israeli leaders have, in recent years, warned that the occupation creates an apartheid situation similar to South Africa’s white minority regime in the 1980s. Activists favoring sanctions to punish Israel over the occupation welcomed last week’s vote, and Israel’s defiant response, because it makes their work so much easier.\n\nInterestingly, one of the earliest consequences of the resolution may soon be felt on the soccer field.\n\nThe rules of FIFA, the international body that runs the game, forbid any member nation from including teams whose home stadiums are outside its national territory without agreement from the recognized authority in that territory. Two years ago, that statute was used to block Russia—under threat of suspension and therefore of losing the right to host the 2018 World Cup—from incorporating Crimean teams in its leagues after taking control of the territory from Ukraine. The Palestinian Football Association, also a member of FIFA, has since made a similar complaint, citing the involvement of teams based in settlements in Israel’s domestic leagues as grounds for suspension.\n\nThe international body is due to respond in January. Israel could dodge the issue by simply moving those teams inside the 1967 lines, but that would fly in the face of the government’s efforts to normalize the settlements. And Israel’s argument to FIFA that the status of the settlements was a matter of dispute becomes even less tenable in the face of Resolution 2334.\n\nSuspension would exclude Israel’s national team from international competition and its professional teams from European leagues, striking a significant psychological blow for ordinary Israeli soccer fans. And that may be the first of many.\n\nIn a world that has rejected Netanyahu’s invitation to ignore the plight of the Palestinians, he may come to miss the protective shield offered by the peace process—and even the outgoing US president against whom he now directs so much ire.\n\nFollow Tony on Twitter at @TonyKaron. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.",
      "Folder": "Feedly",
      "Timestamp": "1483030264",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.732578Z"
}