{
  "id": "40fdeee22f8a43b48bb2e72477918f86",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://coolinfographics.com/blog/2019/2/25/how-artificial-intelligence-is-changing-art",
      "Title": "How Artificial Intelligence Is Changing Art Cool Infographics",
      "Selection": "Using Artificial Intelligence to create works of art is a very controversial topic, and Invaluable has tackled explaining the issue with the infographic How Artificial Intelligence Is Changing the Face of Art and a detailed blog post. This issue applies to fine arts, music, writing, dance and even the culinary arts! When can it truly be considered “art”? Who owns the final creative works?\n\nOver the past 50 years, artists have been using computers to generate forms of digital art, but previously had to write the code that specified a set of rules to create the chosen aesthetics. Within the last couple of years, artists have taken AI art to a new level, using algorithms that learn these aesthetics themselves by analyzing thousands of images.\n\nThough many artists fear that relying on machines will hinder the essence of art and could even lead to replacing humans as creators, AI artists feel that machine-generated art is a new opportunity and the process is becoming an art form in itself. Much like famous artists of the past whose work was informed by concurrent social and political issues, artificial intelligence, working in conjunction with humans, has the ability to create art through those experiences as well.\n\nWithin the last decade, machine learning has become a growing medium that has permeated a variety of industries and disciplines, including the fine, performing, literary and culinary arts. While some worry that AI will stifle creativity and take jobs away from humans, artists offer a different perspective. By working with the capabilities of artificial intelligence machines, artists can use the technology as a tool for the augmentation of human thought to create what has yet to be imagined.\n\nThey also created a good animated GIF infographic to explain how AI can learn to write:\n\nBoth infographics are missing some design elements to help with sharing online. When publishing infographics, you have to assume they will be shared without the rest of the longer article they were originally published with.\n\nThe URL address back to the original infographic landing page (the blog post) or even the company website\n\nWhat’s the CTA (Call-To-Action)? What does Invaluable want the readers to do with this information? Even if it’s just “Learn More at Invaluable”.\n\nInclude a Copyright or Creative Commons license statement? Ironic that it’s missing since the topic is partially about who owns the creative works created by AI. Infographics are a creative work!\n\nThe data sources? The original blog post has links to a number of articles that were used as source material for the infographic (which is great!) but these need to be listed in the infographic itself. If I’m reading the infographic without the rest of the original blog post, why should I believe this information? Why is it credible?\n\nFound on TechiExpert\n",
      "Folder": "Feedly",
      "Timestamp": "1551156309",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.394255Z"
}