{
  "id": "42ca0b447c2b4b478f7793564d1c4a14",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/two-special-elections-on-tuesday-could-hint-at-another-blue-wave-in-2020/",
      "Title": "Two Special Elections On Tuesday Could Hint At Another Blue Wave In 2020 FiveThirtyEight",
      "Selection": "Former Vice President Joe Biden leads President Trump in most early polls, Democrats are leading polls of the generic congressional ballot by 2018-level margins, and general disapproval of the administration’s handling of the coronavirus pandemic threatens to sink Republican prospects across the board. On Tuesday, we’ll get a taste of whether Democrats’ electoral advantage on paper will hold up in practice, as California and Wisconsin hold special elections for two vacant congressional seats. The main event is in the California 25th Congressional District, a bellwether seat in the north Los Angeles suburbs, where both parties see a chance to add to their ranks in the House. But if Democrats are also competitive in the quickly reddening, rural Wisconsin 7th Congressional District, it could signal another blue wave in the fall. Here’s everything you need to know about the two races.\n\nCalifornia 25th\n\nThe California contest will test whether Democrats can hold onto a suburban and formerly GOP seat they captured during the 2018 blue wave. This election — precipitated by the resignation of Democratic Rep. Katie Hill in November after she admitted to an affair with a campaign staffer — marks the second round of voting as no candidate won an outright majority on March 3 to claim the seat. So now Democrat Christy Smith and Republican Mike Garcia — the top-two finishers in that initial vote — are battling it out on Tuesday to serve out the remainder of Hill’s term, which ends January 2021. But regardless of who wins, Smith and Garcia will face off again in November because they both advanced from the regular primary, also held on March 3.\n\nWe don’t have much polling to go on, but the contest looks close. The last public poll of the race dates back to an internal poll the Garcia campaign released in March. In it, Garcia led Smith, 43 percent to 39 percent. According to Inside Elections, private polling has consistently found Garcia leading by the low single digits. Election handicappers rate it a toss-up. And Smith — a first-term assemblywoman in California’s legislature — and Garcia — a businessman and former Navy fighter pilot — have each raised and spent around $2 million. (The national party campaign arms — the Democratic Congressional Campaign Committee and the National Republican Congressional Committee — have also been busy, too, collectively spending over $3 million in the district.) However, the once-conservative district has shifted left over the last few years: Mitt Romney won it by 2 points in 2012, but Hillary Clinton carried it by 7 points in 2016, according to data from Daily Kos Elections.\n\nOne of the big issues in the race, though, may be a state issue: Assembly Bill 5, a new law Smith supported in the legislature that limits businesses’ ability to label workers as independent contractors, rather than employees (who are entitled to employment-related benefits that independent contractors would otherwise not receive), has experienced widespread backlash. Critics argue it’s made it harder for freelancers and gig workers to find jobs, and the economic crisis wrought by the coronavirus pandemic has made it a potential landmine for Smith — it’s one of Garcia’s main talking points. It’s not Smith’s only controversy either; she’s also received blowback after a video leaked in which she appeared to mock the Garcia campaign’s focus on highlighting his military service.\n\nThe special election will also be a testing ground for conducting an election during a pandemic. Democratic Gov. Gavin Newsom issued an executive order requiring counties to mail every voter a ballot, though that doesn’t mean everyone will vote by mail. The district has a limited number of in-person voting sites, and the late addition of one in the city of Lancaster — a move supported by the city’s Republican mayor — prompted Trump to tweet that the election is being “rigged” by Democrats. But Garcia and Smith haven’t been able to rely on traditional get-out-the-vote techniques as they fight for every vote in the final days of the campaign. Instead, they’ve had to mount campaigns built more on videoconferencing, virtual town halls and phone banking than typical door-knocking.\n\nAnd as always, who votes will matter. About 118,000 ballots had been returned as of May 11, according to Political Data, Inc, and at first blush, they bode well for Garcia — registered Republicans have cast 44.5 percent of them versus 35.6 percent by Democrats, plus 20.0 percent by independents or other parties. But these figures aren’t all that different from the ballots that had been returned the day before the March 3 contest, when registered Republicans had cast 45.0 percent of ballots compared to 36.6 percent by Democrats, plus 18.4 percent by others. Yet in the first round of voting, the Democratic candidates combined to win 51 percent of the vote, while Republicans won 49 percent. (It’s worth noting, though, that about twice as many voters have returned mail ballots for this election than just before the March 3 contest, as most votes will be cast by mail because of the pandemic.) In other words, party registration data at this point doesn’t tell the whole story because younger and minority voters are more likely to cast late-arriving ballots and they’re more likely to vote Democratic. In California, ballots must be postmarked on or by Election Day, but they can be received up to three days after.\n\nThere’s a lot at stake in the California 25th — and as is often the case with California, it could be a few days before we know the outcome.\n\nWisconsin 7th\n\nHalfway across the country, Wisconsin is holding another election just five weeks after drawing widespread criticism for not canceling its presidential primary amid the pandemic. After the many mishaps of that election, Gov. Tony Evers reportedly considered postponing the 7th District special, but never pulled the trigger — perhaps fearing that a court would overturn his decision yet again.\n\nSo just like last month, polling places will be open in Wisconsin on Tuesday, and just like last month, some poll workers are begging out of working the election and the National Guard is being called in to help. It’s unclear, however, how many headaches will ensue. There have been no widespread reports of polling-place closures, and the ruralness of the district minimizes the potential for long lines. (In April, the longest lines were reported in urban areas like Milwaukee and Green Bay, which are not voting on Tuesday; the biggest city in the 7th District is Wausau, population less than 40,000.) Indeed, the Wisconsin Elections Commission insists that the state is better prepared for May’s election than it was for April’s, because there have been no legal challenges pushing to change the rules of the election and officials now have experience running an election mid-pandemic.\n\nHowever, just like last month, many more Wisconsinites than normal are opting to vote by mail. As of Monday morning, local officials had reported receiving 112,892 absentee-ballot applications, a comparable number to the April election. Indeed, in the 21 counties wholly contained within the 7th District, 103,402 ballots had been requested for the special election compared with 101,846 for the April primary. Last month, this volume of absentee-ballot requests overwhelmed election offices and led to many people not getting mailed their ballot in time to vote.\n\nHowever they vote, residents of the Wisconsin 7th will elect either Republican state Sen. Tom Tiffany or Democrat Tricia Zunker, the president of the Wausau School Board, to be their next member of Congress. This northwestern Wisconsin district was once a hotbed of Democratic populism, represented by progressive former Rep. Dave Obey for 42 years and voting for Barack Obama by 8 points in 2008.1 But a huge bloc of non-Hispanic white residents without bachelor’s degrees — 72 percent of the population age 25 or older — has turned the 7th District into Republican turf. Former Rep. Sean Duffy, whose resignation for family reasons in September triggered this special election, flipped the seat red in 2010, and Romney won here by a narrow margin in 2012. But Trump put an exclamation point on the district’s realignment when he carried it by more than 20 points in 2016.\n\nZunker can hope that the district’s ancestral Democratic tradition means there are latent Democratic votes for her to activate. But even the strongest liberal candidates have failed to carry the Wisconsin 7th in recent years. According to Daily Kos Elections, Sen. Tammy Baldwin lost it by 5 points in 2018, and according to J. Miles Coleman of Sabato’s Crystal Ball, Wisconsin Supreme Court Justice-elect Jill Karofsky lost it by 6 points last month.\n\nIn addition, as of April 22, Tiffany had outspent Zunker $1.1 million to $328,000. So even though there have been no public polls of the race, the GOP is the clear favorite on Tuesday, with election handicappers rating it “Solid Republican.”\n\nStill, pay attention to the final margin, both here and in California. When a party consistently overperforms its usual partisan baseline in special elections, it bodes well for that party in the general election as well. So even a narrow loss by Zunker, if paired with a comfortable Smith win, would add to the evidence that another Democratic wave is building.\n",
      "Folder": "Feedly",
      "Timestamp": "1589253621",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.329651Z"
}