{
  "id": "43ac64f8a63b404b8341674d573d00af",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/american-muslims-are-a-diverse-group-with-changing-views/",
      "Title": "American Muslims Are A Diverse Group With Changing Views FiveThirtyEight",
      "Selection": "Only days after the end of Ramadan and just before the July Fourth holiday, thousands of people gathered at a Chicago convention center for the 54th annual convention of the Islamic Society of North America. Activists, scholars, religious leaders, booksellers, food vendors, and families of many backgrounds speaking many languages attended panels about topics as varied as religion, relationships, politics, cybersecurity and climate change. Despite their diverse backgrounds, many in attendance had two things in common: They were American, and they were Muslim.\n\nSpeaking at a panel on political views after the 2016 election, Besheer Mohamed, a senior researcher at the Pew Research Center, suggested that an upcoming report would put numbers to the diversity that could be observed at the conference. That survey, released Wednesday morning, is the third in a series of Pew surveys of Muslims in the U.S. taken over the past 10 years.8 It is also a window into the changing attitudes of American Muslims — who make up about 1 percent of the U.S. population9 — on issues such as politics and homosexuality.10\n\n“The key theme that we see regarding U.S. Muslims is diversity,” Mohamed told reporters on Tuesday, ahead of the report’s release. “Among immigrants, no single ethnic group has a majority. … Among U.S.-born Muslims, no racial group has a majority.”\n\nAmerican Muslims are also ideologically diverse. A plurality identify as moderate, with around 30 percent identifying as liberal and about 20 percent identifying as conservative. However, a large majority of Muslims in the U.S. prefer the Democratic Party, and that hasn’t changed since the 2007 Pew survey of Muslim Americans, the first in this series. In the 2016 presidential election, 78 percent of Muslim American voters said they voted for Hillary Clinton, which is a much lower share than the 92 percent who said they voted for Barack Obama in 2008.11\n\nU.S. Muslims tend to be moderate and prefer the Democrats\n\nShare of respondents by ideology and partisanship\n\nIDEOLOGY\n\nAMERICAN MUSLIM\n\nALL U.S.\n\nVery conservative\n\n7%\n\n–\n\n8%\n\n–\n\nConservative\n\n14\n\n–\n\n28\n\n–\n\nModerate\n\n39\n\n–\n\n32\n\n–\n\nLiberal\n\n20\n\n–\n\n19\n\n–\n\nVery liberal\n\n11\n\n–\n\n9\n\n–\n\nDon’t know/refused\n\n9\n\n–\n\n3\n\n–\n\nPARTISANSHIP\n\nRepublican/lean Republican\n\n13%\n\n–\n\n41%\n\n–\n\nIndependent/no lean\n\n20\n\n–\n\n9\n\n–\n\nDemocrat/lean Democrat\n\n66\n\n–\n\n50\n\n–\n\nSource: Pew research center, 2017\n\nThe Republican Party’s reputation among American Muslims seems to have deteriorated in recent years. According to the Pew survey, 59 percent of American Muslims believe the GOP is unfriendly toward Muslims; that’s an increase of more than 10 percentage points since 2011 — when Pew’s second survey in this series was done.12 Nearly three-quarters perceive President Trump to be unfriendly toward Muslim Americans, and 68 percent said he makes them feel worried.\n\nSurvey respondents also reported more discrimination. “The data suggests that the number of Muslims who say they’ve experienced a variety of kinds of discrimination is trending upward,” Gregory Smith, Pew’s associate director of research, said to reporters on Tuesday. Three in four said there is “a lot” of discrimination against Muslims in the U.S., and nearly half said they had experienced at least one instance of religious discrimination in the previous 12 months; that’s up from 43 percent in 2011 and 40 percent in 2007. Women said they experience discrimination more than men do.\n\n“It’s worth remembering that the challenges and obstacles that they tell us they face are really nothing new to the Muslim community,” Smith said. Despite concerns about discrimination, more Muslims in the 2017 survey than in the previous one said American people are generally friendly toward Muslim Americans.13 About half said someone had expressed support for them because of their faith, up 12 points from 2011 and 17 percentage points from 2007.\n\nAnother notable shift that the 2017 survey found was an increase in the share of American Muslims who say that homosexuality should be accepted by society, reflecting broader trends in the U.S. population as a whole. This change in attitude was present in almost every subgroup of American Muslims, not just the younger generation.\n\nAni Zonneveld told me that this finding doesn’t surprise her. She is the founder and president of Muslims for Progressive Values, a group that advocates for lesbian, gay, bisexual, transgender, queer and intersex inclusion in the Muslim community. “We have seen the shift by way of affirmation of our position of LGBT+ rights from straight Muslims through social media,” Zonneveld said in an email. She said she has seen some mosques framing homosexuality as a human rights issue — but she also criticized Muslim institutions and policy organizations, saying that they haven’t gone far enough in advocacy for LGBT issues. In a July 5 news release, Muslims for Progressive Values said it was asked to dismantle its booth and leave the Islamic Society of North America’s convention because of its beliefs. The Islamic Society of North America declined to comment.\n\nIn addition to surveying the attitudes of American Muslims, Pew has asked the public about its perceptions of Islam and of Muslims. Although the new Pew report hints at the idea that the public’s view of Muslims in recent years has improved, Mohamed said that “about half of the public says Islam is not part of mainstream society, so we don’t see full acceptance of the Muslim community by the larger public.” He said Muslims continue to be rated more negatively by the larger public than Catholics, Jews, Hindus and many other religious groups are.14 Surveys have shown that most Americans don’t know a Muslim personally, but those who do speak with Muslims — even occasionally — report having more favorable views.\n\nMedia coverage might contribute to the perception problem. A recent study by Harvard University’s Shorenstein Center on Media, Politics and Public Policy found that in reports with Muslim protagonists on three major national TV news networks, Muslim voices were rarely heard. It also found that news coverage about Muslims is often about terrorism and war. According to the Pew survey, 60 percent of American Muslims and 53 percent of the public agree that the media covers Islam and Muslims unfairly. Rayyan Najeeb, 26, who attended the Islamic Society of North America convention, said the media frequently failed to distinguish between the views of Muslims who live elsewhere in the world and the views of American Muslims. Najeeb said he appreciated that surveys like Pew’s give American Muslims the opportunity to speak for themselves: “It really counteracts a lot of the terrorist-next-door type of thinking … and a lot of the fear-mongering that has been happening in the news.”\n\nAnd publicizing those varying views helps remind people that American Muslims aren’t a monolithic group, said Meira Neggaz, executive director at the Institute for Social Policy and Understanding, a research organization that recently began polling American Muslims. “When you look at all these data points, I think it really highlights how people are just people, and it’s really difficult to lump everyone together and just say … ‘Muslims do this’ or ‘Muslims do that,’” Neggaz said. That’s why polls like Pew’s and ISPU’s are so important, she said: “The crux of polling is to amplify the voices of people. … They may not be doing a 10-minute interview on CNN, but this is at least amplifying the actual real lives of real people.”",
      "Folder": "Feedly",
      "Timestamp": "1501253865",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.566391Z"
}