{
  "id": "44720387d2a442099135866491f1c3c9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1630506/most-americans-are-not-400-away-from-financial-ruin/",
      "Title": "Despite what you’ve heard, 40% of Americans are not $400 away from financial ruin Quartz",
      "Selection": "Last week the Federal Reserve Board of Governors released its report on the Economic Well-Being of U.S. Households, the source of one of the most misleading statistics in America (and there are many contenders). Politicians and many journalists cite it when they say 40% of Americans can’t afford a $400 expense. If you believe it, it sounds like many households are a single event—such as a car break down or a hot-water heater repair—away from dire poverty. But the report says something slightly, but significantly, different. Based on a survey of 11,316 American households, the report says:\n\nIf faced with an unexpected expense of $400, 61 percent of adults say they would cover it with cash, savings, or a credit card paid off at the next statement—a modest improvement from the prior year. Similar to the prior year, 27 percent would borrow or sell something to pay for the expense, and 12 percent would not be able to cover the expense at all.\n\nWithin that 39%, about half would cover the expense with either a credit card or a bank loan. Another 10% of the original 11,316 could borrow the money from a friend or relative, and 2% would take a payday loan. Just 12% would not be able to cover the expense at all. It is also worth noting how much these numbers improved over time. In 2013, 50% of Americans didn’t have $400 in cash, now 61% do.\n\nIt is not good that 21% of Americans would have to incur a high interest loan, from credit cards or payday loans, if they faced an emergency. But it’s also a long way from 40% of the population on the verge of financial ruin. According to the survey, 27% of Americans usually have a positive credit card balance and 26% do from time to time. The survey suggests curbing credit, with well-intentioned proposals to restrict credit cards or payday loans that could have some unintended consequences. For one, it would reduce access to emergency credit for many households.\n\nIt is also important to note it’s not only low earners in this position. According to data from the Survey of Consumer Finances, 46% of American households who earn more than $80,000 carry a credit card balance. A powerful 2016 essay in the Atlantic by Neal Gabler describes how even the upper middle class often lives paycheck-to-paycheck and have become the high-earning poor. He describes desiring a lifestyle that exceeds his earnings, while for others it is a choice about how they want to allocate their money. Why save for a small, financial emergency when you can put it on a credit card (at least in the short-term before those interest payments add up)?\n\nTo be sure, with high interest rates, this is not advisable strategy. Which means that when we hear that 40% statistic we should demand better financial literacy and hope for a return to frugal values that idealizes a healthy bank account instead of owning more things. But it also does not mean nearly half of American can’t afford a car repair.\n",
      "Folder": "Feedly",
      "Timestamp": "1559603436",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.368573Z"
}