{
  "id": "44eac8d110d84927a2035d4d4f198fd3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/first-person/2019/3/7/18253521/israel-ilhan-omar-antisemitism",
      "Title": "The Ilhan Omar controversy shows how little we care about Palestinian lives Vox - All",
      "Selection": "The conversation must center on the plight of the Palestinians.\n\nA controversy is brewing in Washington, DC, over Rep. Ilhan Omar’s comments about the influence of Israel lobby groups and the uncritical support that many members of Congress give Israel’s increasingly hardline, right-wing government. Backlash against Omar’s remarks even prompted House Democrats to make plans to introduce and vote on a resolution this week that would conflate statements like her with anti-Semitism. However, pressure from the Congressional Black and Progressive caucuses forced them to “put off” the issue.\n\nBut amid the frenzy, there’s been a glaring lack of context surrounding Omar’s beliefs. Perhaps most of all, there has been total disregard for the plight of the Palestinian people.\n\nOne might be inclined to ask, “Why is Rep. Omar steadfast in her criticism of Israeli policies and groups like AIPAC, knowing it will spark attacks, smears, and mischaracterizations?” One of the core issues of the Palestinian human rights struggle is that Palestinians have faced 70 years of refugeehood. Omar, who is a refugee herself and continues to identify as such, chooses to uplift the voices and affirm the struggle of refugees worldwide — including Palestinians. As a researcher of the Palestinian diaspora, and as a descendant of a Palestinian family that was ethnically cleansed from their land in 1967, it is a relief to me to finally hear voices in Washington speaking out for Palestinian rights like that of Sen. Bernie Sanders and Reps. Betty McCollum, Rashida Tlaib, and Omar.\n\nOmar has experienced firsthand how innocent humans pay the price for militarism, warfare, and systemic injustice, and is using her platform to protect the most vulnerable. She challenges the Democratic Party to adopt a more progressive and humane foreign policy, one that will not inflict upon others the type of suffering she has faced. Instead of dismissing her, or questioning her role on the House Committee on Foreign Affairs, we should defer to her expertise as a survivor of war and refugeehood.\n\nOmar has shared her own story of fleeing civil war in her homeland of Somalia, living in a refugee camp, being unable to dream of a better future in those harsh conditions, and how her passion for public service was born while serving as her late grandfather’s interpreter in the US as a teen. She knows intimately how innocent civilians are forced to endure injustice from governments and other powerful actors, and is attempting to use her voice as a member of Congress to protect the most vulnerable.\n\nFor her, this means speaking up for victims of the Saudi war on Yemen and citizens living under the brutal Saudi regime. It also means speaking up for the Palestinians. Just as it is becoming clearer to many Americans that a progressive agenda in the United States includes solidarity with the Palestinian struggle for freedom and equality, Omar’s support for Palestinians is part of her core belief system. As such, she and other new members of Congress are creating the space for others to speak up on this issue without fear.\n\nOmar was elected in 2018, a remarkably deadly year for Palestinians at the hands of the Israeli military. According to a United Nations Human Rights Council Report, the Israeli military killed 138 protesters and injured more than 9,000 others between March and December of that year. They protested to demand an end to 70 years of refugeehood, while also demanding an end to Israel’s cruel and illegal siege of Gaza during weekly protests known as the Great March of Return.\n\nAt the same time, the Trump administration cut funding to the United Nations Relief and Works Agency, which is an essential source of humanitarian aid, such as social services, health care, and education, to Palestinian refugees. Surviving on international aid and living in dire conditions in impoverished camps, Omar experienced as a young girl what many Palestinian refugees go through today.\n\nApproximately 70 percent of the 2 million Palestinians in the tiny, besieged Gaza Strip are refugees, survivors or descendants of those who were expelled from their homes during Israel’s establishment in 1948, known as the Nakba (“catastrophe”) to Palestinians. On top of the harsh conditions for 70 years and counting, all of Gaza’s residents also live under Israeli blockade and siege, ongoing since 2007. Regarded as a measure of collective punishment, the Palestinians of Gaza are cut off from other Palestinians and the world.\n\nTravel restrictions make it difficult for residents to move freely. Residents have less than four hours of electricity a day, with rising suicide, poverty, and unemployment rates. The US government, which provides billions of dollars in military funding to Israel every year, is bolstering these violent actions.\n\nOmar has prompted what for some is an uncomfortable debate. She has exposed the double standards and hypocrisy of many old-guard Democratic Party leaders who speak out against racism and injustice in the United States but overlook the racism and injustice that Israel imposes upon the Palestinians. It signals how far out of touch they are with Democratic voters and Americans in general, particularly progressives, young people, and people of color, who are increasingly critical of Israel and supportive of Palestinians struggling for their freedom.\n\nIn her recent statements that have drawn accusations of anti-Semitism, Omar was clear that her critique was focused on a lobbyist group, the actions of the Israeli military, and the policies of Israeli Prime Minister Benjamin Netanyahu. States, militaries, and lobby groups are not and should not be beyond critique — Omar showed that by recently criticizing the role of Saudi financial influence in Washington.\n\nWe should consider why it is so much easier for some to believe that a young black refugee Muslim woman who wears hijab is motivated by anti-Semitism in her criticism of a lobbyist group, rather than by a desire to end warfare and the pain of refugeehood?\n\nOmar understands the plight of refugees, who live in uncertainty and sometimes cannot even dream of a better life. This is why she speaks out so boldly against groups like AIPAC, who lobby for pro-Israel policies as the nation continues to act with impunity, causing more Palestinian suffering and stifling the hope and dream that the Palestinians will one day be able to live in freedom and dignity in their own land.\n\nIf Democratic shifts and recent outcry in US public opinion on Netanyahu’s policies and Israeli military actions are any indicator, more like-minded progressives will join the ranks of Rep. Omar in the future. Democratic Party leaders would be wise to pay attention and stand on the right side of history by following their lead.\n\nHanna Alshaikh is Palestinian-American researcher of the activist and intellectual histories of the Palestinian diaspora, with a particular focus on Palestinians in the United States. Find her on Twitter @yalawiya.\n\nFirst Person is Vox’s home for compelling, provocative narrative essays. Do you have a story to share? Read our submission guidelines, and pitch us at firstperson@vox.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1552109769",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.390373Z"
}