{
  "id": "46c55ba472d5443080b59056cd116f9d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/5-things-you-didnt-know-about-christmas-in-cairo/",
      "Title": "5 Things You Didn’t Know About Christmas in Cairo The Points Guy",
      "Selection": "Typically, when we think of Cairo, the last things that would probably come to mind are jingle bells or Jack Frost nipping at our noses. We’d probably think more about regular prayer calls from the neighborhood mosques and a Sphinx with a nipped nose.\n\nThe Sphinx (Photo by Kitti Boonnitrod / Getty Images)\n\nHowever, one of the most fantastic things about Cairo in December is the love the locals have for the Christmas season. So, if Cairo wasn’t on your list of travels for this season, it may just need to be added. In fact, TPG says this could be the time to add Egypt back to your bucket list — especially because of its newly discovered chamber of mummies and 4,000-year-old Egyptian tomb.\n\nTis the season in this typically tropical country and here are five things you probably don’t know about Christmas in this amazing ancient city!\n\n1. Cairo Has a Fantastic Ice-skating Rink\n\nWhat better way to experience a winter wonderland than going ice skating? Nestled within the Cairo Festival City Mall in New Cairo, “Ice Land” gives all the feeling of the Christmas season. Made of a synthetic material, the rink allows everyone of all ages to come and enjoy this favorite winter pastime while indoors. There’s also a second location in Point 90 Mall, which is situated across the street from the American University of Cairo. Here, you can catch a game of ice hockey or even a performance from professional “Disney on Ice” figure skaters.\n\n2. Sales, Sales and More Sales\n\nOne of the best parts about being in Cairo during the Christmas season is that there are always massive sales. From mall to mall, you’ll find some of your favorite brands at extremely discounted prices. It’s like having Black Friday every day during the month of December. And, with the Egyptian pound substantially lower than other currencies, your money can go a lot further picking up gifts and knickknacks for everyone. You may need to head to Khan El Khalili (Old Cairo) and pick up an extra piece of luggage for the flight home!\n\nYou can purchase hand-crafted Christmas ornaments at markets in Cairo. (Photo via Shutterstock)\n\n3. The New Uber Bus Was Just Unveiled in Cairo\n\nOn Dec. 4, the CEO of the ride-hailing service unveiled Uber’s first minibus service in Egypt. In fact, Cairo is the first city in the world with this option. This feature can be found under the same settings as UberX, Select and Scooter. With this option, you can literally bring the whole family and enjoy some of the fantastic sights during your holiday break without hailing multiple taxis or paying for a driver. In Egypt, you can pay for Uber with cash and for longer distance rides (45 minutes to an hour), you’ll still only pay about $7 to $10.\n\n4. Don’t Be Fooled by the Daytime Weather\n\nAlthough the temperatures boast spring-like weather in December, as the evening approaches, it’ll begin to feel a lot like Christmas. OK, maybe just a little. But do be sure to carry a jacket, sweater or extra layer because temperatures fall about 10 to 20 degrees at night. However, with the multitude of coffee and tea shops, you’ll be sure to warm up in no time.\n\nNighttime in Cairo (Photo by Emad Aljumah / Getty Images)\n\n5. Cairo Celebrates Two Christmases!\n\nYes, you read that correctly. The beauty of celebrating Christmas in Cairo is that western Christmas (Dec. 25) is observed, as well as Coptic Christmas (Jan, 7). For the entire month of December and through the New Year, you and the family can enjoy the Christmas spirit with the vast array of decorations and celebrations.\n\nCelebrating Coptic Christmas in Cairo (Photo by Khaled Desouki / Getty Images)\n\nThis year, The Nile Ritz-Carlton, Cairo (currently just 35k Marriott Rewards points per night — so use a Marriott 35k certificate) will host daily activities from Dec. 23 through Jan. 7. This will include everything from your favorite Christmas indulgences, like gingerbread houses and eggnog, a Christmas movie viewing schedule, to a “Christmas Wonderland”-themed party. There’ll also be an appearance from Santa himself in the Lobby Lounge on Dec. 25.\n\nIf you decide to travel to Cairo next Christmas, you may want to stay at the new St. Regis Cairo (set to open in early 2019), as it is also a Category 5 property in the Marriott Rewards program. This means that the annual certificates from cards such as the Marriott Rewards Premier Plus Credit Card or Starwood Preferred Guest® Credit Card from American Express can really come in handy for a bit of luxury while enjoying the holiday spirit on a budget in Cairo.\n\nBottom Line\n\nIf visiting Cairo during the Christmas break is on your list, you can apply for your entry visa, in advance. The process is very simple, but be sure to give yourself a minimum of two weeks to apply before your trip. Otherwise, Egypt also offers the option of purchasing your visa upon arrival for $25 per person, before reaching border patrol. Also, with it being peak season around the holidays, give yourself enough time to book your flights, accommodations and tours.\n\nHave you been to Cairo at Christmastime? Share your experience below in the comments and read on for more tips if you are seriously considering a trip to Egypt.\n\nFlying Business Class on EgyptAir from JFK – Cairo\n\n4,000 Year Old Egyptian Tomb Now Open to the Public\n\n10 Magical Places to Take Your Kids Around the World\n\nFeatured image of the Cairo Tower during the holiday season via Shutterstock.\n",
      "Folder": "Feedly",
      "Timestamp": "1544945088",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.416512Z"
}