{
  "id": "497e796c2dac492c9ec5f99cce94e843",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.ultimatespeeches.net/bestman/samplebestmanspeech.html",
      "Title": "Offers sample best man speech, best man speech example, and free best man wedding speech",
      "Selection": "Sample Best Man Wedding Speech\n\nGood evening everyone.\n\nAs most of you know my name is Tom and I am the groom's best man and brother.  It is a real honor to be here today celebrating this special day between my brother, John, and his new bride, Cindy. \n\nFirst, let me start by saying that Cindy looks absolutely beautiful today and it is a real pleasure to welcome her into our family.\n\nWhen John asked me to be his best man it seemed like a casual thing at first.  But as I thought more about it, it became a very big deal for me.  I began to feel a little overwhelmed with emotions and the importance of this day for John.  I realized that out of everyone that John could have chosen, he chose me...and that it is pretty special, so thank you John.\n\nAs I began to think about John and what he means to me in my life, I realized that I needed to tell him that I love him and will always support him in everything he chooses to do.  \n\nSo many of my memories are of when we were just boys, but now I look at the man he has developed into and I swell up with pride to be able to call him my brother.  It's not said enough or sometimes it's not said at all, but my brother is a person that I have always (or come to) had a great deal of love and respect for.\n\nGrowing up John and I may not always have seen eye to eye, but has we've gotten older I realize that I have learned a great deal from watching and spending time with him.\n\nIt doesn't matter if your brother is older or younger than you; you can always learn if you're willing to listen and pay attention.\n\nI've learned to be a better person because of him.  I've learned patience, understanding, strength, loyalty and love and these are the same things that John is bringing into his new life with Cindy.\n\nCindy, I ask you to take care of him and love him with everything in you, because that is the only way John knows and that is what he will be giving you.\n\nSo if everyone would please stand for a toast.\n\nTo my brother John, who I have always loved, and his new wife. I wish the both of you all the happiness in the world and may you bring each other patience, understanding, strength, loyalty, and love from this day forward, until death do you part!  \n\nCheers.",
      "Folder": "Archive",
      "Timestamp": "1308631185",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:24.219339Z"
}