{
  "id": "4a876208d33f4c63821f0fe767b51276",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/969885/almost-every-speed-limit-is-too-low/",
      "Title": "Almost every speed limit is too low Quartz",
      "Selection": "When lieutenant Gary Megge of the Michigan State Police attends a meeting, he sometimes asks, “How many of you broke the speed limit on your way here?”\n\nHearing his question, you might assume that lieutenant Megge is a particularly zealous police officer. The type of person who walks half a city block to avoid jaywalking on an empty street. The model citizen who defers almost obnoxiously to the letter of the law. But that is not the point of lieutenant Megge’s question at all.\n\n“We all speed, yet months and months usually pass between us seeing a crash,” lieutenant Megge tells us when we call to discuss speed limits. “That tells me that most of us are adequate, safe, reasonable drivers. Speeding and traffic safety have a small correlation.”\n\nOver the past 12 years, lieutenant Megge has increased the speed limit on nearly 400 of Michigan’s roadways. Each time, he or one of his officers hears from community groups who complain that people already drive too fast. But as Megge and his colleagues explain, their intent is not to reduce congestion, bow to the reality that everyone drives too fast, or even strike a balance between safety concerns and drivers’ desire to arrive at their destinations faster. Quite the opposite, lieutenant Megge advocates for raising speed limits because he believes it makes roads safer.\n\nTraffic engineering 101\n\nEvery year, traffic engineers review the speed limit on thousands of stretches of road and highway. Most are reviewed by a member of the state’s Department of Transportation, often along with a member of the state police, as is the case in Michigan. In each case, the “survey team” has a clear approach: they want to set the speed limit so that 15% of drivers exceed it and 85% of drivers drive at or below the speed limit.\n\nThis “nationally recognized method” of setting the speed limit as the 85th percentile speed is essentially traffic engineering 101. It’s also a bit perplexing to those unfamiliar with the concept. Shouldn’t everyone drive at or below the speed limit? And if a driver’s speed is dictated by the speed limit, how can you decide whether or not to change that limit based on the speed of traffic?\n\nThe answer lies in realizing that the speed limit really is just a number on a sign, and it has very little influence on how fast people drive. “Over the years, I’ve done many follow up studies after we raise or lower a speed limit,” Megge tells us. “Almost every time, the 85th percentile speed doesn’t change, or if it does, it’s by about 2 or 3 mph.”\n\nAs most honest drivers would probably concede, this means that if the speed limit on a highway decreases from 65 mph to 55 mph, most drivers will not drive 10 mph slower. But for the majority of drivers, the opposite is also true. If a survey team increases the speed limit by 10 mph, the speed of traffic will not shoot up 10 mph. It will stay around the same. Years of observing traffic has shown engineers that as long as a cop car is not in sight, most people simply drive at whatever speed they like.\n\nLuckily, there is some logic to the speed people choose other than the need for speed. The speed drivers choose is not based on laws or street signs, but the weather, number of intersections, presence of pedestrians and curves, and all the other information that factors into the principle, as lieutenant Megge puts it, that “no one I know who gets into their car wants to crash.”\n\nSo if drivers disregard speed limits, why bother trying to set the “right” speed limit at all?\n\nOne reason is that a minority of drivers do follow the speed limit. “I’ve found that about 10% of drivers truly identify the speed limit sign and drive at or near that limit,” says Megge. Since these are the slowest share of drivers, they don’t affect the 85th percentile speed. But they do impact the average speed—by about 2 or 3 mph when a speed limit is changed, in lieutenant Megge’s experience—and, more importantly, the variance in driving speeds.\n\nThis is important because, as noted in a US Department of Transportation report, “the potential for being involved in an accident is highest when traveling at speed much lower or much higher than the majority of motorists.” If every car sets its cruise control at the same speed, the odds of a fender bender happening is low. But when some cars drive 55 mph and others drive 85 mph, the odds of cars colliding increases dramatically. This is why getting slow drivers to stick to the right lane is so important to roadway safety; we generally focus on joyriders’ ability to cause accidents—and rightly so—but a car driving under the speed limit in the left (passing) lane of a highway is almost as dangerous.\n\nTraffic engineers believe that the 85th percentile speed is the ideal speed limit because it leads to the least variability between driving speeds and therefore safer roads. When the speed limit is correctly set at the 85th percentile speed, the minority of drivers that do conscientiously follow speed limits are no longer driving much slower than the speed of traffic. The choice of the 85th percentile speed is a data-driven conclusion—as noted lieutenant Megge and speed limit resources like the Michigan State Police’s guide—that has been established by the consistent findings of years of traffic studies.\n\nYet most speed limits are set below the 85th percentile speed. We first investigated this topic at the urging of the National Motorists Association, a “member-supported driver advocacy organization” that has made raising speed limits to the 85th percentile one focus of its efforts.\n\nOne member pointed us to a 1992 report by the US Department of Transportation on the “Effects of Raising and Lowering Speed Limits,” which, beside making the same arguments described above, noted that the majority of highway agencies set speed limits below the 85th percentile, leading over 50% of motorists to drive “in technical violation of the speed limit laws.” lieutenant Megge believes the compliance rate in Michigan to be well under 50%.\n\nIt seems absurd that over half of drivers technically break the law at all times. It’s also perplexing that speed limit policy so consistently ignore traffic engineering 101. So why do people like lieutenant Megge need to spend their time trying to raise speed limits?\n\nHow Saudi Arabia got us all driving 55 mph\n\nWhen I drive that slow, you know it’s hard to steer. And I can’t get my car out of second gear. What used to take two hours now takes all day. Huh, it took me 16 hours to get to L.A.\n\n—Sammy Hagar’s hit song “I Can’t Drive 55”\n\nIn 1973, the Egyptian military crossed the Suez Canal in a surprise attack on Israel. It was the start of the 1973 Arab-Israeli War, and also low speed limits in the United States.\n\nWhen the United States began resupplying Israel with arms, the Organization of Arab Petroleum Exporting Countries announced an embargo against the United States and several other countries. Combined with other supply constraints, it led to a quadrupling of gas prices, shortages of gasoline, and long lines at the pump.\n\nIn an effort to reduce America’s need for gas, president Nixon issued an executive order mandating a 55 miles per hour speed limit on American highways, which Congress made law the following year. States are officially in charge of setting their own speed limits, but national leaders (semi) successfully cajoled states by tying compliance to federal highway funds. Since driving at high speeds is less efficient, the policy is estimated to have saved 167,000 barrels of oil per day, or around 1% of American motor oil consumption.\n\nEven as the effects of the energy crisis drew down in the 1970s, the new federal speed limit remained. But rather than insist on the limit in order to reduce gasoline consumption, members of Congress maintained the policy because they believed it led to safer highways. This is shown by a debate over a measure passed in 1987, which allowed select states to raise the limit on certain roads to 65 mph. The New York Times reported that “Critics immediately warned that there would be a surge in highway fatalities.” The dissenting chairman of the Public Works and Transportation Committee called it “irresponsible, life-threatening legislation.”\n\nCongress abolished the national federal speed limit in 1995. Many states increased their speed limits before they could even post new signs, but many speed limits remained low. Twenty years of a 55 miles per hour speed limit created a low baseline that drags down speed limits today.\n\nWhy speed limits are low\n\nIf you peruse the websites of state’s departments of transportation, you’ll often find a very technocratic explanation of the 85th percentile principle. Speed limits are consistently lower than the 85th percentile speed across the country, however, because there are many limitations on following the principle. Florida’s Department of Transportation, for example, extolls the 85th percentile principle, yet the state legislature sets maximum limits for each type of roadway. Locally, officials can come under pressure from parents and other safety-conscious groups to lower speed limits.\n\nConsistently, the 85th percentile loses out to the perception that faster roads are less safe, so speed limits should be low. It’s a misconception, lieutenant Megge says, that he faces often in his work. When he proposes raising a speed limit, the initial reaction is always “Oh my god! You can’t do that. People are already going too fast.” People think raising the limit 10 mph will lead people to drive 10 mph faster, when really changing the limit has almost no impact on the speed of traffic.\n\nThe same lack of understanding motivates public health pushes for lower speed limits that influence legislation. The World Health Organization, for example, advocates low speed limits to prevent road fatalities, and cites studies showing that accidents and fatalities increase with traffic speed. “When you look at it from a pure physics standpoint,” Megge says, “and ask would you rather hit a bridge abutment at 10 mph or 40 mph, you can’t argue with that. But when I look at correcting a speed limit, I am not advocating driving faster, and that’s the hard part to get over.”\n\nIf someone could wave a wand and get every American to drive below 60 mph, roads would be safer. But since law enforcement can’t keep over 50% of Americans from speeding, putting a low number on a sign can’t make roads safer. Fortunately, American roadways are safer than ever, with highway fatalities at historic lows. Roads can be dangerous, but the perception of roads getting increasingly dangerous is a false one.\n\nPlenty of public safety advocates of lower speed limits, however, would disagree with the actions of individuals like lieutenant Megge. Just as Megge can point to the results on hundreds or thousands of roads which have become more safe or equally safe when the speed limit increased, other researchers looking at data sets of speed limit changes have come to the opposite conclusion and advise that raising speed limits comes with the price of thousands of roadway fatalities.\n\nNone of these studies mention the 85th percentile principle—at least in our review of them—and lieutenant Megge expressed surprise at researchers coming to this conclusion. Given that debates over speed limit laws often enlist experts who make clashing predictions about the effect of raising speed limits, we got the feeling that speed limit policy would be a lot more consistent if the public health community and traffic engineers collaborated more often.\n\nThe other reason speed limits may remain low, which John Bowman, Communications Director of the National Motorists Association strongly insists on, is that cities and police departments use traffic citations as a revenue generating tool. As Bowman says, when speed limits are artificially low, it’s easier to give out citations and pull in fine revenue.\n\nDue to concern about such “speed traps,” Missouri passed a law in the 1990s that capped the amount of a town’s revenue that could come from traffic tickets. In 2010, auditors discovered that Randolph, Missouri, generated 75% to 83% of its budget from traffic tickets. The tiny town of around 50 residents, which is located near several casinos, employed two full-time and eight part-time police officers, turning it into a speed trap poster child.\n\nFiguring out how common the tactics used by Randolph’s police department are around the country is difficult, as is tying it to a conscious decision to keep speed limits low. Each town or city makes its own decisions, which makes it difficult to know how comprehensively speeding tickets are used as a revenue generator. Further, it is very easy for police departments to defend pushing officers to issue more tickets as a goal intended to further roadway safety—as the LAPD did when found in violation of a state law banning traffic ticket quotas last year.\n\nIn our conversation, lieutenant Megge stated that he believes speed traps to be a “big problem” and counter to police officers real role of altering dangerous behavior. In a Detroit News article about a number of towns ignoring state law by not reviewing the speed limits on stretches of their roads, Megge said that he believes the communities did so in order to avoid revising speed limits upwards. This allows them to keep collecting ticket revenue on “artificially low” speed limits.\n\nSlowing down\n\nGiven the inevitability with which most drivers speed, it’s heartening that roadways can be made safer through the very achievable means of traffic engineers setting more realistic speed limits—rather than the nearly impossible goal of getting everyone to drive ten to twenty miles per hour slower. But it also seems counter to other goals. Most people may drive at a reasonable rate, but is that speed low enough to accommodate bikers, protect children at play, and make our cities more walkable?\n\n“I don’t want to lie to people,” lieutenant Megge tells us. It may make parents feel better if the speed limit on their street is 25 mph instead of 35 mph, but that sign won’t make people drive any slower. Megge prefers speed limits that both allow people to drive at a safe speed legally, and that realistically reflect traffic speeds. People shouldn’t have a false sense of safety around roads, he says.\n\nIf people and politicians do want to reduce road speeds to improve safety, or make cities more pedestrian friendly, Megge says “there are a lot of other things you can do from an engineering standpoint.” Cities can reduce the number of lanes, change the parking situation, create wider bike paths, and so on. It’s more expensive, but unlike changing the number on a sign, it’s effective.\n\nRaising speed limits up to the speed of traffic can seem like surrendering to fast, unsafe driving. But it would actually accomplish the opposite. If advocates like Megge are right, following the 85th percentile rule would make roads safer, and it would also mean taking speed limits seriously.\n\nIn its 1992 report, the US Department of Transportation cautioned, “Arbitrary, unrealistic, and nonuniform speed limits have created a socially acceptable disregard for speed limits.” Lieutenant Megge has worked on roads with a compliance rate of nearly 0%, and a common complaint among those given traffic citations is that they were speeding no more than anyone else. With higher speed limits, Megge says, police officers could focus their resources on what really matters: drunk drivers, people who don’t wear seat belts, drivers who run red lights, and, most importantly, the smaller number of drivers who actually speed at an unreasonable rate.\n\nIt seems counterintuitive, but it’s a formula Americans should love: Raise speed limits, make roads safer.\n\nThis post originally appeared at Priceonomics.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1493639592",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.606406Z"
}