{
  "id": "4ada7207aaf34c9cb6dd5eeeed0e79e5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/world/2017/1/28/14424940/trump-refugee-ban-muslims-islamophobia",
      "Title": "Trump says his refugee ban is about protecting America. It's really about Islamophobia. Vox - All",
      "Selection": "President Trump’s recent decision to temporarily ban people from seven Muslim-majority countries, along with all refugees, is billed as religion neutral. It’s not a Muslim ban, the argument goes, because it blocks people of all religions — as long as they’re a refugee or from one of the seven countries.\n\nBut it’s not so simple.\n\nIf you take a close look at Trump’s executive order, you see that it contains a major loophole — an exemption from its ban on refugee entry to the United States for “religious minorities” being persecuted by their governments. Who’s going to qualify for these exemptions? A lot of Christians — according to Trump himself. Here’s what he said in a Friday interview with the Christian Broadcasting Network’s David Brody:\n\nBRODY: Persecuted Christians, we’ve talked about this, the refugees overseas. The refugee program, or the refugee changes you’re looking to make. As it relates to persecuted Christians, do you see them as kind of a priority here?\n\nTRUMP: Yes.\n\nBRODY: You do?\n\nTRUMP: They’ve been horribly treated. Do you know if you were a Christian in Syria it was impossible, at least very tough to get into the United States? If you were a Muslim you could come in, but if you were a Christian, it was almost impossible and the reason that was so unfair, everybody was persecuted in all fairness, but they were chopping off the heads of everybody but more so the Christians. And I thought it was very, very unfair. So we are going to help them.\n\nTrump’s executive order may not officially set up a religious test for admission. But the president’s comments make clear that this is, in fact, the intent. It’s not an accident that Trump singled out seven Muslim-majority countries for his blanket bans on immigration.\n\nThere is no good justification for this policy. Trump’s stated one, fighting terrorism, collapses under the slightest scrutiny. No, I’m afraid there’s only one real reason for enacting policies that disproportionately block Muslims from entering the United States — bigotry.\n\nThis is Islamophobia\n\nThe text of Trump’s executive order never uses the words “Islam” or “Muslim.” Perhaps that’s for legal reasons. But it’s so full of code words that it’s impossible to mistake the intent.\n\n“In order to protect Americans, the United States must ensure that those admitted to this country do not bear hostile attitudes toward it and its founding principles,” the order says. “The United States cannot, and should not, admit those who do not support the Constitution, or those who would place violent ideologies over American law.”\n\nWhich “violent ideologies” are those? Surely it’s not white nationalism — the executive order doesn’t ban Scandinavian skinheads from entering the United States. Instead, it bars anyone and everyone from Iraq, Iran, Syria, Yemen, Lebanon, Somalia, Sudan, and Libya, making clear that the theory behind this order is that Muslims, specifically foreign-born Muslims, are seen as an especial kind of threat of violent extremism.\n\nThis is a dubious theory. Since 9/11, home-grown white supremacists and similar extremists have killed more Americans in the US than all Islamic extremists, American or non-American, put together. It seems that, if your goal is saving lives and stopping extremism, it makes more sense to look at home than singling out a group of immigrants who come, disproportionately, from one religious group.\n\nBut let’s game it out, on Trump’s terms. Is banning a large swath of Muslim immigrants a good way to reduce the terrorist threat?\n\nAgain, the answer is no. No perpetrator of a major terrorist attack in the United States has hailed from a country on Trump’s list. And even if you include the death toll from 9/11, the overall threat level from immigrants is really low. A recent study from the Cato Institute’s Alex Nowrasteh found that an American’s odds of being killed by an immigrant terrorist of any faith are one in 3.6 million. The odds of being killed by a refugee specifically are even higher: One in 3.6 billion.\n\nYou’re more likely to be killed by your own clothes than an immigrant terrorist.\n\nAnd if the justification were actually security, then Trump’s “religious persecution” exemption wouldn’t make a lick of sense. There is no way for the US government to tell if, say, a Syrian refugee is actually a Christian — it’s not the kind of thing you can prove easily. The Syrian ISIS operatives that Trump is so concerned about could simply say there were Christian — and who’s to say they’re wrong?\n\nThe only justification for this provision, instead, is political.\n\n“Evangelical Christians have long been concerned about the persecution of Christians in the Middle East; they’re also the group in the Republican coalition that puts the highest value on welcoming refugees,” my colleague Dara Lind explains. “The ‘religious-minority’ loophole gives an ally of the Trump administration — one that might have objected vociferously to this move — something it wants.”\n\nThat’s all well and good. But it lays bare the actual logic behind the Trump order, which is bigotry. Trump thinks that Muslims pose a threat to the United States, because they are more likely to join a terrorist group. He’s said as much in the past, calling religious profiling of Muslims by police “common sense.” That means that, from Trump’s point of view, having fewer Muslims in the country makes sense.\n\nFrom this point of view, the executive order makes sense. It will, in fact, limit the number of Muslims in the United States — tens of thousands of Muslims come in every year as refugees. Many people come from the seven Muslim-majority countries that Trump targets as students or tourists.\n\nSo while the executive order makes very little sense as a counterterrorism policy, no matter how you slice it, it makes perfect sense as a kind of Muslim Exclusion Act. Sure, it doesn’t end Muslim immigration — most Muslim-majority countries aren’t targeted. But the policy is transparently targeted at reducing Muslim immigration specifically. It’s bigoted because it disproportionately affects Muslims, not because it affects every Muslim.\n\nThat’s certainly how advocacy and human rights groups see it.\n\n“President Trump has cloaked what is a discriminatory ban against nationals of Muslim countries under the banner of national security,\" Greg Chen, director of advocacy at the American Immigration Lawyers Association, told Reuters.\n\nThis shouldn’t surprise anyone. Donald Trump is the same man who once called for a “a total and complete shutdown of Muslims entering the United States.” He never retracted this policy idea or apologized for it. He simply modified it to be more politically palatable and legally workable.\n\nThe current executive order is the result of that process. It’s a kind of Muslim-ban lite, dressed up in non-religious language to avoid legal challenges and political blowback. Trump and his team is counting on the public to be tricked, to limit the backlash against turning Islamophobia into the official guiding light of American immigration policy.\n\nDon’t be fooled.",
      "Folder": "Feedly",
      "Timestamp": "1485635039",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.720105Z"
}