{
  "id": "4d69194249d34f43a5b32c89bbd99f8b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/19711-this-company-wants-to-hack-your-ikea-kitchen-affordably",
      "Title": "This Company Wants to Hack Your IKEA Kitchen (Affordably) Food52",
      "Selection": "Last month, two London-based designers, Tim Deacon and Adam Vergette, launched Plykea. It’s a startup committed to making bespoke plywood worktops, drawer fronts, cover panels, spacer panels, and doors that adapt themselves naturally to IKEA’s wildly popular METOD kitchen line.\n\nPhoto by Plykea\n\nPlykea grew out of the men's mutual realization that there was no centralized node committed to simplifying a process that many homeowners tried to do on their own: to enliven their IKEA kitchens with a wider, more aesthetically-enticing array of materials than the particleboard offered to them. The two often found that re-outfitting IKEA's METOD line with new, birch plywood fronts was unsettlingly expensive, a byproduct of this decentralization.\n\nSo the two teamed up to offer a solution to other homeowners suffering from this same predicament of trying to make their IKEA kitchens feel more personal without totaling their wallets. Both are pretty high-profile designers—Diacon is a co-founder of design agency Normally, while Vergette is an alum of furniture company Vitsoe—and they settled on a simple, obvious name, a portmanteau of plywood and IKEA.\n\nPhotos by Plykea\n\nI’m afraid that Plykea only ships within the United Kingdom for now, but they’re a mere month old. They’re hoping to expand to continental Europe and, eventually, the United States. Bummer! It’s a resource I imagine many people around the world could use. Let’s hope it lasts.\n\nIn the meantime, distract yourself with never-ending permutations of the Frakta tote.\n\nLearn more about Plykea here.",
      "Folder": "Feedly",
      "Timestamp": "1495147426",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.675032Z"
}