{
  "id": "4e0840936dda48fc90bdc10293b2ebad",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/07/coolest-rooftop-bars-in-america/",
      "Title": "10 Coolest Rooftop Bars in America The Points Guy",
      "Selection": "Few things scream summertime like cocktails al fresco. Even better: cocktails al fresco with a bird’s eye view of the people and city that surround you. From foosball tables and fire pits in Dallas to a lively mortuary in Denver, here are 10 of our favorite rooftop bars in America.\n\n1. Sugar — Miami\n\nGiven its subtropical climate, there’s never a bad time to enjoy a drink outdoors in Miami. But the experience is particularly sweet at Sugar, the garden-style hideaway that’s located on the 40th floor of the EAST, Miami Hotel at Brickell City Centre, which offers stunning views of Biscayne Bay. Owned by the Hong Kong-based Swire Properties, the hotel and its beloved rooftop bar pay tribute to the brand’s Asian roots with a unique menu of cocktails, including Lychee Blossom (made of vodka, sake and lychee) and A Night in Hong Kong (made of Absolut Elyx, Prosecco, jackfruit and lemon). A rotating lineup of both international and local DJs make Sugar the kind of place where you’ll want to plant and stay awhile.\n\nImage courtesy of Sugar.\n2. Frolik Kitchen + Cocktails — Seattle\n\nThough at first glance its vibe is sleek and sexy, with its LED-lit bar and glass-walled fireplace, Frolik, located on the fifth floor of Seattle’s Motif Hotel, has got a playful side, too — you’ll find ping pong tables and shuffleboard courts on the patio area. The drinks also put a fun twist on classic cocktails, like the Pear Ginger Mule (with Absolut pear, ginger liqueur, lemon and Nundaberg ginger beer) or the Orange You Old Fashioned (with Bulleit bourbon, bitters, Solerno blood orange liqueur and soda water).\n\nImage courtesy of Frolik Kitchen + Cocktails’ Facebook page.\n3. Gallow Green — New York City\n\nMake your way straight to the rooftop of Chelsea’s (non-hotel) McKittrick Hotel, home to the interactive theater experience known as Sleep No More, and you’ll swear that you’re not in Manhattan anymore. This is where you’ll find Gallow Green, a verdant rooftop bar and restaurant where twinkling fairy lights and greenery as far as the eye can see redefine the phrase “urban jungle.” Pledge your patronage by sipping on a signature Sleep No More, a Mezcal cocktail with pineapple bitters, coconut soda and lime — the perfect antidote to the dog days of summer in the city.\n\nImage courtesy of The McKittrick Hotel’s Facebook page.\n4. Bell Tower Bar — Santa Fe\n\nWhen you’re done browsing the markets and charming shops at Santa Fe Plaza — which has marked the city’s downtown area for more than 400 years — make your way up to the Bell Tower Bar at the luxurious La Fonda on the Plaza, the only hotel on the Plaza itself. Situated high above the city, there’s never a bad time to pop in for a drink at this bar which, as the name suggests, is located in a former belfry. But if you want to see something truly remarkable, grab a seat in the early evening so you can gaze out over the city’s adobe-style rooftops, take in the striking views of the Jemez Mountains and see one of the country’s most striking sunsets, all with a Bell Ringer — a spicy margarita made with fresh jalapeño — in your hand.\n\nImage courtesy of Bell Tower Bar.\n5. SODA Bar — Dallas\n\n“Fun” is the first word that comes to mind when describing a night at SODA Bar, the gem of a bar atop the hip NYLO Dallas South Side hotel. In addition to panoramic views of the Big D skyline, there’s plenty to keep any fun-loving reveler entertained in this retro-styled space, including an infinity pool, foosball tables, an outdoor fire pit and a cozy area that begs to be lounged in. The drinks, too, are nostalgic, like the Cedars Apple Pie (Stella Artois Cidre and cinnamon whiskey) and the Thin Mint (Jameson with Rumplemintz and Godiva White Chocolate liqueur).\n\nImage courtesy of NYLO Dallas South Side’s Facebook page.\n6. The J. Parker — Chicago\n\nThere’s a lot of competition for Chicago’s best rooftop bar; both Cindy’s and I|O Godfrey each have their own distinct charms. But we love The J. Parker, which sits atop Lincoln Park’s Hotel Lincoln, and not just because of its fabulous Windy City views, though it’s certainly got them. We also love that it’s an indoor-outdoor setup with plenty of seating (room for about 200 people altogether), and that its retractable roof makes it a year-round destination. But mostly we love that the bar endeavors to offer its patrons a trip around the world with a lineup of cocktails inspired by every corner of the globe, from Spain (the Vino del Sol is a vodka cocktail with pear liqueur, passionfruit, honeydew, triple sec and lemon) to the American South (the Southern Belle is a delicate blend of bourbon, black tea, peach and lemon).\n\nImage courtesy of The J. Parker’s Facebook page.\n7. Mama Shelter — Los Angeles\n\nLos Angeles might be known as a place where its movers and shakers are always looking for the next big thing, but the rooftop bar at Mama Shelter — a Thierry Gaugain-designed boutique hotel in the heart of Hollywood — seems immune to passing trends. In fact, a single visit to the rooftop bar could let you set your sights on many of the city’s most iconic attractions, including the famed Hollywood sign. Yet there’s nothing pretentious or showy about the space; with its rainbow-colored décor and simple menu of comfort food staples like Mama’s meatballs, you may never want to leave. The space keeps its matriarchal theme going with its mom-meets-Hollywood-themed cocktail menu, which includes drinks like How I Met Your Mother (vodka, Aperol, red grapes, mint, lemon and wheat beer) and Throw Momma From the Train (gin, Aperol, lemon and Yellow Chartreuse).\n\nImage courtesy of Mama Shelter Los Angeles’ Facebook page.\n8. Linger — Denver\n\nGiven how lively Linger is, you’d probably never know it was once a mortuary — at least if it weren’t for the huge sign outside. That’s all just part of the fun at this popular rooftop spot in Denver’s LoHi neighborhood, which serves up a massive selection of wine, local craft beers and cocktails — some of which, like the Corpse Reviver (made with gin, ginger liqueur, Lillet Blanc, lemon, absinthe and activated charcoal) play up the venue’s dearly departed past. But the scene here is far from dead, especially during its weekend Beats & Brunch — trust us when we say you’ll want to make a reservation.\n\nImage courtesy of Linger’s Facebook page.\n9. Departure Restaurant & Lounge — Portland\n\nAsia meets the Pacific Northwest at Departure, a Pan-Asian bar set inside the 15th floor penthouse of Portland’s Nines hotel, which has been drawing throngs of patrons — both locals and visitors alike — for nearly a decade. While the outside patio area isn’t enormous, it’s worth waiting to nab a seat or squeezing into the crowd for the unrivaled views of Portland alone. In addition to a unique array of Asian-inspired handcrafted cocktails — we love the Seoul Spring, made with soju, bamboo syrup and lime — the bar is also home to the city’s largest selection of sake. Drink up!\n\nImage courtesy of Departure.\n10. Assembly — Philadelphia\n\nHigh above the Benjamin Franklin Parkway at the top of The Logan hotel sits one of Philadelphia’s most elegant lounges. Assembly, on the hotel’s ninth floor, delivers a sleek and sexy vibe in the City of Brotherly Love — and a menu to match. It wouldn’t be summer without a frosty glass of frosé, and Assembly serves up plenty of them. It also shakes up a mix of classic cocktails, like a Pimm’s Cup or Aperol Spritz, and turns summer’s favorite flavors into memorable libations, like the Basil Watermelon Lemon Drop. If you’re hungry, there’s an impressive menu of small plates, like Honduran Fire and Ice Lobster — Maine lobster prepared with coconut milk, fresh ginger, red jalapeño and fried plantains — and a tequila-lime cured salmon ceviche with smoked pineapple, red onion, cilantro and jalapeño. We’ll have one of each, please.\n\nImage courtesy of Assembly.\nWhat are some of your favorite bars in the US? Sound off, below.\n\nFeatured image courtesy of EAST, Miami’s Facebook page.\n",
      "Folder": "Feedly",
      "Timestamp": "1500221374",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.573529Z"
}