{
  "id": "4e3ded7d97d04f7baa56555530edd6d7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/policy-and-politics/2016/11/11/13593254/president-donald-trump-administration-cabinet-gop-nevertrump",
      "Title": "They publicly denounced him. Now NeverTrumpers want jobs in his White House. Vox - All",
      "Selection": "During the 2016 presidential campaign, former Mitt Romney advisor Bryan McGrath helped draft an open letter from 50 Republican foreign policy experts slamming Donald Trump for being “hateful,” “fundamentally dishonest,” overly friendly towards dictators like Vladimir Putin, and possessing a worldview that is “wildly inconsistent and unmoored in principle.”\n\n“Mr. Trump’s own statements lead us to conclude that as president, he would use the authority of his office to act in ways that make America less safe, and which would diminish our standing in the world,” McGrath and his colleagues wrote in their March 2016 letter. “We commit ourselves to working energetically to prevent the election of someone so utterly unfitted to the office.”\n\nEight months later, McGrath has a different message for the president-elect and his team: if they want him in the Trump administration, he’d be open to coming on board.\n\n“I never believed that signing that letter meant you were signing some sort of non-compete clause,” he told me in an interview. “If they called, I would take it very seriously. He’s the president, and that really does change everything.”\n\nMcGrath isn’t alone. In the wake of Donald Trump’s stunning upset Tuesday, the GOP’s “NeverTrumpers” are confronting a question they never thought they’d have to answer: stick to their principles and stay out of government at the risk of seeing key jobs go to less qualified people, or swallow their distaste for Trump and join his administration to try to ensure the country doesn’t go off of the rails (and to advance their own careers).\n\nIt’s a tough choice. In the days since the election, several of those who came out against the GOP nominee during the campaign have privately told me that they remain just as concerned about President-elect Trump’s temperament and policy ideas, particularly when it comes to potentially abandoning NATO allies and leaving Japan and South Korea to stand alone against North Korea and an increasingly assertive China.\n\nSome NeverTrumpers, including Eric Edelman, who held a senior Pentagon post under George W. Bush, have told me that they’ll stick to their guns and stay out of a Trump administration even if asked to serve. But that appears to be a minority view: others, like McGrath, say the stakes are too high, and the issues too complex, to stay on the sidelines.\n\nThat decision can boil down to careerism; turning down a job offer now would mean spending at least the next four years — and possibly more, if Trump wins reelection — out of the kind of executive branch positions that can lead to more powerful, and more lucrative, jobs in the future. For some, it’s simple patriotism; if the president of the country you love asks for your help, you’re duty-bound to provide it. And for some it’s a mixture of the two.\n\nThe upshot is that you should expect to see many Republicans who had bashed Trump when he was a candidate agree to serve under him now that he’s president. And that is a very, very good thing.\n\nThe case for NeverTrumpers becoming Trumpers\n\nIn March, Richard Kohn, an expert on civil-military relations at the University of North Carolina, co-signed a letter lambasting Trump for saying he would order the military to kill the family members of terrorists and torture suspected militants, both of which would constitute war crimes. If a President Trump told the Pentagon to carry out those measures, the letter argued, “the US military will be obliged to refuse the orders.”\n\nWith President-elect Trump just weeks away from moving into the White House, Kohn is now calling on Republican national security experts — including those who publicly opposed Trump’s candidacy — to join the new administration and try to keep it from carrying out some of candidate Trump’s worst impulses.\n\n“A president as seriously deficient in knowledge, experience and temperament as Trump is going to need a lot of help, and he will need it from the A-Team,” Kohn wrote in the Washington Post Wednesday. ‘‘Given his demagoguery, inconsistency and changeability, Trump lacks a fixed agenda. He’s all style, no substance — a tabula rasa.”\n\nThat, Kohn argues, is precisely the reason GOP national security veterans need to climb aboard.\n\nYou can suggest generals and admirals for the different commands and let Trump know whose advice to heed in the many ticklish (and dangerous) situations sure to arise during his term. You can warn him when a given comment or idea will tempt or deter an adversary, reassure or unhinge an ally, strengthen or weaken our war-making capacity. You will know how to craft the short memos needed to get his attention and which perspectives will need to be added to the policy discussions that will be ongoing in his administration. You might even prevent a financial as well as a national security crisis.\n\nEliot Cohen, a State Department official in the Bush administration who worked with McGrath to organize the anti-Trump letter, also thinks GOP national security experts who may have once opposed Trump should join the new administration because of the complexity of the issues facing the new president and the relatively small universe of conservative foreign policy and national security experts equipped to help Trump handle them.\n\n“The government needs to be staffed, and there are finite number of people with the skills capable of doing these jobs,” he told me in an interview. “Your oath would be to the Constitution, not to a single person.”\n\nYet Cohen is under no illusions that Trump will somehow miraculously shed the positions, from embracing Putin to questioning America’s commitments to its allies around the globe, that led so many Republicans to shun him in the first place. Anyone willing to enter the Trump administration, Cohen said, should be just as willing to leave it.\n\n“Have a signed, undated letter of resignation in your office desk drawer in case you’re asked to do something you’re not willing to do,” he said. “Be ready to walk away.”\n\nWho Trump names to run top agencies matters — a lot\n\nForeign policy is where presidents are freest to act without fear of Congressional or judicial meddling. It’s also where Trump has the least experience, has staked out the most controversial positions, and runs the biggest risks of accidentally stumbling into a military conflict or making statements that make one more likely.\n\nThat means the people he picks to run the Pentagon, State Department, intelligence community, and Department of Homeland Security will be even more important than for normal president.\n\nTapping a respected and experienced defense expert like former Bush national security advisor Stephen Hadley, for example, would send one type of message about the way Trump wants to approach the world; getting the congressional waiver needed to tap the recently-retired Lt. Gen. Mike Flynn, who hasn't been out of the military long enough to take the defense post and who many in the Pentagon see as basically unhinged, would send quite another.\n\nHadley is an old-school Republican realist who is cautious about the use of force and strongly supportive of international alliances; Flynn is a flamethrower whose new book says ISIS is committed to conquering the United States “and drinking our blood.” It's possible that the Republican-held Senate might block Flynn or other of Trump’s more unconventional or outlandish picks, but it's not at all clear that lawmakers would want to take on a newly-elected president from their own party.\n\nMembers of the NeverTrumper movement would definitely be out of the running for those top jobs. But at least some of those who opposed Trump’s during the presidential race could be approached for the hundreds of senior- and mid-level posts at the Pentagon, State Department, and other executive branch agencies that the new administration will need to fill quickly.\n\nThose aren’t jobs that the general public thinks much about, but they’re vital to the smooth functioning of the government — and to helping subtly tip the balance inside the administration towards or away from specific policies.\n\nEdelman, who co-signed one of the anti-Trump letters, say some younger Republicans who were quietly disdainful of Trump during the campaign are now asking him to help put them in touch with people on the new president’s transition team. His advice to each of them: search your soul, and then look at who Trump has appointed to the top jobs.\n\n“If Trump picks Hadley for the Pentagon, a lot people will think, ‘That guy is qualified and sane; I can go work for him,’” Edelman said, noting that Senate Foreign Relations Committee Chairman Bob Corker, an early Trump supporter briefly under consideration as the mogul’s vice-presidential pick, would be seen in much the same way if he was put in charge of the State Department. “But if it’s suddenly Secretary of State Newt Gingrich, there are a lot of people who may think, ‘No, thank you, I don’t want any part of that.’”\n\nThere are only so many Republican foreign policy experts out there, and the Trump team might decide that their need to fill vital posts with competent people means opening the door to some who openly or privately opposed Trump’s candidacy.\n\n“These people don’t grow on trees,” McGrath says. “The Trump team may find themselves saying, ‘We get it, the campaign is over, we need talented people and it doesn’t matter if they signed a letter.’”\n\nThat would be the rational move, but it's not necessarily the one the Trump team would make. Trump values loyalty and fealty above all else, and has made clear that he plans to reward those endorsed him early with plum posts while sidelining those who opposed him or seemed insufficiently committed to his candidacy. Trump and his aides have been open in their disdain for many of the signatories on the various anti-Trump letters.\n\n“They didn’t just say ‘I’d prefer not to,’ they attacked Mr. Trump in ways that are close to unforgivable,\" Michael Pillsbury, a Pentagon consultant working as an adviser to Trump’s transition team, told Bloomberg.\n\nThe new president has already said that he relies mainly on his own judgement and knows more about defending the country and fighting ISIS than the nation's generals. That means he may decide that he’d rather fill lower-level jobs with people he deems loyal and sympathetic to his idiosyncratic worldview, not those with the experience that might leave them better able to take the jobs. NeverTrumpers may be making peace with the election results and hoping to join Team Trump. It's not clear they'll be wanted.\n",
      "Folder": "Feedly",
      "Timestamp": "1478903953",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.755399Z"
}