{
  "id": "4f72b4b171f34b2da4dd99b4ee29d514",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/875499/quartzs-most-powerful-personal-essays-from-2016/",
      "Title": "Quartz’s most powerful personal essays from 2016 Quartz",
      "Selection": "2016 was a year few of us will ever forget. But while many will remember it as a year of challenge and heartbreak, there were moments of celebration and introspection as well. This range of human emotion was reflected in Quartz’s Ideas essays over the past 12 months well, many of which expressed frustration and sadness—as well as hope, self-examination, and even joy.\n\nThe Ideas section of Quartz has published many, many personal accounts over the past 12 months so a top 10 list was essentially impossible. Here, in no particular order, are some of the pieces that resonated the most with us this past year.\n\nCraigslist confessional: “One look at me, and people think I’m privileged”\n\nBy Helena Bala\n\n“I let people see what they want—the picture of me that’s easiest to digest. It’s neater than the truth. There’s so much criticism directed at millennials nowadays that any whisper of a complaint draws out mass accusations of entitlement—even where it doesn’t exist. It’s all about the bootstraps stories and the easy narratives of people who struggled but then they just pulled themselves together and made it.”\n\nI won $68,000 on daytime TV and learned three things about controlling high-stress situations\n\nBy Molly Rubin\n\n“I didn’t have a cheat sheet. I couldn’t really change the odds. But just knowing the odds gave me the confidence I needed to perform well under pressure. Because I had the tools to make an informed decision, the game didn’t feel so random anymore.”\n\nDear America: What does justice look like for black people in a land that never loved us?\n\nBy Reniqua Allen\n\n“America, you bastard. You are an idea, a system that we now see was always built on deception, theft, destruction, violence, slavery, and rape. You tout supremacy and exceptionalism, but your embrace of privilege, patriarchy, and whiteness proves otherwise. It proves you’re no better than the rest.”\n\nDelivering balloons to funeral homes made me care about humanity more than my millennial side hustle\n\nBy Michael Rogan\n\n“I’d answered the Craigslist ad thinking I’d be working in a Norman Rockwell painting, handing bright fun to smiling kids all day. I would have been more apprehensive had I known I’d be working 10-hour days transporting these fragile balls of panic all over Manhattan.”\n\nI went to Guantanamo Bay to watch the Khalid Sheikh Mohammad hearing, and what I saw shocked me\n\nBy Maggie Cleary \n\n“Guantanamo Bay is a panoply of contradictions. It is military base representing freedom and justice that is situated on a less-than-welcoming communist island. Now it is an island lost in time, perched in the recesses of the American imagination. In one afternoon you can drive by Camp X-Ray, where the detainees were first brought after they were captured, and then swing by a gift store and pick up t-shirts, shot glasses, and a stuffed iguana.”\n\nTrying to scare women away from traveling alone won’t keep them safe\n\nBy Jessa Crispin\n\n“There’s still a large part of our culture that believes women should stay at home where they will be ‘safe.’ The road, the world–those are the danger zones. We hear this so often that we start to believe it, and we behave accordingly. When I head off on another solo trip, it’s often my married friends who clutch my wrist and tell me with a slightly anxious edge, ‘Stay safe!’ I often want to say to them, ‘Yeah. You too.'”\n\nMy boyfriend insisted a gun would keep us “safer” up until the day he shot me in the face\n\nBy Courtney Weaver\n\n“Getting shot was the most embarrassing thing that ever happened to me. An intimate relationship is private. Suddenly, mine was open to public scrutiny. I felt shame because secretly I still struggled with my romantic feelings—they didn’t just vanish after he left me for dead. I still wrestle with that.”\n\nA lot of women don’t enjoy hookup culture—so why do we force ourselves to participate?\n\nBy Leah Fessler\n\n“For many women, there’s nothing liberating about emotionless, non-committal sex. The young women I spoke with were taking part in hookup culture because they thought that was what guys wanted, or because they hoped a casual encounter would be a stepping stone to commitment. In doing this, we actually deny ourselves agency and bolster male dominance, all while convincing ourselves we’re acting like progressive feminists.”\n\nGetting my book rejected 24 times made me realize what American culture gets wrong about failure\n\nBy Bene Cipolla\n\n“What feels most honest, to me, is to consider the possibility that failure is a richer and more intriguing experience than I’ve given it credit for. Perhaps it’s not a stage that I ought to move through as quickly as possible, but a place to hang out for a little while.”\n\nQuitting Twitter helped me learn to be an adult again\n\nBy Haroon Moghul\n\n“Twitter was beginning to make me feel terrible, and yet I kept going back, needing more and more of it to reach the same high. I could sense the damaging compulsion for months; friends, loved ones, and random strangers engaged in various degrees of intervention. But like any addict, I rationalized. Because I needed it.”\n\nI tracked my happiness for a year to get data on how to build a more joyful life\n\nBy Katherine Ellen Foley\n\n“Through the ups and downs of 2016, I made a point of recording every time I felt overwhelmingly happy, confident, and at peace, and what made me feel that way—just a sentence fragment or two and the date. Nothing was too small to make the cut, and I only had one rule: no memories related to romantic relationships. I wanted to intentionally remind myself of all the other fulfilling things in life that aren’t dating. Over Thanksgiving, I sat down, dumped out the contents of the jar, and sorted through my documented happiness.”\n\nWhat training for the New York City marathon taught me about America\n\nBy Annalisa Merelli\n\n“The US has a reputation for positivity. Growing up, my family and I would make fun of American TV shows where the main character inevitably responds to something tragic by whispering: “It’s gonna be OK.” No, it’s not! Whatever awful thing that just prompted that reassurance is not going to go away. Life is sorrow—and Europeans know that. Living in America, on the other hand, means being exposed to serious doses of optimism.”\n\nFive years after I saw my friends die for freedom in Syria, the world has given up\n\nBy Loubna Mrie\n\n“I am just one of millions of Syrians who have witnessed death. I spent most of my early twenties photographing the front lines. Each time I left home, I was not sure if I would return safely. But safety had become the least of my worries, because our faith in the cause was that strong. Five years later I am alive, yes. But I am as angry as I was so many years ago, when I watched the death of a man whose only crime had been to speak against injustice.”\n\nEasy access to guns helped me commit murder. I’ve changed, but the loopholes remain\n\nBy John J. Lennon\n\n“I can’t help but think about what would have happened that night if I hadn’t had access to that gun. Instead, maybe another sequence of events would have unfolded. Perhaps the effects of the Xanax I had taken would have worn off. Perhaps I would have slept on it and felt differently the next day. Perhaps we would have talked it out. Instead, there I was–emotionally empty and angry, and impulsive. Big gun in the trunk. A bit high. It was over in three seconds.”\n\nSid and Nancy and me\n\nBy Euny Hong\n\n“The willingness to die is not something to be advocated, but such willingness is indicative of an unhealthy society. The death wish is very real and very universal. Punk acknowledged this in a way that no music movement—before or since—ever did. I certainly don’t envy Nancy. But one has to marvel at a person so unafraid to admit to entertaining the thought that life is not for everybody.”\n\nHave a different favorite Ideas piece this year? Tell us about it at ideas@qz.com. Or better yet, learn how to write for Quartz Ideas and contribute your own piece in 2017. Best wishes for a Happy New Year!\n",
      "Folder": "Feedly",
      "Timestamp": "1483463329",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.673715Z"
}