{
  "id": "4f8563b54029465b9b5c7467012075d9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/science-and-health/2020/6/23/21299109/covid-19-pandemic-years-potential-life-lost",
      "Title": "“Years of potential life lost” is the most sobering and sad Covid-19 statistic I’ve seen Vox - All",
      "Selection": "Lanee Jackson of Black Lives Matter DC participates in an “Essential, Not Expendable” demonstration in Washington, DC, on April 27. | Chip Somodevilla/Getty Images\n\nBlack Americans have lost 45,777 years of life before age 65 due to Covid-19. White Americans have lost 33,446 years.\n\nMore than 120,000 people in the United States have died of Covid-19.\n\nIt’s an enormous number and, quite frankly, a failure of our national response, and of our leadership. But that number does not seem to be enough to inspire more politicians in states to action, to inspire all Americans to wear masks, to inspire self-sacrifice to save lives.\n\nAnd so we are at a dangerous time in the pandemic. Cases are rising in many states, along with hospitalizations. Deaths have not started rising nationally yet, but researchers fear they’re coming: It can take, on average, 17.8 days from the start of symptoms to a Covid-19 death. America needs a wake-up call to this endless disaster, and fast.\n\nThe death count is almost certainly an undercount. It doesn’t even begin to tell the whole story. Recently, Harvard epidemiologists calculated a Covid-19 statistic that lands like a gut punch. The statistic is “years of potential life lost.” And perhaps it can help shake our collective numbness to the pandemic.\n\nPsychology teaches us it’s too easy to grow numb to mass suffering and death. We need to fight against that instinct when we can. A life lost isn’t just a single number; it’s a trauma with a ripple effect, throughout our communities, and throughout time.\n\nImagining more than 138,000 years of human life lost\n\nCalculating years of potential life lost is somewhat straightforward. The Harvard team looked at death certificate data from people who died of Covid-19 and set a cutoff age, in this case 65.\n\nThey then found all the people who died of documented Covid-19 before reaching this age, and summed up how many years they had left until age 65. This analysis made 65 the cutoff age to try to give a sense of the burden of younger people dying of Covid-19 (though they aren’t dying in rates as high as older people, their loss is still immense). “There’s an arbitrariness,” to the cutoff, Nancy Krieger, a Harvard epidemiologist who co-authored the analysis, says. “But 65 is not arbitrary from a policy standpoint, in terms of benefits, in terms of Social Security, in terms of Medicare. It’s an age that helps also distinguish between people who are of working age still versus not.”\n\nBlack Americans under the age of 65 have lost, collectively, 45,777 years of life, the researchers’ analysis (published in a working paper) found. Hispanics and Latinos lost 48,204.\n\nWhite Americans under age 65 have lost, collectively, 33,446 years of life. Already you can see a clear disparity. White people in the United States greatly outnumber Black people and Hispanics — there are also more deaths among white people overall — but the burden of years life lost among this young group is in these minority communities. (American Indians and Alaska natives lost 1,745 years of life. Asian and Pacific Islanders lost 8,905.)\n\nTallied up, that totals more than 138,000 years of human life lost before age 65. That’s enormous — and still an undercount. Many of these people would have lived to a much older age. Still, this small slice of our national loss is enormous: What is 138,000 years of human life worth?\n\n“You think about people being the dynamic beings that we are, living across space and time,” Krieger says. “And then you have lives that are just pulled out of the picture.”\n\nThat’s a huge loss.\n\n“Think of all people do in a year,” Rhea Boyd, a pediatrician and public health expert, tweeted on Twitter, referencing Krieger’s study. “You work, have babies, get married, make memories. Black and Latinx populations have lost those opportunities more than 45,000 times from COVID alone.”\n\nThink of all people do in a year. You work, have babies, get married, make memories.\n\nBlack and Latinx populations have lost those opportunities more than 45,000 times from COVID alone.\n\nThis racial health inequity has cost Black and Latinx folks an enormous amount.\n\n— Rhea Boyd MD, MPH (@RheaBoydMD) June 16, 2020\n\nAmerica may be growing numb to the pandemic — but it’s never been more critical to act\n\nThere’s a growing sense that America is giving up on the pandemic. Many states have lifted stay-at-home orders without aggressive new mitigation measures in place. And as cases rise in certain states, it’s unclear if governments will take further action to stop the exponential growth.\n\nAs a reporter covering the pandemic, I feel a greater sense of pandemic doom now than in February. In February, we didn’t know what was going to happen, but we were prepared to do something. Now we have a better idea of what will happen, and we’re largely giving up.\n\nIt’s partly understandable. People are tired of stay-at-home orders. People need to work (especially if the government is unwilling to provide expanded support). There’s also been an absence of a strong, nationalized message on the pandemic. The Centers for Disease Control and Prevention has a lot of information for individuals navigating the Covid-19 world, but it gets undermined by the Trump administration, which seems to try to make the issue of mask-wearing into more of a front in the culture wars than a guideline for public health.\n\nBut it’s also understandable in terms of human psychology. There’s a concept called psychic numbing, and it may, in part, explain the apathy and exhaustion many are feeling about the coronavirus pandemic. It means that as the number of victims in a tragedy increases, our empathy, our willingness to help, reliably decreases. This happens even when the number of victims increases from one to two.\n\n“Anything that happens on a large scale seems to require that we use numbers to describe it, and yet numbers are precisely the mode of discourse that, in most cases, leaves audiences numb and messages devoid of meaning,” Paul Slovic, the University of Oregon psychologist who has studied psychic numbing for years, writes.\n\n“Years of life lost” could help cut through the numbing\n\nFor me, the “years of life lost” metric helps cut through the numbing by making these deaths a little less abstract. Think about one year of your life: of the depth and richness of it, of what you can accomplish in it, of how many people you can show your love to during it. Now try to multiply that by 138,000.\n\nThis also runs the risk of becoming another large number. But perhaps its novelty, and its accessibility in terms of applying it to our own lives (we can all imagine a year of life), can help. It also underscores how a single death is a trauma that can ripple out.\n\n“When someone dies, their own death matters enormously,” Krieger says. “But it matters enormously for everyone in that person’s family, friends, and networks. When you strip out someone at a much younger age, there’s just a different dimension to what that burden is.”\n\nNo death occurs in a vacuum. “It’s also all the ripple effects,” Krieger says. The parents who can no longer provide for their kids. The people who can no longer contribute to their communities. “This gives a different view, and I think it’s a very important one about who is being ripped out of society at younger ages.”\n\nA life lost isn’t just a single number — it’s a trauma with a ripple effect, throughout our communities, and throughout time\n\nEven among older people, years of life — years of potential — are being lost. In Italy, researchers found that Covid-19 was killing people around 12 to 14 years before they might have died naturally. Even accounting for age and underlying conditions, the study found, people were dying more than five years sooner than life span estimates would suggest.\n\nOf course, death isn’t the only effect Covid-19 has had on our society. There are plenty of other reasons we need greater action to manage the pandemic. One is the great health burden — all the hospitalizations, the days sick, the lingering effects — on those who fall ill but recover. Also the unknowns: Even asymptomatic cases of Covid-19 may leave a mark on the lungs.\n\nAnother reason is to save our economy. Another is for our mental health. Nationally, around a third of Americans have reported symptoms of anxiety and depression since late April. For comparison, in the first three months of 2019, just 11 percent of Americans reported these symptoms on a similar survey.\n\nDeath “is really important,” Krieger says. “But there’s also when somebody gets sick, or they’re worried about being sick, there’s all the fear that goes with that. There’s the concerns of their loved ones about them. There’s the questions of what the economic implications are for individuals and their households if someone becomes ill.”\n\nThere’s also the unfair burden Covid-19 is placing on Black and minority communities — in terms of health and mortality, but economically too. In the paper, Krieger and her co-authors find Covid-19 mortality is nine times higher in Black communities compared to white people in the 35- to 44-year-old range. “You don’t get relative risks for seven- to ninefold for most things in the US for health inequities,” Krieger says. This is extreme.\n\nAnd a lot more damage can still be done. For the pandemic to simmer down naturally — in a way that will allow life to go back to normal — the population needs to achieve something called herd immunity. For the coronavirus, herd immunity could possibly be achieved when 50 percent of the population is immune. But it could need to be as high as 65 percent.\n\nNo area is anywhere near that figure, even New York City, where at least 17,000 people have died of Covid-19. In late April, it was estimated that 20 percent of the city had been exposed to the coronavirus. Elsewhere, the infection rates are much, much lower.\n\nThere are so many reasons to not be numb to the coronavirus pandemic. As we see case counts rising, we can’t stay complacent. There’s so much more left to lose.\n\nSupport Vox’s explanatory journalism\n\nEvery day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires. Please consider making a contribution to Vox today.\n",
      "Folder": "Feedly",
      "Timestamp": "1592961405",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.316684Z"
}