{
  "id": "4f91c0f5359d463fbfeebad948bc754f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/825554/hm-zara-primark-and-forever-21-one-euromonitor-chart-shows-how-fast-fashion-is-reshaping-the-global-apparel-industry/",
      "Title": "One chart shows how fast fashion is reshaping the global apparel industry Quartz",
      "Selection": "To get a sense of the immense pressure that fast fashion has put on the global apparel and footwear industry, all you need to do is look at this chart. It shows average year-over-year sales growth for a group of fast-fashion leaders, including H&M, Zara, Primark, and Forever 21, compared to the rest of the apparel industry.\n\nThe data comes from a new report by research firm Euromonitor International, called appropriately enough “Fast Fashion in 2016: Industry Disruption and Geographic Dominance.” Fast fashion has far outpaced its competition for years, and according to Euromonitor, its appeal to consumers has already reshaped the apparel business.\n\n“The rapid developments of fast fashion and its infiltration across the world have led to permanent shifts in the global apparel and footwear industry, predominantly impacting pricing and sourcing strategies as traditional players try to maintain momentum in an increasingly competitive landscape,” the report states.\n\nThe fast-fashion model, which runs on frequent deliveries to stores of new clothes with some unbelievably low price tags, has left other retailers, such as Gap, J.Crew, and department stores, playing catch up. Many, including mass brands such as Banana Republic and some designer labels such as Isaac Mizrahi and Halston, are now trying to imitate fast fashion with more frequent deliveries that give customers incentive to come into stores and don’t leave large quantities of unsold clothes waiting to be discounted at the end of the season.\n\nFast fashion has also created a pricing race to the bottom. Clothes keep getting cheaper, and McKinsey warned in a separate report recently that the global culture of disposable fashion it’s driving likely means big trouble for workers and the environment, as growing middle classes in emerging markets buy more clothes.\n\nThese new markets should offer fast fashion further room to expand. In recent years, its growth has slowed as it has saturated Western Europe and the US. But Euromonitor states, “Based on forecast real GDP growth, markets such as India, the Philippines, China and Vietnam present considerable opportunities for continued expansion given rising disposable incomes and growing appetite for international brands.”\n\nWhether or not growth returns to previous levels, fast fashion has already proved immensely profitable, minting some of the richest people on the planet.\n",
      "Folder": "Feedly",
      "Timestamp": "1478131998",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.697479Z"
}