{
  "id": "4fe24832aad542249c105b5767d52903",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/999283/j-crew-president-mickey-drexler-steps-down-and-will-be-replaced-by-james-brett/",
      "Title": "The other shoe has dropped at J.Crew Quartz",
      "Selection": "First, it was Jenna Lyons. In April, J.Crew parted ways with the creative director, who, more than anyone, was responsible for creating the look that defined the brand for over a decade.\n\nNow, Mickey Drexler will step down from his position as CEO, a role he’s held since 2003. He will remain on as chairman, and James Brett, the current president of home-furnishings company West Elm, will take over as chief executive in mid-July.\n\nDrexler and Lyons were a formidable duo, tripling J.Crew’s sales from 2003 to 2013. Together they made J.Crew one of America’s most beloved brands, and earned fans including former first lady Michelle Obama.\n\nThen the magic faded. Sales at stores open for at least a year have been falling for more than two years now. Drexler, speaking to the Wall Street Journal just last month (paywall), said the company had become too “elitist,” giving shoppers the sense that it was a higher-priced brand than it really was. Lyons’s fashion-forward prep had ultimately become too eccentric and expensive for J.Crew’s once-loyal customers. Drexler, for his part, didn’t anticipate how quickly fashion would move in the digital era, and how much price competition there would be from fast fashion.\n\nIn an interview with WWD (paywall), Drexler said it was his decision to step down, and he had been preparing for months. “I am a young, old guy. I have shpilkes,” he said. “I am always in a state of impatience. I have been here for 14 years. I thought it was time to move on and lessen up on the day-to-day. The [succession] plan had been in motion for some time. I told the board a year ago I was ready to step down and move to chairman.”\n\nBrett, Drexler’s successor, was once an executive at Urban Outfitters and Anthropologie, but he’s best known for working a successful turnaround at West Elm, where he sought to bring “personality and soul” back into the design since he became president of the company in 2010. Under his guidance, West Elm’s annual sales increased from around $250 million to about $1 billion, according to financial sources cited by WWD.\n\nDrexler’s 14-year run as J.Crew’s top executive followed his previous job as the CEO at Gap, where he helped revitalize the brand in the 1990s and earned the nickname “merchant prince.” He was and will continue to be widely admired and respected in the retail business.\n\nBrett, meanwhile, will have his work cut out for him once he inherits the many and daunting challenges now faced by J.Crew.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1496713452",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.592463Z"
}