{
  "id": "5033e918c8504f51a1c255a1aff14291",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2018/12/19/18148020/remove-bg-ai-background-foreground-without-photoshop",
      "Title": "This free online tool uses AI to quickly remove the background from images The Verge",
      "Selection": "If you’ve ever needed to quickly remove the background of an image you know it can be  tedious, even with access to software like Photoshop. Well, Remove.bg is a single-purpose website that uses AI to do the hard work for you. Just upload any image and the site will automatically identify any people in it, cut around the foreground, and let you download a PNG of your subject with a transparent background. Easy. \n\nIt’s the latest example of how machine learning techniques that were once cutting-edge are being turned into simple consumer tools. In the case of removing an image’s background, there are already a few open-source algorithms that can handle this particular task. Remove.bg has simply turned them (or something like them) into a free online utility. \n\nOther similar tools include Deepart.io which applies the style of one image (like a painting) to another, and LetsEnhance.io, which uses AI to automatically upscale pictures. \n\nRemove.bg certainly isn’t faultless . Like any magic wand tool, it gets a bit confused when faced with fuzzy boundaries between foreground and background. You can see that in the picture of Elon Musk at the top of the article (check out his missing eye-chunk) and with this picture of Miles Davis lying on a furry bedspread:\n\nBut, it’s certainly robust enough to handle a wide range of pictures, and even though the site claims the tool only works with people, it can handle other subjects, as long as they’re clearly foregrounded:\n\nAnyway. It’s a simple little utility that might be handy to bookmark. It saves time and can produce some pretty fun image macros without any hassle. \n",
      "Folder": "Feedly",
      "Timestamp": "1545239421",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.442149Z"
}