{
  "id": "50a374f7510f413ea0b6c6fa2b2b5b6b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1571524/the-us-college-admissions-scandal-shows-that-parents-overlook-their-kids-best-interests/",
      "Title": "Dear parents It doesn’t matter where your kid goes to college Quartz",
      "Selection": "Today, the US Justice Department charged dozens of parents (including a few celebrities), college coaches, and standardized test administrators in a made-for-TV scheme in which parents paid bribes to help their kids cheat on tests and gain admission to elite universities on sham athletic scholarships.\n\nThe indictment reveals a sorry state of affairs in which parents were willing to fork over tens of thousands of dollars to a college prep company, called the Edge College & Career Network, to finagle a spot for their kids on the tennis team at Georgetown, the water polo team at University of Southern California, or the soccer team at Yale, in spite of the fact that the kids did not play these sports at a high level. Other parents employed the company to help get special treatment when taking college entrance exams, by applying for extra time to complete the tests, or hiring someone else to take them in their stead, or flat-out correcting their answers after the fact.\n\nIt’s hard to know where to start with all the things that are wrong with this. There is some epically bad parenting at work here. These kids’ role models showed them that how you get ahead in life is not hard work, perseverance, or discipline, but lying and cheating. These families clearly have means and privilege—among those indicted are Hollywood actresses Lori Loughlin and Felicity Huffman—but what happens to these kids’ self-esteem, knowing it took a hefty bribe for them to get what others work for?\n\nThe bribes, the cheating, the lying: it’s all for nothing. The prestige of a university does not determine what a student learns, their happiness at school, or how satisfied they are with their lives after graduation. It’s possible that parents willing to lie and cheat don’t care about these things, but chances are they thought their kids needed a high-end education to get ahead in life.\n\nThey were wrong.\n\nA Stanford researcher last year wrote a paper, “A ‘Fit’ Over Rankings: Why College Engagement Matters More Than Selectivity,” that showed better learning was associated with better studying, not the brand name of an institution. Kids who studied the most learned the most; students who put the most effort put into coursework gained a better understanding of their subject and general knowledge; and the more engaged the kids were with coursework, the more curious and creative they became.\n\n“It appears that what students do in college is far more important than the type of institution they attend,” the research concluded.\n\nAnd what about happiness and general life satisfaction? Since 2014, Gallup-Purdue has conducted a survey of college graduates, asking about workplace engagement and personal well-being. The 2014 results included 1,557 associate-degree and 29,560 bachelor’s-degree holders and found no relationship between college selectivity and broad measures of life satisfaction. What seems to matter instead is “what students are doing in college and how they are experiencing it.” The report compiles six college experiences that have an impact on how fulfilled graduates feel later in life:\n\nTaking a course with a professor who makes learning exciting\n\nWorking with professors who care about students professionally\n\nFinding a mentor who encourages students to follow personal goals\n\nWorking on a project across several semesters\n\nParticipating in an internship that applies classroom learning\n\nBeing active in extracurricular activities\n\nLisa Damour, author of Under Pressure: Confronting the Epidemic of Stress and Anxiety in Girls, says that most parents want their kids to grow up to be happy, but they wrongly think that path relies on professional and financial success. Since the future if uncertain, parents focus on grades and test scores, the data closest at hand. She cites research by psychologist Daniel Kanheman that shows adult well-being is driven by high-quality relationships, feeling one’s work has meaning, and feeling one is becoming more skilled in that work.\n\nInstead of pushing kids hard on grades, tests, and the like, Damour says that if you want to push, push on what matters, like fostering meaningful relationships, cultivating interests, and instilling discipline.\n\n“How do they treat the people around them?” she asks. “Do they conduct relationships in ways that they feel good about? And do they get into relationships that seem to be positive for them? Are they able to discover what they can do with their talents that feels important and meaningful to them? Do they have the discipline they need to become increasingly skilled at those things?”\n",
      "Folder": "Feedly",
      "Timestamp": "1552457451",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.417798Z"
}