{
  "id": "514e466cb2f14a15852e307b56e9fb61",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/future-perfect/21348052/mackenzie-bezos-scott-donating-billions-ex-jeff-bezos-amazon",
      "Title": "MacKenzie Scott is donating her billions much faster than her ex Jeff Bezos Vox - All",
      "Selection": "MacKenzie Scott (then Bezos) at an awards ceremony in 2018. | Jörg Carstensen/picture alliance via Getty Images\n\nIn the past year, she’s given away $1.7 billion.\n\nA year ago, Jeff and MacKenzie Bezos set records with the world’s biggest divorce settlement. On July 28, MacKenzie Bezos (now MacKenzie Scott) announced that she’s spent the time since aiming to set a much more inspiring record — for how fast she can give the money away.\n\nWhen the couple divorced in 2019, they were splitting the largest personal fortune in history, estimated at the time at about $145 billion. The couple announced a settlement in April 2019 that left Jeff Bezos 75 percent of his Amazon fortune, while Scott departed the marriage with $35 billion, making her at the time of the announcement the third-richest woman in the world (a recent Forbes ranking now has her at fourth).\n\nRight away, Scott indicated that her approach to philanthropy would be profoundly different from the approach she and Bezos had used as a couple. Jeff Bezos’s forays into philanthropy have been limited. While the wealthiest man in the world, he has not signed the Giving Pledge to eventually donate a significant share of his wealth, and he’s donated a far smaller percentage of it than other ultra-wealthy figures like Bill Gates, Mark Zuckerberg, Warren Buffett, or Mike Bloomberg. When he has given, I’ve criticized his approach for a lack of rigor and clarity.\n\nOne month after the divorce, Scott signed the Giving Pledge that Bezos never did. “I have a disproportionate amount of money to share,” she wrote in her pledge letter. “I won’t wait. And I will keep at it until the safe is empty.” And it seems like she’s been acting on that declaration.\n\nMacKenzie Scott’s deeply unusual approach to philanthropy\n\nA year later, she has published an update, and it’s an astonishing one. In the past year, she has donated $1.7 billion to 116 organizations working in areas of interest to her, from racial justice and LGBTQ equality to climate change and global health.\n\nAll the organizations listed are established nonprofits, selected, Scott says, for their leadership’s “track record of effective management and significant impact in their fields.” The largest area of grants — $586.7 million — went to organizations working on racial equity, an issue where awareness has grown quickly over the past few months amid protests sparked by George Floyd’s killing by Minneapolis police. Other top priorities included economic mobility ($399.5 million), gender equity, public health, and global development (more on these below).\n\nThe total amount — $1.7 billion — is obviously just a fraction of her fortune, but it is deeply unusual for billionaires to give away that much money this quickly, especially without a preexisting organization to do grant research and vetting.\n\nHer methods, too, are unusual. “It was a gift that just fell from the sky,” Jorge Valencia, executive director and CEO of one of those 116 organizations, the Point Foundation, told the Chronicle of Philanthropy. The organization, which offers scholarships to LGBTQ+ students, did not apply for a grant and had no connection to Scott.\n\nAnd while it’s common for philanthropists to give grants that are restricted for a specific purpose, paid out over the course of several years or conditional on various benchmarks for grant success, Scott says she did none of that. “I gave each a contribution and encouraged them to spend it on whatever they believe best serves their efforts. Unless organization leadership requested otherwise, all commitments were paid up front and left unrestricted to provide them with maximum flexibility,” she wrote in her announcement.\n\n“It’s an interesting contrast to the more technocratic giving of the tech billionaires,” Rob Reich, a Stanford philosopher who writes about the role of philanthropy in society, told me.\n\nAnother interesting contrast is the way Scott approached publicizing her giving. The announcement two years ago that Jeff Bezos planned to give $2 billion to education and homelessness charities attracted, Reich says, “fanfare with zero follow-up.” Almost two years later, the website for Bezos’s Day One Fund lists just under $200 million in grants, about 10 percent of the amount initially pledged. Half of the initial pledge was for education, and no progress in this area has been officially announced yet (though Bezos has posted updates on Instagram).\n\nIn 2020, Bezos announced on Instagram a planned $10 billion in grants to fight climate change through what he called the Bezos Earth Fund. The Bezos Earth Fund has no website. Bezos’s original Instagram post says that grants will start this summer, though they appear to have not yet started.\n\nAll this is not unusual (and it doesn’t suggest that Bezos won’t eventually meet his commitments; he has paid out other grants he’s made, including $100 million to Feeding America for coronavirus relief earlier this year). Typically, philanthropic announcements get widespread coverage even if they are substantially in advance of the actual disbursement of money. And in some cases, money is disbursed to donor-advised funds or other instruments, which means they may take even longer to reach recipients. There is nothing wrong with taking your time to make grants if that means the grants do more good — but it’s easy for delays to mean that givers enjoy all the positive publicity of a major grant long before anyone’s life is improved by it.\n\nScott, by announcing her gifts only after she’d already disbursed all the money, avoids that pitfall — and could offer a glimpse of a new model of how to give, one that is focused on moving money quickly, not attaching any requirements or conditions, and shifting the power dynamics of the philanthropy world.\n\nDoes this model of giving work?\n\nScott’s fast, massive disbursements and other recent experiments in quickly moving large sums of money to where they are needed, with much less review and fewer application steps than in traditional grantmaking, “weakens the case that giving away $1.7 billion is difficult,” Reich said. “There remains a question about whether it’s difficult to do well.”\n\nGiving away money very quickly with a minimal process does have some disadvantages.\n\nMany charitable interventions don’t work, and the differences between the best organizations and the average organizations can be quite large. It’s reasonable that many funders don’t want to take that chance.\n\nBut there’s a good argument that at least some funders should be happy to make lots of grants, many of which may disappoint them anyway. Vetting often adds lots of overhead, delays, and communication problems for charities; a faster process that gets money where it’s needed sooner can make a big difference. In some specific fields (say, scientific research), studies have shown that all the effort-intensive work to find the “best” grants is fairly arbitrary; researchers don’t agree with each other’s rankings at all. In a case like that, you might as well just get money out the door, with minimal vetting — as Scott has done.\n\nAnd in some areas, like coronavirus relief, getting money to people quickly is really important. If it takes months to make a grant and more months for the money to arrive, it may be too late to help. Scott donated to GiveDirectly, a nonprofit that gives people cash, no strings attached, and which has dramatically expanded its operations this year in order to help people around the world deal with the coronavirus crisis.\n\nScott’s team reached out to GiveDirectly after having already done their research, GiveDirectly’s managing director Joe Huston told me. Very little staff time was tied up in making the donation happen. (The nonprofit tracks how many resources are expended per dollar raised and said that Scott’s gift was one of the lowest-scoring, on that metric, they could remember.) The money arrived in early June, and 95 percent of it was sent out to recipients within 10 days.\n\n“The pandemic is giving donors experience in handing over the reins in philanthropy,” Huston told me, so that help can reach people as fast as it’s needed. “My hope is that when people are just looking to help, they’ll start with that in general.”\n\nThere are other pitfalls to trying to give away money quickly, though Scott avoided many of the biggest ones. Lots of donors making large gifts gravitate toward targets like Stanford, Harvard, or MIT — big research universities with well-staffed donor relations departments that can absorb enormous gifts. (“For the love of God, rich people, stop giving Ivy League colleges money,” my colleague Dylan Matthews wrote after one such mega-gift, and I agree.) Scott donated to several historically Black colleges and universities; in each case, her donation of $20 million to $40 million was the largest single donation in the school’s history.\n\nThe money will help ”lift the financial burden off of deserving students and help make ends meet so they can focus on graduating on time,” Howard University said in a statement. “This pure act of benevolence is clearly a game-changer and it could not have come at a better time,” Hampton president William R. Harvey told the HBCU Digest.\n\nIn general, picking organizations run by people affected firsthand by the injustices Scott targeted was a priority. “On this list, 91 percent of the racial-equity organizations are run by leaders of color, 100 percent of the LGBTQ+ equity organizations are run by LGBTQ+ leaders, and 83 percent of the gender-equity organizations are run by women, bringing lived experience to solutions for imbalanced social systems,” she wrote in her note announcing the gifts.\n\nThat fact might provide a useful lens for evaluating her donations. MacKenzie Scott does not know how to solve racial justice, women’s rights, or LGBTQ+ equality. She just happens to, unlike most of us, be in possession of $35 billion, and so she decided that if she gave much of that money to Black activists and LGBTQ+ activists and women’s activists, probably they would be better suited than she is to figure out how the money could be spent to solve those problems.\n\nThe same theme recurs in Scott’s letter and in nonprofits’ descriptions of her process. There wasn’t very much vetting because Scott does not particularly expect that she’s better at vetting than these organizations are. There weren’t restrictions on the grants because Scott does not particularly believe she’s more suited than the recipients to guess what restrictions would be useful. She is “trusting the leaders of the organizations chosen,” Reich told me, “with a very deliberate eye toward leaders with the lived experience of the work they’re doing.”\n\nThere’s something deeply inspiring about that. I am in favor of philanthropists putting in the work to identify the most effective approaches to social problems and direct their money with precision where it will do the most good, when they have the resources to do that. I think that work is often well worth the effort.\n\n“There’s room for the bigger foundations, the Bill and Melinda Gates Foundation, that kind of heavyweight model,” Huston told me when I asked whether more philanthropists should be imitating Scott. “But I’m glad there’s more examples, like [MacKenzie] Bezos, like Twitter’s Jack Dorsey,” where philanthropists make donation decisions quickly and trust the decision-making to others.\n\nIf you have $35 billion, that fact does not in itself make you qualified to figure out how to fix the world — and if you think that other people are more qualified, you might decide the best plan is to just shovel the money out the door so they can run with it. That seems to be MacKenzie Scott’s approach to philanthropy so far — and a society grappling with the role of billionaires in our world and in our giving should be watching.\n\nSign up for the Future Perfect newsletter and we’ll send you a roundup of ideas and solutions for tackling the world’s biggest challenges — and how to get better at doing good.\n\nSupport Vox’s explanatory journalism\n\nEvery day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires. Please consider making a contribution to Vox today.\n",
      "Folder": "Feedly",
      "Timestamp": "1596332744",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.310163Z"
}