{
  "id": "5156e8c0bd9642d89b4ca47b925fd9c4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2018/7/26/17613844/racial-diversity-poll-twitter-white-people",
      "Title": "American white people really hate being called “white people” Vox - All",
      "Selection": "A few days ago, I came across this rather striking finding from a recent public opinion survey by the Public Religion Research Institute:\n\nIt is striking for a couple of reasons. For one thing, the question is not about illegal immigrants, or even immigrants at all, it’s not about crime, or welfare, or jobs ... it’s just about racial diversity as such. And more Republicans are against it than for it! (So much for “economic anxiety.”) \n\nBut the question is also notable for its unstated premise: that the growing presence of people other than whites in the US (what else could “increased racial diversity” mean in a majority white country?) is a subject of active political debate. It is not taken for granted as constitutive of a multiethnic democracy, but treated as a kind of add-on, an extra feature. “Is it working? Maybe we should roll it back. Let’s discuss.”\n\nI tried to imagine how that question might strike, oh, someone whose grandparents immigrated from Uganda. That person is just as much a citizen as any other American. She did not choose to be black and cannot choose to be some other race. But now she hears that it is, at the very least, an open question whether her very presence — and her choice to have children, to further diversify America — is detrimental to her country. Is it bad to have her around at all, because she’s black? Let’s discuss.\n\nIt must be alienating to feel like one is on probation in one’s own country, that one’s presence is subject to the approval of white people. And it must be a familiar feeling, especially these days, for everyone who is not white (and male).\n\nIt occurred to me that white people rarely if ever experience questions like this, about their very legitimacy. Do they belong? Is having more of them around good for America?\n\nOne thing white people have never experienced is a poll on whether their presence in their own country is intrinsically detrimental.\n— David Roberts (@drvox) July 24, 2018\n\nIn fact, I thought to myself, I bet asking the question at all — not answering it either way, just asking it — would make a lot of white people flip out. Imagine if they saw that on a poll! \n\nSo, as a bit of goofy provocation, I made just such a poll:\n\nDo white people have a positive or negative effect on America?\n— David Roberts (@drvox) July 24, 2018\n\nI should have said “impact,” not “effect,” to mirror the original poll question. (Twitter really needs some kind of edit feature.) It was not the best zinger ever, and probably not a very constructive way to make a point, but whatever, it was only a tweet. I went and walked my dog.\n\nAs you’ve likely predicted, a lot of white people flipped out. \n\nBy the time I got home, the poll had spread into Trump land, the thread was flooded with MAGA tweeters, and white people were being decisively vindicated in the poll. By Wednesday morning, I was the outrage of the day on the entertainment site The Wrap and on a couple of right-wing news sites. \n\nFor reasons that remain somewhat mysterious to me, the MAGA brigade seems to view their victory in my poll — as of closing, 82 percent deem white people’s net impact as positive, so congrats to my fellow white people! — as a grand self-own on my part. Presumably because I cared about this poll, wanted white people to lose, and assumed my followers would send them down to defeat.\n\nThose erroneous assumptions and many more are reflected in the Twitter thread beneath the poll, which I recommend to anyone with a masochistic streak. The words “cuck” and “soy boy” come up a lot, as well as a wide variety of colorful anatomical suggestions.\n\nThe funny thing is, I never said a disparaging word about white people. I only said that, while other groups are accustomed to being discussed and polled and judged, white people aren’t, and they would freak out if they saw a question like the one in the PRRI poll about themselves. \n\nThen they saw one, completely missed the context, and freaked out, right on cue, thus proving my point in real time. But they won my Twitter poll, so ... burn, I guess?\n\nIt’s all pretty silly. In 24 hours, everyone involved will have moved on to being outraged about something else. The only lesson I feel certain about: Twitter is terrible, and no one should ever tweet again, even though we all know we’re going to.\n\nBut maybe there’s a little insight to be gleaned. I do think the reaction illuminates a larger point.\n\n        Shutterstock\n\n“You’re the real racist, and white people rule”\n\nI kept up with the first few hundred responses (there are over a thousand now), and it’s interesting to see what they shared and where they differed.\n\nSubstantively (if you can call it that), there were two basic reactions. One is to say that I’m a racist, or liberals are the real racists, because they keep calling attention to race and dividing people up by race, while conservatives are just trying to be individuals and judge people by the content of their character. It’s the “No puppet! You’re the puppet!” of racism.\n\nThe other kind of response was, to paraphrase: Of course white people are good for America, white people are America, and America, like every other shithole nation white people conquered, would still be a shithole if not for white people.\n\n(I’m not going to pluck out individual tweets and embed them here because I don’t want to drag individuals on Twitter into a public dispute like this; you can read the thread to see if I’m characterizing it accurately.)\n\nThese are mutually contradictory points, of course. “You’re the real racist, and white people rule.” But they are both very familiar in conservative rhetoric and both delivered behind the same aesthetic, using the same keywords, in the same jumbled tone of fury and contempt. \n\nI didn’t answer the question I asked, but asking it was enough to trigger all the same outrage. Why is that?\n\n        Shutterstock\n\nRacial “priming” happens well before racial decline\n\nOn his podcast, Vox’s Ezra Klein recently interviewed Yale psychologist Jennifer Richeson, noting she “has done pioneering work on the way perceptions of demographic threat and change affect people’s political opinions, voting behavior, and ideas about themselves.” \n\nOne of Richeson’s key insights is that reminders of coming demographic decline — the notion that America will soon become a “majority minority” country, with people of color outnumbering whites — not only cause increased hostility toward other racial groups (which might be expected) but also push white people in a conservative direction on seemingly unrelated policy questions like tax rates and oil drilling. \n\nShe also makes the point that the majority-minority narrative is bogus. By the time it is forecast to happen, who-knows-what demographic changes will have taken place, including changes in who gets coded as “white.” Since the idea is wrong and it freaks people out, she reasons, we should probably stop uncritically repeating it.\n\nStill, what recent political evidence seems to show — and my Twitter brouhaha reflects in some small way — is that the effects Richeson found kick in well before news of any demographic apocalypse arrives (if you consider being a plurality rather than a majority apocalyptic).\n\nIndeed, as research on “priming” shows, simply discussing race at all kicks up those effects among the racially dominant group. Or to put it more bluntly, in the US context: White people really don’t like being called white people. They don’t like being reminded that they are white people, part of a group with discernible boundaries, shared interests, and shared responsibilities. \n\nAfter all, one of the benefits of being in the dominant demographic and cultural group is that you are allowed to simply be a person, a blank slate upon which you can write your own individual story. You have no baggage but what you choose.\n\nIn most situations in the US, a woman is a female person. Someone part of a racial minority is a black person or a Latino person, etc. Gay people. Trans people. Immigrant people. All these groups are [adjective] people, people with an asterisk, while a white, heterosexual male is simply a person, as generic as he chooses. His presence is taken for granted; it rarely occurs to anyone to question it. A white man in khakis and a polo shirt can walk into almost any milieu in the US and, even if he’s greeted with hostility, be taken seriously. His legitimacy is assumed. \n\nThe power and privilege that come along with that — being the base model, a person with no asterisk — are invisible to many white men. Simply calling them “white people,” much less questioning the behavior or beliefs of white people, drags that power and privilege into the open.\n\n        Some white men have even been known to rise above their level of competence.\n\n        Timothy A. Clary/AFP/Getty Images\n\nIdentity politics is something only white men have been allowed to avoid\n\n“Identity politics” — dragging around the baggage of one’s identity, being forced constantly to reckon with it, work around the stereotypes and discrimination it attracts, speak for it, represent it — is something that is forced on other groups, not something they choose. Do you think a young black man likes walking into a store knowing he’s already carrying the weight of a million suspicions and expectations, that he has to behave perfectly lest he invoke them? He’d probably like to be thinking about tax policy too, if he didn’t have to worry about getting shot by the cops on his way home. But that worry comes with his identity.\n\nWhite men bridle at the notion of being part of a tribe or engaging in identity politics. (Ahem.) Alone among social groups, they are allowed the illusion that they have only their own bespoke identity, that they are pure freethinkers, citizens, unburdened and uninfluenced by collective baggage (unique and precious “snowflakes,” if you will). \n\nNo one else is allowed to think that — at least not for long, before they are reminded again that they are, in the eyes of their country, little more than their identity, their asterisk. No one else gets to pretend their politics are free of identity.\n\nWhite people do. But simply saying the words “white people” is a direct attack on that illusion. It identifies, i.e., creates (or rather, exposes) an identity, a group with shared characteristics and interests. It raises questions (and doubts) about the group’s standing and power relative to other groups. It illuminates all that hidden baggage. Lots of white people really hate that.\n\nIn politics, we talk about groups all the time — minorities, immigrants, criminals, what have you — and by and large, no one blinks. The only time I get blowback is when I generalize about men or white people (okay, or baby boomers). Suddenly, “lumping people together” becomes a sin. Even among white liberal friends, I’ve noticed that merely saying the words “white people” causes a frisson of discomfort. \n\nIn fact, it’s difficult to think of a US setting in which the words “white people” are received neutrally. The term is always charged somehow, freighted with meaning and potential conflict, vaguely subversive. White people. White people. White people.\n\n        Shutterstock\n\nA shrinking group cannot avoid being reminded it is a group\n\nWhat primes white people is simply the reminder that they are white people — that they are, and will increasingly be, one group of Americans among others, with particular interests, settling differences via democracy. \n\nRight now, the white maleocracy is clinging to power, with disproportionate wealth and representation in Congress relative to its size. And all the while its leaders decry identity politics. They are used to being the default setting, people with no asterisks, no baggage, and they are extremely loath to give that up. \n\nIn fact, they want their America, the America where white dominance is so ubiquitous as to be unremarkable, back. They keep saying so. \n\nAs many have pointed out and this political era has made painfully clear, to a dominant demographic, the loss of privilege feels like persecution. Being just one group among many feels like losing. After all, what good is being white in the US, especially among poor whites, if some third-generation Ugandan immigrant has just as much control over their fate as they have over hers? If a poll asks whether they’re any good for her, rather than the other way around?\n\nFor the dominant group, being judged and asked to justify itself, as so many subaltern groups are judged and asked to justify themselves, feels like an insult. If you doubt that, go read this Twitter thread.\n",
      "Folder": "Feedly",
      "Timestamp": "1532925946",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.486102Z"
}