{
  "id": "53212ed2c22b4c8681d3056ad23eaa63",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/stretch-points-ihg-international/",
      "Title": "Stretch your points The best international IHG properties bookable for 10k points The Points Guy",
      "Selection": "Here’s the link to apply now for the IHG Rewards Club Premier Credit Card with a 125,000-point bonus after you spend $3,000 on purchases in the first three months.\n\nIf you’re the type of traveler who prefers to get the most nights out of your hotel points, this article — and the entire “Stretch Your Points” miniseries — is for you. In recent installments of this series, I’ve presented some low-tier Marriott properties, domestic Hyatt properties, international Hyatt properties, domestic Hilton properties, international Hilton properties and domestic IHG properties where you can stretch your points.\n\nIt’s not a secret that my husband, JT, and I have stayed at a lot of IHG properties since giving up our apartment over two years ago. In fact, we’ve actually stayed at many of the properties described below. So, even more so than the previous installments of this series, the list below isn’t simply a theoretical discussion of IHG’s best international properties that you can book for 10,000 points per night. Instead, it’s a compilation of hotels that we’re likely to visit (or revisit) due to their location and how far our points can take us there.\n\nLet’s continue this miniseries by studying how many nights you can squeeze out of the current 125,000-point sign-up bonus on the IHG Rewards Club Premier Credit Card, as well as look at some international IHG properties where you can stay for just 10,000 points per night.\n\nIn This Post\n\nHow many nights can I get from the bonus?\n\nThe IHG Rewards Club Premier Credit Card currently offers an increased sign-up bonus of 125,000 points after you spend $3,000 on purchases in the first three months. The card provides an anniversary free night that’s valid at properties costing 40,000 points or less, which makes it relatively easy for most cardholders to justify the $89 annual fee. But the card’s other perks, including IHG Platinum Elite status, can also provide significant value. Plus, cardholders get a fourth night free on award stays, which means you can stretch your points even further when you stay for four nights or longer.\n\nRelated: IHG Rewards Club Premier Card credit card review\n\nIHG award nights normally start at 10,000 points per night. So not counting the points earned while meeting the spending requirements to trigger the welcome bonus, you could squeeze 16 nights out of the IHG Premier Card’s 125,000-point bonus if you stay in increments of four nights at 10,000-point properties (aka four nights for 30k points). TPG’s most recent valuation pegs the value of IHG points at 0.5 cents each, so 10,000 points are worth about $50 and the 30,000 points needed for a four-night stay at a 10,000-point property are worth about $150.\n\nAlternatively, you could book select properties from the PointBreaks list for as little as 5,000 points per night. This means you could theoretically squeeze 33 nights out of the IHG Premier Card’s 125,000-point bonus. But, since the properties on the PointBreaks list change every few months and are removed from the list once the PointBreaks allotment for that property is exhausted, this guide only considers properties that normally cost 10,000 points per night.\n\nProperty profiles\n\nIHG currently has 366 10,000-point properties globally and 248 of these properties, or 68%, are outside the U.S. Here’s the breakdown based on brand of the 10,000-point IHG properties located outside the U. S:\n\nBrand\n\nProperty description\n\n10,000-point properties outside the U.S.\n\nPercent of 10,000-point properties outside the U.S.\n\nHoliday Inn Express\n\nHotel that includes breakfast with your room, but doesn’t offer an on-site restaurant\n\n175\n\n71%\n\nHoliday Inn\n\nHotel that provides more services than a Holiday Inn Express but breakfast isn’t usually included in your room rate; sometimes has an on-site restaurant\n\n66\n\n27%\n\nHoliday Inn Express & Suites\n\nLike a Holiday Inn Express, but with suites\n\n3\n\n1%\n\nHoliday Inn & Suites\n\nLike a Holiday Inn, but with suites\n\n3\n\n1%\n\nHoliday Inn Resort\n\nLike a Holiday Inn, but with resort features and amenities\n\n1\n\n",
      "Folder": "Feedly",
      "Timestamp": "1568671148",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.342148Z"
}