{
  "id": "53f51944a57a4723a1b39143d7a1088c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://kottke.org/17/06/if-you-cant-explain-something-in-simple-terms-you-dont-understand-it",
      "Title": "If you can’t explain something in simple terms, you don’t understand it kottke.org",
      "Selection": "In the early 1960s, Richard Feynman gave a series of undergraduate lectures that were collected into a book called the Feynman Lectures on Physics. Absent from the book was a lecture Feynman gave on planetary motion, but a later finding of the notes enabled David Goodstein, a colleague of Feynman’s, to write a book about it: Feynman’s Lost Lecture. From an excerpt of the book published in a 1996 issue of Caltech’s Engineering & Science magazine:\n\nFeynman was a truly great teacher. He prided himself on being able to devise ways to explain even the most profound ideas to beginning students. Once, I said to him, “Dick, explain to me, so that I can understand it, why spin one-half particles obey Fermi-Dirac statistics.” Sizing up his audience perfectly, Feynman said, “I’ll prepare a freshman lecture on it.” But he came back a few days later to say, “I couldn’t do it. I couldn’t reduce it to the freshman level. That means we don’t really understand it.”\n\nJohn Gruber writes the simple explanations are the goal at Apple as well:\n\nEngineers are expected to be able to explain a complex technology or product in simple, easily-understood terms not because the executive needs it explained simply to understand it, but as proof that the engineer understands it completely.\n\nFeynman was well known for simple explanations of scientific concepts that result a in deeper understanding of the subject matter: e.g. see Feynman explaining how fire is stored sunshine, rubber bands, how trains go around curves, and magnets. Critically, he’s also not shy about admitting when he doesn’t understand something…or, alternately, when scientists as a group don’t understand something. There’s the spin anecdote above and of his explanation of magnets, he says:\n\nI really can’t do a good job, any job, of explaining magnetic force in terms of something else you’re more familiar with, because I don’t understand it in terms of anything else you’re more familiar with.\n\nFeynman was also quoted as saying:\n\nI think I can safely say that nobody understands quantum mechanics.\n\nPretty interesting thing to hear from a guy who won a Nobel Prize for explaining quantum mechanics better than anyone ever had before. Even when he died in 1988 at the end of a long and fruitful careeer, a note at the top of his blackboard read:\n\nWhat I cannot create, I do not understand.\n\nTags: Apple   books   David Goodstein   Feynman’s Lost Lecture   John Gruber   physics   Richard Feynman   science   The Feynman Lectures on Physics",
      "Folder": "Feedly",
      "Timestamp": "1497547539",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.586686Z"
}