{
  "id": "54356998d7b84fb5943e0adb5ae5b44c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/14058-cakey-fans-beware-these-brownies-are-practically-fudge",
      "Title": "Cakey Fans Beware These Brownies are Practically Fudge Food52",
      "Selection": "Posie Harwood, who finds the best back-of-the-box recipes in the grocery store, is taking one-bowl brownies to new (excessively frosted) heights.\n\nI've sampled a lot of brownies in my life. Personally, if I were to get philosophical about it, I like a brownie that teeters on the edge of fudge-like. It should just toe the line: A slight cakiness should keep it from being too dense. Rich but not too rich, it should freeze beautifully and make you the star of all potlucks and picnics and birthday parties, forever and always. \n\nThis one-bowl recipe fits the bill exactly. It comes from the back of the Baker's Chocolate box, and it could not be easier. You melt butter and chocolate together, then whisk in the rest of your ingredients. That's it! You don't have to temper chocolate, or clean multiple bowls, or worry about technique.\n\nThe original recipe calls for nuts. I didn't add them because, to be perfectly honest with you, I didn't have any in my kitchen. If you're into that sort of thing, you can toss a cup of chopped nuts into the batter.\n\nMore: Are you a cakey or a fudgy person?\n\nIf you want to get really wild, you could add chocolate chips. Should you? Probably not. We are going to add some frosting soon, and chocolate chips might push us into the territory of true excess. But if you think you can handle it, I trust you. Go forth and douse yourself with chocolate.\n\nThe frosting is delicious. First, you melt butter, buttermilk, and cocoa powder in a saucepan. The buttermilk gives a subtle tang that helps to balance the intense sweetness of the frosting. Then, you transfer the warm mixture to a stand mixer (or large bowl with a hand mixer) and beat it with powdered sugar.\n\nIf the frosting gives you any trouble, here's some advice I gleaned from own mistakes: If your frosting is very thin and liquidy, try sticking the bowl in the refrigerator for 20 minutes to chill it. Colder frosting will whip into a lighter, fluffier texture. If it still looks too thin, add more confectioners' sugar. I suggest starting with 2 cups, but you might need up to 4 cups.\n\nChocolate Buttermilk-Frosted Brownies\n\nAdapted from Baker's Chocolate\n\nMakes one 9- by 13-inch pan\n\nFor the brownies:\n\n4 ounces unsweetened chocolate3/4 cup butter2 cups sugar3 eggs1 teaspoon vanilla extract1 cup flour\n\nFor the frosting:\n\n1/4 cup butter3 tablespoons buttermilk3 tablespoons unsweetened cocoa powder1/2 teaspoon vanilla extract2 to 4 cups confectioners' sugar\n\nSee the full recipe (and save and print it) here.\n\nDo you have a favorite back of the box recipe, or have you heard about a great one? Leave any suggestions in the comments, and I'll try them out and share them here!\n\nPhotos by Posie Harwood\n",
      "Folder": "Feedly",
      "Timestamp": "1442188409",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.870226Z"
}