{
  "id": "558ca4d61b5e4e1db388046ad6d84810",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/2016/10/rebecca-solnit-nonstop-metropolis/",
      "Title": "Nonstop Metropolis’ Stunning Maps Show NYC the Way Locals See It WIRED",
      "Selection": "If you ask any New Yorker, they’ll tell you—their city is the center of the world. And according to the MTA or Google, the Big Apple’s core is somewhere in lower Manhattan. But traditional maps don’t show the locations familiar to the city’s millions of denizens: the corner in Queens where you can overhear Zulu and Jamaican patois, the trucks selling jerk chicken and dirty rice outside Hasidic synagogues in Brooklyn, the Staten Island Ferry that RZA and Ghostface Killah rode to go to grindhouse theaters in Times Square.\n\nIn their new atlas, Nonstop Metropolis, Rebecca Solnit and Joshua Jelly-Schapiro share 26 maps of New York that prioritize bachata over Broadway, phở over pizza. Media and Wall Street may dominate the city’s narrative, but they don’t dominate the city itself. “High-strung, upper-middle-class white people are a minority population in New York,” Solnit says. “The maps cue us into understanding who is here.”\n\nSolnit made her first metropolitan atlas, Infinite City, in 2007, for SFMOMA’s 75th anniversary. The book charted San Francisco with maps like “Monarchs and Queens,” which juxtaposed butterfly migrations with queer public spaces, and “Right Wing of the Dove,” which traced the military presence in the city. After its release, Solnit was surprised she got such a strong reaction to something that was, essentially, a collection of whimsical cartography.\n\n“There’s a way people light up around maps,” she says. “We have this desire for orientation—each promises that you might at least know where you are, in some metaphysical or practical way.”\n\nSolnit believes personal relationships with places have been diminished by technology. “We’ve had a dramatic loss of orientation,” she says. “Even though these maps are made by a digital designer, the book is a celebration of what the analog world gives us.” Smartphone maps show us where to go, but Siri can’t orient us in the same way that landmarks and street fronts do. As Solnit sees it, standing on a street corner and tracing avenues on a fold-out piece of paper offers a uniquely intimate knowledge of a city.\n\nIn addition to San Francisco’s Infinite City and New York’s Nonstop Metropolis, out today, Solnit also made an atlas for New Orleans, 2013’s Unfathomable City. Despite their different coasts and histories, the three locations loom large in the romantic imagination as places where young Americans go to lose and to find themselves. “These cities are generative of people who come out of the closet or become doctors or dancers, but they’re also generative of new ideas about how we live our lives,” says Solnit.\n\nEven though these maps are made by a digital designer, the book is a celebration of what the analog world gives us.\twriter Rebecca Solnit\n\nTo map a place beyond her home region of the Bay Area, Solnit leaned hard on local historians—which was particularly easy in New York City, a place with 8 million people volunteering reasons why their city is the greatest place on Earth. “All the metropolitan jingoism about New York was an extraordinary boon for this project,” says Jelly-Schapiro. “Whatever odd ephemeral knowledge we’re interested in, there’s someone here who’s made a career out of it.” The team behind Nonstop Metropolis consulted a linguist studying endangered languages in Queens, a former employee of the Department of Sanitation, and online star charts from January 26, 1934, the night when the Apollo Theater opened.\n\nThe final outcome includes a diverse array of deeply particular maps. They range from cartographies imagined by a few, like “Mysterious Land of Shaolin: The Wu-Tang Clan’s Staten Island,” to routes traveled by millions daily, like “Oscillating City,” which tracks New York’s many commuters. Essays and interviews accompany each map, with a list of contributors as varied as the atlases themselves: Bronx hip-hop pioneers Grandmaster Caz and Melle Mel, Open City author Teju Cole and book critic Luc Sante, graffiti artist Lady Pink, and city planning professor Thomas Campanella.\n\nWhile Nonstop Metropolis marks the end of the trilogy, Solnit hopes the books encourage people to make maps for their own hometowns, as she did with students at the University of Wyoming in Laramie in 2011. Everyone has a personal cartography of his or her city. “San Francisco has at least 800,000 ways of being mapped, New York has eight million,” says Jelly-Schapiro. In their trilogy of atlases, Solnit and Jelly-Schapiro imagined 70 personal cartographies. For the rest—a map of your bike commute that avoids all the stoplights, a bar crawl with free popcorn, the Trick-or-Treat route that hits only houses offering Reese’s Pieces—you’ll have to put away Google Maps and create your own.\n\nGo Back to Top. Skip To: Start of Article.\n",
      "Folder": "Feedly",
      "Timestamp": "1476889954",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.702415Z"
}