{
  "id": "5597fff0ef8846fabaa69b22a12718f9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/guides/your-guide-to-using-transferable-points-for-award-flights-to-hawaii/",
      "Title": "Your guide to using transferable points for award flights to Hawaii Million Mile Secrets",
      "Selection": "Hawaii is an amazing travel destination, and the best part is that if you’re American, you don’t need a passport to go there. It’s almost like visiting another country, but with a lot less hassle. However, from the mainland U.S., flights can be long and expensive.\n\nLuckily, there are easy and affordable ways to redeem miles and points earned with best credit cards for travel for award flights to Hawaii. Earning transferable points is a great way to start, because you’ll have many more options when it comes time to book your flights. This can help you get around blackout dates that some airlines impose or just general difficulty in finding available award seats.\n\nHawaii is an incredible destination you don’t want to miss! Here’s how to book award flights to Hawaii with your miles (Photo by Color Me Maui Photography/Shutterstock)\n\nHow to use transferable points for award flights to Hawaii\n\nTo give you options for your trip, we’ll cover flights to Hawaii and also flights within the Hawaiian Islands. We won’t cover every option available, but rather just the best and most useful.\n\nWe’ll cover the basics that will help you make an informed decision like:\n\nTransfer ratio: How many points do you need to transfer to get the number of miles you need?\n\nTransfer time: How long does it usually take to transfer your points to the airline? This is important because you don’t want to find an award only to see it disappear while you’re waiting for the miles to show up in your account.\n\nAward Prices: How many miles will it take to book a flight to Hawaii with a particular airline?\n\nPartner Award Prices: You can use most airline miles to book award flights on their partner airlines. However, typically airlines have different award charts for their partner airlines and partner award seats are usually harder to find because in many cases, you’ll only be able to book the lowest priced (i.e. Saver level) awards. Also, sometimes airlines don’t allow partner bookings for business or first-class seats.\n\nPros: What are the reasons you’d want to transfer points to an airline?\n\nCons: What are the downsides of transferring points to an airline?\n\nOther notes: If there are any special rules, tips, or ticks you should know for the airline, they’ll be covered here.\n\nHow to get to Hawaii with Chase Ultimate Rewards points\n\nYou can earn transferable Chase Ultimate Rewards points with the following cards:\n\nChase Sapphire Preferred® Card\n\nChase Sapphire Reserve®\n\nInk Business Preferred℠ Credit Card\n\nAnd the Chase Ultimate Rewards points you earn with the following no-annual-fee credit cards can be pooled onto the “premium” cards listed above, and then transferred to Chase’s travel partners:\n\nChase Freedom®\n\nChase Freedom Unlimited®\n\nInk Business Cash℠ Credit Card\n\nInk Business Unlimited℠ Credit Card\n\nBritish Airways\n\nBritish Airways operates a distance-based award chart, so the usefulness of British Airways Avios points depends on where in the U.S. you are starting from and whether you are taking a direct flight or a connecting flight. With British Airways, you pay based on the distance of each flight segment, not the total flight distance. So, short, non-stop flights can be a good deal, but longer flights and connecting flights generally aren’t.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: British Airways does not fly to Hawaii, so you’ll need to use the partner award chart below.\n\nPartner Award Prices: British Airways operates a distance-based award chart. You can use the Great Circle Mapper to estimate the distance of each segment of your flight. Most partner flights from the U.S. to Hawaii will fall into the 2,001-3,000 miles range and cost 13,000 Avios points. You’ll want to focus on flights offered by American Airlines and Alaska Airlines, both British Airways partners.\n\nBritish Airways Avios points are going to make the most sense for those of you that are taking a direct flight to Hawaii from the West Coast. If you add a connecting flight you’ll pay for each segment separately. A few examples of the flights that you’ll want to focus on if you want to redeem your British Airways Avios are:\n\nLos Angeles (LAX) – Honolulu (HNL)\n\nOakland (OAK) – Honolulu (HNL)\n\nPhoenix (PHX) – Honolulu (HNL)\n\nSacramento (SMF) – Honolulu (HNL)\n\nSeattle (SEA) – Honolulu (HNL)\n\nPros: Great for booking direct flights from the West Coast\n\nCons: Not good for folks who can’t fly nonstop or are flying from the East Coast\n\nOther notes:\n\nFor more tips check out our complete guide to British Airways Avios points\n\nFlying Blue (Air France / KLM)\n\nFlying Blue is the rewards program of both Air France and KLM, and you can use Flying Blue miles to book travel to Hawaii on Delta.\n\nTransfer Ratio: 1:1\n\nTransfer Time: Instant\n\nAward Prices:\n\nFlying Blue doesn’t publish an award chart anymore. Rather, they offer a pricing calculator. Unfortunately, the pricing calculator page often redirects to the home page, so for your reference, the following prices are typically the lowest available:\n\nCoach – 30,000 Flying Blue miles round-trip\n\nBusiness Class – 60,000 Flying Blue miles round-trip\n\nPros: Even though the Flying Blue price calculator can be hit or miss, their award search engine does a pretty good job. The award calendar is a great bonus.\n\nCons: Can be tough to find available award seats on Delta, especially if you need to connect in the contiguous U.S.\n\nIberia\n\nIberia operates a distance-based award chart, just like British Airways and you can even transfer Avios points between your Iberia & British Airways account. But you’ll have to jump through a few hoops to do it.\n\nIberia is a member of the oneworld alliance, so you’ll be able to book partner awards flights with American Airlines to get to Hawaii. Keep in mind, Iberia only allows you to book round-trip flights on partners like American Airlines, not one-way tickets.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: Here’s the Iberia award chart for American Airlines flights:\n\nOne advantage of using Iberia Avios points instead of British Airways Avios points is that Iberia charges you based on the total distance traveled instead of by segment. So if you have a connection you could potentially pay fewer miles.\n\nThat said, their pricing to Hawaii from the West Coast isn’t as good as British Airways. For example, a round-trip flight between Los Angeles and Maui has a total flight distance of ~4,970 miles, which puts it just inside the band for 28,000 Iberia Avios points in coach.  That’s 2,000 points more than what you’d pay with British Airways Avios points on the same route.\n\nBut looking at Los Angeles to Honolulu, the total flight distance is ~5,112 miles round-trip, so would cost 42,000 Iberia Avios points in coach. That’s not nearly as good a deal.\n\nPros: You’ll be charged for the total distance flown, not by segment.\n\nCons: Can be pricey especially from the East Coast due to distance-based award chart.  Only round-trip awards are permitted on American Airlines.\n\nOther Notes: You can book American Airlines partner awards online.\n\nSingapore Airlines\n\nOne of the biggest advantages of Singapore Airlines miles is how easy they are to earn. You can transfer points to Singapore Airlines from Citi ThankYou, Chase Ultimate Rewards, Amex Membership Rewards, Capital One and Marriott. So if you don’t have enough flexible points to get to Hawaii in any single program, you can easily combine points together and book award flights with Singapore Airlines miles.\n\nTransfer ratio: 1:1\n\nTransfer time: Up to two days\n\nAward Prices: Singapore Airlines offers the cheapest award prices for booking award flights on United Airlines to Hawaii.\n\nCoach – 35,000 Singapore Airlines miles round-trip\n\nBusiness Class – 60,000 Singapore Airlines miles round-trip\n\nOne-way partner awards are half the price of the round-trip partner awards.\n\nPros: Some of the easiest airline miles to earn as they transfer from Chase Ultimate Rewards, Amex Membership Rewards, Citi ThankYou, Capital One and Marriott.\n\nCons: Not the cheapest deal for flights from the West Coast.\n\nSouthwest\n\nSouthwest just began flights to Hawaii in early 2019. That’s great news for anyone with a Southwest Companion Pass, because they’ll get to take a friend or family member to Hawaii as often as they want for just the price of taxes & fees. You can transfer both Marriott points (3:1 ratio) and Chase Ultimate Rewards to Southwest, so they’re pretty easy to collect.\n\nThere are also plenty of Chase credit cards that come with  Southwest points, so they’re even easier to collect:\n\nSouthwest Rapid Rewards® Plus Credit Card\n\nSouthwest Rapid Rewards® Priority Credit Card\n\nSouthwest Rapid Rewards® Premier Credit Card \n\nSouthwest Rapid Rewards® Premier Business Credit Card\n\nSouthwest Rapid Rewards® Performance Business Credit Card\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: Southwest is unique to these other airlines in that they don’t have an award chart. The award prices they charge are directly proportional to the cash price of the ticket. And you’ll generally receive a value of ~1.5 cents per point.\n\nFor example, the below flight from Chicago to San Jose, California, costs $175.\n\nThe same exact seat costs 10,957 Southwest points + $5.60 in taxes. That’s a value of 1.54 cents each.\n\nPros: When Southwest flights go on sale, their award prices drop, too. That’s the benefit of award prices being tied directly to cash prices. Also, Southwest is great for booking cheap inter-island flights.\n\nCons: There are no business or first-class awards on Southwest. So if you’re averse to flying long distances in coach, this isn’t the airline for you.\n\nOther notes: Seriously, you should look into earning the Southwest Companion Pass. It’s the best airline perk because it lets a friend or family member travel with you for free whenever you travel on Southwest. It doesn’t matter if your flight is booked with points or paid for with cash – your companion flies for just the cost of taxes and fees as long as Southwest is selling seats on that flight.\n\nCheck out this Southwest Companion Pass post for all you need to know.\n\nUnited Airlines\n\nUnited Airlines prices their awards as “Saver” awards and “Everyday” awards. Saver awards are much cheaper, so those are what you’ll want to find and book.  Everyday awards can be absurdly expensive and are typically not a good deal. The problem is that United no longer has an official award chart and instead prices awards dynamically. So the prices we’ve listed here follow the old award chart and can vary widely.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: For flights from the contiguous U.S. to the Hawaiian islands, you’ll pay:\n\nCoach – 22,500 United Airlines miles for a one-way Saver Award, up to 45,000 United Airlines miles for a one-way Everyday Award\n\nBusiness Class – 40,000 United Airlines miles for a one-way Saver Award, up to 90,000 United Airlines miles for a one-way Everyday Award\n\nFirst Class – 50,000 United Airlines miles for a one-way Saver Award, up to 110,000 United Airlines miles for a one-way Everyday Award\n\nIf you want to visit a couple of different islands on your trip, redeeming United Airlines miles is a great choice for inter-island flights on partner Hawaiian Airlines. You’ll pay the following prices:\n\nCoach – 7,000 United Airlines miles for a one-way Saver Award, up to 14,000 United Airlines miles for a one-way Everyday Award\n\nBusiness Class – 9,000 United Airlines miles for a one-way Saver Award, up to 18,000 United Airlines miles for a one-way Everyday Award.\n\nPros: United Airlines awards are easy to find and book and typically there are lots of available award seats. United Airlines miles are also a great option if you want to fly between the Hawaiian islands during your trip.\n\nCons: business & first-class awards and Everyday Awards are expensive for travel to Hawaii and with dynamic pricing you can’t rely on finding consistent award prices.\n\nOther notes:\n\nUnited Airlines allows a free stopover or a free one-way on round-trip award flights in the form of the “United Airlines Excursionist Perk” \n\nIf you have one of the Chase United Airlines credit cards or United Airlines elite status, you’ll have access to more available award seats!\n\nFor more on how to book awards with United Airlines miles check out our Ultimate Guide to United Airlines Miles!\n\nVirgin Atlantic\n\nVirgin Atlantic miles are another great way to book Delta flights if they have the available award seats you need. Better yet, you can use your Virgin Atlantic miles for flights on Hawaiian Airlines too.\n\nBut, you can’t fly both Delta and Hawaiian airlines on the same award ticket, only one partner is allowed. Virgin Atlantic miles also transfer from other major transferable points currencies like Amex Membership Rewards and Citi ThankYou points, so even if you don’t have enough Chase Ultimate Rewards points, you may be able to combine points for your flights to Hawaii.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: For flights from the contiguous U.S. to Hawaii, you’re looking at 40,000 Virgin Atlantic miles for a round-trip flight in coach, or 75,000 Virgin Atlantic miles in first-class if you want to fly Delta.\n\nDepending on where you are flying from, flying Hawaiian Airlines may not be as good of a price. Flights from the West Coast to Hawaii start at the same 40,000 miles in coach and 80,000 miles in business class. But, if you want to fly from the East Coast on Hawaiian Airlines, you’re looking at 80,000 miles in coach and 130,000 miles in business class. Flights from the East Coast on Hawaiian Airlines probably shouldn’t be booked with Virgin Atlantic miles.\n\nYou can book flights between the Hawaiian Islands on Hawaiian Airlines for 15,000 miles round-trip in coach and 30,000 miles round-trip in business class.\n\nOne-way bookings are permitted.\n\nFuel Surcharges: Not something you need to worry about on flights to Hawaii.\n\nPros: Can book flights on Delta and Hawaiian Airlines, sometimes more Delta award availability\n\nCons: High prices for flights on Hawaiian Airlines from the East Coast.\n\nOther notes:\n\nOne way bookings are permitted\n\nWhen to book through the Chase travel portal instead\n\nDepending on how much your plane tickets cost, it doesn’t always make sense to transfer Chase Ultimate Rewards points to airline partners for award flights. Instead, you might save points by booking a cheap fare through the Chase Ultimate Rewards travel portal.\n\nWhether or not it makes sense to book through Chase Travel will depend on a few things: How much the ticket costs, what transfer partner you would be using, and which Chase card(s) you have.\n\nLet’s start out with which Chase credit cards you have. Here’s what your points are worth through the portal with each Chase Ultimate Rewards card:\n\nChase Ultimate Rewards Card\n\nHow Much Are Points Worth Toward Travel?\n\nChase Sapphire Reserve\n\n1.5 cents\n\nInk Business Preferred Credit Card\n\n1.25 cents\n\nChase Sapphire Preferred Card\n\n1.25 cents\n\nInk Business Cash Credit Card\n\n1 cent\n\nInk Business Unlimited Credit Card\n\n1 cent\n\nChase Freedom\n\n1 cent\n\nChase Freedom Unlimited\n\n1 cent\n\nGenerally, the cheaper your plane ticket is, the more likely it makes sense to redeem points through Chase travel instead of through a transfer partner.\n\nLet’s look at a quick example first. Suppose you were going to transfer miles to United Airlines to book a coach ticket. United Airlines charges at least 45,000 miles to fly to Hawaii and back in coach. You would be better off redeeming through the Chase Ultimate Rewards travel portal if your ticket cost less than the following:\n\nWith the Chase Sapphire Reserve: $675\n\nWith the Chase Sapphire Preferred or Ink Business Preferred:  ~$563\n\nWith other Chase cards: $450\n\nDepending on what miles you are using, these numbers wouldn’t necessarily be the same. To find out what the breakeven price would be, take the numbers required and multiply by the value of your Chase points. For example, 45,000 United Airlines miles X 0.015 (for the Chase Sapphire Reserve) = $675.\n\nLooked at another way, let’s say that your round-trip flight to Hawaii was going to cost $475. This is how many points you would pay if you booked through the Chase Ultimate Rewards travel portal:\n\nWith the Sapphire Reserve: ~31,667 Chase Ultimate Rewards points\n\nWith the Sapphire Preferred or Ink Business Preferred: 38,000 Chase Ultimate Rewards points\n\nWith other Chase cards: 47,500 Chase Ultimate Rewards points\n\nIn this case, you would be better off booking through the Chase Ultimate Rewards travel portal if you have the Chase Sapphire Reserve, Chase Sapphire Preferred, or Chase Ink Business Preferred compared to transferring and paying 45,000 United Airlines miles for an award ticket.\n\nOf course, if your alternative is booking with British Airways Avios points, that completely changes the equation. If you could book an award flight from Phoenix to Honolulu for 26,000 British Airways Avios points round-trip, you would be better off doing that no matter what card you have assuming a ticket price of $475.\n\nTo find out how many points you need for a given ticket price when booked through the Chase Ultimate Rewards travel portal, take the ticket price and divide by the value of your Chase points depending on what Chase card you have.\n\nTwo other benefits to redeeming your points through the Chase Ultimate Rewards travel portal is that you don’t have to worry about finding available award seats or blackout dates. As long as there’s a seat available for sale, you will be able to book it, and you’ll also earn frequent flyer miles and credit toward status for your airline ticket.\n\nHow to get to Hawaii with American Express Membership Rewards points\n\nAmex Membership Rewards points are very helpful for getting to Hawaii because they have lots of useful airline transfer partners and they are easy to earn. Even better is that Amex Membership Rewards points offer frequent transfer bonuses to their partner airlines, so you can get even more value out of your points.\n\nYou can earn transferable Amex Membership Rewards points with these cards:\n\nCard\n\nWelcome bonus & minimum spending requirements\n\nThe Business Platinum® Card from American Express\n\nEarn up to 75,000 Amex Membership Rewards® points: 50,000 points after you spend $10,000 and an extra 25,000 points after you spend an additional $10,000 all on qualifying purchases made on the card within the first 3 months of account opening.\nTerms Apply.\n\nAmerican Express®️ Green Card\n\nReceive up to $100 in statement credits toward any eligible purchase from Away made within the first three months of Card Membership. Offer ends January 15, 2020. Plus, earn 30,000 Amex Membership Rewards® Points after you spend $2,000 on purchases in your first three months of account opening. Terms apply.\n\nThe Blue Business® Plus Credit Card from American Express\n\nNo welcome bonus\n\nThe Platinum Card® from American Express\n\n60,000 Amex Membership Rewards® points after spending $5,000 on purchases within the first 3 months of opening your account. Terms Apply.\n\nAmerican Express® Gold Card\n\n35,000 Amex Membership Rewards® points after spending $4,000 in purchases in the first 3 months of account opening. Terms Apply.\n\nAmerican Express® Business Gold Card\n\nEarn 35,000 Membership Rewards® points after you spend $5,000 on eligible purchases with the Business Gold Card within the first 3 months of Card Membership. Terms Apply.\n\nBusiness Green Rewards Card from American Express\n\n15,000 Amex Membership Rewards® points after spending $3,000 in eligible purchases within the first 3 months of opening your account. Terms Apply.\n\nAmex EveryDay® Preferred Credit Card from American Express\n\n15,000 Amex Membership Rewards® points after spending $1,000 on purchases within the first 3 months of opening your account. Terms Apply.\n\nAmex EveryDay® Credit Card from American Express\n\n10,000 Amex Membership Rewards® points after spending $1,000 on purchases within the first 3 months of opening your account. Terms Apply.\n\nThe information for the Amex EveryDay Preferred Credit Card and Amex EveryDay Credit Card has been collected independently by Million Mile Secrets. The card details on this page have not been reviewed or provided by the card issuer.\n\nIf you’re working with only Amex Membership Rewards points, you have a lot of great options for flights to Hawaii.\n\nAir Canada Aeroplan\n\nAir Canada Aeroplan is part of the Star Alliance, so is useful for redemptions on Star Alliance member United Airlines for flights to Hawaii. Aeroplan doesn’t have the best award prices to Hawaii, but they are still a good option if you want to fly United Airlines, especially if there is a transfer bonus.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: A round-trip flight to Hawaii costs 45,000 Aeroplan miles in coach, 80,000 Aeroplan miles in Business Class, and 110,000 Aeroplan miles in first class. One-way awards cost half of what a round-trip award costs.\n\nPros: Frequent transfer bonuses\n\nCons: Not the best award prices to Hawaii\n\nOther notes:\n\nReasonable lap infant fees – $50 to $125 or 5,000 to 12,500 Aeroplan miles\n\nFor more tips check out our guide to using Aeroplan miles\n\nANA\n\nYou can redeem ANA (All Nippon Airways) miles to book flights on United Airlines, just like Air Canada. ANA offers lower prices for the same flights as Air Canada in both coach and Business Class. If you want to fly first class, you’ll get a better deal with Air Canada, so it won’t usually make sense to use ANA to book first-class flights to Hawaii. Unfortunately, ANA does not allow one-way bookings, so if you want to book one-way flights, you’ll need to turn elsewhere.\n\nThe biggest drawbacks to using ANA miles are that the award chart and routing rules are relatively complicated.\n\nTransfer ratio: 1:1\n\nTransfer time: Two to three days\n\nAward Prices: As mentioned, ANA’s first class price isn’t great, but they’re a good option for coach and business-class flights to Hawaii. ANA charges 40,000 miles round-trip for coach flights, 68,000 miles round-trip for Business Class flights, and 120,000 miles round-trip for First Class flights. One-way flight bookings are not possible with ANA miles.\n\nIn the chart below, Y is coach, C is Business Class, and F is First Class.\n\nPros: Cheaper prices for coach tickets that booking with Air Canada\n\nCons: Business and first-class flights to Hawaii are expensive and you must book round-trip award flights\n\nOther notes:\n\nANA miles expire after 36 months and cannot be extended\n\nBritish Airways\n\nIt’s not uncommon for there to be an Amex Membership Rewards transfer bonus to British Airways and they can be quite generous, which could make British Airways a useful option, especially if you have your eye on a direct flight from the West Coast.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nFor more details on using British Airways Avios points to get to Hawaii, check the Chase Ultimate Rewards points section.\n\nCathay Pacific Asia Miles\n\nCathay Pacific operates a distance-based award chart and they are a member of the oneworld alliance, which includes American Airlines. Cathay Pacific is also a partner of Alaska Airlines, so you can fly Alaska Airlines to get to Hawaii as well.\n\nCathay Pacific does have good prices for certain flights to Hawaii, but understanding their award chart and booking rules will take some work and booking awards can present some challenges too. One good thing about Cathay Pacific is that they are transfer partners of most flexible points programs, so it might be easier to accumulate the miles you need.\n\nTransfer ratio: 1:1\n\nTransfer time: One to two days\n\nAward Prices: As mentioned, Cathay Pacific Asia Miles has a distance-based award chart. In fact, they have a couple of different distance-based award charts.Generally their prices for shorter flights are better than for longer flights. Flights that fall into the Ultra-Short and Short categories are the only ones that will really make sense to book.\n\nHere is the Cathay Pacific Asia Miles award chart for flights on Cathay Pacific and Cathay Dragon. Unfortunately, you won’t exactly see these prices when looking at flights to Hawaii. That’s because flights on a single partner airline cost 5,000 more miles for a one-way flight, but Cathay Pacific does not publish their partner award chart anymore.\n\nFor example, a flight on Cathay Pacific that falls into the “Short” category in coach would cost 10,000 Asia Miles. If a flight of the same length is on a partner airline, like American Airlines, it would cost 15,000 Asia Miles.\n\nThat means that Ultra-Short flights on a partner cost more than British Airways would charge for the same flight (but no flights to Hawaii are this short anyway).  And British Airways would charge less for Short flights (on a partner) as well. Because Asia Miles is more complicated than British Airways, if you don’t need to connect, using British Airways Avios points is going to be a better bet.\n\nHowever, if you need to make a connection, you might be better off redeeming Cathay Pacific Asia Miles. This is because British Airways charges for each flight segment separately, but Cathay Pacific charges for the entire one-way flight distance.\n\nYou can use Great Circle Mapper to find out the approximate distance of your flight, and make sure to include any connections. There aren’t that many flight options from the U.S. to Hawaii that are going to fall into that 1,151 to 2,750 mileage band, however, but here are a few examples:\n\nLos Angeles (LAX) – Honolulu (HNL):  2,556 miles each way\n\nSan Francisco (SFO) – Honolulu (HNL):  2,398 miles each way\n\nSacramento (SMF) – San Francisco (SFO) – Honolulu (HNL):  2,484 miles each way\n\nAll of these flight itineraries fall into the “Short” flight category, but only the flight from Sacramento to Honolulu with a connection in San Francisco would be a better use of Asia Miles than British Airways Avios points.\n\nFlights that are longer than 2,750 miles would fall into the medium category and generally wouldn’t be a great use of Asia Miles unless they were the only option.\n\nWhen booking an Asia Miles Standard Award, one-way bookings are permitted. Additionally, a Standard Award round-trip award flight can have up to three stopovers and one open-jaw, but the rules are complicated and this doesn’t apply to all award flights. You can read more about the stopover and open-jaw rules under #5 in the terms.\n\nThis award chart only applies to award bookings which include only one partner airline or one partner airline and Cathay Pacific or Cathay Dragon. This will have you covered for flights to Hawaii, but for flights to other regions you may have to check out Cathay Pacific’s oneworld multi-carrier award chart.\n\nPros: Easy to earn – they transfer from Amex Membership Rewards, Citi ThankYou, and Marriott, useful for short-haul or one-way awards, potentially generous stopover and open-jaw policy\n\nCons: Overly complicated, expensive for longer flights, and many partners can’t be booked online\n\nOther notes:\n\nYou can book award flights online if you’re flying on Cathay Pacific, Cathay Dragon, Alaska Airlines, British Airways, Finnair, Iberia, Qantas, or Qatar Airways.  But for awards which include any other partner airline, including American Airlines flights to Hawaii, you’ll need to fill out a “Flight Award Request Form“ or call 866-892-2598 to book your award\n\nUse this tool to figure out how much a specific award flight will cost\n\nSometimes you’ll get a phone agent that doesn’t completely understand Cathay Pacific’s convoluted award booking rules. Don’t be afraid to hang up and call again.\n\nDelta\n\nDelta no longer publishes an official award chart. So it’s a bit of a guessing game estimating how many Delta miles it will cost to get to Hawaii. Nevertheless, Delta miles are worth considering if you want to fly Delta to Hawaii.\n\nAdditionally, Delta does have frequent award flight sales, and they could include flights to Hawaii. This is a good option to keep in your mind in case a good deal pops up.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: Delta doesn’t publish an award chart anymore, but in general, you’ll be able to find award flights for as low as 22,500 Delta miles one-way in coach and 40,000 Delta miles one-way in Business Class. Delta occasionally has award flash sales where prices can be even lower than this. It’s also not uncommon to see much higher prices.\n\nFuel Surcharges: Yes, but not something you need to worry about on flights to Hawaii\n\nPros: Potentially useful award sales\n\nCons: No award chart\n\nOther notes:\n\nWhen you transfer Amex points to U.S. based carriers like Delta, you’ll be charged a small fee of 0.06 cents per point up to a maximum of $99. For example, if you transfer 45,000 Amex points to Delta, you’ll be charged a fee of $27.\n\nFlying Blue (Air France/KLM)\n\nAmex has offered transfer bonuses to Flying Blue in the past, which can make Flying Blue an even better option for flights to Hawaii.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nFor more information on using Flying Blue miles to get to Hawaii, check out the Chase Ultimate Rewards section.\n\nIberia\n\nIberia operates a distance-based award chart, just like British Airways.  You can even transfer your Avios points between your Iberia and British Airways accounts, but you’ll have to jump through a few hoops to do it.\n\nIberia is a member of the oneworld alliance, so you’ll be able to book partner award flights with American Airlines for flights to Hawaii.\n\nTransfer ratio: 1:1\n\nTransfer time: One to two days\n\nSee the Iberia notes under the Chase Ultimate Rewards section for more details.\n\nSingapore Airlines\n\nSingapore Airlines is a great option for flights to Hawaii and they are easy to earn!  You can transfer points from Citi ThankYou, Chase Ultimate Rewards, Amex Membership Rewards, Capital One and Marriott to Singapore Airlines.  If you don’t have enough points with any one program, you can pool your points easily with Singapore Airlines miles!\n\nTransfer ratio: 1:1\n\nTransfer time: Up to 24 hours\n\nSee the Singapore Airlines notes under the Chase Ultimate Rewards section for more details.\n\nVirgin Atlantic\n\nVirgin Atlantic miles are a good option for flights to Hawaii.  Like Singapore Airlines miles, you can transfer to Virgin Atlantic from Citi ThankYou, Chase Ultimate Rewards, Amex Membership Rewards and Marriott, so you have an opportunity to combine your miles if you need to. Additionally, Virgin Atlantic sometimes has access to more Delta award seats than other airline partners do, so they’re worth a look even if you don’t think there are available award seats.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nFor more information, see the Virgin Atlantic information under the Chase Ultimate Rewards section.\n\nWhen to book through the Amex travel portal instead\n\nDepending on how much your plane tickets cost, it doesn’t always make sense to transfer Amex Membership Rewards points to airline partners for award flights. Instead, you might save points by booking a cheap fare through Amex Travel.\n\nWhether or not it makes sense to book through Amex Travel will depend on a couple of things: How much the ticket costs, what transfer partner you would be using, and possibly on what Amex card you have.\n\nFor the most part, the Amex card that you have won’t make a difference as to how much your points are worth. For most cards, your Membership Rewards points are worth just one cent each when redeemed for airfare but, there’s one exception.\n\nIf you have The Business Platinum® Card from American Express, you’ll get 35% of your redeemed points back in two cases: If you’re booking business or first-class airfare on any airline through Amextravel.com, and if you’re booking coach on your airline of choice (the same airline that you’ve chosen to get the $200 airline fee credit reimbursement from). In these cases, your Amex points are worth ~1.54 cents each when you factor in the rebate.\n\nGenerally, the cheaper your plane ticket is, the more likely it makes sense to redeem points through Amex Travel instead of through a transfer partner, but the scale doesn’t tip as easily as it does for some Chase cards.\n\nFor example, let’s assume that you are considering transferring Amex points to Delta to book a coach ticket. Delta charges 45,000 miles for a low-level award flight to Hawaii and back in coach. Your breakeven price between transferring to Delta or using points as cash would be the following:\n\nWith most Amex cards: 45,000 Delta miles X 0.01 = $450\n\nWith the Business Platinum Card from American Express and Delta chosen as your airline: 45,000 Delta miles X ~0.0154 = ~$693\n\nIf your flight price is less than the price listed above (for this example), it would cost less for you to redeem your Amex points as cash through American Express Travel instead of transferring to Delta.\n\nDepending on what miles you are using, these numbers wouldn’t necessarily be the same. To find out what the breakeven price would be, take the numbers required and multiply by the value of your Amex points. Looked at another way, let’s say that your round-trip coach flight to Hawaii was going to cost $400 on Delta. This is how many points you would pay if you booked through Amex Travel:\n\nWith most Amex cards: 40,000 Amex Membership Rewards points ($400 / 0.01)\n\nWith the Business Platinum Card from American Express and Delta chosen as your airline: ~26,000 Amex Membership Rewards points (Simply: $400 / 0.0154 = ~26,000, or to get the exact amount: $400 / 0.01 = 40,000; 40,000 – (40,000 X 0.35 Rebate) = 26,000 miles)\n\nIn this case, you would be better off booking through Amex Travel with your Amex points rather than transferring 45,000 Delta Airlines miles for an award ticket no matter which Amex card you have. If our example flight had been more expensive, that may not have been the case.\n\nYou’ll need the full number of Amex Membership Rewards points in your account (in this case, 40,000 points) to book the ticket. You’ll receive the 35% rebate from having the Amex Business Platinum card in 8-10 weeks.\n\nTo find out how many points you need for a given ticket price when booked through Amex Travel, take the ticket price and divide by the value of your Amex points.\n\nTwo other benefits to redeeming your points through Amex travel is that you don’t have to worry about finding available award seats or blackout dates. As long as there’s a seat available for sale, you will be able to book it, and you’ll also earn frequent flyer miles and credit toward status for your airline ticket.\n\nHow to get to Hawaii with Citi ThankYou points\n\nCiti ThankYou points are another great option if you want to book award flights to Hawaii. Like Chase Ultimate Rewards and Membership Rewards points, they have a number of useful airline transfer partners (and some of the partners even overlap). You can earn Citi ThankYou points from cards like the Citi Premier℠ Card or Citi Prestige® Card.\n\nInformation for the Citi Premier and Citi Prestige cards has been collected independently by Million Mile Secrets and has not been reviewed by the card issuer.\n\nAvianca LifeMiles\n\nLifeMiles is the mileage program for Star Alliance member Avianca, and has made headlines in the past for miscategorizing airport codes into different regions. This has led to some incredible redemptions, but there’s nothing sneaky you can do for Hawaii flights. That said, Avianca’s rates are still pretty good for travel from the U.S. to Hawaii.\n\nBecause United Airlines is also part of Star Alliance, you can redeem Avianca miles for travel on United Airlines.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: Avianca splits the U.S. up into multiple regions: United States 1, United States 2, and United States 3, plus Hawaii. However, for flights between the U.S. and Hawaii, it doesn’t matter where you are flying from or to. The prices are the same. If you want to fly in coach (X), it costs 22,500 Avianca miles each way, Business Class (I) costs 40,000 Avianca miles each way, and First Class (O) costs 50,000 Avianca miles each way.\n\nThe business and first-class prices are not great with Avianca, but the coach price isn’t bad.\n\nPros: Average coach prices for flights to Hawaii\n\nCons: High award prices for Business and First Class\n\nOther notes: Avianca charges a $25 fee for all award bookings\n\nCathay Pacific Asia Miles\n\nCathay Pacific Asia Miles is also a transfer partner of Amex Membership Rewards points.  They operate on a distance based award chart, and are a reasonable option for flights to Hawaii.\n\nTransfer ratio:   1:1\n\nTransfer time:   Instant\n\nFor more information on using Asia Miles to get to Hawaii, check out the Amex Membership Rewards section of this post.\n\nEtihad\n\nEtihad has different award prices for each partner, which can make things pretty complicated. Luckily, if you’re considering using Etihad miles to get to Hawaii, there’s only one partner that you care about – American Airlines.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: Etihad’s award prices between the U.S. and Hawaii aren’t bad, but they’re not great either. Business and first-class awards are quite expensive, but don’t cost as much as some other airlines charge. Coach prices are average to good, especially during the off-peak travel time. Etihad considers off-peak for Hawaii to be January 12 to March 8, August 22, and December 15. So, you’re not really getting a ton of options for travel during off-peak dates.\n\nSomething that is intriguing is the inter-island Hawaii price at only 5,000 Etihad miles. However, American Airlines doesn’t operate any inter-island Hawaii flights, so it doesn’t seem possible to actually book a flight for that price, but if American Airlines ever offers flights between the islands it could offer a good opportunity to redeem some Etihad miles.\n\nPros: Reasonable coach and coach off-peak award prices\n\nCons: Not many off-peak travel dates, high business and first-class award prices\n\nOther notes: If American Airlines ever starts operating flights between the Hawaiian Islands, the price Etihad charges for inter-island flights is pretty good (but don’t hold your breath)\n\nFlying Blue (KLM/Air France)\n\nFlying Blue is a transfer partner of all of the major transferable point currencies, and is a good option for flights to Hawaii.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nTo find out more about using Flying Blue miles to get to Hawaii, reference the Chase Ultimate Rewards section of this post.\n\nQantas\n\nQantas isn’t a bad program to work with, and they have a really good award search engine. Their prices for flights to Hawaii, in the right circumstances, aren’t bad either.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nAward Prices: Qantas has a distance based award chart. If you’re flying from the U.S. to Hawaii, most flights are going to be around 2,500 to 5,500 miles in length each way, depending on where in the U.S. you are flying from and how many connections you need to make. This means that your one-way flights are likely going to fall into Zone 4, 5, or 6.\n\nOnly Zone 4 pricing is really worth considering, and even then, only in coach. In most cases, using British Airways Avios points is going to cost fewer points than Qantas if you are flying from the West Coast, but if you are making a connecting flight it could make sense to book with Qantas instead.\n\nYou can check the approximate distance of your flights on gcmap.com and compare the cost of booking with Qantas and booking with British Airways if you want to fly American Airlines.\n\nFor example, here are some one way flight distances to Hawaii:\n\nLos Angeles (LAX) – Honolulu (HNL):  2,556 miles one way\n\nPhoenix (PHX) – Honolulu (HNL):  2,917 miles one way\n\nDallas (DFW) – Honolulu (HNL):  3,784 miles one way\n\nAlbuquerque (ABQ) – Phoenix (PHX) – Honolulu (HNL):  3,246 miles one way\n\nPros: Great award search engine, okay award price in coach, in certain circumstances (for example, a connecting flight on American Airlines where the first leg is relatively short like the last example shown above)\n\nCons: High prices for business class and first class\n\nSingapore Krisflyer\n\nSingapore Airlines is a transfer partner of all of the major transferable point currencies and offers great prices for flights to Hawaii.\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nTo find out more about using Singapore Airlines miles to fly to Hawaii, refer to the Chase Ultimate Rewards section of this post.\n\nVirgin Atlantic\n\nVirgin Atlantic is a transfer partner of all of the major transferable point currencies. They sometimes have access to more Delta award seats than other partners, so they may be worth a look if you’re coming up short elsewhere!\n\nTransfer ratio: 1:1\n\nTransfer time: Instant\n\nFor more information on using Virgin Atlantic miles to fly to Hawaii, refer to the Chase Ultimate Rewards section of this post.\n\nWhen to book through the Citi ThankYou travel portal instead\n\nDepending on how much your plane ticket costs, it doesn’t always make sense to transfer Citi ThankYou Points to airline partners for award flights. Instead, you might save points by booking a cheap fare through the Citi ThankYou travel portal (and earn miles when you fly).\n\nWhether or not it makes sense to book through the Citi ThankYou Travel Portal will depend on a couple of things: How much the ticket costs, what transfer partner you would be using (and the points cost of your potential award ticket), and which Citibank credit cards you have.\n\nLet’s start out with which Citi card you have. Things are simpler here than for Chase and Amex. If you have the Citi Premier Card, your ThankYou points are worth 1.25 cents each towards airfare. If you have any other card that earns Citi ThankYou points, your points are worth one cent each.\n\nGenerally, the cheaper your plane ticket is, the more likely it makes sense to redeem points through the Citi ThankYou Travel Portal instead of through a transfer partner.\n\nLet’s look at a quick example first. Suppose you were going to transfer miles to Etihad to book an off-peak, round-trip coach ticket. Etihad would charge 35,000 miles for this ticket. You would be better off redeeming through the Citi Travel Center if your ticket cost less than the following:\n\nWith the Citi Prestige or Citi Premier: $437.50 (35,000 X 0.0125)\n\nWith other Citi cards: $350 (35,000 X 0.01)\n\nDepending on what miles you are using, these numbers wouldn’t necessarily be the same. To find out what the breakeven price would be, take the number of miles required and multiply by the value of your Citi points. For example, 35,000 Etihad miles X 0.0125 (for the Citi Prestige or Citi Premier) = $437.50.\n\nLooked at another way, let’s say that your round-trip flight to Hawaii was going to cost $375. This is how many points you would pay if you booked through the Chase Ultimate Rewards travel portal:\n\nWith the Citi Prestige or Citi Premier:  30,000 Citi ThankYou points ($375 / 0.0125)\n\nWith other Citi cards:  37,500 Citi ThankYou points ($375 / 0.01)\n\nIn this case, you would be better off booking through the Citi Travel Portal if you have the Citi Premier, compared to transferring and paying 35,000 Etihad miles for an award ticket. If you have other Citi cards, it would still cost less to transfer.\n\nTwo other benefits to redeeming your points through the Citi ThankYou Travel Portal is that you don’t have to worry about finding available award seats or blackout dates. As long as there’s a seat available for sale, you will be able to book it, and you’ll also earn frequent flyer miles and credit toward status for your airline ticket.\n\nHow to get to Hawaii with Marriott Bonvoy points\n\nThere are a ton of airline partners available if you have Marriott points — over 40. We won’t go into details about how to fly to Hawaii with every single possible partner. Instead, we’ll just tell you the best Marriott transfer partners to get you to Hawaii. Here’s our guide to transferring Marriott points to airlines.\n\nAir Canada Aeroplan\n\nMarriott points aren’t your only option for transferring to Air Canada Aeroplan. You can also transfer American Express Membership Rewards points.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~5 days\n\nTo find out more about using your Air Canada Aeroplan miles to get to Hawaii, check out the Amex Membership Rewards section.\n\nAlaska Airlines\n\nAlaska Airlines miles are a good option for getting to Hawaii on Alaska Airlines and an okay option for traveling to Hawaii on American Airlines. Unfortunately, Alaska Airlines isn’t a partner of any other transferable point currency, so they’re a little bit harder to earn than some of the other options. Nevertheless, it may be the best way for you to get to Hawaii.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~2 days\n\nAward Prices: Alaska Airlines charges different award prices for each partner. So, depending on if you want to fly on American Airlines or Alaska Airlines, you’ll have to look at different award charts and pricing.\n\nAlaska Airlines charges the following prices for their own flights:\n\nCoach: 15,000 to 50,000 Alaska Airlines miles one-way\n\nBusiness Class: 40,000 to 80,000 Alaska Airlines miles one-way\n\nAt the low end of those ranges, the prices are pretty reasonable, especially for coach. But, if you’re being quoted more than 25,000 miles one-way for coach or 40,000 miles one-way for Business Class, there’s almost surely a better option.\n\nIf you want to fly American Airlines, the following prices apply:\n\nCoach: 22,500 Alaska Airlines miles one-way\n\nBusiness Class: 40,000 Alaska Airlines miles one-way\n\nThese prices are solid, but not really anything special.  There’s a good chance that you can almost always book with another airline for the same price or less, and usually with miles that are easier to earn than Alaska Airlines miles.  That said, if you have a bunch of Alaska Airlines miles or can’t make anything else work, this isn’t a bad option.\n\nPros: Low coach prices on Alaska Airlines’ own flights, ability to stopover on a one-way award flight\n\nCons: Relatively tough miles to earn\n\nOther notes:\n\nOne of the best things about Alaska Airlines miles is the ability to do a stopover on a one-way award ticket. This means if you are flying Alaska Airlines, you could stopover in their hub, Seattle. If you’re flying American Airlines, you could spend a day or two in Phoenix or Los Angeles (or any other American Airlines hub) on your way to Hawaii. If you book your return flight with Alaska Airlines miles, you can have another stopover on your return itinerary.\n\nAll Nippon Airways (ANA)\n\nANA is a good option for flights to Hawaii, but really only for coach flights. They are also a transfer partner of Amex Membership Rewards, giving you an option to pool your miles.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~7 days\n\nThe award chart and routing rules are relatively complicated, but if you want to find out more, check out the Amex Membership Rewards section of this post.\n\nAmerican Airlines\n\nYou can use American Airlines miles to book flights on both American Airlines and Alaska to get to Hawaii. Coach prices are pretty good, especially if you are traveling during off peak times, but we generally wouldn’t recommend booking business class or first-class with American Airlines miles unless you don’t have other options.\n\nNote that American Airlines is moving toward dynamic pricing for its awards, so even though it still has an award chart, in practice the prices can be all over the place.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~2 days\n\nAward Prices: American Airlines offers flights to Hawaii in coach, business class, and first class. Coach prices are pretty reasonable especially if you are traveling during off peak dates. The prices for off-peak flights is 20,000 American Airlines miles each way. The regular coach price is 22,500 American Airlines miles each way. The AAnytime prices are both very high, You could fly in business class for the same number of miles or less.\n\nBusiness-class and first-class fights on American Airlines don’t have off peak pricing. In general, they are not as good of a deal as the coach prices. Business-class flights start at 40,000 American Airlines miles each way. Note that if you’re flying on a 3-cabin aircraft (one that has coach, business class, and first class), the mileage price will be 7,500 miles higher for each price level listed.\n\nIf you want to try out flying first class, you can do so on some flights to Hawaii. But, prices aren’t cheap. You’re looking at 65,000 American Airlines miles (or more!) for a one-way flight.\n\nPros: More access to American Airlines award seats than other partners have, good off-peak pricing for coach tickets\n\nCons: High business-class and first-class prices sometimes difficult to find SAAver award availability\n\nOther notes: Sometimes difficult to find SAAver award availability at peak times\n\nAsiana\n\nAsiana might not be a program that you’re very familiar with, but they have some great prices for flights to Hawaii. Unfortunately, Asiana miles aren’t that easy to earn, so you’ll have to save up your Marriott points if you want to use Asiana miles to get to Hawaii.\n\nAsiana is part of Star Alliance, so you can use Asiana miles to book flights to Hawaii on United Airlines.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: 10 days\n\nAward Prices: Asiana offers good award prices for flights from the U.S. to Hawaii. Coach awards start at only 25,000 Asiana miles round-trip and business-class and first-class awards cost 45,000 Asiana miles and 65,000 Asiana miles roundtrip, respectively. These are all great prices for flights to Hawaii if you can find award availability on United Airlines flights that works for your trip.\n\nOne-way award bookings are permitted at half of the price listed below.\n\nFuel Surcharges: Not something you need to worry about on flights to Hawaii.\n\nPros: Great award prices, especially for business class and first class, no phone booking fee, one-way award bookings allowed, low cancellation fee ($30 or 3,000 miles), no change fees\n\nCons: Relatively difficult to earn, poor award search for partner flights online, fuel surcharges on some partners (but not on flights to Hawaii)\n\nOther notes:\n\nIf you want to book a partner flight, you’ll have to call Asiana (800-227-4262) in order to do so. The call center is only open from Monday to Friday 8:30 a.m. to 5:30 p.m. Pacific Time.\n\nAvianca\n\nAvianca miles are a good option for flights to Hawaii, and are also a transfer partner of Citi ThankYou Points.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: Unknown at this time\n\nFor more information on using Avianca miles to fly to Hawaii, visit the Citi ThankYou Point section of this post.\n\nBritish Airways\n\nBritish Airways presents one of the cheapest ways to get to Hawaii with miles if you are flying from the West Coast with a direct flight.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: Under 24 hours\n\nFor more information on redeeming British Airways Avios for flights to Hawaii, check out the Chase Ultimate Rewards section.\n\nCathay Pacific Asia Miles\n\nThe Cathay Pacific Asia Miles award chart is one of the more complex charts out there.  But, if you’re willing to put in some extra time, there is great value to be had!\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~10 days\n\nFor more information on redeeming Cathay Pacific Asia Miles for your Hawaiian vacation, read more in the Amex Membership Rewards section.\n\nDelta\n\nDelta doesn’t publish an award chart anymore, so it can be difficult to know if you’re getting the lowest price possible. Nevertheless, they do occasionally offer pretty good award sales for flights to Hawaii.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time:  ~2 days\n\nFor more information on using Delta miles to fly to Hawaii, check out the Amex Membership Rewards section.\n\nEmirates\n\nEmirates ins’t part of an alliance, but they do have a ton of partners. If your goal is to get from the U.S. to Hawaii, you can use Emirates miles for travel on Alaska Airlines. Emirates has different award prices for each partner, so for flights on Alaska Airlines, you’ll have to reference their Alaska award chart.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~6 days\n\nAward Prices: As mentioned before, Emirates has different award prices for each partner. For flights on Alaska Airlines to Hawaii, you’re looking at prices of 40,000 Emirates miles in coach and 75,000 Emirates miles in business class (first class) for round-trip flights. Emirates does not allow one-way award tickets on Alaska Airlines, so you’ll have to book round-trip.\n\nEmirates coach award prices are decent, but their business class (first class) award price is pretty high. If you’re not quite set on your dates, Emirates charges only a $25 date change fee which is incredibly reasonable.\n\nFuel Surcharges: None on flights to Hawaii\n\nPros: Reasonably low coach award price, low $25 date change fee\n\nCons: Round-trip bookings are required, miles are relatively difficult to earn\n\nOther notes:\n\nInfant tickets are not permitted\n\nEtihad\n\nWe’ve already covered Etihad in the Citi ThankYou points section of this post, and they’re a good option if you need to combine points from multiple programs or if you are traveling during their off peak dates.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~5 days\n\nTo find out more about using Etihad miles to get to Hawaii, visit the Citi ThankYou points section of this post.\n\nFlying Blue (KLM/Air France)\n\nKLM/Air France Flying Blue miles are one of the best ways to fly to Hawaii with miles if you can find available award seats. Not only do they have low prices, but they are also transfer partners of Chase Ultimate Rewards, Amex Membership Rewards, and Citi ThankYou points, giving you great ability to combine miles from multiple programs.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~1 day\n\nIf you want to read about using Flying Blue miles to fly to Hawaii, visit the Chase Ultimate Rewards section of this post.\n\nIberia\n\nIberia offers a distance-based award chart which can be very valuable if you have relatively short flights (even if they involve a connection). Iberia is also a transfer partner of Chase Ultimate Rewards and Amex Membership Rewards, giving you the opportunity to combine your points.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~6 days\n\nIf you want to find out more about using Iberia Avios points to get to Hawaii, visit the Amex Membership Rewards section of this post.\n\nLufthansa\n\nLufthansa miles are a pretty useful option for United Airlines flights to Hawaii. Like United Airlines, they are a member of Star Alliance. Unfortunately, Lufthansa miles aren’t that easy to earn because they are not a transfer partner of any of the other major transferable point currencies.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~6 days\n\nAward Prices: Lufthansa has a zone-based award chart, and award prices start at 40,000 Lufthansa miles round-trip in coach. Business class awards cost 70,000 Lufthansa miles and First Class awards cost 125,000 Lufthansa miles for round-trip bookings. One way award bookings are allowed and cost half of what a round-trip booking does.\n\nPros: Reasonable coach and Business Class award prices, one-way bookings allowed\n\nCons: Relatively difficult to earn\n\nOther notes:\n\nLufthansa allows two stopovers on round-trip awards, but unfortunately this doesn’t apply to stopovers in the same region as your departure. So, while this isn’t helpful for flights to Hawaii, it’s a great perk of the Lufthansa Miles & More program.\n\nQantas\n\nQantas also offers a distance-based award chart and they have one of the best award search engines for oneworld flights. They’re not going to be the best award option for everyone, but in certain circumstances they can be.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~6 days\n\nTo find out more about using Qantas points to get to Hawaii, read the Citi ThankYou point section.\n\nSingapore Airlines\n\nSingapore Airlines is a great option for flights to Hawaii, made even better by the fact that they are a transfer partner of Chase Ultimate Rewards, Amex Membership Rewards, Capital One and Citi ThankYou Points in addition to Marriott Rewards.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: ~6 days\n\nTo find out more about using Singapore Airlines miles to get to Hawaii, check out the Chase Ultimate Rewards section of this post.\n\nUnited Airlines\n\nUnited Airlines miles aren’t going to give you the best prices for flights to Hawaii, but they are easy to earn and they are incredibly easy to use. United Airlines’ award search engine is straightfoward and you generally won’t have too much trouble finding available award seats, as long as you’re at least a little bit flexible.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: Under 24 hours\n\nIf you want to find out more about using United Airlines miles to fly to Hawaii, visit the Chase Ultimate Rewards section of this post.\n\nVirgin Atlantic\n\nVirgin Atlantic miles are a great way to access both Delta and Hawaiian Airlines award seats, but not on the same ticket. Virgin Atlantic is a transfer partner of Chase Ultimate Rewards, Amex Membership Rewards and Citi ThankYou points in addition to Marriott Rewards.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: Under 24 hours\n\nFor more information on using Virgin Atlantic Miles to get to Hawaii, visit the Chase Ultimate Rewards section of this post.\n\nTurkish Airlines\n\nTurkish Airlines is a member of the Star Alliance and it currently has the best award prices for flights from the U.S. to Hawaii of any airline.\n\nTransfer ratio: 3:1 with a 5,000 mile bonus for transfers in increments of 60,000 Marriott Rewards points\n\nTransfer time: Up to 24 hours\n\nAward Prices: \n\nRound-trip partner awards to Hawaii only cost 15,000 miles in economy and 25,000 miles in business. You can also book one-way flights for half the price.\n\nPros: The absolute cheapest award prices to Hawaii\n\nCons: You’ll have to find United Airlines saver awards and booking partner awards with Turkish Airlines isn’t always super easy. You can book them online, sometimes, but you’ll have better luck calling in to book (800-874-8875).\n\nBottom line\n\nRedeeming transferable points for award flights to Hawaii gives you the most flexibility and options to this popular bucket-list spot. That way, your trip to paradise won’t have to cost an arm and a leg. Now you’re ready to start looking into the best hotels in Hawaii you can book with points.\n\nHave any questions about getting to Hawaii we haven’t answered here? Let us know in the comments.\n\nFor more travel and credit card news, deals and analysis sign-up for our newsletter here.\n",
      "Folder": "Feedly",
      "Timestamp": "1577651457",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.350416Z"
}