{
  "id": "55ad7f46d0bc4cf0b1b909e28b7be708",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/09/5-to-know-united-mileageplus/",
      "Title": "5 Things You Need to Know About United Airlines MileagePlus The Points Guy",
      "Selection": "United’s MileagePlus program has undergone quite a transformation in the past few years. Award chart devaluations, the shift to revenue-based earnings and award routing rule changes have made the current MileagePlus stand in stark contrast to the program circa 2014. All that said, the program can unlock some solid redemptions on United metal and on Star Alliance partners, and it’s relatively easy to boost your mileage balance by transferring Ultimate Rewards points. Today, I’ll cover the top five things you need to know about United MileagePlus.\n\n1. XN Fare Availability Makes a Difference\n\nWe all want to pay the lower, Saver-level prices for award tickets on United-operated flights, which requires finding “X” fare Saver availability. As an added perk for Chase United co-branded card holders — for cards such as the United MileagePlus Explorer Card — United has a separate fare class of Saver award space, XN, that cardholders can view and book when logged in to their United account. It’s not uncommon to see results like the below screenshot; on a search for Washington, DC (IAD) to Charleston, SC (CHS) I have two extra flights at the Saver level available to me because I’m a cardholder:\n\nI’ll happily pay the $95 annual fee for the MileagePlus Explorer Card to get the XN space — it makes that much of a difference.\n\n2. United’s Award Search Engine Has Some Kinks\n\nWhen using the United award search engine, it’s important that you don’t take the initial results — or the calendar view results — at face value. By changing inputs such as cabin desired, departure time and displaying only nonstop routes, and by searching one-way, you can alter the routing options and seats that United.com shows.\n\nThis becomes even more important if you want a specific routing not initially shown on United.com. United no longer allows you to search for any two flights that show Saver availability and then call an agent to piece together your itinerary. If you want to book a itinerary that has Saver seats but it’s not an option shown on United.com, you’ll have to pay for each individual flight you want to book.\n\nSimilarly, for Star Alliance partner itineraries, United.com won’t display all (or any) of the possibilities on your first search. It’s important that you know your most desired routing and the flights possible so you can work the engine to give it the routing you want.\n\nA quick example: Next April I’m going to New Zealand and have been looking at return options. A quick one-way search for Auckland to Atlanta (AKL-ATL) on April 25, even with the flexible date box checked, still shows no results available:\n\nHowever, when I change the initial search from AKL-ATL to Auckland-San Francisco, limiting the itinerary to only one connection, a search result appears:\n\nOn the above screen, I change the destination from San Francisco to Atlanta, click search again and voilà:\n\nMultiple options now appear for Auckland to Atlanta at the Saver level on April 25. So get to know the nuances of the United award search engine, and be prepared to do multiple searches to get it to cooperate.\n\n3. Take Advantage of the Excursionist Perk\n\nUnited did away with its great award routing rules that allowed multiple stopovers and open jaws and replaced it with the Excursionist Perk, selling it as a “more flexible and intuitive” award-booking option. The simplest way to explain the Excursionist Perk is that on a round-trip award itinerary, the first flight you add that’s not in the same zone as the originating region won’t cost you extra miles. The free flight must be within a single zone, booked in the same or lower class as the inbound and outbound legs, and the round-trip ticket must end in the same zone it originated from.\n\nGiven the loose set of rules United has laid out for the Excursionist Perk, there are actually a lot of neat things you can do to maximize it. Here’s an option to get you inspired:\n\nTokyo Narita (NRT) – Washington Dulles (IAD) / Singapore (SIN) – Bangkok (BKK) – Ho Chi Minh City (SGN) / Osaka (KIX) – Tokyo Haneda (HND)\nCost: 40,000 miles\n\nThe itinerary prices as follows:\n\nNRT-IAD: 35,000 miles\nSIN-BKK-SGN:0 miles\nKIX-HND: 5,000 miles\n\nThe itinerary qualifies for the Excursionist because travel begins and ends in the same zone (Japan), and the first leg added is not in the origination zone and is wholly within a single zone (Southeast Asia). The KIX-HND leg is added for the itinerary to end in Japan, meaning I can get the SIN-BKK leg for free.\n\nYou can complete a second, similar Excursionist itinerary to close the loops and give yourself one heck of a vacation to multiple Asian destinations for very few miles.\n\n4. Pay Attention to Your Flight’s Equipment Type\n\nThe carrier has labeled most international business-class flights as Polaris on United.com. I’m hearing weekly now from people who are confused when they board and discover that it is the same old hard product with only the new Polaris soft product (think bedding and dinner presentation).\n\nTPG enjoying the new Polaris cabin on the 777-300ER.\nYou’re flying the new Polaris product in its entirety only if you’re flying the new 777-300ER, which is only serving a few routes (or if you’re lucky enough to snag a seat on the single 767-300ER that has been retrofitted). Check the route on United.com to look for 777-300ER, and check the seatmap if you’re flying on a 767:\n\nNext, there’s such a variety of equipment in the United fleet that you want to make sure you choose the best product available for your route. Look at a simple domestic route like Washington Dulles – Houston. On any given day you can pay the same 25,000 miles for a business-class seat but be on either a regional Embraer ERJ-175, narrow-body recliner 737 or 757, or a wide-body 767 with lie-flat seats — obviously, there’s a huge difference in onboard experience. The flights often leave an hour apart from each other, so make sure you look at the details of your flight and don’t sit on a regional when you could enjoy a 767.\n\n5. Booking Last-Minute Award Tickets Is Expensive, But Availability Is Great\n\nWhen booking a MileagePlus award ticket within 21 days of departure, you’ll have to pay a steep fee of $75 per ticket. Close-in ticketing fees remain one of the silliest ancillary airline charges, so make sure you know what you’re getting into if you want to use your miles close to departure. If you have United elite status, your fee will either be waived or reduced: Silver members pay $50, Gold pay $25 and Platinum and 1K members have the fee waived entirely.\n\nEven with close-in ticketing fees, I still look to United to book tickets close to departure because the program has the best award availability out of the legacy carriers. As a United cardholder, I estimate there’s a 75% chance I’ll find a last-minute Saver seat to my destination, excluding holidays. If I need a last-minute ticket that would cost $500+ but is available for 10,000 – 12,500 miles and $80.60, I’ll happily take the deal.\n\nBottom Line\n\nEven with the routing and pricing changes, this program has plenty to offer. It’s worth putting in the effort to learn the nuances to using the United.com award search engine and to understand and maximize all the possibilities of the Excursionist Perk. Above-average last-minute award availability is the icing on the cake with United MileagePlus.\n\nWhat are your top tips for maximizing the MileagePlus program?\n",
      "Folder": "Feedly",
      "Timestamp": "1505312311",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.554430Z"
}