{
  "id": "55eac87f7bfd4256a8c054abb975e84d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/965004/rhetoric-scholars-pinpoint-why-trumps-inarticulate-speaking-style-is-so-persuasive/",
      "Title": "Rhetoric scholars pinpoint why Trump’s inarticulate speaking style is so persuasive Quartz",
      "Selection": "President Donald Trump does not sound like a traditionally impressive orator. His sentences are grammatically awkward, repetitive, and composed of highly simplistic words.\n\nTrump’s remarks when he announced his campaign for presidency presents a typical example of his rambling, incoherent speaking style:\n\n“I will build a great wall—and nobody builds walls better than me, believe me—and I’ll build them very inexpensively,” he said at the time. “Our country is in serious trouble,” he added. “We don’t have victories anymore. We used to have victories, but we don’t have them. When was the last time anybody saw us beating—let’s say China—in a trade deal? I beat China all the time. All the time.”\n\nThe speech was met with widespread derision yet, less than a year later, Trump got the votes to become president of the United States.\n\nRichard Wilson, a professor of anthropology and law at UConn School of Law who has studied the language of demagogues worldwide, says that it’s not uncommon for populist politicians to speak in such a clunky style.\n\n“They use unusual speech patterns and ungrammatical phrases and long pauses—and it kind of pulls you in,” he says. Wilson notes that when he conducted a psychological survey on the speeches of Serbian politician Vojislav Šešelj, who was acquitted of war crimes at The Hague last year, the Serbian translator immediately noted Šešelj’s poor grammar. “[Šešelj] has a Ph.D,” says Wilson. “But when he comes to give a speech, he uses a particular type of language. I think Trump is doing the same. It’s what makes him stand apart from other politicians.”\n\nThere are two reasons, says Wilson, this style of speech is effective: “They [populists] want to speak like regular folks and so they often use phrases that are ungrammatical so as to seem popular,” he explains. “But they also do it because it forces us to listen more closely.”\n\nBecause Trump’s style is so confusing, audiences have to pay closer attention to make sense of his words. And this focus means listeners are more likely to be persuaded, just as you’re more likely to be convinced by a lecturer if you pay close attention rather than let her words drift over you.\n\nIt’s not foolproof, of course—listeners can still use their judgment to evaluate a speech—but it does give an advantage. After all, says Wilson, “If you’re listening to someone more intensely, then you’re more likely to be persuaded by that than if you’re not listening to them.”\n\nEdward Schiappa, professor of rhetoric and media at MIT, notes that Trump’s simplicity of language is appealing to some. “Trump’s prepared speeches are pedestrian,” he writes in an email. The president’s language is what rhetorical critics call “plain style,” says Schiappa, and “probably accounts for Trump’s popularity among the less educated citizens who prefer the sort of simplicity we saw from George Bush.”\n\nTrump’s simple speaking style also gives the impression that politics is straightforward. “People who don’t have time or the inclination to do much research or thought about certain topics think they can be solved simply—’build a wall,’ ‘bomb the hell out of them,’ ‘buy American,’” says Schiappa. “These are simple ideas that seem to address problems that bother a lot of people. “\n\nThough Trump speaks quite unlike great orators of the past, in some ways he does fulfill ancient rhetorical ideas of what makes a strong speaker. “Aristotle talked about this 2000 years ago,” says Wilson. “He talks about ethos, which refers to the credibility of the speaker.”\n\nWhereas most politicians signify their credibility by displaying their experience or reasoning, Trump shows his credibility through an outspoken, honest-sounding style. Wilson says Trump’s speaking style sends the signal that he goes “with his gut.” This gives Trump the freedom to change his mind, and also means he’s seen as a clear departure from traditional politics.\n\nMeanwhile, Trump’s also a master at Aristotle’s notion of pathos, namely influencing the emotions of his audience. “Trump does read very successfully the emotional state of his base, which at this point is angry,” says Wilson.\n\nTrump has other speaking habits that are often seen in demagogues, says Wilson, such as repetition and disgust. Wilson notes Trump shows disgust in his comments about women, such as his remarks about Megan Kelly and Hillary Clinton, and in how he talks about Mexicans. Disgust is a powerful emotional tool in creating an in group, and scapegoating outsiders by blaming them for any problems.\n\nAll politicians use repetition as a rhetorical technique, but Trump takes it to the extreme. This incessant repetition means that even totally groundless statements are reported in the media. Wilson points to Trump’s repeated remarks about Clinton’s emails as an example of how repetition can be effective. “It was continually repeated, again and again, by Trump,” he says. “To the point where people think, ‘I keep hearing it, so something must be there.’”\n\nBut while Trump’s rhetoric might have won him supporters, Schiappa says it’s far from mature language, or a sign of someone who can create strong policy.\n\n“Trump’s unprepared speaking is frightening in its incoherence,” he says. His language is lazy, Schiappa notes—for example, Trump frequently uses the word “very” instead of simply coming up with a stronger adjective.\n\n“Since the time of the ancient Greeks, one’s spoken words have been seen as an expression of one’s inward thoughts and intellectual capacity,” says Schiappa. “I think that is why so many critics are worried about Trump, because his words suggest a very simplistic mind that may not be up to the challenges of the presidency in the 21st century.”\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1493063509",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.683059Z"
}