{
  "id": "572c295f8324454e8f87032e90862c77",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://marginalrevolution.com/marginalrevolution/2018/01/tyler-cowens-12-rules-life.html",
      "Title": "Tyler Cowen’s 12 rules for life Marginal REVOLUTION",
      "Selection": "After reading Jordan Peterson’s 12 rules, a few people asked me what my list would look like.  I would stress that what follows is not a universal or eternally valid account, but rather a few ideas that strike me in the here and now, perhaps as the result of recent conversations.  I suspect the same is true for everyone’s rules lists, so please keep this in perspective.  Here goes:\n\n1. Assume your temperament will always be somewhat childish and impatient, and set your rules accordingly, knowing that you cannot abide by rules for rules sake.  Hope to leverage your impatience toward your longer-run advantage.\n\n2. Study the symbolic systems of art, music, literature. and religion, if only to help yourself better understand alternative points of view in political and intellectual discourse.  Don’t just spend time with the creations you like right away.  Avoid “devalue and dismiss.”\n\n3. When the price goes up, buy less.  Try to understand what the price really is, however, and good luck with that.\n\n4. Marry well.\n\n5. Organize at least some significant portion of your knowledge of the world in terms of place, whether by country, region, or city.  If you do that, virtually every person will be interesting to you, if only because almost everyone has some valuable knowledge of particular places.\n\n6. When shooting the basketball, give it more arc than you think is necessary.  Consistently.\n\n7. Learn how to learn from those who offend you.\n\n8. Cultivate mentors, and be willing to serve as mentors to others.  This never loses its importance.\n\n9. I don’t know.\n\n10. Heed Cowen’s Three Laws.\n\n11. Do not heed Cowen’s Three Laws.\n\n12. Every now and then read or reread Erasmus, Montaigne, Homer, Shakespeare, or Joyce’s Ulysses, so that you do not take any rules too seriously.  The human condition seems to defeat our attempts to order it.\n\nThe post Tyler Cowen’s 12 rules for life appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1516901436",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.551477Z"
}