{
  "id": "577f1cd442e948c086c7de88c1b186a2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://quartzy.qz.com/1253430/nike-epic-react-v-adidas-ultraboost-which-is-better-according-to-a-12-point-checklist/",
      "Title": "A former Nike engineer’s 12-point checklist for rating running sneakers Quartz",
      "Selection": "It took Nike chemists, engineers, and designers more than three years of development before the company was ready to release its new Epic React shoes this past February. The first running shoe to combine Nike’s React cushioning platform with the company’s signature Flyknit uppers, it made for the lightest and bounciest Nike shoes yet, and gave the company a new way to compete against its biggest adversary, Adidas.\n\nAdidas had introduced its own big innovation in bouncy soles, the Boost cushioning platform, in 2012. Since, it has become one of the company’s signature products, and the focal point of Adidas’s successful UltraBoost line of running shoes, which similarly features a sock-like knit upper paired with a squishy, springy sole.\n\nThe rival shoes are so well-matched that they raise an inevitable conundrum for shoppers: Which one is better?\n\nTiffany Beers, a longtime engineer at Nike who left the company in 2017, set out to answer the question—and created a 12-point checklist that makes a pretty good guide for rating any pair of running sneakers. Her criteria include stats that affect performance, such as weight, but also things that matter to the average consumer, like price and the ease of adjusting the laces. (Obviously there would be differences if you’re comparing cushy shoes with ones that offer a barefoot feel, so adjust accordingly.)\n\nBeers know her stuff. She was the lead engineer on the project to make the self-lacing sneakers in Back to the Future II a reality in the form of the Nike Hyperadapt. She decamped from Nike to Tesla, where she worked briefly as a technical program manager, and in March launched a YouTube channel dedicated to sneakers.\n\nWhile she may not seem an impartial judge in a Nike-versus-Adidas match up, having worked at Nike for more than a decade—and during the period of React’s development—she’s quick to dole out criticism of Nike and praise for Adidas when she feels it’s deserved.\n\nSo how did the shoes stack up? Each category was worth one point. If both shoes performed equally well, they both got a point, and if they performed equally poorly in a category, neither got a point. For instance, Beers did not love the look of the midsole on either shoe. Though it’s worth noting that the UltraBoost has already had years of success as a fashion sneaker. Here’s the final tally:\n\nNike Epic React\n\nAdidas UltraBoost\n\nPrice\n\n1\n\n0\n\nAvailability\n\n1\n\n1\n\nAesthetics\n\n0\n\n0\n\nUpper comfort\n\n0\n\n1\n\nUnderfoot comfort\n\n1\n\n0\n\nTraction\n\n0\n\n1\n\nLacing system\n\n0\n\n1\n\nStability\n\n1\n\n1\n\nFit\n\n1\n\n1\n\nQuality\n\n1\n\n1\n\nDurability\n\n1\n\n1\n\nWeight\n\n1\n\n0\n\nTotal\n\n8\n\n8\n\nBeers, however, wasn’t satisfied with a tie. “This is not soccer,” she says in the video, which is worth watching for more detail on how the shoes compare in each category.\n\nThough she notes that both shoes are far superior to anything either company had put out before, she ultimately gives the win to the Nike shoe, because of its lower price—$150 for the Epic React vs. $180 for the UltraBoost—and much lighter weight. There’s an important caveat, though: Beers has only put in about 25 miles running in each so far—not even the length of a single marathon—and says more miles are needed to see how they hold up over time.\n",
      "Folder": "Feedly",
      "Timestamp": "1524011716",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.519282Z"
}