{
  "id": "578f7734062c4956a7a727a6a9661b41",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/world/2017/7/21/16008642/jerusalem-death-protest-day-of-rage-metal-detectors-holy-al-aqsa",
      "Title": "Why people are protesting and dying in Jerusalem over metal detectors Vox - All",
      "Selection": "Access to the Temple Mount is a flashpoint. \n \nWas there ever a city of peace so prone to conflict? \n\nJerusalem, the spiritual center of the three monotheistic faiths, was rocked by protests on Friday over new Israeli security restrictions at a holy site sacred to both Jews and Muslims. The violence left at least two Palestinian men dead and more than 200 Palestinians injured in intense clashes between protesters and Israeli security forces in East Jerusalem and the West Bank. Five Israeli police officers were wounded, reportedly none of them critically. \n\nEven so, what was billed as a planned “Day of Rage” ended up being somewhat less violent than many feared it would be. \n\nThe heightened tensions began last Friday when three Arab citizens of Israel stormed the central area of Jerusalem known to Jews as the Temple Mount and to Muslims as Haram al-Sharif — the holiest site for both Jews and Muslims in Jerusalem, and the second-holiest place in Islam — killing two Israeli police officers. The assailants were shot on site. \n\nIn reaction to the terror attack, Israeli Prime Minister Benjamin Netanyahu’s government imposed unusually strict security measures on access to the Temple Mount and the area around the al-Aqsa Mosque, the golden-domed mosque often known as the “Dome of the Rock,” which sits at the center of the Temple Mount plaza. \n\nThose restrictions triggered further tensions across the West Bank and East Jerusalem, as well as across the greater Middle East. Solidarity protests took place in Ankara, Turkey, as well as Amman, Jordan — and as far away as Yemen and Malaysia.\n\nThe size and number of protests were in no small part because Netanyahu’s security decisions challenged the very delicate status quo regarding Muslim control of, and access to, this holy site. \n\n“Bottom line is that Netanyahu and the government did two things wrong,” says Gershom Gorenberg, an Israeli historian and journalist who has written about the Temple Mount for many years. “They ignored that the conflict over holy site is a conflict over legitimacy and ownership” and that “you have to handle it delicately and behind the scenes.” \n\nBy acting unilaterally, Gorenberg explains, Netanyahu provoked a response that went beyond the immediate trigger, and stirred up long-simmering resentments over Israeli control of East Jerusalem specifically, and the West Bank more generally. \n\nHere’s what happened, and why this kind of violence keeps happening in Jerusalem over and over again. \n\nNetanyahu’s extreme security restrictions didn’t go over so well\n\nThough Palestinian Prime Minister Mahmoud Abbas was quick to condemn the murder of the two Israeli police officers, Israeli security forces acted quickly to shut down all access to the Temple Mount, imposing a two-day shutdown of all access to the holy site. \n\nWhen it reopened on Sunday, Palestinian men under the age of 50 were barred from prayers at the plaza surrounding the al-Aqsa Mosque. And then Israeli security officials went further, installing metal detectors at the perimeter. \n\nPalestinian leaders reacted swiftly with anger. Fatah, Abbas’s political party, called for protesters to demonstrate Friday in a massive “Day of Rage” protest. \n\nLeaders advised Muslim worshipers not to go through the metal detectors, but to pray outside of them instead, creating dramatic, massive scenes Friday of thousands of men bowed in prayer in the street. \n\n“We have been under occupation for 50 years and we will not get used to the new injustice,” longtime Palestinian Liberation Organization activist Mustafa Barghouti told the press on Monday. \n\nAP Photo/Mahmoud Illean\nPalestinians pray outside Jerusalem's Old City on Friday, July 21, 2017.\nAt the core of the issue is a fight over control of sacred religious sites\n\nPractical day-to-day control of, and access to, the specific holy sites of Jerusalem rests in the hands each religion’s own religious authorities, which means that when the Israeli government imposes security measures — even things like metal detectors that might seem relatively minor — without consulting with religious leaders, it can spark widespread resentment and anger.\n\nThe Muslim Waqf, the Islamic religious authority in Jerusalem, has officially controlled access to the Temple Mount through a status quo agreement in place since 1967, when Israel won control of the entire city from Jordan. That’s when access to and administration of holy sites were determined by delicate agreements with each religion. Those agreements are considered the status quo.\n\n“Determining when the status quo has been breached is tricky,” Ir Amim, a nongovernmental organization that focuses on the Israeli-Palestinian conflict in Jerusalem, wrote Thursday in a post for Israel’s left-leaning 972 magazine, “particularly given that it is not written down and in light of the delicacy of how to develop an appropriate security response at times such as these.” \n\nBut optics matter. And the Waqf, Ir Amim explained, says that controlling entry is itself an essential piece of their status quo arrangement now in place for 50 years. “Installing metal detectors manned by Israeli security forces therefore unilaterally transfers authority from the Waqf and constitutes a change in the status quo,” the organization wrote. \n\nThe Temple Mount has seen violence many times\n\nThe Temple Mount has long been a flashpoint, and observers across the city, and around the world, have spent this week worried we could see a repeat of what happened 17 years ago. \n\nIn October 2000, then–Prime Minister Ariel Sharon famously walked on the Temple Mount, after warnings not to enter, stating his walk “was no provocation whatsoever.'' \n\n''It's our right,” Sharon said that day. “Arabs have the right to visit everywhere in the Land of Israel, and Jews have the right to visit every place in the Land of Israel.” His actions triggered the Palestinian popular uprising known as the second intifada, which lasted five years and killed more than 6,000 Palestinians and more than 1,000 Israelis, according to B’Tselem, an Israeli human rights organization\n\nThis is the reason why, despite the three deaths and hundreds of injuries from Friday’s protests, observers are hoping that today’s violence marks the end, rather than the beginning, of a new flashpoint moment for the Holy City.\n\nBut that doesn’t mean the tensions are gone. “[T]his remains an acute, unfolding crisis — and it is far from over,” explained a report posted as the day wound down by Terrestrial Jerusalem, a nongovernmental organization that addresses territorial issues in the city. \n\nPreventing the violence from escalating even further will require a great deal of leadership on all sides. Whether that leadership exists remains to be seen.",
      "Folder": "Feedly",
      "Timestamp": "1500669637",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.649396Z"
}