{
  "id": "57e7ec347c7f44da885d59a16d75e70d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theatlantic.com/magazine/archive/2017/11/when-working-from-home-doesnt-work/540660/",
      "Title": "When Working From Home Doesn’t Work The Atlantic - Business",
      "Selection": "In 1979, IBM was putting its stamp on the American landscape. For 20 years, it had been hiring the greats of modernism to erect buildings where scientists and salespeople could work shoulder-to-shoulder commanding the burgeoning computer industry. But that year, one of its new facilities—the Santa Teresa Laboratory, in Silicon Valley—tried an experiment. To ease a logjam at the office mainframe, it installed boxy, green-screened terminals in the homes of five employees, allowing them to work from home.\n\nThe idea of telecommuting was still a novelty. But this little solution seemed effective. By 1983, about 2,000 IBMers were working remotely. The corporation eventually realized that it could save millions by selling its signature buildings and institutionalizing distance work; the number of remote workers ballooned. In 2009, an IBM report boasted that “40 percent of IBM’s some 386,000 employees in 173 countries have no office at all.” More than 58 million square feet of office space had been unloaded, at a gain of nearly $2 billion. IBM, moreover, wanted to help other corporations reap the same officeless efficiencies through its consulting services. Leading by example was good marketing.\n\nThen, in March of this year, came a startling announcement: IBM wanted thousands of its workers back in actual, physical offices again.\n\nThe reaction was generally unsparing. The announcement was depicted, variously, as the desperate move of a company whose revenues had fallen 20 quarters in a row; a veiled method of shedding workers; or an attempt to imitate companies, like Apple and Google, that never embraced remote work in the first place. “If what they’re looking to do is reduce productivity, lose talent, and increase cost, maybe they’re on to something,” says Kate Lister, the president of Global Workplace Analytics, which measures (and champions) working from home.\n\nIBM might have seen this coming. A similarly censorious reaction greeted Yahoo when it reversed its work-from-home policy in 2013. Aetna and Best Buy have taken heat for like-minded moves since. That IBM called back its employees anyway is telling, especially given its history as “a business whose business was how other businesses do business.” Perhaps Big Blue’s decision will prove to be a mere stumble in the long, inevitable march toward remote work for all. But there’s reason to regard the move as a signal, however faint, that telecommuting has reached its high-water mark—and that more is lost in working apart than was first apparent.\n\nHow could this be? According to Gallup, 43 percent of U.S. employees work remotely all or some of the time. As I look to my left, and then to my right, I see two other business-casual-clad men hammering away on their laptops beside me at a Starbucks just outside Chicago. They look productive. Studies back this impression up. Letting Chinese call-center employees work from home boosted their productivity by 13 percent, a Stanford study reported. And, again according to Gallup, remote workers log significantly longer hours than their office-bound counterparts.\n\nAnother batch of studies, however, shows the exact opposite: that proximity boosts productivity. (Don’t send call-center workers home, one such study argues—encourage them to spend more time together in the break room, where they can swap tricks of the trade.) Trying to determine which set of studies to trust is—trust me—a futile exercise. The data tend to talk past each other. But the research starts to make a little more sense if you ask what type of productivity we are talking about.\n\nIf it’s personal productivity—how many sales you close or customer complaints you handle—then the research, on balance, suggests that it’s probably better to let people work where and when they want. For jobs that mainly require interactions with clients (consultant, insurance salesman) or don’t require much interaction at all (columnist), the office has little to offer besides interruption.\n\nBut other types of work hinge on what might be called “collaborative efficiency”—the speed at which a group successfully solves a problem. And distance seems to drag collaborative efficiency down. Why? The short answer is that collaboration requires communication. And the communications technology offering the fastest, cheapest, and highest-bandwidth connection is—for the moment, anyway—still the office.\n\nConsider the extremely tiny office that is the cockpit of a Boeing 727. Three crew members are stuffed in there, wrapped in instrument panels. Comfort-wise, it’s not a great setup. But the forced proximity benefits crew communication, as researchers from UC San Diego and UC Irvine demonstrated in an analysis of one simulated flight—specifically the moments after one crew member diagnoses a fuel leak.\n\nA transcript of the cockpit audio doesn’t reveal much communication at all. The flight engineer reports a “funny situation.” The pilot says “Hmmm.” The co-pilot says “Ohhhh.”\n\nMatch the audio with a video of the cockpit exchange and it’s clear that the pilots don’t need to say much to reach a shared understanding of the problem. That it’s a critical situation is underscored by body language: The flight engineer turns his body to face the others. That the fuel is very low is conveyed by jabbing his index finger at the fuel gauge. And a narrative of the steps he has already taken—no, the needle on the gauge isn’t stuck, and yes, he has already diverted fuel from engine one, to no avail—is enacted through a quick series of gestures at the instrument panel and punctuated by a few short utterances.\n\nIt is a model of collaborative efficiency, taking just 24 seconds. In the email world, the same exchange could easily involve several dozen messages—which, given the rapidly emptying fuel tank, is not ideal.\n\nThis brings us to a point about electronic communications technologies. Notionally, they are cheap and instantaneous, but in terms of person-hours spent using them, they are actually expensive and slow. Email, where everything must literally be spelled out, is probably the worst. The telephone is better. Videoconferencing, which gives you not just inflection but expression, is better still. More-recent tools like the workplace-communication app Slack integrate social cues into written exchanges, leveraging the immediacy of instant-messaging and the informality of emoji, plus the ability to create a channel to bond over last night’s #gameofthrones.\n\nYet all of these technologies have a weakness, which is that we have to choose to use them. And this is where human nature throws a wrench into things. Back in 1977, the MIT professor Thomas J. Allen looked at communication patterns among scientists and engineers and found that the farther apart their desks were, the less likely they were to communicate. At the 30-meter mark, the likelihood of regular communication approached zero.\n\nThe expectation was that information technology would flatten the so-called Allen Curve. But Ben Waber, a visiting scientist at MIT, recently found that it hasn’t. The communications tools that were supposed to erase distance, it turns out, are used largely among people who see one another face-to-face. In one study of software developers, Waber, working alongside researchers from IBM, found that workers in the same office traded an average of 38 communications about each potential trouble spot they confronted, versus roughly eight communications between workers in different locations.\n\nThe power of presence has no simple explanation. It might be a manifestation of the “mere-exposure effect”: We tend to gravitate toward what’s familiar; we like people whose faces we see, even just in passing. Or maybe it’s the specific geometry of such encounters. The cost of getting someone’s attention at the coffee machine is low—you know they’re available, because they’re getting coffee—and if, mid-conversation, you see that the other person has no idea what you’re talking about, you automatically adjust.\n\nWhatever the mechanisms at play, they were successfully distilled into what Judith Olson, a distance-work expert at UC Irvine, calls “radical collocation.” In the late 1990s, Ford Motor let Olson put six teams of six to eight employees into experimental war rooms arranged to maximize team members’ peripheral awareness of what the others were up to. The results were striking: The teams completed their software-development projects in about a third of the time it usually took Ford engineers to complete similar projects. That extreme model is hard to replicate, Olson cautions. It requires everyone to be working on a single project at the same time, which organizational life rarely allows.\n\nBut IBM has clearly absorbed some of these lessons in planning its new workspaces, which many of its approximately 5,000 no-longer-remote workers will inhabit. “It used to be we’d create a shared understanding by sending documents back and forth. It takes forever. They could be hundreds of pages long,” says Rob Purdie, who trains fellow IBMers in Agile, an approach to software development that the company has adopted and is applying to other business functions, like marketing. “Now we ask: ‘How do we use our physical space to get on and stay on the same page?’ ”\n\nThe answer, of course, depends on the nature of the project at hand. But it usually involves a central table, a team of no more than nine people, an outer rim of whiteboards, and an insistence on lightweight forms of communication. If something must be written down, a Post‑it Note is ideal. It can be stuck on a whiteboard and arranged to form a “BVC”—big, visual chart—that lets everyone see the team’s present situation, much like the 727’s instrument panels. Communication is both minimized and maximized.\n\nTalking with Purdie, I began to wonder whether the company was calling its employees back to an old way of working or to a new one—one that didn’t exist in 1979, when business moved at a more stately pace. In those days, IBM could decide what to build, plan how to build it, and count on its customers to accept what it finally built at the end of a months-long process. Today, in the age of the never-ending software update, business is more like a series of emergencies that need to be approached like an airplane’s fuel leak. You diagnose a problem, deliver a quick-and-dirty solution, get feedback, course-correct, and repeat, always with an eye on the changing weather outside.\n\nI asked Purdie whether IBM’s new approach could be accomplished at a distance, using all the new collaborative technology out there. “Yes,” he said. “Yes, it can. But the research says those teams won’t be as productive. You won’t fly.”\n",
      "Folder": "Feedly",
      "Timestamp": "1507172691",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.620958Z"
}