{
  "id": "596426a76c5c4f0cbf58ef558ed38664",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/704343/watch-a-documentary-reveals-the-dismal-conditions-of-garment-workers-for-major-brands/",
      "Title": "Watch A documentary reveals the dismal conditions of garment workers for major brands Quartz",
      "Selection": "People in the West hear of the conditions endured by garment workers making clothes in Asian factories, but they rarely see them. A short documentary by the Asia Floor Wage Alliance (AFWA), a group of trade unions and labor rights activists, offers a glimpse of people at work in India, Cambodia, and Indonesia.\n\nIt includes footage from factories, which aren’t necessarily tiny, claustrophobic rooms with decrepit walls and little light. The most startling conditions are where the workers live. Some live in homes that are little more than a single, bare room with no toilet or running water.\n\n“Do you think that workers who are producing high level fashion for the global market should be living like rats?” asks Anannya Bhattacharjee, international coordinator of the AFWA.\n\nThe documentary doesn’t name which brands factories are supplying, but it follows from reports detailing worker abuses at those that supplied H&M, Gap, and Walmart. (We summarized the AFWA’s allegations and the brands’ responses to them in this story.)\n\nIt looks at unsafe workplaces, such as the Rana Plaza factory that collapsed and killed 1,134 people, and how workers are mistreated, including being sexually harassed and beaten during strikes. Its main focus is the effect of extremely low wages.\n\nOne married mother of two who earns $160 a month tells the camera, “That is just not enough to cover basic expenses.” It’s a sentiment repeated in the documentary.\n\nThe AFWA advocates for a living wage based on purchasing power that would cover a worker’s food, housing, clothing, travel expenses, children’s education, and healthcare, while still leaving a small amount for leisure or savings. It’s often more than the minimum wage in a country, but necessary for any worker to lead a decent life, according to the AFWA.\n\nIt wouldn’t cost consumers much to bring wages across Asia’s garment-producing countries up to the level recommended by AFWA. Christa Luginbuhl, a coordinator for the labor-rights group Clean Clothes Campaign, says in the documentary that her organization calculated the amount that increasing wages would add to the retail price of a t-shirt. It was just $0.10.\n",
      "Folder": "Feedly",
      "Timestamp": "1465819464",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.761575Z"
}