{
  "id": "59990ffd3d6e42b68ddeac010a1e9e0f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2017/7/27/16054140/gop-health-bill-policy-process-appalling",
      "Title": "I do not know how to convey how appalling the GOP’s healthcare process or policy is Vox All Posts by Ezra Klein",
      "Selection": "There is something very wrong with the Republican Party right now.\n \nI honestly don’t know how to convey how appalling this process or legislation is. There is no analogue in modern politics.\n\nAt about 9:30 pm, Senate Republicans released text of the healthcare bill they intend to pass tomorrow morning. The bill would detonate individual insurance markets, sending premiums skyrocketing, and push 16 million people into the ranks of the uninsured. \n\nSenate Republicans know all this, and their answer is that they don’t want the bill they pass to actually become law. For many of them, the price of passage is a guarantee from House Republicans that they will not pass the Senate’s bill into law but will instead negotiate a new bill with the Senate that both chambers will then pass.\n\nLindsey Graham: Paul Ryan assured us \"under no circumstances they believe skinny repeal is good policy or good politics.\"\n— Paul McLeod (@pdmcleod) July 28, 2017\n\nThis raises an obvious question: If Senate Republicans want to ensure the bill they released tonight never becomes law and is replaced by a better bill instead, why don’t they kill the bill they released tonight and write and pass a better one instead?\n\nThere is no sensible answer to this question. Nothing that is happening tonight makes the slightest bit of sense. All of it violates every procedural principle and policy promise Republicans put forth in the aftermath of Obamacare’s passage. \n\nIt was Mitch McConnell who said, in 2009, that “if the people who wrote this bill were proud of it, they wouldn’t be forcing this vote in the dead of night.\" Obamacare didn’t pass in the dead of night, and the people who wrote it were proud of it — they held hearings, released bill text in advance of votes, waited for Congressional Budget Office scores, and defended it on the merits. But for all their complaints and exaggerations, McConnell and his colleagues never even accused Democrats of doing what they plan to do tomorrow morning — passing a bill so irresponsible that they required assurances it would never become law.\n\nBut to vote \"yes\" under these circumstances - dead of night vote for a bill with no scrutiny that nobody wants - is just disgraceful.\n— Ross Douthat (@DouthatNYT) July 28, 2017\n\nThere is no justification for this process or this policy, and so it has created a rare moment of consensus among outside observers of all political stripes. “I have never seen such unanimity in the horror everyone on all sides is expressing toward the Senate process on this health care bill,” wrote John Podhoretz, editor of the conservative journal Commentary. \n\nIt is worth dwelling for a moment on the environment in which this legislation lands. The Senate GOP’s bill was released mere hours after the White House’s new communications director told a New Yorker reporter that Steve Bannon, President Trump’s chief strategist, is “trying to suck [his] own cock” and Reince Priebus, President Trump chief of staff, is a “a fucking paranoid schizophrenic.” And all that came amidst Trump trying to push his attorney general into resigning by insulting him in public. \n\nIf this were a season of Veep, it would be panned for its absurdity and its crude caricature of Washington. But this is real life, and millions of people’s healthcare is on the line. \n\nWe are watching indefensible policy being pushed forward in an indefensible process in the hopes that it will eventually be signed into law and implemented by an indefensible administration. And what’s stranger is everyone involved knows it. All this comes mere days after Sen. John McCain received a standing ovation on the floor of the Senate for excoriating the way this effort, and the way his institution, was being run.\n\n\"We've tried to do this by coming up with a proposal behind closed doors in consultation with the administration, then springing it on skeptical members, trying to convince them it's better than nothing, asking us to swallow our doubts and force it past a unified opposition,” he said, before basking in thunderous applause. “I don't think that is going to work in the end. And it probably shouldn't.”\n\nBut he has backed the process anyway, as have virtually all of his colleagues. \n\nWhen Donald Trump was elected president, there was much talk about the ways in which he represented something abnormal and unnerving in American politics. But the congressional GOP’s healthcare process has been stark evidence that the rot goes far deeper than the White House. McConnell may present more conventionally than Trump does, but he is breaking norms, corroding institutions, and ignoring the consequences of his policies and actions with the same reckless abandon, and almost every Senate Republican is going along with it. Something is deeply wrong with the Republican Party right now, and the country is going to pay the price. ",
      "Folder": "Feedly",
      "Timestamp": "1501222184",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.645975Z"
}