{
  "id": "599c789d265541bbbba2226420ae7f29",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1275779/how-do-babies-learn-to-talk-speaking-to-other-babies-could-be-key/",
      "Title": "Babies would rather talk to other babies than listen to your baby talk Quartz",
      "Selection": "We know that babies prefer the high-pitched sounds produced by their caregivers in “baby talk” over regular speech, but a new study provides an exciting new perspective. At five months of age, it seems that babies prefer to listen to the sounds of their peers to the cooing of their mother. \n\nResearchers at the University of Quebec tested babies on their preference for different speakers by using a specialized speech synthesizer. They were able to simulate the effects of the human vocal tract—the vocal cords, tongue and mouth—to create vowels with differing pitch and resonance, representing vowels produced by vocal tracts of different sizes. \n\nThe apparatus let the researchers compare babies’ responses to vowels produced by infants their own age, as well as vowels typical of an adult female’s speech. They tested the babies’ responses to different vowel sounds by training them to look towards or away from a chequerboard image. Simply by turning their heads, the babies indicated which sounds they preferred. \n\nThe results were striking. Five-month-olds listened to the infant vowels for 40% longer than the adult vowels, showing a clear preference for vowels that closely matched the sounds they produce themselves. \n\nThese findings present a new view on how we think about babies’ early language learning. A lot of existing research focuses on the effect of parents’ speech on language development; for example, how words produced in a higher pitch grab babies’ attention more easily and go on to shape their early vocabulary. And there is no denying that baby talk is important in child development. Babies who hear more high-pitched baby talk from their caregivers have larger vocabularies at two years of age and higher IQs at age seven. \n\nBabble teaches babies to talk\n\nBut while babies prefer to listen to adult speech when it is produced at a higher pitch, a preference for infant vocalizations over and above this might have important implications for very early language learning. Authors of the study propose that it might motivate them to vocalize more in the first months of life, which could promote the transition to babble production just a few months later. \n\nBabble is the emergence of repeated language-like syllables consisting of one or two “favorite” consonants, such as “bababa.” And we now know that it is an important indication of later language ability. Earlier onset of stable babbling leads to earlier word production and a larger vocabulary in the first two years of life. With this in mind, babies’ implicit preference for their own vocalizations could be an important factor in their path to full language use.\n\nThis is not the first study to suggest that infants’ own vocalizations may play an important role in language learning. Perception of consonants produced in their own babble may help infants filter the speech stream into something more manageable. \n\nStudies have shown that infants prefer to listen to words that match the sounds produced in their babble. For example, an infant who produces many “bababa” sounds will prefer made-up words containing “b,” such as “bapeb,” “pabep” and “pobep”. This is similar to the “cocktail-party effect,” where even in a noisy room we can pick out words that are more relevant to us, such as our name or the town where we live. \n\nIn the same way, infants’ attention is drawn to words that match the sounds they produce most often, helping them pick out words from the speech stream that they’re more likely to be able to produce. It’s no coincidence that infants’ very first words have babble-like qualities: “mummy,” “daddy,” “baby” and onomatopoeic words such as “baa baa” and “woof woof.”\n\nThe importance of infants’ perception of their own vocalizations is supported by research into babies who are deaf. Studies of deaf babies have shown that they do babble but they start babbling much later than hearing infants. \n\nWithout feedback on their own babble production, deaf infants typically cease to babble after a few months. These studies have allowed us to piece together a more comprehensive picture of how human language emerges, taking into account the importance of infant vocalization long before they produce their first word. \n\nBabies learn from the adult world around them, but they also learn from their own early vocalizations. These new findings suggest that this begins much earlier than we previously thought. Perhaps language production does not start with words or even babble, but with vocalizations that begin long before the first speech-like sounds are produced.\n\nThis article was originally published on The Conversation. Read the original article.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1526187429",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.507515Z"
}