{
  "id": "5bea88897dd14311a29ad33c123f42af",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/identities/2016/11/30/13793198/texas-abortion-fetus-funeral-buried-cremated",
      "Title": "Texas will now require aborted fetuses to be cremated or buried Vox - All",
      "Selection": "Unless legal challenges go forward soon, Texas will become the first state to enact this kind of regulation. \n \nThe Texas health department finalized rules this week that will require fetal tissue to be cremated or buried, no matter the stage of development. The new regulations, which are scheduled to take effect on December 19, could dramatically increase the cost of an abortion for women without adding any clear public health or safety benefits. \n\nOther states have proposed similar measures, and Indiana actually managed to pass one that was later blocked in court. But if legal challenges don’t block the new rules in the next few weeks, Texas will be the first state to actually enact such requirements. \n\n“These new restrictions reveal the callous indifference that Texas politicians have toward women,” David Brown, senior staff attorney at the Center for Reproductive Rights, said in a statement Monday after the new regulations were finalized. “Forcing a woman to pay for a burial after she ends a pregnancy or experiences a miscarriage is not just absurd — it is an unnecessary burden and an intrusion on her personal beliefs.”\n\nHealth department officials later clarified that the rules won’t apply to miscarriages or abortions that happen at home, the Texas Tribune reported, and that no birth or death certificates will have to be issued. The regulations apply to hospitals, abortion clinics, and other health care facilities, but not individual women. \n\nThat wasn’t the case for a similar law in Indiana signed by Vice President-elect Mike Pence earlier this year. That law, which was later blocked by a judge, did apply to miscarriages, and was so poorly written that it could have technically required women to cremate or bury their menstrual blood. (The law, which also included a ban on abortions based on the fetus’s race, sex, or “disability,” was blocked because it unconstitutionally restricted a woman’s choices in seeking abortion.)\n\nLaws like these are sometimes described as requiring “funerals for fetuses.” To be clear, this doesn’t mean that women are required to host or attend memorial services. But it does effectively require women to pay for funerary services, cremation or burial, that are normally optional — if they’re offered at all — for fetuses or fetal tissue. \n\nThat’s because using funerary services instead of normal medical waste procedures is likely to dramatically increase costs for health care centers (as much as two- to fourfold, Planned Parenthood estimated), which would be passed on to the patient. Advocates say they fear the regulations could even close clinics that aren’t able to find a funeral service provider who will work with them. \n\nAccording to the Center for Reproductive Rights, officials at the Texas Department of Health and Human Services ignored concerns about the regulations raised by medical organizations and legal experts during a public comment period after the rules were first proposed in July. \n\nJulie Rikelman, litigation director at the Center for Reproductive Rights, told reporters in a Wednesday press call that the center is “taking a very close look” at whether and how to mount a legal challenge against the regulations in the coming weeks, since they are scheduled to go into effect very soon. \n\nFetal burial bills are becoming the latest trend in anti-abortion lawmaking \n\nGuttmacher Institute\n\nFetal burial requirements like the ones in Texas appear to be the hot new trend in tactics that could use burdensome regulations to limit abortion indirectly. \n\nIn addition to the blocked law in Indiana, Ohio has been trying to pass a law requiring fetal tissue to be cremated or buried. That push started after state Attorney General Mike DeWine made baseless claims last year that Planned Parenthood improperly disposed of fetuses in landfills. (He used inflammatory language to describe a normal, legal waste disposal process, and in December 2015 he backed off of threats to pursue legal action against the organization.) \n\nThis is definitely not the first time abortion opponents have pushed laws that would either burden abortion providers or close clinics without any clear medical benefit, nor is it the first time such laws have been copied in other states that hope to use them to restrict abortion. \n\nEver since Republicans took over many state legislatures in the 2010 wave election, states have passed hundreds of laws designed to limit abortion in various ways. \n\nNot all of these laws are unique. Many are copies of model legislation proposed by lobbying groups like Americans United for Life. And many start off being proposed or passed in just one or a few states, before spreading to others as the ideas catch on among lawmakers eager to limit abortion in any way they can. \n\nThe Supreme Court recently struck down two such laws in Texas — one that required doctors to have difficult-to-obtain “admitting privileges” at a nearby hospital, and another that required abortions to be provided in mini hospitals that are expensive to build. The Court found that these laws created an unconstitutional “undue burden” on women seeking abortion. \n\nBut while similar laws have fallen since the Court’s decision in states like Wisconsin, Louisiana, Mississippi, and Alabama, many still remain in place and will require a specific legal challenge in order to be struck down in court. (Some of these laws are similar enough to the overturned Texas laws that they could easily be struck down on the same grounds — but not quite similar enough that it would be automatic.) \n\nThat’s why pushing state anti-abortion laws has been a pretty effective strategy for the anti-abortion movement — even if those laws are likely to be found unconstitutional eventually. Fighting them takes a lot of time, money, and effort. And in the end, at least a few restrictions are likely to survive, or at least do a lot to limit abortion as long as they are allowed to remain standing. ",
      "Folder": "Feedly",
      "Timestamp": "1480549715",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.749015Z"
}