{
  "id": "5bf89b2524504442b1c9343d76af4f4e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://frequentmiler.boardingarea.com/2017/09/07/equifax-data-breach-find-youre-affected-get-protected/",
      "Title": "Equifax data breach Find out if you’re affected and get protected Frequent Miler",
      "Selection": "Equifax today announced a “cybersecurity incident”.  In other words, they were hacked, and about 143 million US consumers are potentially affected.\n\nEquifax says that the information accessed “primarily includes names, Social Security numbers, birth dates, addresses and, in some instances, driver’s license numbers. In addition, credit card numbers for approximately 209,000 U.S. consumers, and certain dispute documents with personal identifying information for approximately 182,000 U.S. consumers, were accessed.”\n\nOuch.  Luckily Equifax has made it easy to find out if you were affected.  Simply go to this website and fill out the text boxes:\n\nNeither my wife nor I were affected (assuming this site is working properly!)\n\nProtect yourself, for free\n\nAfter checking your status, you can begin enrollment in TrustedID Premier, for free, by pressing the orange button labelled “Enroll”.  Note that enrollment is not instant.  I was told that I could complete enrollment on or after September 15th:\n\nEquifax describes TrustedID Premier, as follows:\n\nThe offering, called TrustedID Premier, includes 3-Bureau credit monitoring of Equifax, Experian and TransUnion credit reports; copies of Equifax credit reports; the ability to lock and unlock Equifax credit reports; identity theft insurance; and Internet scanning for Social Security numbers – all complimentary to U.S. consumers for one year. The website also provides additional information on steps consumers can take to protect their personal information. Equifax recommends that consumers with additional questions visit http://ift.tt/2wNhTYY or contact a dedicated call center at 866-447-7559, which the company set up to assist consumers. The call center is open every day (including weekends) from 7:00 a.m. – 1:00 a.m. Eastern time.\n\nMore details about this stuff can be found here: equifaxsecurity2017.com\n\nEarn Miles Without Flying: START HERE\t\n\nThe post Equifax data breach: Find out if you’re affected and get protected appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1504834360",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.556011Z"
}