{
  "id": "5c2b1f16c96446919dbba7d175235e26",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/2016/09/apples-new-high-end-watch-crazy-tough-ceramics-baby/",
      "Title": "Apple’s New High-End Watch Is Crazy Tough. Why Ceramics, Baby WIRED",
      "Selection": "Apple’s using a cool material in its latest stable of Watches: ceramic. The shiny white wearable is the new flagship model, and starting this Friday you can order one for $1,250. Yes, that’s nine grand cheaper than the $10,000, 18-karat gold Apple Watch Edition it replaces, but it’s still about twice the price of the stainless steel Series 2. What do you get for the extra dough, beyond a slick look?\n\nToughness, mostly. “Ceramics are much more durable than metals,” says Julia Greer, a materials scientist at Caltech. To understand what she means, consider your MacBook. That anodized aluminum casing provides a handsome sheen, but drop it and you run a good chance of denting a corner. Stick it in your bag unprotected, and your keys almost certainly will scratch it.\n\nThis is why watch nerds love ceramics, and why companies like Swiss watchmaker Rado have used them since the 1960s. Rolex does it, too. So does Chanel. In fact, so does Apple—the back of each Watch uses zirconia ceramic where the magnetic charger attaches. Ceramics are non-conductive, and don’t interfere with wireless charging.\n\nCeramic timepieces are increasingly popular, and it’s easy to see why. Literally. Remember when people took to Twitter, Instagram, and Apple forums last year to complain about scratches on their new stainless steel Watches? The problem isn’t unique to Apple; all stainless steel watches scratch because metals are ductile—materials-scientist-speak that means they deform under stress.\n\nCeramics, on the other hand, are virtually scratch-proof.  “They deform in an elastic way,” Greer says. “You’ll never see the deformation, until they crack.” Unlike an aluminum or a stainless steel case, a ceramic one can take a licking and keep on ticking. The rub with ceramics is that, while they’re tough to scratch, they’re more prone to cracking compared to metal. “That’s a tradeoff mother nature usually gives us,” says Desi Kovar, a materials scientist at the Univerisity of Texas-Austin. Generally speaking, the harder and stiffer the material, the more brittle it is.\n\nCeramics are brittle because they’re loaded with irregularly distributed pores. These air pockets make ceramics lighter, but they’re structural weak points. Some ceramics, like bricks, have large pores. “The larger the pore, the easier it is to break,” Kovar says. If you’ve ever broken a ceramic vase or some such, the break probably originated at a pore.\n\nWatchmakers use a ceramic material with very fine pores. It’s called zirconia (zirconium oxide, for any chemists in the house), and it’s simultaneously hard and resistant to cracking. It also resists changes in temperature and moisture, which is why surgeons often use it in hip-replacement prosthetics. To bolster its strength (and achieve that bright, white color) Apple added alumina, another ceramic. The result is a material that’s pretty much un-scratchable, and, under most circumstances, unbreakable.\n\nIs it impossible to break? No. “But you’ll probably never experience forces that are high enough to cause fracture,” Greer says. That may be true, but at $1,250 it’s best to not test that theory.\n\n \n\nGo Back to Top. Skip To: Start of Article.\n",
      "Folder": "Feedly",
      "Timestamp": "1473378248",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.779454Z"
}