{
  "id": "5c38d94e30d14698a4aa5a159105a0db",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.frugaltravelguy.com/2016/12/our-plans-with-100000-new-chase-ultimate-rewards-points.html",
      "Title": "Our Plans with 100,000 New Chase Ultimate Rewards Points Frugal Travel Guy",
      "Selection": "Since the hubby got approved for the Chase Sapphire Reserve card, I’ve been scheming how we’ll use our new stash of points. This adds on to our existing haul of 170K points, meaning we will soon have more than 275,000 Chase Ultimate Rewards. The possibilities are endless, but I have more than a few ideas in mind.\n\nWhile it’s unlikely we’ll use all of our UR points in the next 12 months, here are a few of the ways we plan to splurge in 2017:\n\nWe’re booking a walking tour of San Juan, Puerto Rico for winter break. For just 2,885 points per person (with the Chase Sapphire Reserve) and a little more if you have the Chase Sapphire Preferred, we’re taking a guided walking tour of Old San Juan this winter break. I think this will be a fun and educational way to introduce my kids to the history of Puerto Rico, and we’ll get to see Christopher Columbus Square, Puerto Rico’s Old Casino, For San Cristobal’s Lookout Square, San Juan Cathedral, Ponce de Leon tomb, and others.\n\nWe need to book a few hotels for our Europe trip next summer. As I mentioned in my post on using Flying Blue miles to go to Europe with the kids next summer, I still have several hotels to book for our trip. I’ve got VRBO condos rented in both Rome and Florence, but need to book hotels in the Swiss Alps and northern Italy.\n\nWe’re booking a day trip to Cinque Terre from Florence, Italy. I decided to book a “home base” for us in Florence for five nights with the idea that we could travel out from there (versus going from place to place every day, and packing and unpacking all 4 of us). One day trip we’re booking through Chase Ultimate Rewards is a day trip to Cinque Terre for just 5,258 points (with Chase Sapphire Reserve) per person. This 13-hour trip will take us to four of the five villages that make up the region.\n\nWe’re doing a tour of the Tuscan countryside. There are several day trips to Tuscany from Florence to choose from, but we’re considering the full day Tuscan countryside tour right now. For 3,214 points per person, we’ll get to see the medieval town of Siena, San Gimignano (biggest tourist trap ever, but I LOVE it), and the Monteriggioni medieval fortress. Kids are a little cheaper, which means the trip will cost just 9,640 points for all four of us!\n\nI’m sending my husband on the Bob Marley Tour – with a friend. Next year will be our third year heading to the Holiday Inn Montego Bay all-inclusive resort for Spring break, and this is the third year my husband has tried to rope me into the Bob Marley tour. I don’t really want to go, for numerous reasons you can discover if you google the tour and read the reviews =)\n\nThis year, however, we are going to this resort with friends! So, I can send my husband with my friend’s husband, and they can “enjoy the experience” while we relax. The Bob Marley Experience is just 6,042 Chase Ultimate Rewards points if you book through the portal and have the Chase Sapphire Reserve.\n\nFinal Thoughts\n\nAs you can see, I love using Ultimate Rewards points for excursions. I am also extremely flush with airline miles right now, making a point transfer completely unnecessary.\n\nThis is part of the reason I love flexible points like Chase Ultimate Rewards, too. You can literally spend them however you want – for travel, for flights or hotels, or for cash back if you want.\n\nWhat is your favorite way to spend Chase Ultimate Rewards points?\n\n \n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1481854148",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.738008Z"
}