{
  "id": "5c772f65fc344dcc938913a07af62592",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://quartzy.qz.com/1152498/in-defense-of-donald-trump-drinking-a-dozen-diet-cokes-a-day/",
      "Title": "In defense of drinking one dozen Diet Cokes a day Quartz",
      "Selection": "This weekend, when the New York Times ran a profile (paywall) about the daily life of Donald Trump, we learned that the US president drinks not one or two, but 12—or more!—cans of Diet Coke a day.\n\nJournalists, social media users, and citizens of the world at large are in a tizzy. Should anyone be surprised, though, given we already knew Trump simply presses a button on his desk in the Oval Office when in in need of a soda and gets one delivered posthaste?\n\n“Nobody drinks that much Diet Coke in one fucking day. He might be a serial killer,” wrote one Twitter user, the declaration garnering more than a thousand retweets. Others rebuked the president for indulging in junk food, over-caffeinating, or seeming to lack any interest in self-preservation.\n\nThose are valid criticisms, and there are a few minor downsides to drinking 12 cans of Diet Coke a day. But consider the myriad of benefits. Diet Coke is sweet, but not sugary, and contains zero calories. Yet it’s formulated in such a way to stimulate taste buds the same way that drinks full of actual sugar do, making it a decent substitute for people trying to stave off diabetes or cut weight while accustomed to a traditional high-carb Western diet. And a regular-size single can of Diet Coke contains about 40 mg of caffeine—less than half the amount of a cup of black coffee.\n\nThen there are its merits in filling an existential void. “Cracking open a can of it, or pouring some over ice, helps me survive a long work day,” one impassioned journalist wrote in NPR in 2012, responding to a wave of criticisms against Diet Coke launched by health and wellness magazines. The Outline earlier this year published an in-depth takedown of anti-Diet Coke claims, calling it a “magical, calorie-free elixir.”\n\nIn other words, as far as vices go, this one is relatively harm-free. All the more power if you can get it delivered—in a wine glass—by glove-clad servers waiting quietly behind you as you address the prime minster of Japan, as is the case in this set of infamous photographs taken earlier this year.\n\nCoca-Cola has been struggling to sell Diet Coke in recent years, as the world’s preferences shift to foods and drinks that are marketed as “natural” or “organic”—but good on Trump for doing his part to keep this particular American habit— and industry—alive.\n",
      "Folder": "Feedly",
      "Timestamp": "1512949510",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.563489Z"
}