{
  "id": "5d06fb97c1e6481c8dc7e7cbd5230a51",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/dell-credit-amex-business-platinum-how-to-use/",
      "Title": "15 Items You Can Get for Free With the Amex Business Platinum’s Dell Statement Credit The Points Guy",
      "Selection": "Card members of the Business Platinum® Card from American Express just got two valuable new perks: up to $200 in statement credits for Dell purchases each year and a complimentary year of global WeWork access.\n\nYou can now sign up for the WeWork benefit, and the Dell statement credit went live right at midnight on Feb. 1. That’s when we learned that the $200 benefit is broken into two different semiannual $100 statement credits for making a purchase through Dell.\n\nThere were a lot of yawns when this benefit was announced. After all, most card members probably figured that you’d have to buy a Dell laptop or Dell supplies to use this credit. However, after diving into Dell’s online catalog, I’m finding literally thousands of items for sale through Dell for under $100. These include:\n\n7 docks & stands\n\n319 keyboards & mice\n\n144 batteries, chargers and adapters\n\n318 carrying cases\n\n272 audio\n\n1,090 cables and adapters\n\nThat’s a bunch of options, so let’s highlight some of the items under $100 that might be the most appealing to travelers. Just don’t forget to register for the promotion before you make any of these purchases using your Business Platinum Card.\n\nIn This Post\n\nKensington SecureTrek backpack: $99.99\n\nThere are 130 backpacks available for sale through Dell for under $100. The one that stands out to me as the most logical for travelers is the Kensington SecureTrek. Capable of holding up to a 15.6-inch laptop and a 10-inch tablet in padded sleeves, the backpack is designed with a number of anti-theft measures including a locking base and anti-puncture zippers. And it’s not too heavy, at just 3.11 pounds.\n\nIncase City Backpack: $99.95\n\nImage courtesy of Incase.\n\nFor those carrying bigger laptops, the just-under-$100 Incase City Backpack is designed to hold the 17-inch Apple MacBook Pro. Interestingly, this is being sold for $30 cheaper on Dell than it is on Incase’s own website. The sleek backpack features numerous compartments and sleeves to keep everything in place.\n\nTargus Sport Backpack: $23\n\nIf you’re looking for a cheap day pack instead, consider the Targus Sport Backpack. At just $23, it’s large enough to carry a 15.6-inch laptop while being small enough to be carried on as a personal item — even on restrictive low-cost airlines like Frontier and Spirit. The blue version is marked down to $22.99 while the black and red versions currently cost $27.99 before tax.\n\nLogitech USB Headset H390: $30\n\nAmong the 149 headphones and headsets available for under $100 through Dell, the $29.99 Logitech USB Headset H390 popped out as a practical choice. I’ve found that headsets with a boom mic can be a hands-free neck-saver for long phone calls with airline agents or hourslong holds waiting for a Marriott agent. It’s a wired headset with a USB plug, making it most practical for VOIP calls. But, you might be able to use an adapter to connect your phone.\n\nSony MDR-XB650BT headphones: $98\n\nIf you’d rather go wireless, the Sony MDR-XB650BT is currently marked down from $128 to $98. These over-the-ear headphones connect to your phone via NFC or Bluetooth and promise up to 30 hours of battery life. These headphones also have a built-in microphone that also makes it good for making calls. Available in black, blue and red colors.\n\niHome iBT370 portable speaker: $30\n\nI’m such a fan of my Oontz Angle 3 portable speaker that I made it my pick for TPG’s holiday gift guide. Unfortunately no Oontz speakers are available through Dell — although the Angle 3 Plus is available through the TPG Shop. However, there are 154 other speakers available for under $100. In the budget category, there’s the $29.99 iHome iBT370. Weighing just 5 ounces and with a stated battery life of 8 hours, it’s a light choice for taking your music on the road.\n\nBose SoundLink Micro portable speaker: $79\n\nOn the higher end of the speaker scale is the Bose SoundLink Micro — which is currently marked down to $79 from the standard $99 price. The 10-ounce waterproof speaker seems rugged enough for any travel plans you might have.\n\nSony PS-LX300USB turntable: $98\n\nIn case you missed it, vinyl is making a comeback. According to a recent survey, nearly 50% of vinyl record purchases are by those under 35. Whether you’re a young or old vinyl lover, if you need a new turntable, the Sony PS-LX300USB is currently marked down from $128 to $98. Even better, it has a PC connection for digitizing old records.\n\nEPSON Expression Home XP-440 printer: $49\n\nIf you’re looking for a compact all-in-one printer, scanner and copier for use at home, the EPSON Expression Home XP-440 is currently marked down from $99 to $49 through Dell. It’s capable of printing up to 10 pages per minute and scanning up to 1200 x 2400 dpi. And it’s a wireless printer for ease of use through your computer, laptop, tablet or phone.\n\nUrban Factory Lipstick 2,600 mAh battery: $11-13\n\nFor those of us who travel with electronics, you know how critical a backup power bank can be to saving the day. Among the 78 portable charging devices under $100, there’s four “lipstick” power banks available starting at $10.99. Depending on your phone, these are going to be about one cell phone battery worth of charge.\n\nVisionTek 8,000 mAh battery: $27\n\nIf you’re looking for more than just one charge, the VisionTek battery is one of the best options on Dell’s website when it comes to price per capacity. The 8,000 mAh battery costs just $26.99.\n\nAmazon Echo Dot: $50\n\nIt seems everyone already has a smart speaker in their home. But if you don’t — or want to upgrade yours — the 3rd-generation Amazon Echo Dot is available for just $49.99 through Dell in both white and gray colors.\n\nGoogle Home Mini: $49\n\nIf you’re more of a Google fan, you might want to purchase the six-ounce Google Home Mini instead. The Google assistant is available through Dell for just $49 before tax.\n\nMcAfee Total Protection 5 Device: $90\n\nOn the software side, there are 134 options under $100 including a range of photo and video editing tools that travelers may find useful. But, security is paramount — especially when traveling. If you don’t already have a security solution, you can purchase McAfee’s anti-virus, identity and privacy protection “Total Protection” bundle through Dell for $89.99 before tax.\n\nMicrosoft Office 365 Personal 1-Year: $70\n\nAnother practical software option is the single-user license of Microsoft Office 365 Personal for $70 or the 5-user Microsoft Office 365 Home for $100. The bundle includes Word, Excel, PowerPoint and 1 TB (per user) of online storage through OneDrive. While it’s not the sexiest option on the list, it could be a real money saver for those that’d have to pay for Microsoft Office another way.\n\nWhat Doesn’t Work\n\nDell gift cards can seem like an easy way of maximizing the statement credit — banking funds for a larger purchase later. Unfortunately, Dell doesn’t sell its own gift cards directly. So, the purchase won’t trigger the statement credit.\n\nMaximizing Your Purchase\n\nBefore you make your purchase, make sure to register for the Dell statement credit. And while you’re on the American Express website, check your Amex Offers to see if your Amex Business Platinum is targeted for an Amex Offer for 10% cash back on Dell purchases:\n\nThe terms of that Amex Offer say that you’ll need to make the purchases through Dell.com/amex. So, you’ll probably want to use this link to make sure that you get 10% cash back. However, if you aren’t targeted — or want to risk giving up the 10% cash back for potentially even more cash back — you can click through a cash-back portal such as TopCashBack which is currently offering 5% back:\n\nThat’s not bad, but as Frequent Miler pointed out recently, Cashback Monitor’s history of Dell cash-back rates shows that 20% back offers come around every six months. If you’re looking to absolutely max out this $100 Dell statement credit offer, it might be worth waiting for an elevated cash-back offer.\n\nImage from Cashback Monitor.\n\nBy stacking these promotions, you can end up getting a free item — after statement credit — plus cash back on top of that. That’s not bad for a new credit card perk that many card members probably weren’t too excited about.\n",
      "Folder": "Feedly",
      "Timestamp": "1549752921",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.401286Z"
}