{
  "id": "5dc116e8bb194ac3b984b649c72dc857",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/967197/fourth-anniversary-of-rana-plaza-disaster-fast-fashions-dirty-secrets/",
      "Title": "“We have one eye open and one eye closed” The dirty labor secrets of fast fashion Quartz",
      "Selection": "Four years ago today, 1,134 garment workers died when their factory building collapsed in a suburb outside Dhaka, Bangladesh. “Survivors described a sensation akin to being in an earthquake: hearing a loud and terrifying cracking sound; feeling the concrete factory floor roll beneath their feet; and watching concrete beams and pillars collapse as the eight-story building suddenly seemed to implode,” Jim Yardley wrote in the New York Times. Cracks had begun to appear in the building’s structural columns the day before, but factory bosses forced workers to enter the building.\n\nIt was the biggest industrial accident the world had seen in 30 years—and global fast fashion retailers, including Benneton, The Children’s Place, and Mango were quick to say that they had no connections with the factory. But in subsequent weeks, reporters would uncover that Benetton, The Children’s Place, Mango, and a host of other brands, including Zara, Walmart, C&A, Carrefor, Joe Fresh, and KiK were, in fact, producing in the factories located in Rana Plaza. By April 30, the New York Times reported that New Wave, one of the factories in the complex, had made more than 120,000 pounds of clothing for The Children’s Place in the preceding eight months.\n\nThis is the mystery at the center of the modern global supply chain: How can brand-name clothing companies, highly valued in the market for their ability to control all manner of production challenges, not know where their products are being made?\n\nTo investigate this question, I made the first of what would become six trips to Bangladesh in July 2013. I met with factory owners, representatives of the fashion brands, trade unionists, government officials, the president of the trade association of garment manufacturers, lawyers, the World Bank, the International Labor Organization, and the US embassy.\n\nWhat quickly became clear was that the brands’ lack of visibility into their own supply chains was not an accident—or really a mystery at all. People described to me an “open secret” of subcontracting that made many factories invisible to the brands. In this system of garment production, the brands place orders with hub factories, which then farm out production to a series of spoke factories. The brands only see the hub factory, not the spokes—or the workers in them.\n\nThe reason Benetton, Mango, and Joe Fresh denied they had production in Rana Plaza was because they likely had not placed orders with those factories directly. Rather, they worked through intermediary agents or had placed orders with a hub that had used one of the Rana Plaza factories as a spoke. When Benetton tweeted, “None of the companies involved are suppliers to Benetton Group or any of its brands,” it was probably right—insofar as the company was tracking only its hub factories. The problem is that a significant amount of production happens in spokes, where workers often labor in substandard conditions that help keep costs down.\n\nSome time after I had published a long report on subcontracting in the apparel supply chain, I gave a talk to a group of mid-level fashion buyers in New York. I asked the room of more than 100 buyers if the practices I described—large factories subcontracting to smaller, substandard factories outside any kind of inspection or safety regime—sounded familiar. The first two buyers to raise their hands protested, saying their companies had very strict codes of conduct and that this kind of thing would never happen in their supply chains. But the third buyer, a woman seated in the very back row, was clear: “Oh yes,” she said, “this is exactly how it works—we have one eye open and one eye closed.”\n\nFour years after Rana Plaza, the apparel industry in Bangladesh remains a long way from being safe and sustainable. All the effort and attention these last four years has been directed at reforming “bad” factories through inspections, public shaming, and threats of lost business. But this model isn’t delivering results. So maybe it’s time for a different tack: a focus on the brands themselves. Fast fashion is booming, and getting faster all the time. Consumers and investors really like companies that rely on the kind of low-wage, low-tech labor that Bangladesh has in such abundance.\n\nSo how does a good fast fashion company treat its workers? I have a few recommendations. First, it has a stable supply chain that features long-term relationships with supplier factories. It knows where its products actually are made, which probably means that it doesn’t go through layers of intermediary agents to order those products. The price it pays its suppliers is sufficient to cover decent wages and safety standards for workers. If it has retail outlets in the US and Europe, it pays those workers fairly and doesn’t abuse their time with unfair scheduling practices. And on the runway, it promotes healthy body images for women and men and doesn’t harass its models.\n\nFast fashion doesn’t have to hurt people. It can be good for workers, consumers, and investors. But it has a long way to go—and consumers can help push the industry in the right direction. When we shop, we already consider factors like convenience, style, and price. Paying attention to how companies treat workers also should be part of the mix. When you’re shopping this week, ask about where garments get made—not just the country on the tag, but the factory. Write to customer service pushing for a more transparent supply chain. (Fashion Revolution has some great templates.) Let companies know that you, as a consumer, are invested in the people behind the labels you love.\n\nLearn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1493063065",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.609163Z"
}