{
  "id": "5e695f407b5541579850c09fff471e90",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1275938/22-american-mothers-on-what-its-like-to-go-back-to-work-after-maternity-leave/",
      "Title": "23 American mothers on what it’s like to go back to work after maternity leave Quartz",
      "Selection": "To celebrate Mother’s Day, Quartz staff collected story ideas from their mothers and sought to answer them. This mother asks: How do Americans experience going back to work after maternity leave? Read more stories from the series here.\n\nFor women in countries that offer several weeks or months of paid maternity leave, it can be unfathomable to think about returning to work only a week or even days after giving birth. But for many American women, it’s an everyday reality.\n\nThe US is the only rich nation in the world that doesn’t require companies to offer their employees paid maternity leave. Only 14% of US civilian workers in 2016 had access to paid family leave in 2016, according to the Pew Research Center. One in four US mothers return to work 10 days after giving birth. And just over one-third of American mothers don’t return to work (pdf) after having a baby. (The economic losses of not having paid family leave are significant.)\n\nQuartz asked American women to describe their experience of going back to work after giving birth. Some were lucky to have flexible schedules and found fulfillment in going back to work; others struggled with unreliable child care, unsupportive bosses, health problems, and anxiety. Here are their stories (slightly edited for clarity and length).\n\nShannon, 52, talent development\nDuration of leave: seven weeks to three months for three kids \n\nThe hardest was returning after a four-year leave. I used the time well with education, consulting, leading parts in the community. Yet my resume was a lead balloon. I ended up in a different profession via referral by a friend. It took a few years to get back. I felt handicapped yet wasn’t, but couldn’t shake the stigma.\n\nClaudia, 43, journalist\nFive months\n\n “One advantage of being an older mother is that I am in a position financially to make that choice. Others are not so fortunate.” My boss let me work from home and start at three days a week, so I was lucky compared to most American parents. However, I was not ready to leave my son when he was still so small and ended up quitting a few months later. One advantage of being an older mother is that I am in a position financially to make that choice. Others are not so fortunate, especially earlier in their careers.\n\nAmanda, 38, lawyer\nFive months\n\nIt was challenging finding a good nanny who we trusted and felt comfortable leaving our son with—and it was hard to leave him in someone else’s hands all day long—but it was also somewhat of a relief to go back to work. It turns out working full-time is in many ways much easier than taking care of a baby full-time! But I wish I had eased back in a bit more.\n\nI actually find it to be more difficult now that my son is three and has so much personality, so much to say, and feelings about things. In retrospect, a little baby is relatively easy to leave in the morning and come home to at night. I would love to spend more time with my three-year-old each day.\n\nSara, 32, digital communications\nTwelve weeks (four parental leave, two accrued paid time off, six unpaid)\n\nI was incredibly lucky in that I was the first woman to be pregnant at my company. I negotiated a ramp-up period where I started at 24 hours a week, including one day from home, then bumped up to 32 hours per week with two days from home. It allowed me to transition gently and set a reasonable expectation for my ability to fulfill my job function. That said, money was very tight from being on one income for so long and then a part-time income. I definitely missed out on opportunities because I wasn’t easily able to travel for client meetings.\n\nTia, 37, journalist\nThree months, broken up into two six-week stints\n\nMy first pregnancy I went back after six weeks; I was depressed and this helped me dig out of it, plus I was a contractor with no paid benefits. This time (my third child), I went back after six weeks, went on to leave again at three months, then back again at four and a half months. It was hectic but I hate not being at work. What I really hate is how I had three different layers of bureaucracy to navigate in order to utilize any paid leave. I had six weeks of paid bonding leave through San Francisco, six weeks of disability through California, and my company covered the same six weeks of disability at a lower level—so they pitched in nothing rather than pushing me up to full pay.\n\nMelissa, 27, nurse practitioner\nFifteen weeks\n\n “Sometimes I feel like my milk supply suffers when I work more than one day in a row and that can be really stressful.” I work three days during the week, and every third weekend. Having the days off during the week with the baby really helps with the adjustment. My husband is also on paternity leave now, so I know my baby is in great hands. It will be harder in a month when he starts at a home daycare. Sometimes I feel like my milk supply suffers when I work more than one day in a row and that can be really stressful.\n\nAllison, 31, administrative assistant\nEight weeks, but extended to nine\n\nI was a restaurant manager then. It was horrible. There was obvious guilt of leaving your kiddo so young. And the normal issues: pumping and postpartum depression. I would tell my boss that I needed to go pump, and he would yell at me that it wasn’t a good time and he didn’t have to provide time for me if it inconvenienced the company’s day-to-day. I really didn’t choose when I needed to pump, your body tells you. Needless to say, I dried up quickly and before I was ready.\n\nWe had issues finding affordable child care. We had one babysitter leave my son (six months at the time) in a running car for hours.  She’s lucky we didn’t press charges.\n\nAfter returning to work, I would go days without seeing my son because I would leave for the restaurant before he got up, then would get home after he had gone to bed. Ultimately I was forced out, and it was a good thing.\n\nNobody tells you how hard it is to be a first-time mom, with hormones, with baby, and then with the government’s “policies,” and then the stigma of society and working mothers. It’s just unbelievable, yet we do it. And we do it with grace and a BAMF Mommy attitude.\n\nSenator Elizabeth Warren is an outspoken advocate for paid family leave. (Reuters/Sam Goresh)\nSophie, 33, database migration and management\nTen weeks\n\nIt was hard. I had a flexible schedule, and daycare was close by, so I was still able to breastfeed the way I wanted to. But about two weeks after I went back to work, my daughter got sick. It started as a respiratory virus, and then turned into full-blown pneumonia, which left her struggling to breathe. She was admitted to the hospital, and I worked from her hospital room with my laptop, taking care of emails while nurses checked her oxygen levels and dosed her with antibiotics. I’m planning on taking more unpaid leave [for my next child], so hopefully this baby will be bigger before going into daycare, but it weighs on me a lot.\n\nKathleen, 27, human resources coordinator\nEleven weeks\n\nI had a good experience. We love our son’s daycare, which is only four minutes from my office. I would nurse him on my lunch hour—this helped break up my time away from him. I did miss out on the office camaraderie because of missing lunches and having to take pumping breaks, but now he is one year old, and I get good adult conversation over lunch!\n\nMy employer is also extremely flexible with hours and work from home which makes it less stressful. We also have a doctor that does wellness visits on weekends and evenings so I haven’t had to miss work for that.\n\nJessica, 25, finance\nSix weeks\n\nThe first thing that comes to mind was how sad and overwhelmed I was. I even felt like a failure having to leave my child so early. I had negative thoughts every day from knowing I was failing at providing breast milk to not spending enough time bonding with my child. I wish I had more time to bond and understand my new life as a mother.\n\nCoty, 34, lawyer at a non-profit\nThree months\n\nI had a really hard maternity leave—a premature baby who got sick a lot—and expected to dread going back to work because that is the predominant societal narrative. But I have actually loved it. As soon as I picked up my son from daycare the first time and saw that he was okay, I relaxed. I’ve been back in the office for three and a half months now. Of course I miss my baby.  But I get to use my brain and talk to adults and if I want to go grab a sandwich for lunch, I can do that without having to pack a diaper bag.\n\n “I have made an effort to talk about how happy I am to be back at work to friends and coworkers in an effort to dispel some of the ‘every mother secretly wants to be at home with the baby’ stereotype.” It has definitely made a big difference that I have an office of my own with privacy to pump, and a supportive workplace that allows me to continue doing so. It’s a constant juggling act, but being back at work has made me a better parent. When I am with my son, I am grateful to be with him and not dreading the long expanse of day to fill. And when he’s at daycare and I’m at work, I know that he’s safe and learning. I have made an effort to talk about how happy I am to be back at work to friends and coworkers in an effort to dispel some of the “every mother secretly wants to be at home with the baby” stereotype.\n\nErin, 32, technology\nSixteen weeks\n\nTo be honest, it was quite positive. My company provided 16 weeks paid and at the end of it I felt excited to return to work. The transition back was, as expected, an adjustment at first, but my team and family were both supportive which made a huge difference. I’m due with baby number two in November and feel very optimistic about the process being just as smooth.\n\nMargo, 35, digital marketing specialist\nThree months\n\nA full nightmare. An actual waking nightmare. My daughter had feeding and weight issues that we were still trying to sort out. (It turned out she was pooping blood because she was allergic to both dairy and soy. What a fun mystery to solve that was!) I hadn’t yet had a full night of sleep and wouldn’t for months and months after, because she didn’t sleep through the night until after she was one.\n\nI don’t know how I did it, and I’m one of the lucky ones. I cobbled together 10 weeks paid and only had to take two unpaid. It honestly humbled me to my core and made me militant in my belief that all new parents need at least six months paid, minimum.\n\nOnly 14% of US civilian workers in 2016 had access to paid family leave, according to the Pew Research Center. (Reuters/Joshua Lott)\nLindsay, 36, certified public accountant\nEleven weeks\n\nMy experience has been positive. I am able to set my own pump schedule and have a clean, nice space to do it. I am able to shift my hours to leave on time to get my baby from daycare. I can work from home when I need to. I can go to all baby appointments as needed without penalizing my paid time off. My only criticism is I wish I received my full paycheck while I was out, rather than the 60% my short-term disability provided.\n\nMelinda, 37, early intervention program manager\nTwelve weeks unpaid\n\nI could only go back part time due to my infant’s needs and my own health issues. It was extremely difficult to find quality and affordable care, pump enough milk for him to be fed when I wasn’t there, but also impossible to pay the bills without my job. And it feels terrible to not be able to rest and enjoy your baby, and to go back to work when you’re still barely getting any sleep. I am thankful my employer was flexible and understanding, otherwise it would have been impossible, not just hard! This is a big part of the reason I only have one child.\n\nAshley, 28, teacher\nSix weeks\n\n “It honestly humbled me to my core and made me militant in my belief that all new parents need at least six months paid, minimum.” It was hard leaving my newborn daughter with someone that I had only recently met. It’s even more difficult finding adequate time to pump and the stress of producing enough is at times unbearable. My workplace is more than accommodating, but being a teacher makes it difficult to leave the students during class not knowing if they’re getting the help that they need, let alone knowing that their behavior changes when I’m not there. It’s a catch-22: I love my job. But I miss my daughter.\n\nCynthia, nonprofit\nEleven and a half weeks\n\nTwo kids at two different jobs. Both unpaid. I was a wreck after my first—colic, no sleep, came back to a giant pile of work and pumping accommodations that maybe just barely met the law. Wasn’t covered by FMLA [the Family and Medical Leave Act] with the second, was warned I could be fired and advised to take an even shorter leave. [At the second job] my department and coworkers were much more supportive, though. They had pumping space and no one seemed mad when I took time with my baby on leave or to pump.\n\nAnnalyn, 25, mammographer\nEight weeks \n\nI’m a first-time mom and I knew I would miss my child but didn’t know it was going to be as difficult as it turned out to be. My heart ached everyday and still does even with her at seven months old. As much as I would love to be home with her, I always think about how hard I worked for my degree and how fulfilling my job is. I sometimes feel selfish for thinking that, but I’m so damn proud of what I’ve accomplished career-wise that I can’t give that up, at least just yet. I wish we could stay home with our babies for more than the 12 weeks some employers allow (if you’re eligible for FMLA that is), because there’s so much growth and self-discovery that our babies go through that we miss out on.\n\nJenn, 30, teacher\nFive months\n\n “I wish I had more time to bond and understand my new life as a mother.” I work for a super-awesome, alternative-options, year-round high school program. I had five months paid time off while working from home 15-20 hours a week to extend it as long as possible. All my coworkers are very supportive of breastfeeding and understood when I had to pump, as most of them have kids.\n\nSusan, 35, nanny\nFour weeks\n\nI told my boss I’d need “at least a month” off before coming back to work. [It would be] unpaid, so I really couldn’t afford any longer. He interpreted that to mean four weeks and scheduled me to be back 28 days after my baby was born. Somehow I felt like 30 or 31 days (a whole month!) would have made a difference, but I guess not much in the end. I’m lucky though, I get to bring my baby with me [to work] and I can breastfeed whenever I need to.\n\nJennifer, 43, content editor\nTwelve weeks\n\n[It was] disorienting. I was grateful to be back in a more familiar element, but I was sleep-deprived and had a hard time catching up. At three months, my baby still wasn’t sleeping through the night, so we were waking up every three hours (or less) to her cries. And while my work had a lactation room for nursing mothers to pump, it was windowless, dark, and depressing. Plus, since I was having a hard time producing milk, I would always take longer than I had planned for, which would eat into the time I needed to spend catching up on work. So I ended up giving up on breastfeeding less than a month after I had returned to work. I don’t know how women do it with even shorter maternity leaves.\n\nSheena, 38, software engineer\nFour and a half months\n\nIt was hard. My project had been taken over by someone else and all the other good projects were snapped up also. I lost a lot of momentum and it took me a year to get it back. And I was pregnant again, so I lost the opportunity to see my project through.\n\nGail, 41, chef\nFour months\n\nIt was complicated. A part of me was ready to work again, and another part of me knew I was missing out on being with my baby. For my last child, I had started a family business, so when I went back to work, she went with me. A niece met me at job sites where I worked making the food. She would hold my baby on site while I worked and bring her to me when it was time to nurse. After a few months of that, she went to day care with her brother and sister. I had to give her formula then, another decision that was complicated for me. I always thought I would be a stay at home mom, but it turns out I am not.\n\nLearn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1526252718",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.506924Z"
}