{
  "id": "5eb1c6ad49ef4ada9b5c43f3f25a5bd5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/tech/2017/10/6/16431394/splice-dj-plugins-ozone-8-neutron-2",
      "Title": "Splice is making it much easier to buy expensive music production plugins The Verge",
      "Selection": "Cloud-based music collaboration and creation platform Splice is expanding its rent-to-own plugin offerings, adding iZotope mixing and mastering tools Ozone 8 and Neutron 2. Splice is the only company offering rent-to-own for plugins, an option it launched last year to help bedroom producers access professional tools, which can cost hundreds, and sometimes thousands, of dollars to purchase outright.\n\nSplice, which started as a cloud service for musicians to share and collaborate on projects made in DAWs (Digital Audio Workstations) like Ableton, now also includes a subscription service to a sample library with over 1 million sounds, a store for selling popular plugins like Massive (a Native Instruments synth), a library of free plugins, and a robust online community, offering remix competitions and the ability for users to access other people’s public projects.\n\nOne of the great things about Splice is that everything is either for free or for a very minimal fee, meaning producers have a one-stop shop to back up their files, source samples, and collaborate without draining their wallet. But plugins, the tools used within a DAW to do everything from create sounds to process signals, have remained cost-prohibitive. With steep price tags and only a few companies offering licensing as an alternative to purchasing, many producers either can’t access the plugins they need or want, or resort to using illegal copies.\n\nMany producers either can’t access the plugins they need or want, or resort to using illegal copies\n\nSplice attempted to solve this last year, introducing the market’s first rent-to-own plugin program. It launched with Xfer Records’ Serum, a popular wavetable synth that retails for $189. Through Splice’s program, users get three days to try out the plugin for free, and then pay $9.99 a month to use it until it’s paid in full, at which point the license is turned over. At any point, payments can be stopped and picked up at a later point. Splice’s rent-to-own option proved popular among producers as they could now use very expensive plugins for only a few dollars a month while banking equity. Serum is currently the most-used plugin available on Splice.\n\nNow, over a year later, Splice has expanded rent-to-own for the first time, adding iZotope’s mixing and mastering plugins Ozone 8 and Neutron 2. Ozone 8 retails for $499 and Neutron 2 retails for $249. On Splice’s rent-to-own platform, they’re each $9.99 a month, or can be bundled for $14.99 a month. Given that Splice’s first rent-to-own plugin was a synth and now they’ve added mixing and mastering tools, it looks like the company is working toward a full-range rent-to-own plugin marketplace that covers everything from sound creation to final touches. The company tells The Verge it is “looking forward to adding more plugins to rent-to-own soon.”\n\nA full-range rent-to-own plugin marketplace that covers everything from sound creation to final touches\n\nWhile DAWs come with their own plugins, musicians also purchase high-quality and prestige plugins like Serum separately for the sounds they make, or functions they perform. These can cost hundreds of dollars each (there are a few plugins that can cost as much as a car!), and digital musicians need a handful to perform a variety of actions. This can include actual sound creation (synths) to effects (delay, reverb, etc.) to tools used at the end for mixing and mastering the final sound. This means costs can rack up quickly even if someone’s only buying a few necessary items. As a result, people often download cracked versions that can be buggy. “Currently plugins are by and large released with daunting upfront costs and bad purchase experiences,” Splice co-founder Steve Martocci tells The Verge, “that lead the vast majority of musicians, including some of the biggest stars, to pirate them.”\n\nSome companies that create a variety of plugins have tried to solve these problems by creating subscription software models, the same way Adobe has modeled Creative Cloud, and in ways similar to how general digital media has moved from outright ownership to subscription-based business models. Waves, for example, a company that makes both plugins and hardware, has three subscription tiers for plugins. The lowest, at $9.99 a month, includes 16 plugins, and the highest, at $149 a month, includes over 150.\n\nWhile this solves a need, even Waves’ mid-tier package at $50 can feel a little spendy and most don’t need access to that many high-end plugins as learning each intimately enough to use intuitively takes time. Plus, you’ll never own the plugins. “Musicians don't need 50 plugins they barely use,” says Martocci. “They need the highest-quality plugins — the ones worth investing their time into learning and money into buying, the ones that truly raise the bar for their art.”\n\n“Musicians don't need 50 plugins they barely use. They need the highest-quality plugins.”\n\nThere’s some other bonuses with Splice’s rent-to-own. It’s cheap enough that a musician could shell out $10 to use a plugin for a month and toy around with it. Or, maybe a collaborator temporarily needs a specific plugin in order to work on a project someone else has started. In these ways, the platform’s rent-to-own acts much like a subscription platform: you pay a monthly fee, you get access. But, unlike with a subscription, you’ll eventually own the plugin if you pay into it long enough. If Splice can reach agreements with enough companies to provide a robust rent-to-own market, it would close the loop for it being a one-stop shop for their users, while providing access to (and equity in) tools that were previously cost prohibitive.\n\nVisit Splice to try their rent-to-own plugin program, now offering Serum, Ozone 8, and Neutron 2.\n",
      "Folder": "Feedly",
      "Timestamp": "1507327560",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.540586Z"
}