{
  "id": "5edc0912243c4df081ca46c00bfa82f5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/15472-a-35-minute-weeknight-roast-chicken",
      "Title": "A 35-Minute Weeknight Roast Chicken Food52",
      "Selection": "Sunday-afternoon cooking is a wonderful thing—in the hours before another chaotic work week rolls in, there's time to prepare: a quiche for office lunches, a large batch of pasta that will get you through the next few days, a poached fish that will last at least until Tuesday. But come Wednesday, the dent you made in your ready-made food stock starts to widen, and by Thursday, you're lucky if you have half a serving left of that delicious pasta. Enter: the pre-marinated roast chicken.\n\nPhoto by Mark Weinberg\n\nThis butterflied roast chicken, marinated in a mixture of buttermilk, tarragon, Dijon mustard, and nutmeg (among other herbs), tastes better the longer it sits and soaks in the simple mixture—so if you set aside 10 minutes to prepare it on Sunday, it will be perfect mid-week. Come Wednesday, all you have to do is throw it on the stove for 5 minutes, then into the oven for 30 minutes; the butterflied cut helps it cook that much faster. And since the recipe only takes 1/4 cup of wine, you'll have plenty to sip on while you kick off your shoes and raise a glass to a roast chicken that's as easy as Sunday morning.\n\nButtermilk-Marinated Roast Chicken with Tarragon and Dijon Mustard\n\nMaryFrancesCooks\n\n♥\n7\n\n+\nSave\n▴\n\nView Full Recipe \n\nServes 4\n\n1/4\n\ncup chopped fresh tarragon\n\n1\n\ntablespoon red peppercorns, crushed (black works fine as well)\n\n3 1/2\n\npounds whole chicken, backbone cut out and butterflied\n\n5\n\ncloves of garlic, crushed\n\n1 1/2\n\ncups buttermilk\n\n3\n\ntablespoons peanut oil, divided\n\n2\n\ntablespoons Dijon mustard\n\n3/4\n\nteaspoon freshly grated nutmeg\n\n1\n\ntablespoon coarse sea salt\n\n1/4\n\ncup dry white wine for deglazing (optional)\n\nIs there an undiscovered Food52 chicken recipe you love? Send us a paragraph or two at submissions@food52.com about why you love it, and it could be featured next week!",
      "Folder": "Feedly",
      "Timestamp": "1452206194",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.847106Z"
}