{
  "id": "5f83abe38d7d45f5933616ac3cb24d51",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1157663/comcast-just-changed-its-website-and-youre-not-going-to-like-it/",
      "Title": "Comcast changed its website and net neutrality fans may not like it Quartz",
      "Selection": "So it begins. The Federal Communications Commission voted on Dec. 14 to repeal the net neutrality rules that prevent US telecoms from blocking, slowing, or charging more for certain content. Those protections are gone. What’s left is an assurance that the Federal Trade Commission will enforce the voluntary commitments made by telecommunications firms like Comcast, AT&T, and Verizon.\n\nTechnically, the companies have pledged to uphold “net neutrality” commitments under the new regulatory regime. Yet the nature of those commitments are changing. Comcast’s website has changed dramatically since at least April, when the chairman of the FCC announced his intention to repeal net neutrality. Previous versions of the site, preserved by the Internet Archive, promised to not throttle content, prioritize internet traffic, or create paid fast lanes, while committing to making internet accessible to low income families.\n\nBut the website had already pared back its lofty language by November, as Ars Technica spotted at the time. The changes seem all the more glaring today.  \n\nComcast now has three lines committing to “not block, slow down or discriminate against lawful content” while stating it “believes in full transparency in our customer policies.” That leaves a lot of wriggle room. It could be that Comcast will follow through on some of its earlier promises or, as the new language suggests, it will start implementing paid prioritization (arguing that it is not discrimination). The company has been changing its language about this for months. A Comcast spokesperson told CNET in November it has “no plans” to enter paid prioritization agreements.\n\nMost Popular\n\n\t\tRead full story\n",
      "Folder": "Feedly",
      "Timestamp": "1513347166",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.517751Z"
}