{
  "id": "6037abfb37774c40b981d2fff511b876",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/948392/why-did-winston-churchill-hate-the-hindus-and-prefer-the-muslims/",
      "Title": "Why did Winston Churchill hate the Hindus and prefer the Muslims Quartz",
      "Selection": "Bhagat Ram Talwar, later known as Silver, was the only quintuple spy in World War-II, working for the British, Russians, Germans, Italians, and the Japanese. Silver, who identified as a “Hindu Pathan,” was born and raised in the northwest region of the subcontinent bordering Afghanistan. Unlike other spies, he shuttled between Kabul and India, traversing the tribal territories where Winston Churchill fought his first war. That experience would go on to establish the British prime minister’s opinions about Hindus and Muslims.\n\nLike Kipling, Winston Churchill, for whom Silver worked during the war, would also have been horrified by the thought that he was a Hindu. In 1945, after his return from Yalta, where Churchill, Franklin Roosevelt, and Joseph Stalin decided the post-war future of the world, the British Prime Minister had dinner with his Downing Street secretary, John Colville, and Arthur Harris, head of Bomber Command. Colville’s diary entry of 23 February 1945 records Churchill’s thoughts about the Hindus:\n\nThe PM said the Hindus were a foul race “protected by their mere pullulation from the doom that is their due” and he wished Bert Harris could send some of his surplus bombers to destroy them.\n\nThree years earlier Churchill had told Ivan Mikhailovich Maisky, the Soviet ambassador in London, that, should the British be forced to leave India:\n\nEventually, the Moslems will become master, because they are warriors, while the Hindus are windbags. Yes, windbags! Oh, of course, when it comes to fine speeches, skilfully balanced resolutions and legalistic castles in the air, the Hindus are real experts! They’re in their element! When it comes to business, when something must be decided on quickly, implemented, executed—here the Hindus say “pass”. Here they immediately reveal their internal flabbiness.\n\n[…]\n\nChurchill’s contrasting views of the Hindus and Muslims had been formed half a century before when he had fought his first war not far from where Silver was born. Churchill had taken part in what was called “a frontier war” with the British, putting down a rebellion by Pathans in the Swat Valley, now part of Pakistan. The war formed the subject of the first of his many books: The Story of the Malakand Field Force. The Hindus do not feature in the book and while Churchill is critical of the Muslims he admired their courage.\n\n[…]\n\nAs he gazed down on the destroyed Mohmand villages and their trampled crops, he found much to admire in the Muslims:\n\n… it would be unjust and ungenerous to deny to the people of the Mamund [the spelling then used] Valley, that reputation for courage, tactical skill and marksmen which they have so well deserved. During an indefinite period they had brawled and fought, in the unpenetrated gloom of barbarism. At length they struck a blow at civilisation, and civilisation will yet ungrudgingly admit that they are a brave and warlike race.\n\n[…]\n\nHad Churchill ever met Silver it is hard to see how he could ever have accepted he was really a Hindu.\n\nThe Indian Spy by Mihir Bose. (Aleph Book Company)\nChurchill’s sentiments regarding the brave Muslims were universally shared by British officials who got to know the region. Mountstuart Elphinstone, a classical scholar who led the first serious mission to Afghanistan in 1808, made no secret he preferred the Islamic faith over that of the superstitious Hindus and wrote, “They have also a degree of curiosity which is a relief habituated to the apathy of the Indian.” He went on to say, “I know of no people in Asia who have fewer vices or are less voluptuous or debauched.” For all the talk of the great civilising mission of imperial rule British officials were happy that none of this “brave and warlike race” wanted to be “civilised” or have anything to do with British education, let alone western values and ideas.\n\nFour years after Silver’s birth Beatrice Webb and her husband, Sidney Webb, visited Peshawar and recorded how the British officials saw the uneducated Muslim Pathans:\n\nWe are amused at the universal praise of the wild Pathans (Afridis and Afghans) of these parts. Everyone says they are fine fellows, far superior to the Hindoos! [then a common spelling for the Hindu]. We learn on cross-examination they are cruel and treacherous, shockingly addicted to unnatural vice and habitually given to stealing each other’s wives; that murder and robbery are so common as not to be deemed crimes; that the men do little work, leaving the agriculture and the care of their goats mostly to the women and boys; and that the only occupation considered worthy of manhood is the promiscuous shooting at each other, taken unawares, which they call war. When we ask why a people is admired which breaks nearly every Commandment, and is apparently of no earthly use in the universe, we are told they are fine manly fellows, ‘good sportsmen’, with a sense of humour! Verily our English standards are peculiar. The fact is that the British officer likes them because (1) they admire and respect him and his special qualities; (2) they make good soldiers under him; and (3) they in no way compete with him or ‘claim equality’, or excel in directions in which he feels himself deficient. When we ask a thoughtful Civilian whether he sees any reason to believe that, even in a couple of centuries, the Pathan will have developed into anything like a civilized people, or into anything else of use in the world, he is bound to admit that there is no sign of any such a Possibility.\n\nIn the 1930s Silver, as we shall see, played a part in helping a secular party get power in the North West Frontier, the first time and only time a secular party has ever exercised control in that part of the world. It was allied to the Congress, the main nationalist party in India. The Congress, though secular, was Hindu-dominated, not surprising since India is predominantly a Hindu country. And a bewildered Caroe wrote: “It is hard to see how the Pathan tradition could reconcile itself for so long to the Hindu leadership, by so many regarded as smooth-faced, pharisaical and double-dealing.”\n\nExcerpted with the permission of Aleph Book Company from the book The Indian Spy: The True Story of the Most Remarkable Secret Agent of World War II by Mihir Bose. ",
      "Folder": "Feedly",
      "Timestamp": "1491283944",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.616510Z"
}