{
  "id": "60d6b7e6d0e043469cf0f92b9d041dc1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/recode/2019/8/12/20758787/jeff-bezos-day-one-fund-philanthropy-charity-homelessness",
      "Title": "Jeff Bezos is quietly letting his charities do something radical — whatever they want Vox - All",
      "Selection": "Jeff Bezos is making a name for himself in the world of charity. | Nicole Craine/WireImage\n\nIs that good? Is that bad? It’s definitely unusual.\n \nWhen starting Amazon more than two decades ago, Jeff Bezos decided to build a reputation as an aggressive micromanager.\n\nWhen starting the Day One Families Fund, his new billion-dollar charity, Bezos decided to try something remarkably different.\n\nJust after he became the world’s richest man one year ago, Bezos, who had until then been conspicuously absent from the world of serious charitable giving, announced that he would give $2 billion to bolster homelessness services and early childhood education in the US. He quickly sent $100 million to two dozen well-regarded nonprofits working to provide shelter to homeless families across the country.\n\nAnd since then, he has done something that even the nonprofits receiving his millions remark is highly unusual: He has given them life-changing money with virtually no restrictions, formal vetting, or oversight, according to Recode’s interviews with eight of those funded by him and others familiar with his donations.\n\nFunders of Bezos’s stature typically cast an open call for proposals, spending months poring over applications from nonprofits and sometimes insisting on site visits, interviews, and reams of financial data. Bezos’s team instead quietly cold-called the nonprofits he was already interested in backing, asked them for a few 500-word answers, and then wired them millions of dollars in cash or Amazon shares within about six weeks of making initial contact.\n\nFunders require nonprofits to fill out reports as often as every quarter, outlining the recipients progress on the funder’s own favorite dozen-plus metrics. Bezos does require an annual report, but he doesn’t even send a rubric; nonprofits can effectively create their own accountability and send him whatever type of update they want.\n\nFunders are also prone to placing copious restrictions on their money to ensure it is spent on whatever it is they care about. What does Bezos do? He’s taken “no strings attached” to the extreme, effectively letting the nonprofits spend the money on anything that offers shelter to homeless families, even if the initiative was nowhere to be found on the original applications or grant agreements.\n\nThat all might sound pretty wild. Giving $100 million to nonprofits based on little provided information and then letting them run with it sounds, on its face, like a recipe for disaster. It conjures the image of fat-and-happy charity leaders milking extravagant salaries from others’ generosity, or profligate spending on extraneous overhead — or even outright fraud, such as when the head of the United Way embezzled $1.2 million from his foundation.\n\nTo be sure, Bezos’s approach is a wonderful arrangement for the nonprofits. Almost too wonderful. Big money, little accountability, and the marketing power of the world’s wealthiest man to boot? Of course they rave about it.\n\n“It may seem kind of crazy to have this rare opportunity and to not have the intensive oversight you’d typically expect with a funder,” said Vera Beech, who runs Community Rebuilders, a homeless shelter group based in Grand Rapids, Michigan. “But for us, it’s absolutely a dream come true.”\n\n“It may seem kind of crazy to have this rare opportunity and to not have the intensive oversight you’d typically expect with a funder”\n\nBut for everyone else?\n\nWell, here’s the surprise: Multiple experts told Recode this strategy actually makes a lot of sense. They think philanthropies should give nonprofits substantially more leeway.\n\nRisks abound, to be sure. The swiftness with which Bezos is parting with the money could backfire — and it does also contradict some of his public rhetoric about his approach to giving.\n\n“There [are] a lot of mishaps, a lot of problems, that can occur if there’s not adequate oversight,” said Daniel Borochoff, who advocates for more accountability as the head of CharityWatch. “If someone was stealing from an Amazon warehouse, I’m sure his people would be all over it. But if people were stealing from the shelter pantry, the mission-focused charity staff and volunteers might not.”\n\nOne nonprofit leader who received millions from the Day One Fund said he felt Bezos’s approach was “puzzling.”\n\n“There is no one that we partner with — that would fund us — that is this hands-off. Especially at this significant level of funding,” the leader said. “It’s very different from our typical funding relationships, you bet.”\n\nBezos representatives declined to comment for this story.\n\nThe Amazon founder has indicated he intends to be more hands-on with his other billion dollar initiative, a preschool program that Bezos has said, “I’m going to be operating.” He considers the homelessness program “a more traditional grant-making” model. \n\nBut the entire world is scrutinizing Bezos’s first serious foray into charity, both because of his new figurehead power as the world’s wealthiest person and because of how parsimonious he has historically been with his donations. The Amazon founder, along with his then-wife MacKenzie, have long countered that they did not want to rush into philanthropy — and have been willing to take withering criticism in order to avoid knee-jerk donations.\n\nJeff Bezos said little about his philanthropic giving until confronted with questions from the New York Times in the summer of 2017, after he tweeted a “request for ideas” just before briefly becoming the richest person in the world for the first time. He then spent 15 months mulling those ideas before announcing the Day One Fund. \n\n“I have a lot of ideas about philanthropy — that I’m not ready to share or talk about,” Bezos told Charlie Rose nine years ago when asked whether he would consider signing the Giving Pledge (he still hasn’t). “There are a lot of interesting unknowns. And sometimes I think we try to solve problems before we understand the problem.”\n\n“What would you do if we gave you $5 million?”\n\nThe lack of accountability built into Bezos’s system places an enormous amount of weight on the front end: If you’re going to give nonprofits an exceedingly long leash, you’ve got to make sure you choose the right nonprofits in the first place.\n\nBut the strangeness of Bezos’s philanthropy begins with the way he chose his first two dozen nonprofits.\n\nFor Beth Vann-Turnbull, the head of Housing Families First near Richmond, Virginia, it began with three missed calls while she was on vacation.\n\nThe calls came from Paul Dauber, Bezos’s personal lawyer, who, despite not working for the philanthropy, has been the primary point of contact for nonprofits like Housing Families First. He asked leaders like Vann-Turnbull an easy question: How would you like to be considered for a grant of up to $5 million?\n\n“This must be going to everyone in the country who works in homeless services,” Vann-Turnbull recalls thinking.\n\nTo a person, these calls came completely out of the blue. They had an air of mystery. But behind the scenes at the Day One Fund, an advisory board of a dozen experts on homelessness had culled together this list from their personal networks.\n\nThis was not a typical open process, where a foundation posts a public call for proposals and patiently works through the submissions. Observers have noted there’s a risk that an elite group of informants could be biasing Bezos’s work toward their favored projects, rather than honestly and comprehensively assessing who exactly has the best idea. (Bezos has praised his advisory board as “experts” in the field.)\n\nEven the invited applicants were nervous. Bezos was asking for a proposal within two weeks. Often, nonprofits can spend months laboring over every decimal point on a grant application, and for far smaller grants than $5 million.\n\nLucky for them, Bezos wasn’t asking for much: just a few general questions about their nonprofits and then, quite starkly, a 500-word answer about how they’d spend the money.\n\n“I’ll apply for a grant for $5,000 and it’s five times the length of this one,” said Darlene Newsom, who runs UMOM New Day Centers, a nonprofit that operates homeless shelters in Phoenix. “I was a little bit in awe about it.”\n\nNearly every grantee who spoke with Recode called the abridged process “unusual.”\n\n“I wouldn’t even call it an application. It was a back-of-the-envelope idea,” said one person who received money. “‘What would you do if we gave you $5 million? Okay! You’re in!’ It was quite strange.”\n\n“‘What would you do if we gave you $5 million? Okay! You’re in!’ It was quite strange.”\n\nThere would be no other questions after that five-page application. No site visits. No interviews. The next time they’d hear from Bezos’s staff, the only question was whether they’d like their donation in cash or Amazon stock. A lump sum payment arrived just before Thanksgiving.\n\n“I would love for Jeff Bezos to be there.” But don’t count on it.\n\nThat brings us to the next way in which the Day One Fund radically differs from the charity orthodoxy: Bezos basically vanished from the day-to-day experience of the nonprofits since handing them the money. That’s not unprecedented, but charity leaders say they’ve rarely, if ever, seen a donor of this size be so absent.\n\nHe has no minders routinely checking in with the 24 executive directors of the nonprofits he backed. In fact, with no full-time staff working exclusively on the billion-dollar project, Bezos has largely outsourced his non-legal interactions with his charities to a trade group, the National Alliance to End Homelessness, which has organized a few calls and meetings at conferences between various grantees, the nonprofits told Recode.\n\nThat’s left some longing for more direct interactions with Bezos’s team, which can sometimes be unresponsive to their outreach, sources say, and hasn’t seized on some open invitations from multiple grantees to their homeless shelters (which isn’t terribly uncommon).\n\nThere’s a practical reason these nonprofits want to show off for Bezos: This lack of a real relationship is a missed opportunity for them to secure future funding from Bezos down the line, multiple leaders told Recode.\n\nOther nonprofits just want to establish even a scintilla of a personal connection with the billionaire who gave their organization its largest gifts ever.\n\nNewsom said her board members have even taken to sending handwritten personal cards to Bezos’s house to say thanks. She’s planning to invite Bezos to their annual gala in October.\n\n“I would love for Jeff Bezos to be there,” she said.\n\nWhat if Jeff Bezos is right?\n\nAll signs at this point indicate that Bezos has little interest in overseeing their gala from the dais — or overseeing anything at all, really.\n\nBezos’s team’s lack of engagement reflects his broader strategy to effectively hand the nonprofits the money and get out of the way.\n\nTo say this is far from how typical funders like to do things is an understatement. Governments especially love to attach endless conditions to the money they disburse, part of a conventional wisdom baked in the 1980s that bloated nonprofits were not spending nearly enough of their funding on programming and that more supervision could help combat fraud.\n\nAnd despite escalating criticism from nonprofit leaders and academics about attaching these strings, donors continue to dangle money that comes with conditions upon conditions upon conditions.\n\nVu Le, a nonprofit leader who runs an influential blog on philanthropy issues, told Recode that donors’ obsessive focus on overhead costs serves to “infantilize” nonprofits. He compared his industry’s conundrum to volunteer firefighters arriving at the scene of a blaze.\n\n“Every three or four steps, people want to make sure the money I’m giving you is spent on the water or on the hose. I also want to make sure that any of the money isn’t spent on the rent for your fire station,” Le said. “We spend all this time trying to answer these stupid questions that we’re not fighting the fires.”\n\n“We spend all this time trying to answer these stupid questions that we’re not fighting the fires”\n\nTo be clear, the Bezos money has to be spent on family homelessness measures, but there are very few restrictions under that umbrella. The grant agreements that Bezos and the nonprofits signed do not legally limit how they spend the money, and multiple nonprofits told Recode that they’ve changed some of their plans after receiving Bezos’s gifts.\n\n“This is really the most flexible funding that we’ve ever had,” said Beech. “I could understand that some people would look for that traditional response. For us, we’re like, ‘Welcome to the modern world.’”\n\nFor example, rather than splicing the money in a series of payments, nonprofits received all the money at once. If they wanted to spend it all right away on a new fancy building, they could.\n\nAnother example: In June, the grantees submitted their first annual report to the Bezos fund. Reporting is drudgery in the world of charities, with each funder asking for their own idiosyncratic metrics to be met with on own forms, no matter how much money they actually gave. Funders can ask for reports as often as every quarter.\n\nBezos let his nonprofits send in whatever report they wanted. No form.\n\nIf any of the 24 nonprofits — or the hundreds of others that Bezos will likely choose over the next decade — flops fantastically, critics will be quick to point out that this lack of accountability was a rookie mistake. Some may even call out the other Seattle-based tech billionaire, Bill Gates, who was criticized as too trusting of nonprofits in the early years of his philanthropic efforts. Gates changed course and now requires his grantees to go through a careful vetting process.\n\nBut to many experts in the nonprofit space, the hope is that Bezos’s emerging strategy will challenge the conventional wisdom that a long leash is a bad thing for a nonprofit. Old-guard philanthropy may snicker, but so did the other sectors that Bezos has decimated during his reign at Amazon. \n\nAnd the egg is on their face, not his.\n\nRecode and Vox have joined forces to uncover and explain how our digital world is changing — and changing us. Subscribe to Recode podcasts to hear Kara Swisher and Peter Kafka lead the tough conversations the technology industry needs today.\n",
      "Folder": "Feedly",
      "Timestamp": "1565809303",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.354047Z"
}