{
  "id": "633e3f740eec4785bb0f82f15efe1060",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/guides/award-flights-to-japan/",
      "Title": "Your Guide to Using Transferable Points for Flights to Japan! This Week Chase Ultimate Rewards Points! Million Mile Secrets",
      "Selection": "The Mrs. and I recently took a trip to Japan after being inspired to visit by a friend who lived there for a few years.  And after visiting, we’re ready to go back for round two!  We loved just about everything – the culture, the food, the public transportation…and the world-class toilets.\n\nBecause of the trip, I’ve had lots of friends interested in traveling to Japan.  So I thought I’d put together a little guide on how to get to Japan using transferable points.\n\nWith Your Flexible Points, You’ll Be Riding Go Karts Around Tokyo While Dressing Up in Mario Costumes in No Time!\n\nEarning transferable points is a great way to give yourself flexibility with your travel dates.  You won’t be stuck searching for available award seats or dealing with blackout dates.\n\nHow to Use Transferable Points for Flights to Japan\n\nTo keep things simple, I’ll cover the best ways to fly in and out of Tokyo.  And I won’t cover every option for every different type of flexible rewards.  Instead, I’ll review the most useful and practical transfer partners.\n\nI’ll cover the basics that will help you make an informed decision, things like:\n\nTransfer ratio:   How many points do you need to transfer to get the number of miles you need?\n\nTransfer time:   How long does it usually take to transfer your points to the airline?  This is important because you don’t want to find an award only to see it disappear while you’re waiting for the miles to show up in your account.\n\nAward Prices:   How many miles will it take to book a flight to Japan with a particular airline?\n\nPartner Award Prices:   You can use most airline miles to book award flights on their partner airlines.  For example, you can use United Airlines miles to book award seats on ANA.  However, typically airlines have different award charts for their partner airlines.  And partner award seats are usually harder to find because in many cases, you’ll only be able to book the lowest priced (i.e. Saver level) awards.  Also, sometimes airlines don’t allow partner bookings for Business or First Class seats.\n\nFuel Surcharges:   When you book an award ticket, you’ll always have to pay for taxes and fees, which can be very high depending on where you’re going (i.e. London).  But some airlines also add fuel surcharges, in addition to the taxes and fees.  This can add $100s to the ticket cost.  So I’ll let you know whether or not you can expect these types of charges with each particular airline.\n\nPros:   What are the reasons you’d want to transfer points to an airline?\n\nCons:   What are the downsides of transferring points to an airline?\n\nOther notes:   If there are any special rules, tips, or ticks you should know for the airline, they’ll be covered here.\n\nHow to Get to Japan With Chase Ultimate Rewards Points\n\nYou can earn transferable Chase Ultimate Rewards points with the following cards:\n\nChase Sapphire Preferred® Card\n\nChase Sapphire Reserve®\n\nInk Business Preferred℠ Credit Card\n\nAnd the Chase Ultimate Rewards points you earn with the following no-annual-fee cards can be pooled onto the “premium” cards listed above, and then transferred to Chase’s travel partners:\n\nChase Freedom®\n\nChase Freedom Unlimited®\n\nInk Business Cash℠ Credit Card\n\nInk Business Unlimited℠ Credit Card\n\nBritish Airways\n\nBritish Airways operates a distance-based award chart, so British Airways Avios points aren’t the most universally useful rewards for booking awards to Japan.  With British Airways, you’ll pay based on the distance of the flight segment, NOT the total flight distance.  So shorter non-stop flights can be a good deal, but if you need a connecting flight you’ll pay extra for it!\n\nTransfer ratio:   1:1\n\nTransfer time:   Instant\n\nAward Prices:   British Airways operates a distance-based award chart.  You can use the Great Circle Mapper to estimate the distance of each segment of your flight.\n\n \n\nBritish Airways Avios Points Required for Each Flight\n\nTravel Distance\n\nCoach \n\nPremium Economy\n\nBusiness Class\n\nFirst Class\n\nOff-Peak\n\nPeak\n\nOff-Peak\n\nPeak\n\nOff-Peak\n\nPeak\n\nOff-Peak\n\nPeak\n\n0 to 649 miles\n\n4,000\n\n4,500\n\n5,750\n\n6,750\n\n7,750\n\n9,000\n\n15,500\n\n18,000\n\n650 to 1,149 miles \n\n6,500\n\n7,500\n\n9,500\n\n11,250\n\n12,750\n\n15,000\n\n25,500\n\n30,000\n\n1,150 to 1,999 miles\n\n8,500\n\n10,000\n\n12,750\n\n15,000\n\n17,000\n\n20,000\n\n34,000\n\n40,000\n\n2,000 to 2,999 miles\n\n10,000\n\n12,500\n\n20,000\n\n25,000\n\n31,250\n\n37,500\n\n42,500\n\n50,000\n\n3,000 to 3,999 miles\n\n13,000\n\n20,000\n\n26,000\n\n40,000\n\n50,000\n\n60,000\n\n68,000\n\n80,000\n\n4,000 to 5,499 miles\n\n16,250\n\n25,000\n\n32,500\n\n50,000\n\n62,500\n\n75,000\n\n85,000\n\n100,000\n\n5,500 to 6,499 miles\n\n19,500\n\n30,000\n\n39,000\n\n60,000\n\n75,000\n\n90,000\n\n102,000\n\n120,000\n\n6,500 to 6,999 miles\n\n22,750\n\n35,000\n\n45,500\n\n70,000\n\n87,500\n\n105,000\n\n119,000\n\n140,000\n\n7,000+ miles\n\n32,500\n\n50,000\n\n65,000\n\n100,000\n\n125,000\n\n150,000\n\n170,000\n\n200,000\n\nPartner Award Prices:   British Airways uses the same chart for their awards and partner awards unless you book a flight with 2+ or more partner airlines.  In that case, you’ll want to reference this chart.  You’ll notice that the prices aren’t good and the fees are hefty.\n\nWith almost all partner awards, you can only book the peak price.\n\nWith British Airways Avios points, you can book Japan Airlines flights under 650 miles within Japan for 4,500 Avios one-way + taxes & fees.  And from some West Coast cities, you can book one-way awards on partners like American Airlines or Japan Airlines starting at 25,000 British Airways Avios points + taxes & fees.  But your options for flying cheaply to Japan are limited.\n\nFuel Surcharges:   Yes\n\nPros:   Great for booking short-haul flights within Japan or non-stop flights from the West Coast\n\nCons:   Not good for folks who can’t fly non-stop or need to fly farther to get to Japan, higher fuel surcharges & fees on some flights\n\nOther notes:\n\nFor more tips check out our complete guide to British Airways Avios points!\n\nKorean Air\n\nThe price of award flights on Korean Air from North America to Japan varies between peak and off-peak dates.  You can book round-trip coach flights from the US to Japan for only 70,000 Korean Air miles during off-peak times.  Typically, the off-peak dates cover ~9 months of the year!\n\nTransfer ratio:   1:1\n\nTransfer time:   2 to 7 business days, but you can hold award seats while waiting for the transfer\n\nAward Prices:   All of the award prices listed in this chart are for round-trip flights, one-way awards cost half as much:\n\nRound-Trip Award Flight Prices With Korean Air Miles\n\nKorean Air calls their Business Class “Prestige” and the peak and off-peak dates change each year.  You can check the dates here.\n\nPartner Award Prices:   \n\nKorean Air is a member of the SkyTeam alliance.  So you can use Korean Air miles to book non-stop award flights to Japan on partners like Delta.  There are no peak or off-peak prices for the partner award chart.  This is nice because you can book these awards starting at 80,000 Korean Air miles round-trip in coach, even during the busy season!\n\nBut you can NOT book one-way award flights on partner airlines.  The following chart lists the round-trip partner award price:\n\nRound-Trip Partner Award Flight Prices Using Korean Air Miles\n\nAsia 1 includes Korea & Japan.\n\nFuel Surcharges:   They do add fuel surcharges on award flights, but for Korean Air flights and Delta partner flights to Japan, the fees are reasonable.\n\nPros:   Lots of available award seats on Korean Air flights, especially Business & First Class (but recently folks have been reporting that Korean Air isn’t as generous with opening award seats as they used to be), free stopover (layover of 24+ hours) on one-way award flights (on Korean Air flights only), free stopover & 1 open jaw (flying into a city, leaving from another) on partner award flights\n\nCons:   Partner awards can be harder to find (I’m looking at you Delta), you can only book awards for specific family members\n\nOther notes:\n\nKorean Air only allows you to book awards for eligible family members.\n\nFor more tips on booking awards with Korean Air miles check out our guide!\n\nSingapore Airlines\n\nSingapore Airlines miles are not particularly useful for getting to Japan.  The biggest advantage they have is how easy they are to earn.  You can transfer points from Citi ThankYou, Chase Ultimate Rewards, AMEX Membership Rewards, and Marriott / Starwood to Singapore Airlines.  So if you don’t have enough flexible points to get to Japan in any single program, you can easily combine points together and book award flights with Singapore Airlines miles.\n\nTransfer ratio:   1:1\n\nTransfer time:   Up to 2 days\n\nAward Prices:   Japan is in Zone 7 of the Singapore Airlines award chart.  Award flights from the West Coast are comparable in price to other options for coach flights, but Singapore Airlines only flies from Los Angeles to Tokyo.  And I’m not sure how easy it is to find available award seats.  I searched on the Singapore Airlines website for ~15 minutes and could only find partner award flights.  Maybe you’ll have better luck.\n\nOne-Way Saver Award Prices With Singapore Airlines Miles\n\nBecause of Singapore Airlines’ more restrictive routing rules, I couldn’t find flights with Singapore Airlines from the East Coast.  But even if you can find those award seats, you’re better off booking a partner award, which will cost fewer miles.  But you’ll want to pay attention to fuel surcharges with certain airlines.\n\nPartner Award Prices:   Singapore Airlines is a member of Star Alliance.  You can book awards with their partner airlines from North America to Japan for:\n\nCoach – 108,000 Singapore Airlines miles round-trip\n\nBusiness Class – 210,000 Singapore Airlines miles round-trip\n\nFirst Class – 250,000 Singapore Airlines miles round-trip\n\nOne-way partner awards are half the price of the round-trip partner awards.\n\nFuel Surcharges:   Singapore Airlines does not add fuel surcharges to their own flights.  But if you’re booking a partner award flight you’ll pay fuel surcharges when the airline you’re flying with has them.  Most European & Asian airlines add hefty fuel surcharges.  But others, like United Airlines, don’t have any fuel surcharges.\n\nPros:   Some of the easiest airline miles to earn as they transfer from Chase Ultimate Rewards, AMEX Membership Rewards, Citi ThankYou, and Marriott / Starwood\n\nCons:   High cost of awards and restrictive routing rules\n\nOther notes:\n\nYou are allowed 1 stopover (layover of 24+ hours) & 1 open jaw (origin or destination is not the same) on round-trip Saver award flights\n\nYou can add stopovers on award flights for $100 each (up to 3 total), but you can’t book them online\n\nUnited Airlines\n\nUnited Airlines prices their awards as “Saver” awards and “Everyday” awards.  Saver awards are much cheaper, so those are what you’ll want to find and book.  Everyday awards can be absurdly expensive and are typically NOT a good deal.\n\nTransfer ratio:   1:1\n\nTransfer time:   Instant\n\nAward Prices:   \n\nCoach – 35,000 United Airlines miles for a one-way Saver Award, up to 80,000 United Airlines miles for a one-way Everyday Award\n\nBusiness Class – 70,000 United Airlines miles for a one-way Saver Award, up to 175,000 United Airlines miles for a one-way Everyday Award\n\nFirst Class – 90,000 United Airlines miles for a one-way Saver Award, up to 200,000 United Airlines miles for a one-way Everyday Award\n\nPartner Award Prices:\n\nCoach – 35,000 United Airlines miles one-way\n\nBusiness Class – 80,000 United Airlines miles one-way\n\nFirst Class – 110,000 United Airlines miles one-way\n\nFuel Surcharges:   No, United Airlines does not add fuel surcharges for their award flights or partner award flights!\n\nPros:   United Airlines awards are easy to find and book and typically there are lots of available award seats\n\nI Did This Search for United Airlines Award Seats From Chicago to Tokyo on July 17, 2018, and You Can See There Are Plenty of Last-Minute Seats!  Plus, It Only Gets Better the Farther Out You Search or If You Have a United Airlines Credit Card!\n\nCons:   Business & First Class partner awards and Everyday Awards are expensive!\n\nOther notes:\n\nUnited Airlines charges a booking fee of $75 for award flights booked within 21 days of departure.  But you might be able to avoid it with this trick!\n\nUnited Airlines allows a free stopover or a free one-way on round-trip award flights in the form of the “United Airlines Excursionist Perk” \n\nIf you have one of the Chase United Airlines credit cards or United Airlines elite status, you’ll have access to more available award seats!\n\nFor more on how to book awards with United Airlines miles check out our Ultimate Guide to United Airlines Miles!\n\nVirgin Atlantic\n\nVirgin Atlantic doesn’t fly to Tokyo or Japan, but they are worth mentioning because they have one of the best options for partner award flights from the US to Japan.  And Virgin Atlantic miles are super easy to collect.\n\nTransfer ratio:   1:1\n\nTransfer time:   Instant\n\nAward Prices:   There are no Virgin Atlantic flights to Tokyo or Japan.\n\nPartner Award Prices:   Virgin Atlantic has a different award chart for each partner airline.  You can check them out here.  But the only useful partner is ANA, and when I say useful, I mean amazing!\n\nAll the prices below are for round-trip awards – you can NOT book one-way partner award flights:\n\nRound-Trip Partner Award Prices on ANA Using Virgin Atlantic Miles\n\nThose prices aren’t typos!  You can book a First Class partner award on ANA from the West Coast to Japan for only 110,000 Virgin Atlantic miles!  That’s only 2,000 miles more than what it would take for a Singapore Airlines partner award in coach!\n\nUnfortunately, you cannot book partner award flights online.  You’ll have to book them over the phone (800-365-9500).\n\nFuel Surcharges:   Yes, but the fuel surcharges on ANA flights are reasonable.  I checked a few different flights from the US to Japan and saw fuel surcharges in the $170 range, and you’ll spend an additional ~$100 in taxes & fees.\n\nPros:   Incredible ANA awards, you can transfer Chase Ultimate Rewards, AMEX Membership Rewards, Citi ThankYou, and Marriott / Starwood points to Virgin Atlantic – so they’re easy to earn!\n\nCons:   Can’t search for or book partner awards online, only one useful award flight option to Japan, fuel surcharges on award flights\n\n Other notes:\n\nYou can search for ANA awards on the United Airlines website or Air Canada’s Aeroplan site and then call Virgin Atlantic to book the flights.\n\nBottom Line\n\nJapan is one place that should be on your bucket list!  Even outside of cherry blossom season, it is one of the most beautiful and cleanest countries I’ve visited.  And the people couldn’t be more helpful!\n\nPlus, getting there doesn’t have to cost a fortune!  With transferable points, there’s no shortage of options for booking award flights.  So I’m putting together this guide on how to use flexible points to visit Japan.\n\nFor the next installment of this series, I’ll be covering how to get to Japan using AMEX Membership Rewards points.\n",
      "Folder": "Feedly",
      "Timestamp": "1532733823",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.451961Z"
}