{
  "id": "63711963a4e14a8b848ab9d28f58b0fd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1146981/egypts-tahrir-alley-boosts-start-ups-despite-political-instability-and-violence/",
      "Title": "Egypt’s start-up “revolution” is set to dominate Africa’s tech landscape Quartz",
      "Selection": "Cairo\n\nIt was the lunches in his office in Lebanon’s capital Beirut that first got Waleed Abd El Rahman thinking about the food business. As a busy professional, the Egyptian entrepreneur had the selection of eating greasy fast food or overpriced but healthy meals from nearby restaurants. Another option was to order a home-cooked meal from a local trader, which was nutritious but wasn’t regularly available or arrived on time.\n\nWaleed reckoned that most of these women traders made decent returns only when they cooked for big company events or during religious celebrations like Ramadan and Eid. Like the cooks in his home country, they weren’t also well-connected to their customers, many of whom were professionals like him in search of healthier choices. If this was done successfully, he thought, it would allow the women to scale up their business, do something they are passionate about regularly, and achieve financial freedom.\n\nAnd so in Oct. 2015, Waleed quit his job as the managing director of the MIT Technology Review Arab Edition and moved back to Cairo to start Mumm, an on-demand, home-cooked food service. The platform, which enlists both Egyptian and Syrian refugee cooks, trains them on food safety and quality, markets their specialty dishes, and ultimately helps deliver a fresh hot meal to customers in between 60-90 minutes.\n\n“The whole business and show is about and around them,” Waleed says. “It’s about empowering them further with self-actualization.”\n\nThat audacious sense of achievement is something that pervades Egyptian startups as they gain a prominent profile in Africa’s tech landscape. Despite a government crackdown on civil liberties and independent websites, a militant insurgency in parts of the country, deadly terrorist attacks, and a dramatic fall in tourism, Egypt’s nascent tech scene remains a bright spot for the country. And after years of being scared off by political turmoil, investors are making a comeback with fundraising for Egyptian startups jumping 105% in 2016 alone.\n\n “One of the biggest wins for the revolution is that it made a lot of people believe in themselves.” The availability of a large market of almost 100 million people, a young and tech-savvy populace, rising internet penetration, and the ubiquity of inefficiencies in the public sector have coalesced to boost this technological transformation. It has also enabled an environment where many can access employment opportunities in the digital sector, influence or alter social and family dynamics and build better futures.\n\nSince the 2011 Arab Spring revolution, homegrown companies in Egypt have been created to detect and report bugs (Instabug), navigate traffic (Bey2ollak), compare online shopping prices (Yaoota), digitize death and obituary services (ElWafeyat) and provide free crowdsourced online video education (Nafham).\n\nSome of these companies, like online recruitment platform Wuzzuf and Instabug, have even been fully absorbed by Silicon Valley accelerators, establishing offices in San Francisco.\n\nThis boom, some say, is symptomatic and directly linked to the popular and largely nonviolent demonstrations that rocked the country in 2011 and forced out the dictator Hosni Mubarak who ruled the country for over three decades. While a significant amount of groundwork was done in the years prior, the civil resistance movement had a snowball effect says Amira Ahmed, who has more than a decade of experience working in and writing about the tech scene in Egypt.\n\n“There has been a much more deliberate building up of the ecosystem since 2011 and from then on, the momentum has only increased so that we’ve really seen the ecosystem start to take a more coherent shape.”\n\nAnd even though the drive for democracy largely failed, Waleed says it left many young people with the chutzpah to start their own businesses and get connected. “One of the biggest wins for the revolution is that it made a lot of people believe in themselves,” he said.\n\nWomen attend a cooking class conducted by Egyptian NGO Fard and Egyptian startup Mumm in Cairo, Egypt.\n\nTahrir Alley:\n\nThe best place to document the budding tech scene is to visit the GrEEK Campus located in downtown Cairo, just a few blocks from where the main revolution protests took place in Tahrir Square. Founded in 2013, the campus, also known as Tahrir Alley & Technology Park, is the first of its kind in the capital and offers private and co-working spaces to both startups as well as established multinational technology and media companies.\n\nLeased from the American University in Cairo, the hub was founded by Ahmed El Alfi, a former venture capitalist and a 2017 Quartz Africa Innovator. Over the years, El Afli has become an invaluable member of the Middle East and North Africa’s rapidly growing tech industry. He is the chairman of Sawari Ventures, a company that aims to transform regional economies through investments in high-impact businesses, and is also the co-founder of Flat6Labs, a leading regional startup accelerator that provides seed funding and mentorship to hundreds of entrepreneurs and businesses.\n\nThe GrEEK Campus was established at a time when the local tech ecosystem was anything but favorable for Egyptian entrepreneurs. Too many obstacles stood in their way at the time, key among them access to finance. Ahmed also says that government red tape, poor infrastructure, lack of technical skills, laws that discourage entrepreneurship, and the inability to follow best business practices to ensure long-term sustainability were some of the problems that plagued the sector.\n\nBut El Alfi, who had been an early stage investor abroad for decades, was ready to incubate and nurture small businesses. One of the companies he co-founded at the time was Nafham, a free K-12 online education platform that provides 5-15 minutes video lessons covering Egyptian, Algerian, Saudi, and Syrian curricula from primary to secondary school. The platform has 23,000 videos with over 430,000 subscribers watching the lessons through its YouTube channel. The app also has tutors who answer students’ questions, and check the veracity of videos uploaded by contributors.\n\nMostafa Farahat, a co-creator of Nafham, says they wanted to see how digital technologies could disrupt educational provision in a country where poor infrastructure and overcrowded schools hinder the full development of children. After five years of operation, Farahat says they now want to experiment with artificial intelligence and how it can enhance greater levels of individualized learning. They also want to introduce a premium service model that would allow students to get much more comprehensive or tailored support from teachers.\n\nTechnology, he said, allows for solutions that “can have a great impact. You come to understand that the country could be transformed into something different or better.”\n\nThe eagerness to crack a problem that even governments are still unable to solve is also what pushed Mostafa Kandil to launch Swvl in early 2017. The bus transportation service in Cairo allows passengers to customize their journey by finding the shortest routes, reserve their space in a bus, and then pay their fares through the company’s mobile app. In a city with notorious traffic pr0blems, Kandil says Swvl provides an alternative to locals from the unreliable public transportation, the costly ride-sharing services, not to mention the hustle of fueling their own private cars amid a protracted fuel shortage crisis.\n\n“For us, it was like a no-brainer,” Kandil, who is a former executive at the Dubai-based Uber rival Careem, said. “The demand is insane. The supply is great.”\n\nJust three months after it started operation, Careem invested $500,000 into Swvl, which currently operates hundreds of buses and serves thousands of customers per day. Uber has also announced plans to launch a national bus service in Egypt.\n\nKandil says they hope to start operating in Alexandria by end of 2017, with possible expansion to Jordan, Pakistan, and Saudi Arabia. “This mix of young people, who are talented and tech-savvy with a lot of problems to solve and a huge market to serve is like a secret sauce for building great stuff,” he said.\n\nBut to launch this grassroots tech movement into the global stage, there’s an urgent need to connect startups to relevant resources. Since 2013, Abdelhameed Sharara has run RiseUp Summit, an annual innovation event that brings together investors and entrepreneurs from both Egypt and all over the world in order to create new partnerships. The three-day event, which takes place at the GrEEK Campus, provides startups exposure, access to talent, contacts, and much-needed capital.\n\nThe RiseUp Summit at the GrEEK campus has grown to be the Middle East and North Africa’s largest innovation and entrepreneurship summit.\n\nThe rise of the summit’s profile has also encouraged investment programs like Injaz, Wamda, and Cairo Angels to further accelerate the tech entrepreneurship ecosystem in Egypt. Following in these footsteps, the government also established an incubator, The Technology Innovation and Entrepreneurship Center, to drive innovation and benefit the national economy. Sharara says the main point behind the summit is to also pass the message that even though startups might fail, it is persistence that is key.\n\n“You want to connect start-ups with the most available resources but also inspire them,” Sharara told Quartz. “So there’s this huge, positive vibe that comes from this grassroots movement inside the event, close to what happened at the revolution.”\n\nImproving the ecosystem\n\nAs the ecosystem grows and accessing finance improves, observers say there’s need for big steps to improve the system. There’s a lot of focus on seed and early-stage funding, Ahmed says, but more venture capital and private equity funds have to come in to keep up with the growing number of start-ups that need to move up to their stage of development. If the government is serious about supporting the industry, they should also introduce policies that make it easy for companies to grow. Education systems should also foster modern analytical and digital know-how skills that many start-ups need.\n\n“The inspiring thing about entrepreneurs is that they always find a workaround. It shouldn’t be that way though,” Ahmed said.\n\nWaleed from Mumm says that these obstacles also push more innovators to tinker with the system, improve it, and create a better marketplace for all to compete in.\n\n“We still have so much to do,” Waleed agrees. “But there is this striving ecosystem that is growing very very quickly and it is governed by a social contract that has a lot of ethics that is geared towards building this space, and making Egypt a better place.”\n\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.\n",
      "Folder": "Feedly",
      "Timestamp": "1512550431",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.564595Z"
}