{
  "id": "640d778c1c854c43953c53d098d5dc56",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://thepointsguy.com/2017/01/deal-alert-us-mexico-city-from-180/",
      "Title": "Deal Alert US to Mexico City From $180 Round-Trip The Points Guy",
      "Selection": "Want to see the latest flight deals as soon as they’re published? Follow The Points Guy on Facebook and Twitter, and subscribe to text message alerts from our deals feed, @tpg_alerts.\n\nAirfare deals are typically only available on limited dates. We recommend that you use Google Flights to find dates to fly, then book through an online travel agency, such as Orbitz or Expedia, which allows you to cancel flights without penalty by 11pm Eastern Time within one day of booking. However, if you’re using the American Express Platinum Card, you’ll need to book directly with the airline or through Amex Travel portal to get 5x MR points. Remember: Fares may disappear quickly, so book right away and take advantage of Orbitz or Expedia’s courtesy cancellation if you’re unable to get the time away from work or family.\n\nHere’s a great chance to visit the New York Times’ top destination of 2016 — for less. Fly between the US and Mexico City (MEX) from just $180 round-trip on a variety of carriers, including American, JetBlue, United and Volaris, with fares valid on departures from February through May 2017. Use Google Flights to search for your desired travel dates, then complete your booking through the carrier’s website.\n\nAirline: American, JetBlue, United, VolarisRoute: BOS, IAH, JFK, LAX, MCO, MIA and ORD to MEXCost: $180+ round-trip in economyDates: February – May 2017Booking Link: Orbitz or ExpediaPay With: The Platinum Card from American Express (5x on airfare), Chase Sapphire Reserve, Premier Rewards Gold Card from American Express, Citi Prestige (3x on airfare) or Chase Sapphire Preferred (2x on travel)\n\nHere are a few examples of what you can book:\n\nOrlando (MCO) to Mexico City (MEX) for $180 round-trip in February on JetBlue:\n\nNew York City (JFK) to Mexico City (MEX) for $198 round-trip in March on Volaris:\n\nLos Angeles (LAX) to Mexico City (MEX) for $198 round-trip in February on Volaris:\n\nHouston (IAH) to Mexico City (MEX) for $201 round-trip in February on United:\n\nBoston (BOS) to Mexico City (MEX) for $235 round-trip in February on American:\n\nMaximize Your Purchase\n\nDon’t forget to use a credit card that earns additional points on airfare purchases, such as the American Express Platinum Card (5x on flights booked directly with airlines or American Express Travel), Chase Sapphire Reserve, American Express Premier Rewards Gold or Citi Prestige (3x on airfare) or the Chase Sapphire Preferred Card (2x on all travel purchases). Check out this post for more on maximizing airfare purchases.\n\nFeatured image of Mexico City courtesy of Getty Images.\n\nIf you’re able to score one of these tickets, please share the good news in the comments below!\n\nH/T: Scott’s Cheap Flights\n\nChase Sapphire Preferred® Card\n\nAPPLY NOW\n\nEarn 50,000 bonus points after you spend $4,000 on purchases in the first 3 months from account opening. That's $625 toward travel when you redeem through Chase Ultimate Rewards®\n\nNamed Best Credit Card for Flexible Travel Redemption - Kiplinger's Personal Finance, July 2016\n\n2X points on travel and dining at restaurants worldwide & 1 point per dollar spent on all other purchases.\n\nEarn 5,000 bonus points after you add the first authorized user and make a purchase in the first 3 months from account opening\n\nNo foreign transaction fees\n\n1:1 point transfer to leading airline and hotel loyalty programs\n\nGet 25% more value when you redeem for airfare, hotels, car rentals and cruises through Chase Ultimate Rewards. For example, 50,000 points are worth $625 toward travel\n\nNo blackout dates or travel restrictions - as long as there's a seat on the flight, you can book it through Chase Ultimate Rewards\n\nIntro APR\n\nRegular APR\n\nAnnual Fee\n\nForeign Transaction Fee\n\nCredit Rating\n\nN/A\n\nSee Issuer's Terms\n\nIntroductory Annual Fee of $0 the first year, then $95\n\n0%\n\nExcellent Credit\n",
      "Folder": "Feedly",
      "Timestamp": "1484009814",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.728201Z"
}