{
  "id": "66466c2517c849f7acf196323aae622f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2017/7/19/15997776/trump-health-care-complicated-deal",
      "Title": "Trump can’t make a health care deal because he doesn’t understand health care Vox All Posts by Ezra Klein",
      "Selection": "Trump is uninformed, underprepared, and unclear — and this is is the result.\n\nThe blame in the Senate’s health care omnishambles is attaching to Majority Leader Mitch McConnell, and understandably so — he wrote the bill, he designed the process, he owns the result. But the absence of President Donald Trump from the story is, itself, an important part of the tale.\n\nFor better and for worse, policy leadership in the modern era tends to come from the White House. Take the Affordable Care Act. Though the bill was written in Congress, President Obama and his staff were involved at every step of its construction — they set the policy vision, used the technical resources of the executive branch to work through trade-offs, were deeply involved in the legislative process, and led the communications effort on the bill’s behalf.\n\nThe apex of this was the Blair House summit. As the bill was floundering, Obama invited congressional leadership from both parties to the Blair House to debate the legislation on live television for hours. Obama was trying to prove to congressional Democrats that they could win the argument on health care, that he could win the argument on health care, and that they should trust him and pass the bill. It really is worth watching a few minutes of Obama’s performance in this, and contrasting it with Trump’s role in the replacement effort:\n\nObama’s performance was effective because it was, to Democrats, persuasive. Obama knew the details of the legislation, he knew the issue, and he knew how Democrats thought — and so he made arguments they believed, and persuaded them that even if the Affordable Care Act was a dangerous vote to take, it was still a vote worth taking.\n\nWhat happened publicly at the Blair House happened privately every day. Obama and his team were constantly working to sell wavering Democrats on the bill, to persuade them that the trade-offs made were the right ones, to convince them this was a historic opportunity to achieve the Democratic Party’s 80-year dream of universal health care. It’s no accident that Obama’s health care address to a joint session of Congress ended by wrapping the bill in the legacy of the late Sen. Ted Kennedy, and framing it as the “great unfinished business of our society.”\n\nThe campaign worked. In the Senate, Democrats had 60 votes, they needed 60 votes, and they got 60 votes.\n\nThe Affordable Care Act was a heavy lift, and there are many who deserve credit for its passage — notably Nancy Pelosi and Harry Reid. But I don’t know anyone involved in that effort who thinks it could’ve been done without Obama and his White House.\n\nThe GOP’s repeal-and-replace effort was also a heavy lift, and it’s been done without the productive involvement of Trump and his White House — in fact, Trump often made the process considerably harder.\n\nThe core problem is Trump has no idea what he’s talking about on health care and never bothered to learn. “Nobody knew health care could be so complicated,” he famously, and absurdly, said. His inability to navigate its complexities meant he couldn’t make persuasive arguments on behalf of the bills he supported, and he routinely made statements that undercut the legislative process and forced Republicans to defend the indefensible.\n\nTrump’s post-election promise of “insurance for everybody” with “much lower deductibles” set up a standard Republicans had no intention of ever meeting but kept having to answer for. At his occasional meetings with wavering members of Congress, he’s made superficial political arguments to people who had deep policy concerns. The discussions left legislators feeling insulted and annoyed that the president hadn’t bothered to do the barest amount of homework.\n\nBecause Trump doesn’t understand the legislation or the trade-offs it made, he can’t make persuasive arguments on its behalf in public or private, and so he mostly doesn’t try. Trump and his team are not frequent presences in the public debate trying to sell the legislation they’re so keen to sign. That’s one reason the various bills routinely polled around 20 percent — without Trump using the bully pulpit to argue on behalf of the legislation, critics, terrible Congressional Budget Office reports, and news of congressional infighting filled the void.\n\nWhen Trump does weigh in, it’s often a disaster. Asked by Fox News’s Tucker Carlson how he responded to analyses showing the House health bill would hurt the people who voted for him, he replied, “Oh, I know,” and said the bill was “very preliminary.” Later, after holding a Rose Garden ceremony to celebrate the passage of the House health bill, he called it “mean.” But he never articulated a standard for a bill that wouldn’t be mean, and he never came up with a policy that wouldn’t hurt his supporters.\n\nLater, during a particularly delicate moment in the Senate’s negotiations, he tweeted that Senate Republicans should perhaps abandon the current process and “immediately REPEAL, and then REPLACE at a later date!” This tweet of no confidence didn’t make McConnell’s job any easier. At another point, Trump suggested it would be fine if Republicans failed to pass anything at all.\n\nIn this context, Trump’s missive this morning is comical. No one has ever heard Trump discuss, with any specifics, how good the Senate health care bill is. No one believes he can, or that it would be a good idea if he tried.\n\nThe Republicans never discuss how good their healthcare bill is, & it will get even better at lunchtime.The Dems scream death as OCare dies!\n\n— Donald J. Trump (@realDonaldTrump) July 19, 2017\n\nIn a prescient post-election piece for the conservative Weekly Standard, Yuval Levin and Gerard Alexander worried that Trump’s disinterest in policy would lead to chaos in the legislative process:\n\nIn the absence of an opinionated final arbiter who could always be brought in, the policy process can easily become far less, rather than more, productive. If President Trump is indeed to remain above the details, and if the executive branch is unlikely to be able to compensate for his relative apathy or absence, congressional leaders may have to think very differently about their own role in the policy process. That might make for some opportunities, but only if members of Congress are prepared for what to many of them will be an unfamiliar and challenging task.\n\nMembers of Congress, we now see, were not prepared for that task. McConnell is a legislative tactician. He might be the guy you want to pass your health care bill. But he’s not the guy you want to write your health care bill, decide its contours, make its policy trade-offs, and argue its merits.\n\nBy making McConnell that guy through his own inattention and ignorance, Trump set up the process for failure. The result was legislation nobody liked, that nobody could defend, and that looks likely to fail. And failure is, it’s worth saying, a better outcome for the GOP and the country: The legislation is so poorly built, and sold on so many lies, that if it did pass, implementation would be a catastrophe.\n\nDuring the campaign, Trump posed as a master dealmaker. But you can’t make a deal if you don’t understand what’s being discussed, what the various sides want, or what the trade-offs involved in different concessions would mean. And you really can’t make a deal if you don’t know what you want or why you want it. Preparation, information, and clarity matter in policymaking, and the widely acknowledged reality that Trump is completely underprepared, woefully uninformed, and personally confused mattered here.",
      "Folder": "Feedly",
      "Timestamp": "1500524233",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.571594Z"
}