{
  "id": "6655671711d74ff487e6923d44df9164",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/24071-how-to-cook-chicken-thighs-in-a-pan",
      "Title": "The Crispy Skillet Chicken I Could Eat Every Single Night Food52",
      "Selection": "You can cook chicken thighs a million and one ways, but there’s one method I turn to over and over: a cast-iron skillet and surprisingly low heat. I first learned this Genius technique from my co-worker Kristen Miglore, who learned it from Melissa Hamilton and Christopher Hirsheimer.\n\nBasically, you salt-and-pepper the thighs, place them in a pan over medium heat, and leave them alone. Fast-forward 15 to 30 minutes later and the skin is as crispy as a potato chip. Flip, cook a little longer, and you’ve got the best chicken thighs of your life.\n\nThe obvious follow-up question is: What do you serve them with? But the better question is: What do you do with all that rendered chicken fat?\n\nI’m supposed to tell you to put it in a jar and keep it in the fridge for future sautéed vegetables. But any time I do this myself, I forget about said jar, and end up asking my husband three weeks later, “What is this?” (I don’t know.) “Can I throw it out?” (Uh, sure.) And into the trash it goes.\n\nUsing the chicken fat immediately not only avoids this unfortunate fate, but ties the whole dish together. Such was the idea behind this weeknight favorite of mine:\n\nInstead of using olive oil to pan-fry the croutons and sautée the kale: chicken fat to the rescue! I love how that rich flavor connects the components—and, you know, the fact that you get to reuse the same pan is pretty cool, too.\n\nThis recipe is just like that, but make it spring. Instead of wintry kale, we have plucky asparagus. And instead of torn bread, there are tiny potatoes. Bacon joins the party because bacon is delicious.\n\nBacon also gives us another flavorful fat to play around with. Think of it like a rendered fat relay (what, like your high school didn’t have those?). Cook the chicken thighs, then smash-fry the potatoes in that chicken fat. Cook the bacon, then sauté the asparagus in that bacon fat. (Psst: Blanching both the potatoes and asparagus beforehand not only gives them a head start, but seasons them throughout with salt.)\n\nIf this all sounds very rich, it’s not—thanks to garlic, red pepper flakes, lemon juice, and Dijon mustard. These assertive players keep the whole dish feeling bright and sprightly, just like I want all my spring dinners to be.\n\nCrispy Chicken Thighs With Asparagus, Bacon & Potatoes\n\nView Recipe\n\nIngredients\n\n6\n\ntablespoons kosher salt, plus more to taste\n\n1\n\ntablespoon extra-virgin olive oil\n\n4\n\nchicken thighs\n\n1\n\npinch freshly ground black pepper\n\n1\n\npound golf ball–sized red potatoes\n\n1\n\npound asparagus, fibrous ends trimmed\n\n4\n\nthick slices bacon, roughly chopped into ¾-inch pieces\n\n2\n\ngarlic cloves, minced\n\n1\n\npinch red pepper flakes\n\n1\n\nlemon, juiced\n\n2\n\nteaspoons Dijon mustard\n\n6\n\ntablespoons kosher salt, plus more to taste\n\n1\n\ntablespoon extra-virgin olive oil\n\n4\n\nchicken thighs\n\n1\n\npinch freshly ground black pepper\n\n1\n\npound golf ball–sized red potatoes\n\n1\n\npound asparagus, fibrous ends trimmed\n\n4\n\nthick slices bacon, roughly chopped into ¾-inch pieces\n\n2\n\ngarlic cloves, minced\n\n1\n\npinch red pepper flakes\n\n1\n\nlemon, juiced\n\n2\n\nteaspoons Dijon mustard\n\nMore Chicken Thighs, Please\n\nWhat's your favorite way to cook chicken thighs? Tell in the comments!\n",
      "Folder": "Feedly",
      "Timestamp": "1556417264",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.379183Z"
}