{
  "id": "66b9e83e719f435ea668d785416ffa53",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.frugaltravelguy.com/2017/03/marriott-is-giving-away-3-75-million-marriott-points-no-strings-attached.html",
      "Title": "Marriott Is Giving Away 3.75 Million Marriott Points, No Strings Attached Frugal Travel Guy",
      "Selection": "The world’s largest hotel chain just announced the world’s biggest points giveaway. On June 1st, 2017 they’ll be giving away 3.75 million Marriott points, enough for Free Travel for Life, for nothing more than a little postage. And everyone can enter up to 60 times each.\n\nHow to Enter (The Easy Way)\n\nJust send Marriott a letter. Seriously, it’s that easy, we double-checked:\n\nJust “Hand print your name, address, day and evening phone numbers, email address, Rewards Account number, and date of birth on a 3″ x 5″ piece of paper.”\n\nThen mail it in to:\n\nMarriott Mobile App Travel For Life,” c/o HelloWorld, Inc.\n\nP.O. Box 5029, Department 829846\n\nKalamazoo, MI 49003-5029.\n\nEach entry that you mail in will count as 3 entries, and you can enter up to 20 times for a total of 60 entries, the limit for this promotion.\n\nAnd if you win, they’ll even give you $10,000 extra in cash to cover most of the tax liability.\n\nBut mailing in entries isn’t the only way to enter.\n\nHow to Enter With Stays\n\nThe Free Travel for Life sweepstakes is a promotion for the Marriott Mobile App. Sign up for it on Apple or Android with your Marriott Rewards Number and you can earn multiple entries, up to 20 through each method:\n\nMake a Reservation at a hotel anywhere in the world, through the app.\n\nProperty brands include:\n\nThe Ritz-Carlton\n\nRitzCarlton Reserve\n\nJW Marriott\n\nEDITION\n\nMarriott Hotels\n\nMarriott Vacation Club\n\nDelta\n\nAutograph Collection\n\nRenaissance Hotels\n\nGaylord Hotels\n\nCourtyard Hotels\n\nSpringHill Suites\n\nProtea Hotels\n\nFairfield Inn & Suites\n\nAC Hotels\n\nMoxy Hotels\n\nMarriott Executive Apartments\n\nResidence Inn\n\nTownePlace Suites\n\nCheck In to a Marriott Property Using Mobile Check-In:\n\nCheck in to a room reserved with your Rewards Account (whether the reservation is made on the app, phone, online or in person) using the app’s Mobile Check-In service. Each time you use this counts as one entry.\n\nUse the Mobile Request Feature:\n\nWhenever you use the app to message the hotel before or after your trip, or request anything the app will automatically register one entry.\n\nThe Catch\n\nNo matter how you earn the entries, each account holder is only allowed 60 entries. So, essentially, 20 letters at three points a letter is 60 entries. And 20 requests via the app, 20 check-ins and 20 reservations also equal 60 entries. And there is no point in doubling up since 60 is the limit.\n\nAlthough entering with stays if you’re already have Marriott Rewards card and 80,000 sign-up bonus points to put to use this could be a fun way to play with the app.\n\nJust know that all stays, letters, mobile app requests, etc. must be completed by May 31st 2017. The winner will be announced on June 30, 2017.\n\nFor more information about the contest, head here.\n",
      "Folder": "Feedly",
      "Timestamp": "1488808150",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.630342Z"
}