{
  "id": "66bfaedbe277496ebc380ca7e0530597",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/938776/how-i-used-math-to-develop-an-algorithm-to-help-treat-diabetes/",
      "Title": "I’m an MIT professor who used math to help treat diabetes Quartz",
      "Selection": "When people ask me why I, an applied mathematician, study diabetes, I tell them that I am motivated for both scientific and human reasons.\n\nType 2 diabetes runs in my family. My grandfather died of complications related to the condition. My mother was diagnosed with the disease when I was 10 years old, and my aunt Zacharoula suffered from it. I myself am pre-diabetic.\n\nAs a teen, I remember being struck by the fact that my mother and her sister received different treatments from their respective doctors. My mother never took insulin, a hormone that regulates blood sugar levels; instead, she ate a limited diet and took other oral drugs. Aunt Zacharoula, on the other hand, took several injections of insulin each day.\n\nThough they had the same heritage, the same parental DNA and the same disease, their medical trajectories diverged. My mother died in 2009 at the age of 75 and my aunt died the same year at the age of 78, but over the course of her life dealt with many more serious side effects.\n\nWhen they were diagnosed back in the 1970s, there were no data to show which medicine was most effective for a specific patient population.\n\nToday, 29 million Americans are living with diabetes. And now, in an emerging era of precision medicine, things are different.\n\nIncreased access to troves of genomic information and the rising use of electronic medical records, combined with new methods of machine learning, allow researchers to process large amounts of data. This is accelerating efforts to understand genetic differences within diseases—including diabetes—and to develop treatments for them. The scientist in me feels a powerful desire to take part.\n\nUsing big data to optimize treatment\n\nMy students and I have developed a data-driven algorithm for personalized diabetes management that we believe has the potential to improve the health of the millions of Americans living with the illness.\n\nIt works like this: The algorithm mines patient and drug data, finds what is most relevant to a particular patient based on his or her medical history, and then makes a recommendation on whether another treatment or medicine would be more effective. Human expertise provides a critical third piece of the puzzle.\n\nAfter all, it is the doctors who have the education, skills, and relationships with patients who make informed judgments about potential courses of treatment.\n\nWe conducted our research through a partnership with Boston Medical Center, the largest safety net hospital in New England—one that often provides care for uninsured people or those with lower incomes. We used a data set that involved the 1999-2014 electronic medical records of about 11,000 patients who were anonymous to us.\n\nThese patients had three or more glucose level tests on record, a prescription for at least one blood glucose regulation drug, and no recorded diagnosis of type 1 diabetes, which usually begins in childhood. We also had access to each patient’s demographic data, as well their height, weight, body mass index, and prescription drug history.\n\nNext, we developed an algorithm to mark precisely when each line of therapy ended and the next one began, according to when the combination of drugs prescribed to the patients changed in the electronic medical record data. All told, the algorithm considered 13 possible drug regimens.\n\nFor each patient, the algorithm processed the menu of available treatment options. This included the patient’s current treatment, as well as the treatment of his or her 30 “nearest neighbors” in terms of the similarity of their demographic and medical history to predict potential effects of each drug regimen. The algorithm assumed the patient would inherit the average outcome of his or her nearest neighbors.\n\nIf the algorithm spotted substantial potential for improvement, it offered a change in treatment; if not, the algorithm suggested the patient remain on his or her existing regimen. In two-thirds of the patient sample, the algorithm did not propose a change.\n\nThe patients who did receive new treatments as a result of the algorithm saw dramatic results. When the system’s suggestion was different from the standard of care, an average beneficial change in the hemoglobin of 0.44% at each doctor’s visit was observed, compared to historical data. This is a meaningful, medically material improvement.\n\nBased on the success of our study, we are organizing a clinical trial with Massachusetts General Hospital. We believe our algorithm could be applicable to other diseases, including cancer, Alzheimer’s, and cardiovascular disease.\n\nIt is professionally satisfying and personally gratifying to work on a breakthrough project like this one. By reading a person’s medical history, we are able to tailor specific treatments to specific patients and provide them with more effective therapeutic and preventive strategies. Our goal is to give everyone the greatest possible opportunity for a healthier life.\n\nBest of all, I know my mom would be proud.\n\nThis post originally appeared at The Conversation. Follow @ConversationUS on Twitter. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1490309699",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.619988Z"
}