{
  "id": "66e53f8dc5b04dcaa75faf7ac9dc74da",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/heres-what-you-should-say-when-you-get-customer-service-on-the-phone/",
      "Title": "Change of plans Use this negotiation strategy to get customer service on your side The Points Guy",
      "Selection": "If you’re a frequent TPG reader, your life has likely been affected by the coronavirus pandemic and its resulting impact on travel.\n\nNumerous TPG readers have told us that they booked nonrefundable reservations because they didn’t plan to cancel their trip. Others purchased travel insurance, but most trip insurance doesn’t cover epidemics so they’re still out the money. In many such cases, your best bet is to reach out directly to the airline or hotel in question and ask for help.\n\nRelated: Will “cancel for any reason” insurance protect your trip?\n\nTPG has covered how to reach customer service as quickly as possible — but what should you ask for once you get on the phone?\n\nBe clear about what you need\n\nBefore you get on the phone, know where you want to go before you reach out to your airline to make any changes. A customer service representative can’t tell you whether or not it’s best for you to go home to your own apartment, or shelter in place at your parents’ house in another state, and it isn’t their job to wait on the line while you draft up a pros-and-cons checklist.\n\nRelated: A number of airlines have suspended all routes in the wake of the coronavirus pandemic\n\nHave your desired airport code, travel times and dates, your passport number and record locator, and any other personal information ready on hand before you reach out. And be prepared for long hold times, or try reaching out via Twitter or text.\n\nBe flexible on how you accomplish your goal\n\nIt’s great to have a specific plan in place, but keep your big picture goal in mind. Right now, your top priority should be safety and speed, not necessarily convenience or efficiency. If you’re trying to get home to Brooklyn or Queens, be willing to consider flying into Newark, Philly or even Boston. Similarly, flying into Oakland, San Jose or even Sacramento could be a good alternative to San Francisco if you need to get back to the Bay Area.\n\nAlternatively, consider renting a car and driving where you need to go if the journey isn’t too long — or if you’re up for taking the scenic route home. The main goal of social distancing is increasing the amount of physical distance between you and other people, and a road trip fulfills most of the criteria. Keep in mind that most hotels and stores along the way may be closed or operating under limited hours, so stock up on gas and supplies well before setting out. \n\nNegotiation strategy: Big ask, little ask\n\nIf you know that you can’t or won’t need to travel any longer, you’ll probably want your money (or points) back instead of rescheduling your trip for a later date. But just because your friend got a full refund on an international flight through Delta Airlines doesn’t mean you’ll get the same result for canceling a domestic flight on Spirit.\n\nRelated: Your complete guide to traveling during the coronavirus outbreak\n\nHere’s where a sales negotiation strategy called “big ask, little ask” could help you accomplish your goal.\n\nThe concept here is to have at least two satisfactory outcomes in mind, and to ask for the bigger favor first. If that fails, then ask for the smaller favor. In contrast, the smaller request will seem easier to grant, and you’ll be more likely to get what you ask for.\n\nYour success will vary based on a lot of factors, but it never hurts to try — and it really pays to be as polite as humanly possible.\n\nLet’s say you purchased a $400 nonrefundable ticket, and your airline is offering you free changes for the travel dates. But the event you wanted to attend was canceled, so you no longer plan to take this trip. When you reach out to customer service, go for the “big ask” first: A full refund. Be polite, explain your circumstances, and nicely ask if the agent can help you out. If the answer is yes, then great; if no, then switch to your “little ask”, which could be a voucher toward future travel instead of rescheduling your flight.\n\nRelated: I booked my canceled trip using an airline voucher. Will the airline issue me a new one? \n\nChances are, you’ll find some leniency from the representative. And even if you don’t, you can walk away knowing you did your best.\n\nPriority goes to travelers who need immediate assistance\n\nTrying to cancel a spring break trip in April? Don’t get on the phone; save customer service hotlines for people who need immediate help resolving their travel issues.\n\nRelated: Use Chase’s online tool to rebook or cancel your Ultimate Rewards itinerary\n\nInstead, reach out to your airline or online travel agency (OTA) via email, Twitter or text. You can avoid long hold times, possibly increase your chances of getting a favorable response, and know that you’re doing your fellow traveler a favor by freeing up the phone lines.\n\nRemember that you’re on the same team — and be kind\n\nThese are stressful times with little to no prior precedent, and it’s easy to feel overwhelmed. Remember that you and the customer service agent share the same goal of getting you where you need to go, even if it doesn’t feel that way.\n\nAlso keep in mind that these agents have been dealing with frustrated customers for weeks, and are facing job uncertainty themselves. Be kind and thoughtful to the person helping you — a “thank you” or a “How are you doing?” goes a long, long way right now.\n\nFeatured photo by Getty Images.\n",
      "Folder": "Feedly",
      "Timestamp": "1584670475",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.335833Z"
}