{
  "id": "67852f4dd74f4e2292c95bb7fe706a39",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/circuitbreaker/2017/6/20/15843106/smartduvet-breeze-temperature-control-self-making-bed-kickstarter-indiegogo",
      "Title": "This smart bedding makes itself and lets you control the climate on each side The Verge",
      "Selection": "You’re hot. Your partner is cold. It’s a classic story: one of you throws off the blankets in the middle of the night while the other is burrowed within them. But it defeats the point of sleeping next to your person — if you’re spooning through a duvet, you might as well hug a body pillow.\n\nSmartDuvet, the company that first launched a self-making bed on Kickstarter, is now offering a second edition that lets two people adjust their preferred temperatures on their side of the bed. The SmartDuvet Breeze, like its predecessor, is basically a blow-up air-blanket you put on your duvet, inside your duvet cover. (Do you have a duvet cover? I don’t. Should I have a duvet cover?) It attaches to a control box, which you might be able to hide under your bed.\n\n SmartDuvet\n\nThink of the control box as a mechanized air pump. SmartDuvet makes the bed by filling up the bed like a pool toy. Because it’s attached to your bedding, it pulls everything with it as it fills with air. Your bed will be “made” when it reaches its final form.\n\nThrough an app, you can control the climate of each side of the SmartDuvet Breeze by blowing warm or cold air from control box. It’s dual-layered to include the bed-making and the temperature control air tubes, which you connect to the blanket during setup.\n\n SmartDuvet\n\nSmartDuvet creators claim that it’s not just good for your comfort, but that bed oxygenation will reduce sweat and prevent bed-bugs. They also say it’s a green product since you wouldn’t be heating or cooling your whole house to your desired temperature. Joke’s on you, SmartDuvet, I live in New York City and I can’t control my apartment’s thermostat. But it’s a nice idea.\n\nIt’s more than 550 percent funded on Indiegogo at time of publish and we demoed the first SmartDuvet at CES 2017, so while there’s no guarantee on receiving your crowdfunded product, this could actually ship in September 2017 as advertised.\n\nFor now, SmartDuvet Breeze is taking early pledges starting at $199. Once on market, the company aims to sell it for $359.\n",
      "Folder": "Feedly",
      "Timestamp": "1497998515",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.660342Z"
}