{
  "id": "67cf655d6af5423a8922aa5b3752dbea",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/991848/donald-trumps-handshake-with-emmanuel-macron-shows-his-trick-doesnt-work-on-other-peoples-turf/",
      "Title": "Trump’s handshake trick doesn’t seem to work on other people’s turf Quartz",
      "Selection": "Update: This article was updated to include new footage of Donald Trump shaking hands with Emmanuel Macron.\n\nWhile in the United States, president Donald Trump notoriously shakes people’s hands to the point where he’s almost twisting their arms out of the sockets, often leading to comically awkward scenes during photo-ops with heads of states or politicians. But during his first overseas trip as president, Trump seems to be losing at his own game.\n\nWhen Trump met Emmanuel Macron today in Brussels, the newly elected French president grabbed his hand hard—and wouldn’t let go before Trump did. Press images show Trump leaning away and attempting twice to free himself from Macron’s death grip. His neck appears stiff and his lips pressed to a thin line.\n\nReuters notes:\n\nEach man gripped each other’s right hand so firmly that their knuckles turned white and their jaws seemed to clench.\n\nImages from the photo session at the U.S. ambassador’s residence in Brussels showed Trump finally giving up, his fingers loosened while Macron is still holding on tightly.\n\nUpdate: Later footage from the same day suggests that Trump might be trying to make up for his lack of home team advantage. During a group photo with NATO leaders following his meeting with Macron, Trump exacted revenge with an extremely vigorous second shake.\n\nThis is a pretty intense handshake between Macron and Trump http://pic.twitter.com/nseTdcpXkX\n\n— Colin Jones (@colinjones) May 25, 2017\n\nJust a few days earlier (May 22) during the Muslim Leaders Summer in Riyadh, the president of Tajikistan, Emomali Rahmon, yanked Trump’s hand so hard that the US president was pulled forward—exactly the same way Trump once shook hands with US Supreme Court judge Neil Gorsuch.\n\nНайден человек, который переиграл Трампа в рукопожатии http://pic.twitter.com/snhfDgJr2r\n\n— тем временем… (@a_imanaliev) May 23, 2017\n",
      "Folder": "Feedly",
      "Timestamp": "1495754810",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.596803Z"
}