{
  "id": "67ee4b81cccd4db3ad083eff2f1f03ef",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/free-things-to-do-in-dublin-with-kids/",
      "Title": "Free (or Nearly Free) Things to Do in Dublin With Kids The Points Guy",
      "Selection": "Let the luck of the Irish guide your trip to Dublin. Dublin is extremely family-friendly, so it’s no wonder TPG readers have pulled off amazing trips to Ireland — especially if they focus on the most family-friendly international carriers that can get them there using miles (or great sales). And, thankfully, once you’re in Dublin, many of the attractions kids will love charge nothing to access or enter. From the city’s Science Gallery (on one of Europe’s most esteemed college campuses, Trinity College) to the Dublin Zoo (housing animals since 1831), here’s how to soak up the Irish culture in the country’s largest city and major cultural center.\n\nBest Dublin Attractions for Little Kids\n\nFilled with green space — whether landmarks like St. Stephen’s Green or Merrion Square — Ireland’s capital offers lots of room to roam outdoors. Museums and attractions are, for the most part, kid-friendly, too, and many don’t charge an entrance fee.\n\nDublin Zoo\n\nWith 400 animals and spanning 69 acres of Phoenix Park, 3.7 miles northwest of Merrion Square, Dublin Zoo is known in the zoo community for breeding endangered species, including Rodrigues fruit bats. Admission is free at this historic zoo that has been around since 1831.\n\nWild Lights, Ireland’s award-winning night-time spectacular at the Dublin Zoo. (Photo courtesy of Dublin Zoo)\n\nCorkagh Park\n\nNot only is the 300-acre Corkagh Park in South Dublin a green space with a playground, fishing and fairy trails, but it’s also an animal-petting zoo with no charge to enter. During the early summer, the rose garden is in bloom, providing amazing photo ops for the family. There are also birds you can visit in a special aviary section of the park.\n\nThe Corkagh Park Rose Garden. (Photo by Liam Flag via Wikipedia Commons)\n\nMerrion Square\n\nTo help work through the kinks of jet lag or allow toddlers enough room to simply roam, don’t leave Dublin without a stroll through Merrion Square, located in the city center. On the west side of the park is a children’s playground and on the east side, a snack stand that also serves beverages. Kids like to experience the park as a self-guided activity, using this guide that includes finding, and then drawing, sharing or taking a photo of certain items. One of Ireland’s most famed writers — Oscar Wilde — has a trio of statues in his honor that were established in 1997 by sculptor Danny Osborne. There is no cost to enter the park.\n\nA fair in Merrion Square in Dublin. (Photo via Shutterstock)\n\nColored Doors on Leeson Street\n\nIf you’ve got a chunk of time to fill but the family is still restless, walk on Lower Leeson Street, three blocks southeast of St. Stephen’s Green, a public park. You’ve likely seen images of these brightly colored doors in photos, but seeing the vividness in person is a treat. And, if you’re craving tea or a snack, the darling House Dublin’s café (offering both indoor and outdoor seating) is the perfect stop. \n\n(Photo by Robert Anasch via Unsplash)\n\nDublin Attractions for Tweens\n\nWith its rich history in literature and music, Ireland’s cultural capital is poised to easily reach tweens as a gateway to learning even more about the country’s history.\n\nNatural History Museum\n\nTweens love the “Dead Zoo” at the National Museum of Ireland, which refers to the admission-free Natural History Museum. Located on Merrion Street, the museum houses cabinets filled with species that are no longer with us, including skeletons of Irish deer and a 65-foot-long whale skeleton hanging from the roof.\n\n(Photo courtesy of Dublin’s Natural Museum of History)\n\nLiterary Pub Crawl\n\nYou might be thinking that a pub crawl is not a kid-friendly activity, but Dublin is not your average pub scene. In Dublin, everybody goes to the pub — considered an extension of one’s living room — and the food menus are hearty. For the literary pub crawl (14 euros/$16 each and does not include beer), professional actors take a group to four or five pubs within a few blocks’ radius, starting at The Duke Pub, and re-enact scenes from the writings of famous Irish poets and playwrights, including Samuel Beckett and James Joyce.\n\nNational Botanic Gardens of Ireland\n\nWhile many cities charge an arm and a leg to access its botanical gardens, the National Botanic Gardens of Ireland is free. Located a little under 2 miles from the city center, this paradise is easy to reach by public transit via the 4, 9 or 83 buses. Of special interest is a fruit and vegetable garden, filled with Irish apple varietals; and tropical plants typically grown around the world thrive inside The Great Palm House. Kid-specific activities include the Viking House (information about what Vikings grew, wore and ate) and a tropical rainforest (the only one in Ireland) located inside the Great Palm House.\n\nThe National Botanic Gardens of Ireland in Dublin. (Photo via Shutterstock)\n\nDublin Attractions for Teens\n\nWhether this is your teen’s first European vacation or just their first time in Dublin, it’s a great city to explore for US teens since English is spoken, but there’s still a bit of foreign character. If your kid is into science and art, there are lots of opportunities to learn more in the many museums.\n\nScience Gallery Dublin\n\nLocated on the Trinity College campus, within the university’s Naughton Institute, Science Gallery Dublin celebrates its 10th anniversary this year. This isn’t your typical science museum because the targeted demographic is teens and those in their young 20s. Also, instead of a museum with permanent exhibits, it operates via temporary shows (around 40 to date).\n\nTrinity Science Gallery, Dublin (Photo by Julien Behal/PA Images / Getty Images)\n\nThe National Gallery of Ireland\n\nIf you’re used to plunking down $20–$25 per member of your family to spend a day at the art museum, you’ll love that The National Gallery of Ireland (focused on art between the 14th and 20th centuries) is free to enter. It’s conveniently located in the city center, a half-block northwest of Merrion Square. If you can manage to visit on a Sunday, this is Family Day. On Family Day the gallery introduces special kid-friendly tours, activities and sessions (all drop-in, no sign-up required) plus art-creation in the new Maples and Calder Creative Space, launched earlier this year. If your teen is already into art, and wants to explore on his or her own (as opposed to in a group with younger kids), consider checking out a free art pack and audio guide from the information desk.\n\nThe National Gallery of Ireland in Dublin. (Photo via Shutterstock)\n\nBook of Kells and Old Library Tour at Trinity College\n\nWhile it’s free to stroll the Trinity College campus — just immediately across from the city center — you can “splurge” a bit by folding in some education. It costs just 28 euros ($32) for an entire family (children under 12 are free) to tour the Old Library, which dates back to the 18th century, as well as view the Book of Kells, the first four gospels of the New Testament written in Latin around 800 AD. Sign up for a tour here.\n\nThe Long Room at Trinity College (Photo by Aitormmfoto / Getty Images)\n\nRent Dublinbikes\n\nIf it’s a nice day and you’re comfortable with the lay of the land, renting bicycles through Dublinbikes (a shared-bicycle company) is a fun activity after you’ve crossed off all of the other must-sees in Dublin on your list. Bike rentals cost 5 euros ($6) for a three-day ticket. To rent a bike, just approach one of the stations in Dublin’s city center (each has about 15 bikes).\n\nDublin bikes along the Liffey River in Dublin. (Photo via Shutterstock)\n\nBottom Line\n\nIf language is a concern when traveling to Europe, Dublin’s locals speak English, but more importantly, they are such warm, kind and laid-back people that immersion takes no time at all. With world-class museums celebrating the arts and sciences, walkable neighborhoods (you don’t need a car here, nor do you have to travel underground often like you might in Paris or London) and easily accessible cultural icons (from Irish music and dancing to Dublin’s famous colored doors), your kids will definitely remember their trip to Dublin.\n\nTo continue your Dublin trip planning:\n\nUse Points and Miles to Travel to Dublin for St. Patrick’s Day\n\nGuide to Booking Aer Lingus Award Flights\n\nAer Lingus Business Class Review\n\nReview of the Westin Dublin\n\nHow to Spend an Overnight Layover in Dublin\n\nTrip-Spiration: Explore Ireland\n\nFeatured images by David Soanes Photography / Getty Images\n",
      "Folder": "Feedly",
      "Timestamp": "1543617051",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.449799Z"
}