{
  "id": "68dd1f35ff924fc4bc182116d020e484",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://coolinfographics.com/blog/2019/12/16/how-much-does-it-really-cost-to-produce-your-favorite-tv-show",
      "Title": "How Much Does It Really Cost To Produce Your Favorite TV Show Cool Infographics",
      "Selection": "How Much Does It Really Cost To Produce Your Favorite TV Show? infographic compares the cost to make the show to their ratings on IMDb. Cashnetusa.com comes to the conclusion that, while Game of Thrones paid out the big bucks and received the huge ratings, it isn’t always necessary. Peaky blinders received great reviews and spent 10 million less per episode!\n\nOur new guide to the cost of producing the best and worst rated shows on TV in 2019 reiterates this sense that it’s not always the size of your production budget that counts, but what you do with it. The costly robots of Westworld are rivalled in ratings by the non-union zombies of The Walking Dead for a third of the price; Lost In Space was just as mediocre as the decidedly more earthbound NCIS: New Orleans.\n\nAnd in the short-term, with the complete series rating hovering around 9.5 on IMDb, Game of Thrones still manages to top our new table as both the highest rated and highest costing show. But when you consider the bitter taste on the tongues of millions of disappointed HBO subscribers, would a more thought-through finale have been a better investment than all that extra cash? Or are GoT fans just sour because (as experts suggest) they’re going through an end-of-show ‘break-up’?\n\nThis infographic design does a lot of things right:\n\nGood scatterplot data visualization to illustrate their data\n\nData points are clearly identified with data titles using proximity, not connecting lines necessary. This can often be a design challenge!\n\nSources clearly identified with links so anyone can look into the data\n\nUse of Creative Commons to protect the infographic and encourage sharing\n\nThe text on the infographic landing page includes the clickable data source links and a methodology description.\n\nFound on Geekologie.com\n",
      "Folder": "Feedly",
      "Timestamp": "1577769409",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.318069Z"
}