{
  "id": "68ef24b282114243aa13f4b7576c1934",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/the-goods/2019/4/2/18290956/recycling-crisis-china-plastic-operation-national-sword",
      "Title": "America’s new recycling crisis, explained by an expert Vox - All",
      "Selection": "For 30 years, China took in the world’s plastic. What happened when they stopped?\n \nFor all the campaigns encouraging people to recycle more, few lay out exactly what happens to our recyclables once they go into the blue bin. Rather than our milk jugs magically reincarnating into toys on their own, for nearly three decades American recyclables were shipped cheaply to China, where they could be sold and given new shape. \n\nThat worked well enough, until China started cracking down. With dirty waste continuing to appear in imported recyclables, the rising cost of labor, and an abundance of the country’s own potentially recyclable waste, China no longer had the same financial and environmental incentives to accept the world’s waste. \n\nWithin the recycling community, there had been rumblings that China might change its policies, but the force of Operation National Sword, announced in July 2017, still came as a surprise. Going into full effect last March, it banned 24 types of scrap and implemented much stricter and more rigorous contamination standards which have been described as “impossible to reach.” As a result, local governments and the recycling industry are now facing an unprecedented recycling crisis, especially in plastics.\n\nK. Y. Cheng/South China Morning Post via Getty Images\nPlastic recycling must now meet “impossible” contamination standards. \n\nTo put the impact of this current crisis into the context of past waste crises — like the Love Canal Disaster, where a residential neighborhood was built on a toxic waste dump with disastrous consequences, leading to the formation of the EPA’s Superfund program — and to understand how the effects of this policy are being felt across the United States, The Goods spoke to Kate O’Neill, an associate professor in the Department of Environmental Science, Policy and Management at UC Berkeley. Specializing in global environmental politics and the global politics of waste, her upcoming book Waste explores the extent to which waste can be a resource, and she has written and spoken extensively about the recycling trade with China. \n\nWhat’s the history of the US sending recyclables to China?\n\nChina imported most of the world’s scrap, the good stuff as well as the more problematic, especially as its industry started to boom in the late ’90s and early 2000s. It was also connected with China’s entry into the World Trade Organization in 2001. That was a period where China’s growth started booming. It was shipping goods to Europe and the States and that enabled a cheap process of shipping the scrap back to China in the holds of the ships that had brought all the stuff over. So that made it cheaper to ship to China than, say, to ship recycling across the country. And China was the market — that’s where it went to be used. We were shipping it to China because there was demand from its manufacturing sector because it wasn’t producing enough virgin plastic. So there was an economic rationale.\n\nIs it that China doesn’t need our recyclables now that they have enough of their own?\n\nIt produces plastics for its domestic market and has a lot of plastic scrap of its own to recycle. This is very similar to the dynamics with electronic waste, because China imported a lot of that for a while, and illegally for quite a while too, and then started really cleaning up its recycling villages and creating more industrial parks for domestic recycling. It’s trying to do the same with plastics. \n\nI also think Beijing is very concerned about their environmental quality and image overseas. As China is taking on this role as the world’s economic superpower, there are aspects that are not just pure economics or military power, but a sort of leadership by example. We see it with efforts in China to combat climate change. I also think that they were very concerned about being seen as the world’s dump site.\n\nHow do past rumblings and claims of crisis compare to now? Is the shit hitting the fan?\n\n“Oh, the shit’s hitting the fan”\n\nOh, the shit’s hitting the fan. Operation Green Fence was the 2013 effort to just start getting exporting countries to clean their recycling, their plastics in particular. That sent ripples, but that was more enforcing existing legislation, it wasn’t a severe cut in contamination limits. The recycling industry saw it as more of a, “Well, let’s kind of clean up our act at the collection stage and not bother the consumers with this.” What happened was that suddenly a whole cleaning services industry sprang up in Southeast Asia, so you knew you could ship it to Malaysia where it would be cleaned if it didn’t meet China’s specifications. \n\nAbsolutely no one thinks they’re going to lift this restriction at any point, and it’s really been exacerbated by the trade war with the US. [China has] had periodic disruptions, just temporary ones, on the import of other kinds of scrap like iron, copper, and aluminum. But there’s demand in their own recycling industries for that so it’d be tricky for Beijing to say no to importing that kind of scrap. But plastics now, no one sees any lifting on those restrictions anytime soon. \n\nIt seems like this is a type of crisis we’ve never had to face before, but based on impact does it compare to anything else?\n\nOnly nuclear waste. Obviously it’s not the same as a widespread nuclear waste accident, but I think it’s the most widespread, and I would definitely call this the most high-profile and prolonged period I’ve seen waste in the global press in many, many years. \n\nThinking back over early waste crises, again, it’s not quite the same danger to human health, but it’s on par with Love Canal and those big events in the ’60s and ’70s. We’ve really been displacing those risks — out of sight, out of mind — either to poor minority communities in the case of hazardous waste, or now to displacing our plastic and paper waste to communities where — although it’s used in China — it was being disassembled and reprocessed by people who are very much being exposed to the worst risks. \n\nHow is this going to start impacting our lives here in the US?\n\nIt already has in so many ways. There’s the ripple effect for our lives and also globally. Initially the plan was just to divert the plastics to different places like Southeast Asia. That has not been working because countries like Malaysia and Thailand have become overwhelmed with plastic and stopped importing. India just announced it would not take plastics, so the quest for markets is still ongoing.\n\nThere’s a lot of campaigns for consumer education, getting rid of what the industry calls “wish cycling” [the well-intentioned attempt to recycle nonrecyclables, which causes contamination and more waste] and encouraging people to properly wash recyclables. You’ve got a shift away from single-stream recycling, when you put everything into the one big container, to multiple stream, where you’re separating recyclables into different containers. \n\n“There was no matching or building of recycling capacity along with the increase in recycling programs”\n\nWe’re seeing an increase in landfilling, and because most states have fees for landfills, that’s creating an additional expense [for municipalities]. Plastics went from [selling for] like $300 a ton at their peak to now where you almost have to pay to get rid of them. Municipalities are cutting back on their recycling and what they will pick up, some places have stopped recycling altogether. This includes not just plastic but also glass, not because it was ever exported to China but because it’s difficult and expensive to recycle in the first place, so when you’re losing money because of plastics you’re not going to keep propping up a real economic loss generator like glass.\n\nAfter years of hearing that we should recycle more, it’s pretty shocking to realize that we don’t have an infrastructure that can deal with all of it. \n\nRecycling started in the ’70s and ’80s but it took a while to really spread and certainly to become kind of mandatory. [Over the past 20 years] there was no matching or building of recycling capacity along with the increase in recycling programs. I was living in New York in the mid ’90s and I remember when the recycling came in, that maps directly onto the years when we started exporting to China. \n\nThere’s an interesting debate warming up about if we should focus on improving our recycling or if that is going to enable our continued consumption of plastics. In other words, let’s not focus on recycling, let’s just focus on not using plastics. I personally think that we need to do both, and I’m concerned about this argument that we shouldn’t even be improving recycling, that we just need to focus on not using plastic, because that seems like a lot harder of a goal to reach. \n\nWant more stories from The Goods by Vox? Sign up for our newsletter here. \n\nEllen Rolfes/Vox\n",
      "Folder": "Feedly",
      "Timestamp": "1554602906",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.386074Z"
}