{
  "id": "698fa51e75f44ff585ef67a4f54f484b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/13906-a-5-minute-trick-for-fresher-tomatoes",
      "Title": "A 5-Minute Trick for Fresher Tomatoes Food52",
      "Selection": "This trick—which only takes 5 minutes—may be the answer to avoiding refrigerator-chilled, flavorless tomatoes.\n\nA few weeks ago, when our Test Kitchen Manager Derek was doling out tomatoes that wouldn't survive the weekend in the office, I made the mistake of offering that he put them in the refrigerator. A genuine look of shock came over him as he said, \"Put them in the refrigerator? I could never do that to a tomato!\" Over the next few weeks, I started to recognize just how much refrigerators can affect tomatoes' taste—the cold temperatures cause them to lose their flavor and become mealy. \n\nThis loss of flavor and degradation of textured is because the cold can halt the flavor-producing enzymes in tomatoes that thrive at room temperature. New research suggests, however, that the same could be true of the opposite.\n\nA recent article from Quartz brings to light new research from plant physiologist Jinhe Bai, who's found that dipping tomatoes in warm water before chilling them may help them retain their flavor. He took tomatoes fresh from the vine and dipped them into 125° F water, then chilled them—and he found that the flavor remained.\n\nWe decided to test the theory, albeit in a slightly flawed form (our tomatoes were store-bought, so it's likely that they were chilled before we ever reached them), but the findings may surprise you:\n\nThe method: We purchased two store-bought tomatoes and placed one in a water bath at 125° F for five minutes, then refrigerated both overnight. We allowed both tomatoes to come to room temperature (which in itself helps them recover from refrigeration), invited members of the Food52 to blind taste test of each tomato, then asked each person to pick their favorite tomato.\n\nThe findings: Of the 10 team member asked to try the tomatoes, eight of ten said that the pre-heated tomato was their favorite. Of those who chose the pre-heated tomato, almost all cited a \"more tomato-y\" taste—though to different degrees. Caroline, our Assistant Editor, determined more \"essence of tomato\" and our C.O.O. Bridget said that it was \"infinitely better.\" Amanda, our Design Editor, was perhaps the most specific, saying of the non-treated tomato, \"This is like chewing on paper—you know when paper disintegrates in your mouth? You’ll remember when you try this tomato.\" She chose the pre-heated version. But Kristen, our Executive Editor, said that she felt the texture was slightly better.\n\nConclusion: The pre-heated tomato had an 80% success rate, but many of the people who liked it said that its flavor was almost imperceptibly better. In a pinch, you'll find us dipping our tomatoes in warm water before refigeration—better safe than sorry!\n\nWhat are some of your tricks for keeping tomatoes fresher longer? Tell us in the comments below!\n\nPhoto by James Ransom \n",
      "Folder": "Feedly",
      "Timestamp": "1440199481",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.841109Z"
}