{
  "id": "6a8a779bbf8f4db89cc6736b6c6ec2dc",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/safaris-on-the-cheap/",
      "Title": "Tuesday Travel Tip You can do a safari on the cheap The Points Guy",
      "Selection": "For many travelers, a safari is a once-in-a-lifetime experience. The logistics involved in getting to southern or eastern Africa from the U.S. and the cost can pose a challenge to even experienced travelers, and planning a safari is not something typically done on the spur of the moment.\n\nTPG just published a story, in fact, dedicated to planning a bucket-list safari — which says, essentially, that a safari like you’ve seen in National Geographic documentaries does require a lot of planning and won’t come cheap. As for options to use points and miles to book accommodations, those are limited by the absence of international chains away from major cities in Africa. You have more choice when using points and miles to book airfare, but the recent demise of South African Airways has cut the number of relatively cheap options to get to Southern Africa.\n\nNew to The Points Guy? Sign-up for our daily newsletter and check out our beginner’s guide.\n\nBut you don’t have to spend vast amounts to see in the wild the Big Five animals that are the main reason people go on African safaris. Lions, leopards, elephants, rhinos and buffalo are all found in reserves that can be easily accessed from Kenya’s Nairobi and South Africa’s Johannesburg, two big, cosmopolitan cities reachable with one stop from major U.S. airports. You may not even have to sleep at a safari camp or lodge.\n\nFor example, in the case of Nairobi National Park, you can wake up at an international-standard hotel that’s part of a major chain. Near the airport, there’s a Hilton Garden Inn, Four Points by Sheraton, Crowne Plaza and Best Western if you want to use your points. From those accommodations, it’s a quick drive to Nairobi National Park where you’ll watch lions hunt gazelles in a real African nature park and be back at your hotel in time for a poolside beer in the late afternoon. And all of this will cost less than the price of some Broadway tickets.\n\nNairobi National Park is just a half-hour drive from downtown Nairobi, and may well be the most unusual national park in the world, turning on its head the commonplace idea that safaris require venturing far into the wilderness. A daylong visit cost me under $300, including entrance fees, pickup and drop-off at my hotel in a Land Rover and the services of a knowledgeable guide. I was by myself, but for a group of four people, the price can drop to just above $100 per person. This isn’t a tamer, lamer version of a real safari: While you’re within sight of the city, the park has lions, leopards, giraffes, hippos, buffalo and more, all wild and behaving exactly as they would in any of the far more famous African game reserves. With any luck, you will take home photos that could have been shot in the Serengeti.\n\nYou won’t find elephants in the park — they’re too massive to be contained within it — but you’ll see them at the Sheldrick Wildlife Trust just outside. The center raises orphaned elephants and releases them into the wild when they are ready. It’s well worth a visit, which many tours include with the national park.\n\nA lion in Nairobi National Park (Photo by Alberto Riva/The Points Guy)\n\nI found a reputable tour operator to take me to Nairobi National Park, Wote Group Safaris, through the concierge at my hotel, but there are many options available online. A quick search will turn up several well-recommended names.\n\nWhile Nairobi offers you the ability to replicate a full-blown safari in a day — and an airport with nonstop flights to New York on Delta alliance partner Kenya Airways — in Johannesburg you have to reach a little further out from the city, but budget options are still available. There are several game reserves within a three-hour driving distance of the city and, although none are national parks, many of them offer the chance to see the Big Five in action. You may be able to swing a three-day safari, for example at the Madikwe Game Reserve three and a half hours from Johannesburg, for under $1,000 if you stick to the budget or midrange tour options.\n\nFeatured image by Goddard_Photography/Getty Images\n",
      "Folder": "Feedly",
      "Timestamp": "1589907113",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.298298Z"
}