{
  "id": "6bd7264dd9d943098bee4ebea4b8fa58",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://marginalrevolution.com/marginalrevolution/2018/04/lessons-from-the-profit.html",
      "Title": "Lessons from “The Profit” Marginal REVOLUTION",
      "Selection": "I’ve learned a lot about industrial organization watching The Profit, a reality-TV show on CNBC featuring businessman Marcus Lemonis. In each episode Lemonis buys into a failing small-to-medium-sized business and works to turn it around. Lemonis doesn’t invest in a random sample of businesses nor even in a random sample of failing businesses. Nevertheless, the lessons that The Profit teaches are consistent with the new literature on management which has increased my confidence both in the show and the literature.\n\nIn the perfectly competitive model, price is equal to average cost and firms operate efficiently at minimum cost. Yet, Syverson finds that in the typical US industry a firm at the 90th percentile of the productivity distribution makes almost twice as much output with the same inputs as a firm at the 10th percentile. It’s not easy to measure inputs or outputs, of course, but even firms producing very uniform products show big productivity differences.\n\nHow can firms that use inputs so inefficiently survive? In part, competition is imperfect which gives inefficient firms a cushion because they can charge a price higher than cost even as costs are higher than necessary. Another reason is that small firms eat their costs.\n\nA typical firm on The Profit, for example, has decent revenues, sometimes millions of dollars of revenues, but it has costs that are as high or higher. What happened? Often the firm began with a competitive advantage–a product that took off unexpectedly and so for a time the firm was rolling in profits without having to pay much attention to costs. As competition slowly took hold, however, margins started to decline and the firm found itself bailing. But instead, of going out of business, the firm covers its losses with entrepreneurs and family members who work without pay, with loans which grow ever larger, and by an occasional demand shock which generates enough surplus revenue to just keep going.\n\nThe correct metaphor for competition isn’t a boxing match that knocks out the inefficient firm. The correct metaphor is a slow tide. Inefficient firms must scramble for a bit of high ground but as the tide ebbs and flows they can occasionally catch a breath when their head bobs above the profit line. An inefficient firm can survive for years before it inevitably sinks.\n\nThe second lesson from The Profit is that management matters and it matters in systematic and fairly easy to replicate ways. If mis-measurement explained productivity differences, Lemonis would not be able to successfully turn firms around. But he can and does. How?\n\nOne of the first things Lemonis does in almost every episode is get the numbers right so he can calculate which products are selling and which have the highest price-to-cost margin. Concentrate production on high-margin, big sellers. Drop the rest. Simple; but many firms don’t know their numbers.\n\nSecond, in episode after episode, Lemonis cleans up shop. Literally. He cleans the shop floor and gets rid of inventory that isn’t selling. He then arranges the floor to improve process flow (made easier by concentrating production on fewer products). He then creates an inventory system, tracks orders and the inputs needed to create those orders, and takes advantage of costs savings through economies of scale in input purchases.\n\nCan it be so simple? To be sure, Lemonis is a smart guy but very little of what he does takes genius. We know this because we now have robust evidence from India and Mexico that better management increases profits and productivity and that such increases can be sustained over the long run. In the studies from India and Mexico, randomly selected firms were given access to a “management intervention” and their productivity and profits improved and stayed higher for years after the intervention ended.\n\nMoreover, what were these management interventions? Did some bright Harvard grad recommend a complicated swap-options deal? A new chemical process? A new management form? No. By and large, the interventions were simple. Just like the Lemonis interventions.\n\nHere, for example, are some pictures of the storage systems used in the Indian textile firms which were part of the management study (from Nick Bloom’s slides). This is exactly the kind of thing one sees on the Profit and the recommendations to create an inventory control system are exactly the same. Management 101.\n\nThis is the sense in which the lessons of The Profit are consistent with the new literature on management and increase confidence in both.\n\nAnother lesson from The Profit is that firm problems are personal problems. The son who can’t step out from the shadow of the father and the father who can’t let go. The two brothers who haven’t gotten over the death of their father and the problems this creates in the firm they have inherited. The siblings who are still fighting to get their parent’s attention. If Lemonis has a genius skill it’s in keeping his temper and working through bullshit problems to get to the real festering issues that are at the root of inefficiencies.\n\nNow, in this case, there is surely some selection going on. Personal drama makes for good television but the general point strikes me as true and correct and important. It’s difficult to run a business like a business. The analytical mindset that can separate business problems from personal problems isn’t natural. Many people cannot separate business decisions from their own preferences and emotional biases, which is one reason why great business leaders are rare.\n\nI’ve learned a lot about IO from watching The Profit but could business people learn about running a firm by seeing more reality-TV? Robin Hanson argues:\n\nIf one can learn….from just watching the inside story of real firms over several years, that suggests a big win: record the full lives of many rising managers over several years, and show a mildly compressed and annotated selection of such recordings to aspiring managers.\n\nI agree with Robin, Reality-TV MBAs could offer a lot of value. The Profit is a good place to start.\n\nThe post Lessons from “The Profit” appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1522988388",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.524362Z"
}