{
  "id": "6c4cd794537b41f59049a70d3d6e6c59",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/974752/the-data-prove-it-going-gluten-free-to-lose-weight-is-bad-for-your-health/",
      "Title": "The data prove it Choosing to go gluten-free is bad for you Quartz",
      "Selection": "For most of us, gluten is more or less synonymous with carbs.\n\nThis perception isn’t totally false—gluten is a protein found in grains, which include yeast, and any kind of wheat (and therefore flour), which is a major component of breads and pastas. So for a lot of people who try to go gluten-free, what they’re really doing is avoiding bread—which can be an effective diet for those trying to lose weight. But while the gluten-free diet has become an increasingly popular trend in recent years, research suggests the fad comes with negative health consequences.\n\nIn September of last year, researchers from Rutgers University found that the amount of people living the gluten-free life tripled (paywall) between 2009 and 2014. By looking at trends in the US Centers for Disease Control National Health and Nutrition Examination Survey, the team collected self-reported data on the eating habits of over 22,000 individuals. Between 2013 and 2014 interval, roughly 1.7% of folks (128 people in a group of about 7,600) stuck to a gluten-free diet, up from just half a percent between 2009 and 2010 (in a group of about 7,800).\n\nIt’s worth noting that, when asked, none of these people reported suffering from celiac disease. The number of people diagnosed with that condition consistently remained under 1% (pdf) of the US population. People with celiac cannot tolerate gluten; when even trace amounts of the protein reach their digestive system, they experience severe cramping and bloating as well as acne and mood changes that can persist up to weeks on end.\n\nHyun-seok Kim, a physician with a background in public health at Rutgers and lead author of the recent gluten diet paper, told the Guardian that he thought that the uptick in gluten-free eating was likely because people trying to lose weight saw it as “trendy,” or used “self-diagnosed gluten-sensitivity” to explain other GI symptoms.\n\nThe problem is, being gluten-free doesn’t automatically mean being healthy. Whole grains have a lot of dietary fiber, which make you feel full and may lower your chances of stroke or other heart disease by about 30%, according to the American Heart Association. A recent meta-review led by researchers at Tufts University of more than 500,000 people total found that eating roughly 50 grams of whole grains per day (about three servings) was associated with lower risks of cardiovascular and heart disease.\n\nOn May 2, the BMJ published the results of a study including over 100,000 participants surveyed over 26 years. Researchers from Columbia University and Harvard Medical School were looking for a connection between gluten consumption and heart disease. As part of the survey, 64, 714 women and 45,303 men—all of whom worked in health care—filled out a food questionnaire every four years about their gluten consumption.\n\nThe study ultimately did not find that gluten-free diets can be directly connected with heart disease, as New York Magazine reports. But the study authors still write that the “the promotion of gluten-free diets among people without celiac disease should not be encouraged.” In other words, cutting out grains from your diet when you don’t need to means that you’re missing out on the preventative benefits they provide.\n\nThe gluten-free trend can actually hurt people with celiacs, too. “I find that my condition was not taken seriously,” Molly Lewis, a 28-year-old with celiacs, told NPR. She said that when she goes out to eat, waitstaff frequently assume that she’s just trying to avoid carbs, and aren’t careful about making sure her food is kept separate from any gluten. When they roll their eyes, she said, “I know I’m going to get sick.” People with celiacs can feel symptoms if they encounter just 2o milligrams of gluten per kilogram of food.\n\nUltimately, it’s simply a bad idea to go gluten-free if you don’t have celiacs. You’re not doing your heart any favors, and you may be making it difficult for people who actually suffer from celiacs.\n",
      "Folder": "Feedly",
      "Timestamp": "1493909435",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.678636Z"
}