{
  "id": "6c4ed116c3214a1ca6cb3d90e1ef7c85",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/09/deal-egypt-from-550/",
      "Title": "Deal Alert US Cities to Egypt From $550 Round-Trip The Points Guy",
      "Selection": "Want to see the latest flight deals as soon as they’re published? Follow The Points Guy on Facebook and Twitter, and subscribe to text message alerts from our deals feed, @tpg_alerts.\n\nAirfare deals are typically only available on limited dates. We recommend you use Google Flights to find dates to fly, then book through an online travel agency, such as Orbitz or Expedia, which allows you to cancel flights without penalty by 11pm Eastern Time within one day of booking. However, if you’re using the American Express Platinum Card, you’ll need to book directly with the airline or through Amex Travel portal to get 5x MR points. Remember: Fares may disappear quickly, so book right away and take advantage of Orbitz or Expedia’s courtesy cancellation if you’re unable to get the time away from work or family.\n\nHere’s a deal we don’t see every day. Several carriers are offering great fares on flights to Cairo, Egypt (CAI). Fly from either New York (JFK) or Chicago (ORD) to the Egyptian capital from just $550 round-trip on Air France. New York-based flyers have a choice between Egyptair’s nonstop flight from JFK to CAI, or can fly via Paris (CDG) on Air France for a few dollars less. If you’re based in Chicago (ORD), you’ll find the low fares on Etihad, so you’ll have to connect in Abu Dhabi (AUH). These prices are generally available from November 2017 all the way through May of 2018, but exact availability depends on where you’re originating from. Use Google Flights to find dates that work for you, and then either book through the airlines directly or through an OTA like Expedia or Orbitz.\n\nLunch with a view or two  Day 1 in Cairo was a blast. It’s hot, but not THAT bad and there were virtually no tourists- my favorite way to see the sights! And never for a split second did I feel unsafe. Just like the stock market buy low/sell high – when a destination’s tourism is way down it can be the best time to go (like that time I went to Tokyo after the nuclear incident and I was virtually the only tourist in the Tsukiji Fish market).\n\nA post shared by Brian Kelly (@thepointsguy) on Aug 15, 2017 at 2:49pm PDT\n\nAirlines: Air France, Egyptair, EtihadRoutes: JFK/ORD to CAICost: $550+ round-trip in economyDates: November 2017 – May 2018Booking Link: Orbitz or ExpediaPay With: The Platinum Card from American Express (5x on airfare), Chase Sapphire Reserve, Premier Rewards Gold Card from American Express, Citi Prestige (3x on airfare) or Chase Sapphire Preferred (2x on travel)\n\nHere are a few examples of what you can book:\n\nNew York (JFK) to Cairo (CAI) for $550 round-trip on Air France:\n\nChicago (ORD) to Cairo (CAI) for $608 round-trip on Etihad:\n\nNew York (JFK) to Cairo (CAI) for $635 round-trip on Egyptair:\n\nMaximize Your Purchase\n\nDon’t forget to use a credit card that earns additional points on airfare purchases, such as the American Express Platinum Card (5x on flights booked directly with airlines or American Express Travel), Chase Sapphire Reserve, American Express Premier Rewards Gold or Citi Prestige (3x on airfare) or the Chase Sapphire Preferred (2x on all travel purchases). Check out this post for more on maximizing airfare purchases.\n\nIf you’re able to score one of these tickets, please share the good news in the comments below!\n\nFeatured image by Alan Tsai via Getty Images.\n",
      "Folder": "Feedly",
      "Timestamp": "1506027377",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.548242Z"
}