{
  "id": "6c6eb95f154f41bb92b744596f0781f5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://fivethirtyeight.com/features/new-yorkers-will-pay-56-a-month-to-trim-a-minute-off-their-commute/",
      "Title": "New Yorkers Will Pay $56 A Month To Trim A Minute Off Their Commute FiveThirtyEight",
      "Selection": "How much would you be willing to pay to shave a minute off your commute? For New Yorkers, the answer appears to be around $56 per month. That’s how much more New Yorkers pay in rent, on average, for a one-bedroom apartment that’s a minute closer by subway to Manhattan’s main business districts.\n\nThat finding — based on our analysis of data from the real estate listing service StreetEasy, which provided more than 175,000 rental prices from 2015 listings for New York City homes — puts an approximate value on the old real estate adage about the importance of location, location, location. The higher rents show how much New Yorkers are willing to pay for convenience — and how those who can’t afford to live close to jobs are getting pushed to the edges of the city and must spend more of their time on the subway, leaving less time for leisure and sleep. (They also have access to fewer jobs.)\n\n“Living in the world of New York real estate, you very quickly realize, is all about trade-offs,” said Krishna Rao, an economist at StreetEasy.\n\nThose trade-offs aren’t just about commuting time. Places with short commutes are also often places with other desirable characteristics: restaurants, nightlife and convenience, both in terms of getting to other places in and around the city and of getting people from other parts of the city to come to your neighborhood.\n\nOur findings suggest that residents of Williamsburg and other Brooklyn neighborhoods on the L train could soon be paying less in rent. That’s because the MTA plans to close the L train for repairs starting in 2019, adding about eight minutes to commutes from the Bedford Ave. station and about four minutes from other stations along the L. The shutdown should shave about $200 to $450 off the rent of the typical Williamsburg one-bedroom — until the repair work is done, anyway.\n\nMeanwhile, according to Jonathan Miller, president of Miller Samuel Real Estate Appraisers & Consultants in New York, rents already have increased near stations planned for the Second Avenue subway on the Upper East Side, which is due to open later this year.\n\nStreetEasy’s analysts, using the same set of more than 175,000 listings, took a slightly different approach in its analysis and came up with a smaller estimate of about $33 per minute. More on that later.\n\nBoth sets of estimates make sense considering that New Yorkers make, on average,1 about $29 per hour. Saving a minute each way on 20 round-trip commutes each month works out to two-thirds of an hour saved from commuting time, or just under $20 a month on average. Many one-bedroom apartments are occupied by two workers, and the New Yorkers who can afford to live the closest to the city’s business centers are generally the wealthiest.2\n\n“Proximity to transportation hubs in a walkable city is a pretty powerful incentive” for renters, said Miller, who added that the $56-per-minute estimate seemed reasonable. New Yorkers may not be typical in how highly they value short commutes; travel time might matter less to renters in cities where a greater share of commuters use cars, or with fewer high-earning residents, or with less desirable urban centers.\n\nTo get our estimate, we decided to focus on the more than 63,000 one-bedroom homes in StreetEasy’s data set, since they were the most plentiful. StreetEasy linked each home to its nearest subway station, then calculated the time it would take to travel from that station by subway to either Midtown or Downtown Manhattan.3 We ran a regression to find the relationship between the rent of a one-bedroom home and the average of travel time from the station nearest to it to Midtown or Downtown. It showed rent increasing by $56 per minute of decrease in average travel time.4\n\nWe also ran the same regression for studios, two-bedrooms and three-bedrooms and got about what you’d expect: For each increase in number of bedrooms, the amount by which rent increased with shorter travel time increased by about 50 percent. This is reasonable because you might expect, on average, that 50 percent more people live in a home with one additional bedroom, so more people would benefit from the commute (though not every additional person in a home commutes to Midtown or Downtown — children are more likely to go to school closer to home).5\n\nAs any New Yorker knows, this analysis doesn’t capture all the complexities and horrors of the local real estate market. For instance, we’re assigning the same travel time based only on which station is closest to a given home — which doesn’t count time spent traveling by foot, bus or bike to the nearest station, or account for travel to a slightly more distant station with faster train service to Midtown or Downtown. That’s a bigger deal the farther you get from the city’s business centers, as subway stops get sparser and walks to the station get longer. That also means our analysis might slightly overstate the value New Yorkers place on saving a minute on their commutes, because the true gap in time between the typical home in Midtown and one in the outer boroughs is greater than just the difference in subway ride time. On the other hand, not everyone works in Midtown or Downtown, which means that those who do might value proximity to those neighborhoods even more than our analysis suggests.\n\nFor its own analysis, StreetEasy used a simpler method to get a similar result. The company’s analysis included all homes, no matter the size, and grouped them together by the nearest station. It looked only at commutes to Midtown, not Downtown. It also looked at how the median rent of nearby homes varied by station, and it didn’t account for people boarding at local stations and transferring to express trains.\n\nAs the chart above suggests, the relationship between commuting time and rent isn’t quite linear. For homes with subway commutes under 30 minutes — a group that includes the majority of StreetEasy listings — commuting time and rent are strongly linked. But beyond about 30 minutes, the relationship breaks down: Rents for homes an hour away from Midtown look pretty much the same as rents for those just half an hour away. That could be because a one-bedroom home an hour from Midtown is bigger, on average, than one 15 minutes away: The analysis treated a two-bedroom single-family house the same as a two-bedroom apartment. It could also be because for people who either don’t have to commute by subway (because they’re retired or students or working from home or take a car to work) or don’t mind longer commutes, those outlying neighborhoods bring other charms, like proximity to the beach.\n\nA lot of what drives rents is neighborhood characteristics, said Rao, the StreetEasy economist. “Your commute isn’t everything that matters to you.”",
      "Folder": "Feedly",
      "Timestamp": "1472519970",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.782497Z"
}