{
  "id": "6d30d75f893e4f549571b75cf7d05176",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/how-americans-order-their-steak/",
      "Title": "How Americans Order Their Steak FiveThirtyEight",
      "Selection": "Are people who prefer their steaks well done just wrong? It’s the question that has divided a nation that is otherwise firmly united on the “steak is great” front, given that we Americans consume about 25 billion pounds of beef annually. It makes ordering at steakhouses for large parties a negotiation; it causes effete elitists like me to reconsider the measure of a diner; and I’m going to guess that the BTUs of gas spent taking perfectly good rare steaks to well done amount to an environmental catastrophe.\n\nA May 2014 investigation from this very website — one which, by my own admission, began as a campaign to smear those who enjoyed well-done beef — found that when people self-reported their steak preferences, most said medium-rare, followed by medium and then medium-well.\n\nBut that’s just what people say they like. We’re living in a society where meat doneness preference has been used as a political cudgel against the holder of the highest office in the U.S. We have to get to the tender, marbled meat of the issue.\n\nLonghorn Steakhouse hooked us up here, agreeing to share aggregated data about how Americans prefer their steak. Longhorn shared a year’s worth of steak orders1 from all of its 491 U.S. locations, revealing how Americans ordered all different cuts of steak. It turns out that Americans claim to like their steak a lot rarer than they actually do!2\n\nThere are serious differences in how people order different cuts, and we wanted to know why.\n\n“Every steak has a different fiber,” said Jens Dahlmann, the executive chef at Longhorn. “If you look at the most tender steak, it’s the tenderloin. That’s a steak that lends itself to barely cooking it. It’s got a very soft fiber and very sweet flavors to it. It works great for rare and medium-rare.”\n\nPrime rib also works great on the rarer side. Because it’s cooked slowly and at low temperatures, a rare order of prime rib can come out without the bloodiness that turns off many rare-averse people. Other steaks can handle more heat.\n\n“Steaks that still perform very well even if you go to a medium-well temperature, those would be the highly marbled steaks, the ribeye, even the porterhouse or T-bone,” Dahlmann said. “There is a bone running through the middle, and around the bone retains more moisture and flavor.”\n\nDavid Berson, director of operations at Peter Luger Steak House in Brooklyn, agreed. “Some people like a ribeye rare, but I would recommend cooking it a little longer. It’s got a lot of fat.”\n\nOne way cooks can get a leg up is to buy thicker cuts of beef, which gives them more margin for error than the thin cuts most supermarkets sell. “For home cooks it’s important to get the highest quality they can,” Berson said. “With protein — fish, beef — you don’t want to cut corners.”\n\nMeat buying is a big part of the job at Luger’s. “We look for fat distribution or marbling,” Berson said. “That’ll be a good indication of how juicy the steaks will be.”\n\nDahlmann suggests that home cooks invest in a high-quality meat thermometer to nail the perfect doneness every time. Any steak with an internal temperature from 95 degrees to 105 degrees Fahrenheit is rare, anything from 115 to 125 degrees is medium-rare and, according to FiveThirtyEight culture writer and cantankerous elitist Walt Hickey, anything above that is ruined.\n",
      "Folder": "Feedly",
      "Timestamp": "1499110605",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.579711Z"
}