{
  "id": "6d6e7cdd6bda4008a6d71f29dc47bbd5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/world/2017/6/19/15829438/finsbury-park-theresa-may-donald-trump",
      "Title": "Theresa May is schooling Donald Trump on how to respond to Islamophobia Vox - All",
      "Selection": "They were just trying to pray in peace.\n\nLate Sunday night, Muslim worshippers celebrating Ramadan at London’s Finsbury Park Mosque exited services onto the nearby Seven Sisters Road. A white van careened off the street and slammed into the crowd, killing one and injuring at least eight others. The driver, a 48-year-old white man, reportedly yelled, “I want to kill all Muslims” before he was apprehended by members of the crowd he attacked.\n\nAfterward, all eyes turned to UK Prime Minister Theresa May. Earlier this month, jihadists killed eight in an attack on London Bridge that also involved a van ramming pedestrians. After that attack, May said that there was “far too much tolerance” of “Islamist extremism” in the UK and called for civil liberties restrictions (like limits on free speech online) in response. Would her response be as aggressive when Muslims were the victims rather than the perpetrators?\n\nYes, as it turns out — it was.\n\n\"This was an attack on Muslims near their place of worship and, like all terrorism in whatever form, it shares the same fundamental goal,\" she said. \"It is a reminder that terrorism, extremism, and hatred take many forms, and our determination to tackle them must be the same whoever is responsible.”\n\nBritish Prime Minister Theresa May announces new commission for countering extremism in wake of #FinsburyPark attack https://t.co/if2uFwOLPo http://pic.twitter.com/FFMa497o1k\n— CNN International (@cnni) June 19, 2017\n\n“Excellent and powerful statement from Theresa May on Finsbury Park,” tweeted Brendan Cox, an anti-hate activist whose wife, Jo Cox, a Labour member of Parliament, was murdered last year by a right-wing, anti-Muslim extremist.\n\nCox also noticed something else. Donald Trump, who immediately condemned the London Bridge attack and used it to argue for his controversial travel ban, has yet to comment to the attack in Finsbury Park.\n\n. @realDonaldTrump I fear u may have missed it but there was a terror attack last night in London on Muslims. Looking fwd to yr condemnation\n— Brendan Cox (@MrBrendanCox) June 19, 2017\n\nTrump still has not tweeted on the matter. It took until late on Monday afternoon for the White House to offer any statement, saying that \"thoughts and prayers go out to our British allies.\" \n\nThere’s a lesson here: a lesson on how a normal leader handles hate crimes, and how Donald J. Trump does it. \n\nTheresa May is hardly a champion of inclusion\n\nIt’s important to understand that May is not historically a champion for the rights of Britain’s Muslim minority.\n\nMay was home secretary, a position responsible for (among other things) internal security, prior to becoming prime minister. During that time, she championed something called the Prevent program — a counter-extremism program introduced in 2003 that had been heavily criticized for singling out Muslims for police attention. In 2011, May introduced a plan for the program to focus on “extremist ideology,” an idea that experts have criticized as dangerously vague.\n\n“The Home Secretary does fail to identify what the terms ‘extremism’ and ‘radicalisation’ actually mean, or provide any robust research or insights as to who might be an ‘extremist,” Brian Blakemore, an expert on UK homeland security policy at the University of South Wales, wrote at the time. “The problem with this lack of detail is the potential to profile … the police could use their powers of investigation to arrest innocent Muslims purely because of their ethnicity, name, and religion.”\n\nPrevent hasn’t changed very much since May became prime minister last year. This led Baroness Sayeeda Warsi, a member of May’s Conservative Party who served as minister for faith and communities while May was home secretary, to publicly criticize the prime minister in a recent interview with the UK Times. Warsi called Prevent “toxic,” adding, “I think Theresa May needs to pause, she needs to reassess what Prevent is about.” She linked this to a broader problem with anti-Muslim sentiment in the UK.\n\n\"I think Islamophobia is Britain's bigotry blind spot,” Warsi said. “I would like a prime minister or home secretary to stand up and say, ‘We all want to fight the war on terror, but Muslims are not fair game.’\"\n\nSunday night’s attack in Finsbury Park was the acid test as to whether Theresa May would be able to follow through on Warsi’s challenge. If you can’t condemn anti-Muslim hatred after it claimed the life of one of your citizens, when could you ever?\n\nBut May passed the test.\n\n“This extremism every bit as insidious and destructive to our values and our way of life [as jihadism],” she said after the Finsbury Park Mosque attack. “There has been far too much tolerance of extremism … and that means extremism of any kind including Islamophobia.”\n\nThis is the bare minimum of what you could expect from a leader in this position. May, a champion of controversial and arguably discriminatory counterterrorism policies, still managed to come out and publicly condemn attacks on Muslim worshippers as harshly as she had condemned attacks committed by Muslims.\n\nIt’s a bar that Trump can’t ever seem to clear. \n\nContrast May with Trump\n\n(Getty Images)\n\nWhile Trump jumps at any report of suspected Islamist terrorism — even ones that haven’t been confirmed — he usually takes days to mention attacks on Muslims if he mentions them at all. The Washington Post’s Philip Bump lists two examples:\n\nIt took days for him to praise the two men who were stabbed to death in Portland while defending Muslim women on a train. It took almost a week for him to speak out about the shooting of two Indian men in Kansas by someone who thought that they were Muslim. In one sense, it’s odd that Trump hasn’t tweeted condolences to the victims in London, given the criticism he’s received for his slow response to the above attacks — but, again, it’s not surprising that he hasn’t, given that history.\n\nBump’s cases are particularly telling because they were in the United States. Trump can’t seem to get interested in Islamophobic terrorist attacks inside America’s borders, yet the “America first” president jumps at opportunities to highlight reports of Islamist violence in places like Britain and the Philippines.\n\nThe reason why is fairly obvious.\n\nAttacks targeting Muslims do nothing for Trump’s political agenda, and don’t fit into his worldview (which positions Islam principally a source of violence). When Muslims commit attacks, by contrast, Trump can use that as a justification for his policies singling out Muslims — most notably the travel ban targeting individuals from Muslim countries.\n\n“The idea of Muslims being victimized doesn't fit his domestic or foreign policy agenda,” Shahed Amanullah, an Obama-era State Department official, told my Vox colleague Sarah Wildman. “He doesn't even respond to something like Portland with basic humanity, both because Muslims are not a core constituency and because it interrupts his narrative of Muslims being a threat.”\n\nThe reaction to the two London attacks, then, are emblematic of Trump’s real concerns. He’s not concerned with political violence or terrorism in general — the fact that people are being murdered in the name of extremist ideology. He’s only concerned with violence that comes from a specific group that espouses a specific strain of extremist ideology. \n\nWhich is precisely why we’re not hearing calls to ban white Britons from entering the United States until Trump can “figure out what’s going on.” Violence committed by anyone other than Muslims just doesn’t seem to be on Trump’s radar. ",
      "Folder": "Feedly",
      "Timestamp": "1497911501",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.585162Z"
}