{
  "id": "6ddf0f249f6448848f2f52f68f7b3ae3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://kottke.org/20/01/hand-painted-movie-posters-from-ghana-in-the-80s-90s",
      "Title": "Hand-Painted Movie Posters from Ghana in the 80s & 90s kottke.org",
      "Selection": "In order to drum up business for local movie theaters in Africa (most notably in Ghana), theater owners would commission local artists to paint movie posters.\n\nWhen Frank Armah began painting posters for Ghanaian movie theaters in the mid-1980s, he was given a clear mandate: Sell as many tickets as possible. If the movie was gory, the poster should be gorier (skulls, blood, skulls dripping blood). If it was sexy, make the poster sexier (breasts, lots of them, ideally at least watermelon-sized). And when in doubt, throw in a fish. Or don’t you remember the human-sized red fish lunging for James Bond in The Spy Who Loved Me?\n\n“The goal was to get people excited, curious, to make them want to see more,” he says. And if the movie they saw ended up surprisingly light on man-eating fish and giant breasts? So be it. “Often we hadn’t even seen the movies, so these posters were based on our imaginations,” he says. “Sometimes the poster ended up speaking louder than the movie.”\n\nYou can check out more of these amazing artworks in this Twitter thread, this BBC story, on the AIGA site, and at Poster House, which has an exhibition of these posters up through Feb 16.\n\nUpdate: I removed this modern-day spoof of the Ghanaian posters from the post. The tell is the reference to this amazing GIF. (thx, erik)\n\nTags: art   design   Ghana   movies",
      "Folder": "Feedly",
      "Timestamp": "1578947374",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.316988Z"
}