{
  "id": "6de153d8387f4740bb2fb927beec939f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1063717/the-best-bosses-realize-that-the-higher-they-rise-the-less-glory-they-get/",
      "Title": "The uncomfortable, powerful truth every manager realizes after getting a promotion Quartz",
      "Selection": "People usually get promotions because of their outstanding achievements and success. But most good leaders realize a strange paradox while climbing the career ladder. As Sarah Thompson, CEO of global advertising firm Droga5, tells the New York Times: “There’s less glory the more senior you get.”\n\nIn a “Corner Office” interview with Adam Bryant, Thompson explains that her management philosophy involves directing her energy outward. “You have to constantly be thinking about how you’re going to make the whole team better. To do that, you have to be kind of selfless. It’s not about winning the meeting or feeling that people would be lost without you.”\n\nThe inverse relationship between seniority and glory can be uncomfortable for a lot of top performers. After all, studies show that from childhood, the right kind of praise makes us more intelligent, happy, and successful. But good management means caring less about getting credit, and more about giving it. Thompson’s advice represents an essential shift in mindset: What if we viewed promotion as commemorating one’s judgment, rather than one’s ability to execute difficult tasks? In this sense, seniority honors one’s ability to facilitate, not spearhead, success—to listen to others, develop good organizational strategies, and shepherd teams toward progress.\n\nDavid Hassell, CEO of the software company 15Five, also promotes the notion that leaders should think of themselves as conductors, not champions. To communicate his values, he flips his company’s organizational chart upside-down. “Think of the CEO as the trunk of the tree — the one who holds and supports everyone in the organization to grow and keep the vision alive,” he writes on LinkedIn. “The support trickles up into the branches … It’s a shift from a management perspective of what can I get from you, to what do you need from me?” Satya Nadella, CEO of Microsoft, also riffs on this perspective, explaining that business leaders ought to be “learn-it-alls,” not “know-it-alls.”\n\nThis mindset benefits leaders themselves as well as the people they manage. As Emily Esfahani Smith, author of The Power of Meaning: Crafting a Life That Matters, explains in Quartz, the 20th-century psychologist Erik Erikson theorized that in order to lead a meaningful life, humans had to master a certain value or skill at each developmental stage. The most significant task of adulthood, according to Erikson, is “generativity”—which Esfahani describes as “cultivating the next generation, or helping other people to accomplish their goals and reach their potential.”\n\n“In other words, you’re a successful adult when you outgrow the natural selfishness of your childhood and youth—when you realize that life is no longer about charting your own course, but about helping others, whether it’s by raising children, mentoring colleagues, or creating something new and useful for the world,” writes Esfahani. “Generative people perceive themselves as part of a larger tapestry and seek to preserve it, however humbly, for future generations. This legacy gives their lives meaning.”\n\nThe idea that “there’s less glory the more senior you get” is inherently generative. Enacting this mantra demands great humility. But doing so makes leaders more open and receptive to the feedback, ideas, and collaboration necessary for ongoing group success.\n\nChallenging as it may be to adopt this mindset, the result is a happier, more productive team. “It took me a while to realize that people are going to do things differently than me,” says Thompson. “I had to learn that it’s about setting up the outcomes and quality you want, and giving people more and more freedom to achieve that.”\n\nLearn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.",
      "Folder": "Feedly",
      "Timestamp": "1504015008",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.638858Z"
}