{
  "id": "6e3514c95aa143b4afe957db2ffa1ed8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1773213/divvying-up-tasks-at-home-can-balance-the-division-of-labor/",
      "Title": "For a more equal division of labor at home, stop delegating and start divvying Quartz",
      "Selection": "Recently, I was speaking with a highly accomplished female client. She had worked for years towards a promotion, but now that she had officially been offered it, she was seriously questioning whether it was the right time to accept it. As we probed further, it became clear that it was not the demands of the new job that concerned her, but the multitude of responsibilities, meaningful to mundane, outside the office.\n\nShe and her husband, also in a high-powered job, have three school-aged kids. He was extremely supportive of her career, but when it came to the mountain of little things, somehow they all fell on her plate, not his. It was the mental to-do list of little things that add up to an overwhelming mental load. “Where is that permission slip? “ “What’s on the menu for Thanksgiving at our house?” Through no one’s fault in particular, her professional ambitions were being impacted by a never-ending to-do list at home.\n\nShe’s not alone. In my over 10 years as an executive coach to mid- and senior-level executives, many clients have reported that feeling overburdened at home can reduce their desire to move ahead at work. This phenomenon seems to affect women more than men and is often misinterpreted by others (and sadly by the women themselves) as a lack of ambition or career confidence.\n\nThough more women are in the workforce than ever, the division of labor in heterosexual dual-career households often still falls along gendered lines, with women doing more childcare and housework. While recent time use studies show the gap closing in the number of chore hours men and women perform at home, women’s invisible work, or mental load seems as high as ever (research is looking at how this shows up in same-sex couples as well). Some things, like masterminding a busy family’s calendar, don’t take a lot of time but do take a substantial amount of mental energy. As a solution to this domestic imbalance, most friends or advice columns suggest that women ask for help or delegate more.\n\nWhile delegating feels like a step in the right direction, it is actually starting from the incorrect assumption that the work women are looking to delegate is theirs in the first place. It’s not. Delegating is ownership while asking someone to help—and does not relieve the mental burden because at some level, you still own the task.\n\nIt’s time for a paradigm shift: women need to stop delegating and start divvying.\n\nPrivy to divvy\n\n>Divvying means it is not your responsibility anymore and comes with the bonus of recouping some mental energy. The tasks involved in keeping kids thriving, and a home running smoothly, are communal tasks that should be placed on the table and as a couple divvied up in an intentional way.\n\nWhat does divvying look like in practice? As author Anne Marie Slaughter told The Cut in 2016:\n\nSo, sitting down and saying, “Let’s divvy this up. Let’s be realistic about the pickups, the feeding, the dressing, the bathing, the night duty, the diaper duty,” and that’s just the day-to-day care…. “Who is going to look into everything from Little League to summer camp?” So, laying it out, just like you would in a business, I think that’s the start.\n\nStacey McGarrity, the CEO of a national interior design firm, and her husband Chris, an entrepreneur, have gotten good at divvying when it comes to managing their demanding careers and parenting second grader Amelia. “We definitely divvy, we divide and conquer. So much so that I don’t have any idea what’s in her dance bag, because he’s ‘Dance Dad.’”\n\nHaving a supportive partner was always important to Stacey—she saw her mom struggle under the burden of working full time and taking care of the house and kids, and she didn’t want that for herself. But that doesn’t mean this explicit divvying of responsibilities came about completely naturally. Partners should sit down and think about all tasks—large and small, frequent and occasional—needed to keep their household running. Each partner should choose the things they love doing or are OK doing, then they consider outsourcing the tasks both hate doing.\n\nFor instance, Stacey owns religion because it was important to her but not as much to Chris. “I get up and take her to church, I make sure she goes to her CCD [catholic school] class, anything to do with the volunteer work at the church, all of that falls into my plate. And the only time that he’s asked to do something is if I’m out of town.”\n\nChris owns cooking. “I’ve never been a cook and he’s always like to cook, so he does grocery shopping. That’s why lunch falls into his category,” Stacey says.\n\nThanks to this strategy, Stacey feels she is able to be more successful, both as a mom and as a CEO. “It’s allowed me to grow my business and be more efficient,” she says; because not all the childcare duties fall to her, Amelia has the option to participate in more activities.\n\nBut the biggest perk from divvying is the transfer of mental ownership of responsibilities, and the practice of letting go. For many women, having the mental and emotional energy that was once consumed by little things at home frees them up to think bigger about what is possible for their careers. Having a partner they can truly hand things off to gives them even greater confidence to say “yes” more often at work—a luxury men have always had.\n\nThe client that I mentioned earlier, the one who considered not taking the promotion? At my recommendation, she did have a sit-down with her husband. She took the promotion. She doesn’t deal with permissions slips anymore!\n\nMichelle Friedman is an executive coach, consultant and speaker, and the founder of Advancing Women’s Careers, a NYC-based coaching and consulting firm that helps solve gender imbalance in the workplace. She and her husband are longtime divvy-ers.\n",
      "Folder": "Feedly",
      "Timestamp": "1576909510",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.319772Z"
}