{
  "id": "6ef9e87c6f9446ceb8e16638661c6ea0",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/identities/2017/8/12/16138982/trump-charlottesville-false-equivalency",
      "Title": "The false equivalency of Trump blaming “many sides” in Charlottesville Vox - All",
      "Selection": "A researcher explains why Trump seriously missed the mark.\n\nAfter white supremacists held violent rallies in Charlottesville, Virginia, on Friday and Saturday, President Donald Trump had a chance to denounce the hate and bigotry that led to the current situation during a Saturday bill signing ceremony. Instead, he blamed “many sides.”\n\n“We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides, on many sides,” Trump said.\n\nThe president’s false equivalency quickly drew a lot of criticism on Twitter. But Phillip Abita Goff, a researcher who focuses on race and policing issues at John Jay College of Criminal Justice, perhaps said it best in a series of tweets:\n\n1. The deaths from racial violence in the US have not been on many sides. Separation of parents from children have not been on many sides. https://t.co/vDIciGDFX9\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n2. The forced sterilization has not been on many sides. The government-enforced segregation has not been on many sides.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n3. The forced relocation has not been on many sides. The stolen labor has not been on many sides. Media erasure has not been on many sides.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n4. Police-sanctioned lynchings have not been on many sides. Broken treaties and stolen land have not been on many sides.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n5. Immigration enforcement has not been equally applied to many sides. Beauty standards have not represented many sides.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n6. Segregated schools do not advantage many sides. Rape culture does not create vulnerable people from many sides.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n7. Music traditions were not coopted and sold for profit from many sides. The constitution didn't count 3/5ths of a person from many sides.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n8. Justice frequently does not have many sides. When powerful groups harm less powerful groups, there is not a need for mutual apology.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n9. False equivalency is a lie that renders the powerful as victims. And it is a violence to those who are not equal save for that lie.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\n10. Poverty and exploitation do not have many sides. People did not die in #Charlottesville on many sides. And justice cannot say otherwise.\n\n— Phillip Atiba Goff (@DrPhilGoff) August 12, 2017\n\nIn short, there aren’t multiple morally equivalent sides here. There’s one side — white supremacists — that has long oppressed all other groups of people. Their protests aim to ensure that oppression continues, even if it means using violence. The people counterprotesting, on the other hand, are trying to end that oppression.\n\nSo while it’s true that both sides participated in the brawls seen throughout the protests, one side — in a country that supposedly values equality — has the much stronger case by actively working against the hate, bigotry, and violence that the white supremacist side is actively trying to perpetuate.\n\nBut Trump won’t acknowledge any of that. Asked to clarify his remarks, a White House official said, “The President was condemning hatred, bigotry and violence from all sources and all sides. There was violence between protesters and counter protesters today.” Trump is deliberately not calling out the white supremacists who led to the unrest in Charlottesville.",
      "Folder": "Feedly",
      "Timestamp": "1502599926",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.560994Z"
}