{
  "id": "6f574c9e0c994475b6691bf277155455",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2019/10/the-nobel-prize-in-economic-science-goes-to-banerjee-duflo-and-kremer.html",
      "Title": "The Nobel Prize in Economic Science Goes to Banerjee, Duflo, and Kremer Marginal Revolution",
      "Selection": "The Nobel Prize goes to Abhijit Banerjee, Esther Duflo and Michael Kremer (links to home pages) for field experiments in development economics. Esther Duflo was a John Bates Clark Medal winner, a MacArthur “genius” award winner, and is now the second woman to win the economics Nobel and by far the youngest person to ever win the economics Nobel (Arrow was the previous youngest winner!). Duflo and Banerjee are married so these are also the first spouses to win the economics Nobel although not the first spouses to win Nobel prizes–there was even one member of a Nobel prize winning spouse-couple who won the Nobel prize in economics. Can you name the spouses?\n\nMichael Kremer wrote two of my favorite papers ever. The first is Patent Buyouts which you can find in my book Entrepreneurial Economics: Bright Ideas from the Dismal Science. The idea of a patent buyout is for the government to buy a patent and rip it up, opening the idea to the public domain. How much should the government pay? To decide this they can hold an auction. Anyone can bid in the auction but the winner receives the patent only say 10% of the time–the other 90% of the time the patent is bought by the government at the market price. The value of this procedure is that 90% of the time we get all the incentive properties of the patent without any of the monopoly costs. Thus, we eliminate the innovation tradeoff. Indeed, the government can even top the market price up by say 15% in order to increase the incentive to innovate. You might think the patent buyout idea is unrealistic. But in fact, Kremer went on to pioneer an important version of the idea, the Advance Market Commitment for Vaccines which was used to guarantee a market for the pneumococcal vaccine which has now been given to some 143 million children. Bill Gates was involved with governments in supporting the project.\n\nMy second Kremer paper is Population Growth and Technological Change: One Million B.C. to 1990. An economist examining one million years of the economy! I like to say that there are two views of humanity, people are stomachs or people are brains. In the people are stomachs view, more people means more eaters, more takers, less for everyone else. In the people are brains view, more people means more brains, more ideas, more for everyone else. The people are brains view is my view and Paul Romer’s view (ideas are nonrivalrous). Kremer tests the two views. He shows that over the long run economic growth increased with population growth. People are brains.\n\nOh, and can I add a third Kremer paper? The O-Ring Model of Development is a great and deep paper. (MRU video on the O-ring model).\n\nThe work for which the Nobel was given is for field experiments in development economics. Kremer began this area of research with randomized trials of educational policies in Kenya. Duflo and Banerjee then deepened and broadened the use of field experiments and in 2003 established the Poverty Action Lab which has been the nexus for field experiments in development economics carried on by hundreds of researchers around the world.\n\nMuch has been learned in field experiments about what does and also doesn’t work. In Incentives Work, Dufflo, Hanna and Ryan created a successful program to monitor and reduce teacher absenteeism in India, a problem that Michael Kremer had shown in Missing in Action was very serious with some 30% of teachers not showing up on a typical day. But when they tried to institute a similar program for nurses in Putting a Band-Aid on A Corpse the program was soon undermined by local politicians and “Eighteen months after its inception, the program had become completely ineffective.” Similarly, Banerjee, Duflo, Glennerster and Kinnan find that Microfinance is ok but no miracle (sorry fellow laureate Muhammad Yunus). A frustrating lesson has been the context dependent nature of results and the difficult of finding external validity. (Lant Pritchett in a critique of the “randomistas” argues that real development is based on macro-policy rather than micro-experiment. See also Bill Easterly on the success of the Washington Consensus.)\n\nDuflo, Kremer and Robinson study How High Are Rates of Return to Fertilizer? Evidence from Field Experiments in Kenya. This is an especially interest piece of research because they find that rates of return are very high but that farmers don’t use much fertilizer. Why not? The reasons seem to have much more to do with behavioral biases than rationality. Some interventions help:\n\nOur findings suggest that simple interventions that affect neither the cost of, nor the payoff to, fertilizer can substantially increase fertilizer use. In particular, offering farmers the option to buy fertilizer (at the full market price, but with free delivery) immediately after the harvest leads to an increase of at least 33 percent in the proportion of farmers using fertilizer, an effect comparable to that of a 50 percent reduction in the price of fertilizer (in contrast, there is no impact on fertilizer adoption of offering free delivery at the time fertilizer is actually needed for top dressing). This finding seems inconsistent with the idea that low adoption is due to low returns or credit constraints, and suggests there may be a role for non–fully rational behavior in explaining production decisions.\n\nThis is reminiscent of people in developing countries who don’t adjust their retirement savings rates to take advantage of employer matches. (A connection to Thaler’s work).\n\nDuflo and Banerjee have conducted many of their field experiments in India and have looked at not just conventional questions of development economics but also at politics. In 1993, India introduced a constitutional rule that said that each state had to reserve a third of all positions as chair of village councils for women. In a series of papers, Duflo studies this natural experiment which involved randomization of villages with women chairs. In Women as Policy Makers (with Chattopadhyay) she finds that female politicians change the allocation of resources towards infrastructure of relevance to women. In Powerful Women (Beaman et al.) she finds that having once had a female village leader increases the prospects of future female leaders, i.e. exposure reduces bias.\n\nBefore Banerjee became a randomistas he was a theorist. His A Simple Model of Herd Behavior is also a favorite. The essence of the model can be explained in a simple example (from the paper). Suppose there are two restaurants A and B. The prior probability is that A is slightly more likely to be a better restaurant than B but in fact B is the better restaurant. People arrive at the restaurants in sequence and as they do they get a signal of which restaurant is better and they also see what choice the person in front of them made. Suppose the first person in line gets a signal that the better restaurant is A (contrary to fact). They choose A. The second person then gets a signal that the better restaurant is B. The second person in line also sees that the first person chose A, so they now know one signal is for A and one is for B and the prior is A so the weight of the evidence is for A—the second person also chooses restaurant A. The next person in line also gets the B signal but for the same reasons they also choose A. In fact, everyone chooses A even if 99 out of 100 signals are B. We get a herd. The sequential information structure means that the information is wasted. Thus, how information is distributed can make a huge difference to what happens. A lot of lessons here for tweeting and Facebook!\n\nBanerjee is also the author of some original and key pieces on Indian economic history, most notably History, Institutions, and Economic Performance: The Legacy of Colonial Land Tenure Systems in India (with Iyer).\n\nDuflo’s TED Talk. Previous Duflo posts; Kremer posts; Banerjee posts on MR.\n\nBefore last year’s Nobel announcement Tyler wrote:\n\nI’ve never once gotten it right, at least not for exact timing, so my apologies to anyone I pick (sorry Bill Baumol!). Nonetheless this year I am in for Esther Duflo and Abihijit Banerjee, possibly with Michael Kremer, for randomized control trials in development economics.\n\nAs Tyler predicted he was wrong and also right. Thus, this years win is well-timed and well-deserved. Congratulations to all.\n\nThe post The Nobel Prize in Economic Science Goes to Banerjee, Duflo, and Kremer appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1571074120",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.335546Z"
}