{
  "id": "6fa59a0d72ee4a3a8104f3c17091424a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/871778/the-un-security-council-passed-a-resolution-to-end-israeli-settlements-in-palestinian-territories/",
      "Title": "The UN Security Council passed a resolution to end Israeli settlements in Palestinian territories Quartz",
      "Selection": "Late today (Dec. 23), the United Nations Security Council voted on a resolution to end Israeli settlements in Palestinian territories. Fourteen of 15 council members were in agreement—only the US abstained. Applause broke out in the room after the draft resolution passed.\n\nInitially proposed by Egypt and withdrawn under pressure from Israel and US president-elect Donald Trump, the resolution was put forward for a vote this afternoon by New Zealand, Malaysia, Venezuela and Senegal. It states that Israeli settlements on Palestinian territory occupied since 1967, including East Jerusalem, have “no legal validity” and demanded a halt to “all Israeli settlement activities.”\n\nIsrael’s permanent representative at the UN, Danny Danon, denounced the resolution and those who voted for it, asking the room full of Security Council members afterward, “Would you ban the French from building in Paris?”\n\nBenjamin Netanyahu, Israel’s Prime Minister, also minced no words in a statement issued in response to the vote, and signaled that the more things change, the more they stay the same. “Israel rejects this shameful anti-Israel resolution at the UN and will not abide by its terms,” he said.\n\nFor Palestinians, the resolution’s passage is at least a symbolic win, whatever Netanyahu and others threaten. “This is a day of victory for international law, a victory for civilized language and negotiation and a total rejection of extremist forces in Israel,” said chief Palestinian Authority peace negotiator Saeb Erekat in a statement.\n\nWe express our gratitude to the cosponsors of #UNSC 2334 on illegal Israeli settlements @NZUN @venezuela_un @MalaysiaMFA #Senegalhttp://pic.twitter.com/0va9e7jLFf\n\n— Palestine PLO – NAD (@nadplo) December 23, 2016\n\nThe US has avoided referring to the Israeli settlement activity as “illegal” as a concession to Israel, which hopes to incorporate larger settlement blocs if a two-state solution with the Palestinians is reached. Today’s resolution, explicitly stating that settlement is illegal, is an international rebuke from other nations, rejecting that American circumspection and Israel’s actions though it imposes no sanctions. To reverse the vote that passed today, a follow-up vote must be proposed—but that proposal needs to survive the veto power of the Britain, China, France, or Russia, which seems unlikely given the enthusiasm for today’s resolution.\n\nIt was President Barack Obama’s decision to abstain from the UN vote today, and the abstention is in accord with Obama’s chilly relationship with Netanyahu and the Israeli right wing.\n\nOn the other hand, president-elect Trump is very much in alignment with the current Israeli prime minister, and had urged the US to veto this resolution before it went up for vote. Trump’s pick for Ambassador to Israel, David Friedman, is hawkish and opposes the two-state solution for peace—which is the ultimate goal of today’s UN Security Council resolution.\n\nConstruction of Israeli settlements undermines efforts to reach peace by signaling Israel’s intent to continue expanding. Halting settlements would ostensibly increase the Palestinians’ faith in Israel’s seriousness about the peace process and about giving back occupied land.\n\nAfter the vote, Trump tweeted that things will be different at the UN once he’s in office. But “different” is a pretty vague goal and the businessman has never had to contend with Middle East politics for real.\n\nAs to the U.N., things will be different after Jan. 20th.\n\n— Donald J. Trump (@realDonaldTrump) December 23, 2016\n\nBluster has gotten him far. But the tricky question of peace for Israel and Palestine has stumped the world’s greatest minds and its finest leaders for decades.\n",
      "Folder": "Feedly",
      "Timestamp": "1482553569",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.677861Z"
}