{
  "id": "702b4232ed8842cb8b7df9eb507bb32a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2018/7/25/17607232/trump-white-women",
      "Title": "Trump’s enduring political strength with white women, explained Vox All Posts by Matthew Yglesias",
      "Selection": "White women voters disapprove of President Donald Trump’s job performance, but nonetheless view him more favorably than other voters — showing that even as a large Trump-era gender gap seems to have opened up, gender remains a less significant marker of political behavior than race and ethnicity or even age. \n\nTracking polling from Civiqs available online makes it easy to examine Trump’s approval rating among demographic subgroups of registered voters and illustrate the point. \n\nTrump famously won a majority of white women’s votes in 2016, but he is currently unpopular with this group. \n\n        Civiqs\n\nIt’s important to note, however, that Trump was unpopular on Election Day. In past American elections, losing candidates (Al Gore, John Kerry, John McCain, Mitt Romney) were viewed favorably by more people than viewed them unfavorably. The 2016 election was a very unusual race in which both candidates’ favorable ratings were underwater. An unpopular opponent plus the Electoral College let Trump win despite being unpopular. \n\nAlthough Trump is unpopular with white women, he remains more popular with white women than with voters overall.\n\nWhite women like Trump more than average\n\nTrump’s 45 percent approval rating among white women isn’t very good, but it’s better than his overall national approval rating with voters of just 42 percent.\n\n        Civiqs\n\nThat said, among whites, there is a large gender gap in evaluations of Trump. While he’s modestly unpopular with white women, he is enormously popular with white men.\n\n        Civiqs\n\nCiviqs find that Hispanic men’s Trump approval rating is 6 points higher than Hispanic women’s, while the gender gap for African Americans is just 2 points. \n\nAmong white women, meanwhile, there are huge divides based on age and education.\n\nYoung women hate Trump\n\nAge has emerged as a significant partisan divide in recent cycles, and this is particularly true for white women. \n\nAmong the youngest cohort of white women, Trump’s approval rating is a pathetic 32 percent, whereas among white female senior citizens it’s a very strong 51 percent.\n\n        Civiqs\n\nThere are, similarly, significant splits by education. Just 44 percent of white women voters with college degrees approve of Trump, while an even smaller 36 percent of white women with graduate degrees approve. By contrast, among working-class white women, views are split evenly.\n\n        Civiqs\n\nDiscussions of politics are often driven by stereotypes and demographic paradigms, and as such, the predominant image of the “Trump supporter” has tended to be a working-class white man. \n\nThis is, indeed, Trump’s very best demographic and in some sense his electoral base. But in a practical sense, it’s Trump’s substantial strength among working-class white women that’s critical to his political success. Especially given Democrats’ self-conception as the party of women’s rights and women’s interests, their failure to do better with this group deserves to be seen as a central political issue. \n",
      "Folder": "Feedly",
      "Timestamp": "1532928300",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.450131Z"
}