{
  "id": "704494163a5a406d8b7e4c900696c501",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://skillet.lifehacker.com/can-i-just-enjoy-this-damn-diet-coke-without-being-heal-1797073517",
      "Title": "Can I Just Enjoy This Damn Diet Coke Without Being Health-Shamed Skillet",
      "Selection": "Another day, another wet blanket article talking trash about my truest love: Diet Coke. According to The Cut, my favorite non-alcoholic beverage (and #1 energy source) may be killing me softly:\n\nA recent study in the Canadian Medical Association Journal found that drinking one drink with artificial sugar a day can lead to a higher risk of weight gain, obesity, diabetes, and heart disease.\n\nAs someone who has been drinking Diet Coke since the mid-eighties, I do not find the above set of words to be extremely interesting. Also, I don’t think that’s exactly what the study is saying. In fact, the interpretation of the data printed in the actual study seems a bit wishy-washy:\n\nEvidence from RCTs does not clearly support the intended benefits of nonnutritive sweeteners for weight management, and observational data suggest that routine intake of nonnutritive sweeteners may be associated with increased BMI and cardiometabolic risk. Further research is needed to fully characterize the long-term risks and benefits of nonnutritive sweeteners.\n\nTo me “does not clearly support” means you don’t have a very strong case, but that’s not my point. I don’t think anyone is under the impression that diet soda is good for you, and drinkers of it certainly do not believe that it is a healthful beverage. Out of all the diet soda drinkers I know, a very small percentage of them drink diet soda because they think it will lead to weight loss. (EXHIBIT A: This not-at-all-scientific Twitter poll.)\n\nDiet Coke-heads drink Diet Coke because we freaking love it. (I also drink it because I come from a family of Diet Coke drinkers; I didn’t even taste a regular Coke until I was like, eight.) But Diet Coke is one beverage that people just love to hate. I have a lot of bad habits, but no other habit has been so zealously discouraged than my habit of enjoying an icy cold diet beverage. It’s telling that my two favorite bartenders, who have served me far more alcoholic beverages than non-alcoholic ones, have only ever threatened to cut me off once, and the threat was not over martinis or Campari, but that sweet silvery can of aspartame-packed nectar. I have had actual cocaine users finish telling me a story about how much cocaine they did over the weekend (the most boring of stories) and then launch into a lecture on how the Diet Coke I held in my little, chubby hand was going to kill me (the cocaine user is usually holding a pint glass of tequila or something to boot).\n\nHere’s a freaking #lifehack for you: Enjoy a vice or two. Sure you can try to prolong your life by cutting out gluten or drinking coffee (or not drinking coffee), but life shouldn’t be about denying yourself, and what’s the point of living if you do so without joy? Diet Coke infuses my day with joy (and just enough caffeine) and I don’t understand why so many people wish to rob me of my joy. (Again, don’t say it because they’re concerned with my health; if people were really concerned about my health they wouldn’t like shenanigans such as this on Instagram.)\n\nDo I get a headache if I drink more than four a day? Yes, but I get a tummy ache if I eat an entire box of Kraft macaroni, so I just consume less of those things. (Anything worth loving should also be able to hurt you a little—that’s my motto.) There isn’t a strong case for Diet Coke as a healthy choice, but the anti-diet soda study I mentioned at the beginning of this article wasn’t particularly compelling either. If you’re really concerned, I guess you can enjoy some La Croix—though I hear fizzy beverage naysayers are trying to take that away too—but please leave my Diet Coke alone.\n",
      "Folder": "Feedly",
      "Timestamp": "1500590931",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.571234Z"
}