{
  "id": "704b1a6b1c914cd3bd7d738743c6fef9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2020/2/4/21122493/yahoo-class-action-settlement-data-breaches",
      "Title": "You might be able to get up to $100 from the settlement for Yahoo’s data breaches The Verge",
      "Selection": "Photo Illustration by Rafael Henrique/SOPA Images/LightRocket via Getty Images\n\nYahoo famously suffered numerous data breaches from 2012 to 2016 (including one in 2013 that affected all 3 billion of its users), and the company is informing users that they can now submit claims for either credit monitoring or cash compensation as part of a proposed class action lawsuit settlement. Yahoo says if you had a Yahoo account anytime between 2012 and 2016 and are a resident of the US or Israel, the class action settlement may affect you.\n\nThe total amount of the settlement fund is $117.5 million, up from a proposed $50 million settlement that was rejected by a judge. Yahoo will use that settlement fund to pay for:\n\nA minimum of two years of credit monitoring for individual users\n\nA cash payment of $100 to users who can prove they already have at least 12 months of credit monitoring (though the final cash amount may be higher or lower depending on how many claims are filed)\n\nCompensation for time spent dealing with issues resulting from the data breaches\n\nOut-of-pocket costs users may have had to pay as a result of having their information stolen in the data breaches, such as paying an accountant to help refile a falsified tax return\n\nReimbursement for some costs of Yahoo’s premium or small business services\n\nIf you want to file a claim, you can find the forms right here. You must submit your claim online or by mail by July 20th.\n\nBut before you get too excited, just remember the Equifax situation; if a ton of people go through this process and opt for the cash payment, you’re not getting anything close to $100.\n\nIn addition to the 2013 breach that affected 3 billion Yahoo users, this proposed class action lawsuit also covers a 2014 “state-sponsored” hack that affected more than 500 million accounts, a 2012 “data security intrusion” (though Yahoo says there is no evidence that user credentials, email accounts, or contents of emails were taken from that), and a breach that lasted from 2015 to September 2016 where hackers were able to gain access to approximately 32 million Yahoo email accounts.\n",
      "Folder": "Feedly",
      "Timestamp": "1580853970",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.342720Z"
}