{
  "id": "734864896eb74ff987af0ab9404e6907",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/948798/jenna-lyons-is-out-at-j-crew/",
      "Title": "Jenna Lyons, whose creative vision guided J.Crew through its dramatic rise and fall, is out Quartz",
      "Selection": "Jenna Lyons, president, creative director, and the de facto face of the J.Crew clothing brand, is parting ways with the company after 26 years.\n\n“Jenna and I got together and we both agreed it was time for a change,” CEO Mickey Drexler told Business of Fashion, which broke the news (paywall).\n\nSomsack Sikhounmuong, the current head of women’s design at J.Crew, will become the brand’s chief design officer and oversee men’s and children’s as well.\n\nFor J.Crew, it marks the end of an era. Lyons’s creative influence helped the brand become a US household name in the 2000s. She had been with the company since 1990, and rose quickly after Drexler joined as CEO in 2003. In the decade that followed, their partnership helped J.Crew triple its sales, and made fans including former US first lady Michelle Obama.\n\nLyons had a deft touch for giving J.Crew’s preppy staples a fashion-forward twist with energetic colors and creative styling. In 2010, she became the brand’s president, and has come to be a fashion celebrity with her own widely admired style.\n\nBut many of J.Crew’s formerly loyal customers believe the company strayed too far from its strengths, becoming too fashion-centric in its product offering and catalogue styling, at the expense of the wardrobe basics that made it a closet staple. Some have blamed Lyons—by name—though J.Crew also has had other problems, including customer allegations that the quality and fit of its products have deteriorated over the years.\n\nSales have now been falling for years, prompting the company to oust its head of women’s design in 2015—but not Lyons, which was somewhat unusual in the fashion industry. The company instead brought in Sikhounmuong, previously head designer at Madewell, J.Crew’s sister brand, which was enjoying the sort of success J.Crew has lately been seeking for itself.\n\nJ.Crew has also suffered from the problems plaguing US retail more broadly, including increasing competition from cheap fast-fashion competitors and an overabundance of brick-and-mortar stores. In its most recent fiscal year, reported on March 21, J.Crew sales fell 3%, while sales at stores open at least a year dropped 7%.\n\nSikhounmuong will now have the task of trying to turn the brand’s sales around. Lyons will remain a creative adviser to J.Crew through the end of the year, when her contract runs out. Her position will not be filled, the company said. Instead her duties will be shifted to other members of J.Crew’s executive team.\n",
      "Folder": "Feedly",
      "Timestamp": "1491260932",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.616787Z"
}