{
  "id": "7508b67decaa4369b94e79a51632ad84",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://tywkiwdbi.blogspot.com/2016/05/americas-drunkest-cities.html",
      "Title": "America's drunkest cities TYWKIWDBI (Tai-Wiki-Widbee)",
      "Selection": "\"The findings were compiled by online financial news outlet 24/7 Wall St.\n\nThe group analyzed self-reported data from County Health Rankings & Roadmaps, a joint program with the Robert Wood Johnson Foundation and the University of Wisconsin Population Health Institute. Excessive drinking, concentration of bars and alcohol-related driving deaths all were contributing factors in determining America’s drunkest cities...\"\n 1. Appleton, Wis.\n\n 2. Oshkosh, Wis.\n\n 3. Green Bay, Wis.\n\n 4. Madison, Wis.\n\n 5. Fargo, N.D.\n\n 6. La Crosse, Wis.\n\n 7. Fond du Lac, Wis.\n\n 8. Ames, Iowa\n\n 9. Eau Claire, Wis.\n\n10. Mankato, Minn.\n\n11. Wausau, Wis.\n\n12. Sheboygan, Wis.\n\n13. Missoula, Mont.\n\n14. Grand Forks, N.D.\n\n15. Racine, Wis.\n\n16. Janesville, Wis.\n\n17. Milwaukee, Wis.\n\n18. Lincoln, Neb.\n\n19. Iowa City, Ia.\n\n20. Corvallis, Ore\"Wisconsinites consistently imbibe on a grander scale, with more than one-quarter of adults reporting that they binge or drink heavily throughout the week.\n\nAppleton, Wis., topped the national list just six months after winning the statewide honors. Data showed that 26.8 percent of Appleton residents drank excessively and nearly one-third of driving deaths involved alcohol. The city has 4.4 drinking establishments per 10,000 residents, compared to an average of 1.6 bars per 10,000 population across the 381 cities covered by the survey.\"\n\nThe study also reported that the driest cities were in the Bible Belt.",
      "Folder": "Feedly",
      "Timestamp": "1463689441",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.804436Z"
}