{
  "id": "7796a1824cd94593979bca270968ea97",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.getrichslowly.org/2017/12/13/visualizing-net-worth/",
      "Title": "Visualizing your net worth — and how it compares to others Get Rich Slowly",
      "Selection": "As you all know, I’m fond of financial scorecards. While admitting their limitations, I like numbers and tools that allow you to compare your financial progress with other people.\n\nI like credit scores, for instance, because they put a number on how you handle money — a number you can compare to Americans at large. And I like apps like Credit Sesame, which let you to monitor your credit score — much like a bathroom scale lets you monitor your weight.\n\nPerhaps my favorite number is net worth, the total value of everything you own. Calculating net worth is easy. It’s what you own minus what you owe. That’s it. Simple, right? Simple but powerful.\n\nNet worth tracks your financial health in the same way that weight measures your fitness. Neither number tells the whole story, but as a measure of change over time each is a handy tool.\n\nWant to calculate your own net worth? I’ve created this free net worth spreadsheet in Google Docs for you to download or copy. It’s still branded with Money Boss, but I’ll change that soon.\n\nNet worth is a great way to track your own financial progress as you age. But have you ever wished you could compare your net worth with the net worth of other Americans? I have. It’s possible, but it’s a complicated process that required digging through tables of government data.\n\nWell, Zach at Four Pillar Freedom — who must have too much free time — recently took info from the Federal Reserve’s 2016 Survey of Consumer Finances and created a couple of tools that let you visualize the net worth of Americans by age. These tools aren’t sophisticated. They perform simple tasks, but they perform them well.\n\nHere, for instance, is Zach’s tool for looking at net worth percentiles by age.\n\nMy net worth of approximately $1.6 million puts me between the 95th and 96th percentile of Americans aged 45-49.\n\nZach also whipped up a quick chart to show the number of people who have positive net worths versus those with negative net worths. Plus he has a quick tool that compares the median net worth for each age group to the net worth of the top 1% in each population.\n\nIf you too are a money nerd who likes to compare yourself to others, then take a few minutes to explore Zach’s net worth visualizer!\n\nThe post Visualizing your net worth — and how it compares to others appeared first on Get Rich Slowly.\n",
      "Folder": "Feedly",
      "Timestamp": "1513298414",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.517983Z"
}