{
  "id": "77c55298cc3b4af7b13876a8e597b867",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/review/brilliant-two-panel-switch-smart-home-controller",
      "Title": "Brilliant Two Switch Panel Rule Your Smart Home Devices Wired",
      "Selection": "Earlier this year, I asked a friend to dog-sit for us while my family was on vacation. I lured her in with the promise of access to our fully-equipped smart house. She could peruse the full extent of my Apple Music subscription on our Sonos, or watch Netflix on our Apple TV. She could fiddle with the Hue lights. She could even start the robot vacuum, if she wanted! No pressure or anything.\n\nThat afternoon, I got a call. I had accidentally packed the iPad mini, which serves as our house’s smart control panel. Without it, she couldn’t use... well, anything. In retrospect, we were lucky that she was even able to operate the front door.\n\nIf you have a smart home, you most likely control it with your smartphone or personal tablet. Toggling between multiple apps is annoying, and so is sitting in your house for anyone who isn't you. The concept behind tech start-up Brilliant is therefore—excuse me here—brilliant. It takes control of your smart house out of your pocket and drills it into the wall with a panel that anyone can use.\n\nThe Brilliant panel is a simple computer, rather than an upgraded smart switch. In addition to providing Amazon Alexa services when connected to your Amazon account, it has a microphone, a camera, a motion detector, and an alarm. It integrates an astonishing number of smart home devices, like the Nest and Ecobee thermostats, the Ring doorbell, the Phillips Hue bulbs, and Sonos speakers.\n\nI was excited to test the Brilliant two switch panel (Brilliant also offers one-, three-, and four-switch panel configurations). At the moment, it’s still a little too clunky to substitute for my iPad, but I’m optimistic that that will change in the very near future.\n\nLight Bright\n\nThe two-switch panel is 4.76 inches wide and 5.3 inches tall, with an LCD touch screen that has 720 x 1280 resolution and two indented sliders that work as dimmers. It’s only a little bigger than a regular light switch panel. I chose to install the Brilliant by my front door. You need a 120-volt double switch gang box that is grounded and wired in compliance with National Electric Code.\n\nThat's easy enough; a double switch gang box and compliant wiring is what you find when you unscrew the panel for most double light switches. And when I watched Brilliant’s clear and simple installation video, installation seemed easy. But when I unscrewed our panel, a rat’s nest of cords popped out at me. My husband rewired our house himself, and I needed to enlist his help to figure out which cord was what.\n\nShutting off the breaker and manipulating live wires isn’t hard, but it is nerve-wracking, and I was grateful to be able to do it with someone who had done it before without burning our house down (yet). For anyone who doesn't have experience with electrical wiring, Brilliant will soon be announcing an installation service. A licensed electrician will come install one panel for you, starting at $199, with tiered pricing for multiple panels.\n\nThe Brilliant has both Wi-Fi connectivity and Bluetooth capabilities. Once installed and online, the possibilities made me a little giddy. I downloaded the Brilliant app, where, obviously, the first order of business was to upload pictures of my kids from my camera roll to roll continuously whenever the Brilliant was on. I also linked the Brilliant to my Amazon account so I could use Alexa. The panel walked me through how to do it.\n\nAdding our smart home devices to the Brilliant was annoying, in ways that were both predictable and unexpected. In theory, it’s as simple as touching the panel, selecting a room, and tapping the Add Device button. I did predict, and dread, the tedious back-and-forth between my husband and me as we tried to remember who had registered for what device, which email address they'd used, and what all the long-forgotten passwords were.\n\nBut I had other snafus. The Hue lights and Sonos didn’t show up immediately, so I reset the router. That brought the Hue lights online, but to get the Sonos, I had to contact the team at Brilliant. They said they'd discovered a bug with the Sonos's new API and rolled out an update that evening. The Nest didn't show up, either. Although Brilliant says that any user can connect to any Nest thermostat, their director of product management did have to send me an email that let me log into my Nest account, in order to authorize the Brilliant to access it.\n\nOnce all the devices are on the Brilliant, you can’t use all of their functions. For example, I can turn my Sonos on and off, but I can only play selections from albums or playlists that I’ve already added to My Sonos. Likewise, I can turn my Hue lights on and off, and dim or brighten them, but I can’t tinker with the colors.\n\nThe app doesn’t always sync with the control panel either. I can’t add new devices via the app, and I also can’t find the Hue or Sonos. It’s not especially irritating, considering that I can always control those via their original apps on my phone. Plus, my Sonos sounds much better than the Brilliant's speaker.\n\nTinker, Tailor\n\nI’m not surprised that there are a lot of kinks to work out with the Brilliant, since it's a relatively new product that comes packed full of functions. For example, the panel has a camera and microphone, so that you can speak to other Brilliant panels via intercom; I thought briefly about installing it in my husband’s workshop behind or house, but the electrical wiring situation is even hairier out there. The camera also has a tiny sliding panel to cover the lens for privacy.\n\nThe Brilliant also has a motion detector, which has a range of 8 to 15 feet, and you can toggle the motion sensors on and off. I set the display to turn on dim lights whenever the Brilliant detected motion, which is convenient for when I stumble into the living room at 6 am, bleary-eyed and holding two kids. I also told the Brilliant to turn the lights off if it didn’t detect motion after 30 minutes.\n\nYou can also set customizable scenes. I created one that starts automatically after my kids' bedtime, which dims all the lights and starts playing a Pandora station on low. I also set a timer for the porch light, which turns it off at 10 pm. You can also set alarms. The Brilliant rings a surprisingly pleasant-sounding chime, which I use to remind my kids that we have to leave for preschool right this second.\n\nAnd of course, with Alexa enabled, you can do all the usual Alexa things, like ask for the weather forecast or get a refresher on Mary, Queen of Scots. Not only does Alexa answer you, but visuals—like the ten-day forecast, or written explanations—also appear on the Brilliant screen. If you want to control the devices that the Brilliant controls through Alexa, you also have to enable the Alexa Skill. The Brilliant app walks you through it.\n\nScreen Time\n\nThe Brilliant brilliantly (sorry, but you can’t stop me!) filled a gap in the smart home market. I find the mini iPad to be pretty convenient, but I know our dog-sitters and baby-sitters find it a little annoying, and possibly a little intrusive. After all, I also use it to watch videos and browse the Internet. As much as I trust my friends, babysitters, dog-sitters, and house-sitters, I always wonder if they have to fight an urge to check my calendar or order 300 cinnamon raisin bagels when I leave my iPad at home.\n\nThe Brilliant isn't perfect. It's expensive, and hard to install, when compared to, say, an Echo Show. But for all the random quirks that come with a relatively recent product—like, say, accidentally turning off my Hue lights with another switch and then having the Brilliant tell me that it couldn't find them—it was so easy to imagine how easy and convenient it would be, once a lot of the bugs were worked out.\n\nI kept finding the Brilliant unexpectedly delightful. I loved catching glimpses of my kids as I walked out of the house. My \"kids are in bed\" scene startled my husband into cracking open a bottle of wine. The panel does get the most important things right: It manages your home devices, and nothing more. And you can't accidentally take it with you on vacation.\n",
      "Folder": "Feedly",
      "Timestamp": "1542834347",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.424596Z"
}