{
  "id": "78df0a7337ab419eb48caf319c2340b8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2019/3/7/18254616/2020-democrats-ilhan-omar-israel",
      "Title": "Three 2020 Democrats express concern that attacks against Ilhan Omar will stifle debate on Israel Vox - All",
      "Selection": "Warren, Sanders, and Harris all come out in support of Omar.\n\nAt least three Democratic presidential candidates have come out in support of Rep. Ilhan Omar (D-MN), whose recent questioning of pro-Israel lobbying groups and the United State’s political alliance with Israel has come under fire for feeding into anti-Semitic conspiracies.\n\nSen. Bernie Sanders (I-VT) said the attacks against Omar were “wrong” and “stifling debate.” Sen. Elizabeth Warren (D-MA) said “branding criticism of Israel as automatically anti-Semitic has a chilling effect on our public discourse.” Sen. Kamala Harris (D-CA) says she worries Omar is being targeted in a way that “may put her at risk.”\n\nTensions within the Democratic Party have been growing over the past week, as Democratic leadership has been under pressure to rebuke Omar’s comments but also avoid falling in line with a conservative campaign to paint Omar, one of the first Muslim women in Congress, as an anti-Semite.\n\nThe backlash against Omar began when the first-term Congress member from Minnesota tweeted that American politicians’ support for Israel was “all about the Benjamins,” which many saw as directly tied to an anti-Semitic conspiracy about Jewish magnates buying off American politicians.\n\nThen in a discussion about the anti-Semitism allegations against her, Omar said she was trying to “talk about the political influence in this country that says it is okay to push for allegiance to a foreign country.” Rep. Eliot Engel (D-NY), who chairs the Foreign Affairs Committee, which Omar sits on, called it “a vile anti-Semitic slur”; some Democrats and Republicans interpreted her comment as feeding into a longstanding anti-Semitic trope that Jewish people are disloyal citizens of their own countries.\n\nOthers 2020 candidates, like Sens. Kirsten Gillibrand (D-NY) and Cory Booker (D-NJ) took a different tone than Warren, Sanders and Harris. Booker said he found Omar’s comments “disturbing,” while recognizing that some of the attacks against her had “anti-Islamic sentiment.” Gillibrand said that “those with critical views of Israel, such as Congresswoman Omar, should be able to express their views without employing anti-Semitic tropes about money or influence,” also highlighting the hypocrisy in the Republican Party for censuring Omar, but saying “little or nothing” when President Donald Trump “defended white supremacists at Charlottesville.”\n\nHouse Democratic leadership publicly censured Omar for careless word choice in a statement and is planning to hold a vote on a resolution Thursday that rebukes anti-Semitism, Islamophobia, and white supremacy (without naming Omar directly).\n\nBut many more progressive Democrats — including Warren, Harris, and Sanders, who are running for president — are sticking with Omar, calling the attacks an attempt to silence debate on Israel.\n\nWhat Sanders, Harris, and Warren said\n\nWhile support for Israel among Americans remains strong overall, support for Palestine is at an all-time high, according to a February poll from Gallup — primarily driven by liberal Democrats. That’s probably why the most progressive 2020 candidates are coming out in support of Omar — and, more notably, in support of having a debate about Israel policy.\n\n“What I fear is going on in the House now is an effort to target Congresswoman Omar as a way of stifling that debate,” Sanders said in a statement. “That’s wrong.”\n\nIn a statement, Harris said “we all have a responsibility to speak out against anti-Semitism, Islamophobia, homophobia, transphobia, racism, and all forms of hatred and bigotry, especially as we see a spike in hate crimes in America.” She added that there is a difference between criticism of policy and anti-Semitism:\n\nBut like some of my colleagues in the Congressional Black Caucus, I am concerned that the spotlight being put on Congresswoman Omar may put her at risk. We should be having a sound, respectful discussion about policy. You can both support Israel and be loyal to our country. I also believe there is a difference between criticism of policy or political leaders, and anti-Semitism. At the end of the day, we need a two-state solution and a commitment to peace, human rights, and democracy by all leaders in the region — and a commitment by our country to help achieve that.\n\nWarren took a similar tack. In a statement, she said:\n\nWe have a moral duty to combat hateful ideologies in our own country and around the world — and that includes both anti-Semitism and Islamophobia,” the Massachusetts Democrat said in a statement. “In a democracy, we can and should have an open, respectful debate about the Middle East that focuses on policy. Branding criticism of Israel as automatically anti-Semitic has a chilling effect on our public discourse and makes it harder to achieve a peaceful solution between Israelis and Palestinians. Threats of violence — like those made against Rep. Omar — are never acceptable.\n\nIn a 2020 primary where many of the biggest Democratic nominees more or less agree on the big-ticket domestic issues, foreign policy, especially when it comes to Israel, will offer much more room for debate.\n\nOmar’s comments certainly provide an early test of how the future of Democratic leadership sees the issue.\n",
      "Folder": "Feedly",
      "Timestamp": "1552110191",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.419221Z"
}