{
  "id": "7903589fbeb441e2b841e8290fca92d4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2019/4/3/18293545/pete-buttigieg-democrats-president-israel-omar-palestine",
      "Title": "Democrats are increasingly critical of Israel. Not Pete Buttigieg. Vox - All",
      "Selection": "Buttigieg’s staunch support of Israel bucks the Democratic party’s trend.\n \nPete Buttigieg may be a rising star in the 2020 Democratic field, but his strong pro-Israel views may put him at odds with the increasingly pro-Palestinian left flank in his own party.\n\nThe 37-year-old openly gay mayor of South Bend, Indiana, has in the past described Israel as a model for the US in how to deal with security threats. He’s blamed most of the suffering in Gaza on Hamas, the Palestinian Islamist political organization and militant group that has run the territory since 2007. And he’s strongly rejected condemnations of Israel — and US support for it — made by progressive lawmakers.\n\nThat’s not to say he’s completely ignored the plight of Palestinians — he hasn’t. During a March campaign stop in Iowa, Buttigieg said he wants America to help make “a world where Israelis and Palestinians are able to live in peace side by side.” Overall, though, Buttigieg has shown a willingness to back Israel.\n\nThat puts him in stark contrast with the more progressive wing of his own party. Poll after poll has shown that liberal Democratic primary voters are less sympathetic to Israel than they were in years past. It also shows he disagrees with some first-term Representatives, particularly Ilhan Omar (D-MN) and Rashida Tlaib (D-MI).\n\nSeveral of his rivals for the 2020 Democratic nomination, most notably Sen. Bernie Sanders, are also far more critical of Israel than Buttigieg. Sanders has repeatedly condemned Israel for violence at its border with Gaza, where time and time again Israeli forces have killed mostly unarmed protesters — including women and children — pleading for an end to the decade-long Israeli blockade of food, fuel, and medicine.\n\nA senior foreign policy adviser for Buttigieg told me that “Pete doesn’t see the Israel-Palestinian issue as a zero-sum game” and while he doesn’t support the politics of far-right Israli Prime Minister Benjamin Netanyahu, he still supports Israel and views it as an ally and democratic state.\n\nStill, the mayor may enjoy surprising support now, but it’s possible his Israel views will doom him among Democrats in the end.\n\nButtigieg continues to make many pro-Israel statements\n\nThe former Navy intelligence officer has spoken about Israel openly for at least a year.\n\nLast May, Buttigieg took a trip to Israel with other mayors that was organized by the American Jewish Committee, a global Jewish advocacy organization. Shortly after his return, Buttigieg was interviewed for the organization’s podcast. That was tough timing, as just four days earlier Israeli forces had killed dozens of Palestinians protesting the opening of the US embassy in Jerusalem. \n\nStill, Buttigieg had nothing but high praise for Israel, suggesting its way of handling security threats could be a good model for the US.\n\nCourtesy of the American Jewish Committee.\nSouth Bend, Indiana Mayor Pete Buttigieg, Democratic presidential candidate, on Temple Mount near the Dome of Rock Mosque alongside Columbus, Ohio Mayor Andy Ginther, now former West Palm Beach, Florida Mayor Jeri Muoio, and Dayton, Ohio Mayor Nan Whaley on May 10, 2018.\n\n“Seeing the way that a country can be on the one hand very intentional, very serious, and very effective when it comes to security and on the other hand not allowing concerns about security to dominate your consciousness,” he said, “I think that’s a very important lesson that hopefully Americans can look to when we think about how to navigate a world that unfortunately has become smaller and more dangerous for all of us.”\n\nButtigieg’s foreign policy adviser, though, told me the mayor’s “comments were by no means any endorsement of Netanyahu’s policies.”\n\nButtigieg also said many of the problems facing Gaza were Hamas’ fault.\n\n“There really is not a unified or single voice for the Palestinian people,” Buttigieg said. “Most people aren’t aware of the difference between what’s happening in Gaza — run by Hamas in a way that is contributing to a lot of misery there — but also totally different than an environment where you’d have a negotiating partner across the table.” \n\nThere’s no doubt that Hamas has failed to govern the territory well, to the point that Palestinians living there are protesting the group. But much of the humanitarian hardship is undoubtedly also caused by Israel’s blockade.\n\nAnd the more recent statements he’s made on the topic of Israel suggest his views remain largely the same as they were in that May interview. \n\nDuring a January 31 appearance on The View, for instance, he was asked to respond to comments made by Rep. Ilhan Omar (D-MN) where she criticized Israel for violating human rights and even compared its conduct to Iran’s.\n\nButtigieg, a married gay man, countered strongly. “People like me get strung up in Iran,” he said, “so the idea that what’s going on is equivalent is just wrong.”\n\nHe continued: “They’ve [Israel] also got to figure out — and we’ve got to figure out with them as an ally — what the regional security picture is going to look like there,” he said. He added that an Israeli general during his May 2018 trip told his delegation the most complicated problem facing Israel is Iran.\n\n“It’s always been one of the most fiendishly complicated issues and simple answers will not serve us well at a time like this,” he said.\n\nMultiple opportunities, multiple defenses of Israel. It’s pretty clear, then, where Buttigieg stands. The problem for him is that he increasingly stands alone.\n\nThe Democrats are sparring over their views on Israel\n\nProgressive Democrats are much less shy about voicing criticisms of Israel and championing pro-Palestinian views.\n\nSanders, a top contender for the Democratic nomination, has consistently backed Palestinians in Gaza over Netanyahu’s government.\n\nMark Wilson/Getty Images\nSen. Bernie Sanders (I-VT) speaks during the “We the People” summit featuring 2020 presidential candidates, at the Warner Theatre on April 1, 2019 in Washington, DC. \n\nAs the Atlantic’s Peter Beinart pointed out in February, “He’s produced videos that call Gaza an ‘open-air prison,’ he’s depicted Benjamin Netanyahu as part of the ‘growing worldwide movement toward authoritarianism,’ and, most controversially of all, he’s suggested cutting US military aid to Israel.”\n\nProgressives also put pressure on Democratic candidates to skip an annual conference organized last month by a pro-Israel lobbying group, the American Israel Public Affairs Committee (AIPAC). Surprisingly, Buttigieg, along with many other Democratic hopefuls, didn’t go (although some did).\n\nAnd while not in the presidential race, Muslim lawmakers like Omar and Tlaib continue to speak out against Israel’s treatment of Palestinians — which of course has resulted in blowback on them and Democrats more generally.\n\nThere’s a reason Democratic candidates are having an easier time either ignoring or outright criticizing Israel these days. A 2018 Pew Research poll showed that only 27 percent of Democrats said they sympathized with Israel, an 11-point drop from 2001. Meanwhile, Republican sympathy jumped 29 points to 79 percent in the same time frame. \n\nIt’s partly led President Donald Trump to incorrectly label Democrats anti-Israel and even anti-Jewish. \n\nIsrael, then, will continue to be a sore spot for the Democratic party and arguably the most important foreign policy issue of the primaries. Buttigieg has already made his pro-Israel case. The question is if voters will reward him for it.",
      "Folder": "Feedly",
      "Timestamp": "1554852931",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.413948Z"
}