{
  "id": "7966625b842f446e8a8b3f657d47930b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1081262/the-fall-guide-to-watching-the-best-of-us-tv-for-cord-cutters/",
      "Title": "The cord-cutter’s guide for what TV to watch this fall 2017 Quartz",
      "Selection": "It’s autumn in the US and, along with pumpkin lattes and warm sweaters, it means the return of scores of TV shows for audiences to watch, or more likely, DVR and binge-watch later.\n\nBut with so many people cutting the cord and abandoning cable, the fall-TV season isn’t just for pay-TV subscribers any longer. We’re living in a golden age of programming, and there are just as many shows available on streaming services as there are on traditional TV channels. There’s even American football on Amazon this year.\n\nNetflix\n\nFan-favorites like Narcos and BoJack Horseman returned to Netflix earlier this month. The streaming service also premiered American Vandal, which spoofs the true-crime series like Making a Murderer that Netflix helped popularize. More series are on the way over the next few months, including the highly-anticipated second season of Stranger Things.\n\nFuller House, Sept. 22 – The revived family sitcom is back for a third season.\n\nSuburra, Oct. 6 – A thriller about corruption and organized crime set in Rome that is Netflix’s first Italian original series.\n\nMindhunter, Oct. 13 – A new series about an FBI profiler who interviews famous serial killers that is one of Quartz’s top fall-TV picks, along with…\n\nStranger Things, Oct. 27 – The Duffer brothers’ homage to Eighties pop culture is back.\n\nAlias Grace, Nov. 3 – A mini-series adaptation of Margaret Atwood’s novel of the same name, about a servant convicted of killing her employer and his housekeeper. The author’s last on-screen adaptation, Hulu’s The Handmaid’s Tale, just won an Emmy.\n\nFate/Apocrypha, Nov. 7 – A TV anime adaption of a Japanese light novel series of the same name.\n\nLady Dynamite, Nov. 10 – The quirky comedy from stand-up act Maria Bamford returns for a second season.\n\nGodless, Nov. 22 – Another Epstein pick to watch out for. This one stars Jeff Daniels as an outlaw chasing a deserter across the American West.\n\nShe’s Gotta Have It, Nov. 23 – A TV adaption of Spike Lee’s 1986 debut feature-film about a woman and her three lovers.\n\nGlitch, Nov. 28 – Netflix picked up the second season of this Australian supernatural drama.\n\nVIDEO\n\nNetflix starts at $7.99 a month in the US.\n\nAmazon Prime\n\nAmazon has a sizable line up this fall, too. And, for the first time, it includes live NFL games.\n\nOne Mississippi, Sept. 8 – The dark semi-autobiographical comedy from Tig Notaro is back for a second season.\n\nTransparent, Sept. 22 – The Emmy-winning Transparent, which stars Jeffrey Tambor as a transgender matriarch, returns for its fourth season.\n\nWishenpoof!, Sept. 26 – The animated kids show is also back for season three.\n\nThursday Night Football, Sept. 28 – Amazon will stream 11 NFL games live, free for Amazon Prime subscribers.\n\nTin Star, Sept. 29 – A new drama about crime and corruption in a US mountain town.\n\nLore, Oct. 13 – An anthology series about horror legends.\n\nRed Oaks – The third and final season of the comedy series is slated to premiere in October.\n\nIf You Give a Mouse a Cookie, Nov. 7 – A new animated children’s series.\n\nPhilip K. Dick’s Electric Dreams – A UK anthology series based on the late sci-fi author’s works that’s thought to be Amazon’s answer to Netflix’s Black Mirror.\n\nVIDEO\n\nPrime Video starts at $10.99 a month in the US, or it’s free with a $99-a-year Prime subscription.\n\nHulu\n\nThe streaming service is following up its Emmy-winning drama The Handmaid’s Tale with a slate of new originals and a few returning favorites.\n\nThe Mindy Project, Sept. 12 – The former Fox comedy starring Mindy Kaling is in the midst of its sixth and final season.\n\nChance, Oct. 11 – Hulu’s Hugh Laurie-led thriller about a forensic neuro-psychiatrist returns for a second season.\n\nI Love You, America, Oct. 12 – A new weekly late-night show starring comedian Sarah Silverman.\n\nFreakish, Oct. 18 – The teen horror drama series is back for season two.\n\nFuture Man, Nov. 14 – A new sci-fi comedy from Seth Rogen that stars The Hunger Games‘s Josh Hutcherson.\n\nMarvel’s Runaways, Nov. 9 – A new series about a group of California teens who learn their parents are part of an evil cult. Think of it like The O.C. set in Marvel’s superhero universe.\n\nVIDEO\n\nHulu starts at $7.99 a month.\n\nHBO, Showtime, Starz\n\nThen, there are premium-cable TV networks that make their TV shows available to audiences online through streaming subscriptions.\n\nThe Deuce (HBO), Sept. 10 – David Simon’s new series about the 1970s porn industry in America is another one of Quartz’s fall 2017 picks.\n\nOutlander (Starz), Sept. 10 – Starz’s time-traveling show is back for a third season.\n\nVice Principals (HBO) – HBO’s dark comedy about high-school administrators returns for season two.\n\nActive Shooter: America Under Fire (Showtime), Sept. 29 – A new eight-part docuseries about mass shootings in the US.\n\nCurb Your Enthusiasm (HBO), Oct. 1 – Larry David returns in the revival of his HBO comedy series.\n\nWhite Famous (Showtime), Oct. 15 – A new show about a young African-American comedian’s rise to stardom.\n\nThe Girlfriend Experience (Starz), Nov. 5 – Inspired by the 2009 film by Steven Soderbergh, this new series follows a young attorney who doubles as a high-end sex worker.\n\nShameless (Showtime), Nov. 5 – The long-running William H. Macy-starring family dramedy returns for an eighth season.\n\nSMILF (Showtime), Nov. 5 – A new comedy about parenting and work-life balance.\n\nAll Def Comedy (HBO), Nov. 12 – Russell Simmons’s long-running 1990s stand-up comedy series returns to TV.\n\nVIDEO\n\nHBO Now is $14.99 a month. Showtime is $10.99 a month. Starz is $8.99 a month.\n\nOther subscription video on-demand services\n\nIf you haven’t had your fill yet, there are a litany of other streaming-video-on-demand services peddling new shows this fall. Chief among them is CBS All Access, which will premiere its long-awaited Star Trek series.\n\nStar Trek Discovery (CBS All Access), Sept. 24 – The first episode will air on CBS, which is available for free via an antenna or through a pay-TV provider. But future episodes will only air for cord-cutters on CBS All Access.\n\nRyan Hansen Solves Crimes on Television (YouTube Red), Oct. 18 – Veronica Mars actor Ryan Hansen plays himself in a comedy about actors that pair up with homicide detectives to solve crimes on YouTube’s $9.99-a-month ad-free platform.\n\nGet Krackin (Seeso), Sept. 21 – Australian comedy duo Kate McLennan and Kate McCartney parody morning TV in a new show on Seeso’s $3.99-a-month streaming service.\n\nRiviera (Sundance Now) – Julia Stiles stars in this 10-part thriller for the $4.99-a-month streaming service from AMC Networks, which owns Sundance TV.\n\nQuite a few UK shows will premiere in the US this year too, thanks to streaming services like BritBox and Acorn TV. Cold Feet and an upcoming BBC drama Broken will hit BritBox, and dramas including The Governor, Doc Martin, and Newton’s Law—an Australian show—are a few of those you can catch on Acorn TV this fall.\n\nVIDEO\n\nCBS All Access is a $5.99-a-month platform. BritBox is $6.99 a month and Acorn TV is $4.99 a month. YouTube Red is is $9.99 a month.\n\nDon’t forget all the free TV\n\nLet’s not forget, there are still plenty of TV shows out there that cord-cutters can watch for free. They’re on broadcast TV. And you can access them through a digital antenna, which runs from $10 to $150 and will grant you access to live broadcasts from networks like ABC, CBS, the CW, Fox, and NBC.\n\nEntertainment Weekly has a full list of the shows you can find in primetime this fall.\n\nVIDEO\n\nNew TV episodes will soon be streaming soon, too\n\nIf you don’t have an HD antenna or pay-TV package, you can still stream some of the most sought-after shows on broadcast and cable TV, like The Walking Dead, The Big Bang Theory, and the new Will & Grace. You just may have to wait.\n\nCBS All Access will get you new and old episodes of all the new and current CBS shows like The Big Bang Theory, Kevin Can Wait, NCIS, and Criminal Minds, and even allow you to watch them live.\n\nSome new episodes of shows from broadcasters like ABC, Fox, and NBC, such as Dancing With the Stars, This Is Us, and Empire, head to Hulu the day after they air on TV. Others are added to the service after the full season has aired. And some cable shows like AMC’s Fear the Walking Dead and FX’s You’re the Worst and American Horror Story hit Hulu, before subsequent seasons premiere on TV.\n\nNew episodes of shows on the CW also come to Netflix a week after the seasons wrap on TV in the US. So you’ll be able to catch new episodes of shows like The Flash, Supernatural, and Riverdale sometime in 2018. (Lucky viewers in regions like the UK and Australia will reportedly be able to watch new episodes on Netflix shortly after they air on TV.) Netflix also usually gets new seasons of top AMC shows like The Walking Dead and Better Call Saul before the next season begins; season seven of The Walking Dead is up on the service now ahead of its Oct. 22 debut.\n\nWith a little patience, you can catch most of the season’s TV offerings without signing up for a costly pay-TV bundle.\n\nRead this next: For the cost of YouTube’s $35-a-month TV bundle, this is what you could get instead\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1506113303",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.626553Z"
}