{
  "id": "7a05f77ea1db47d8b6e23d1f144acfb5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/41263/The-First-Shipping-Container-House-Weve-Seen-That-Actually-Looks-Awesome",
      "Title": "The First Shipping Container House We've Seen That Actually Looks Awesome Core77",
      "Selection": "To be blunt, most houses we've seen that are built out of shipping containers look like total crap. So our hats are off to architect David Fenster, who designed this beautiful 1,200-square-foot home, sited in the Santa Cruz Mountains, out of shipping containers. Using a series of clever design tricks—look for the \"redneck bay window,\" \"shower tower,\" inside-outside catwalk and how the kitchen was handled--Fenster has managed to create an airy, functional, spacious-feeling house that doesn't make it feel like you're living in a steel box:\n\nAmazingly, this was reportedly Fenster's first time working with shipping containers. I discovered this by reading a Yelp review of Modulus, the Silicon Valley firm Fenster founded. Writes Connie DeWitt, who commissioned the home with husband Kam Kasravi:\n\n…Although they had never worked with this material, they were intrigued and jumped into the project with both feet. David, the principal, created an amazing, beautiful design that was perfectly suited to our challenging site and that met all of our requirements (and many that we hadn't even thought of) from the first concept. Refreshingly different from the stereotype I had of architects, David listened to what we wanted and didn't impose his personal aesthetic vision on us. It was truly a collaborative effort.\n\nIf having an architectural firm that listens to your needs, understands that real people have real budget constraints, and that has sensitivity to and an understanding of the practicalities of getting things built in the real world—while also creating innovative, breathtaking designs—you will not be disappointed in Modulus.\n\nIt's kind of weird reading Yelp reviews of architects. Can you imagine if they had them for industrial designers?\n",
      "Folder": "Feedly",
      "Timestamp": "1443802551",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.866622Z"
}