{
  "id": "7b65d313712f4270a68dcb642f23c23f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/20273-behr-2018-color-of-the-year",
      "Title": "Behr's Color of the Year Is Soothing and Tranquil Food52",
      "Selection": "This past Tuesday, paint company Behr announced its first-ever Color of the Year. It’s a shade that the company has christened “In The Moment T18-15,” a mellow blue-green tinctured with gray.\n\nPhoto by Behr\n\nThe company believes this particular color encourages mindfulness, that it's a tonic to the overstimulation of the digital age. It's a color meant to nudge us away from our devices and closer to nature.\n\n“In The Moment speaks to our society’s desire to disconnect and be present,” Erika Woelfel, Behr’s vice president of color and creative services, said in a statement. It’s certainly a nice shade. The color's quite chameleonic, too, adapting to its surroundings so that it accents darker rooms, vivid and luminous when surrounded by light.\n\nPhoto by Behr\n\nPhoto by Behr\n\nPhoto by Behr\n\nPhoto by Behr \n\nPhoto by Behr\n\nPhoto by Behr\n\nPhoto by Behr\n\nPhoto by Behr\n\nIf In The Moment isn’t quite your speed, Behr has also rolled out a “Color Trends palette” that’s a spectrum of 20 shades they believe we'll be seeing more of over the next year.\n\nInterpret this campaign as a bid, on Behr’s part, as a way to join the same bandwagon as Pantone, who annually dubs a certain color the Color of the Year. To my mind, In The Moment certainly beats any shade Pantone has picked in recent memory, though it doesn’t have a patch on Marrs Green, that blazing hue chosen as the world’s favorite color just a few weeks back.\n\nDo You Like Pantone's 2017 Color of the Year? \nby Amanda Sims\nThis Is the World's Favorite Color—and We're Into It\nby Mayukh Sen\n\nBut I understand why people may find Marrs Green too disorienting a color to bring into their homes. In The Moment is something like the more muted spiritual sister to Marrs Green. I'll take it.\n\nLearn more about Behr's Color Trends 2018 campaign here. What's your take on In The Moment? Let us know in the comments.",
      "Folder": "Feedly",
      "Timestamp": "1502386875",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.642114Z"
}