{
  "id": "7bc64073f50f400fafd6b5ff38d10090",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/africa/1474064/i-too-am-america-book-tells-stories-of-muslims-in-the-us/",
      "Title": "Muslim immigrants from Africa keep proving the American dream is still here for all Quartz",
      "Selection": "The streets of Little Senegal in Harlem, New York and the Cedar-Riverside neighborhood in Minneapolis share a common trait: they are both home to thriving African immigrant communities from west and east Africa, many of whom practice Islam. From halal meat stores to restaurants, fabric stores and shops selling religious articles, these buzzing enclaves offer a telling portrait of Islam in America.\n\nMore than any other issue, immigration is the one factor that has defined the diversity and demographics of the US Muslim population. With a total of about 3.45 million people or 1% of the US population, three-quarters of Muslims in the United States are first-generation Americans who were born in another country, according to the Pew Research Center. Most of these immigrants and their children come mostly from countries in the Middle East and South Asia like Pakistan, India, and Iraq. But they also come from all across Africa, gain an education at higher rates, and eventually serve in the highest echelons of politics, science, and business worlds.\n\nSome of the stories of these inspiring individuals are captured in the newly-published book I, Too, Am America. The collection of 50 stories by the veteran journalist Lekan Oguntoyinbo, celebrate the journeys and the remarkable contributions of Muslims—both African and otherwise—to the advancement of the United States. The book’s title is a play on the Langston Hughes poem I, Too, which affirms the concept of patriotism and captures a hankering for equality through diligence and resolve.\n\nMarathoner Khalid Khannouchi\n\nThe book’s publication comes as both Muslims and Africans in America face greater scrutiny and increasing hostility in the form of violence. President Trump, who has retweeted anti-Muslim videos from a British far-right group, has also instituted a travel ban that includes Muslim-majority African states like Somalia and Libya. His administration has also deported a record number of Africans from Senegal and Ghana in the west to Egypt and Morocco in the north.\n\nFollowing the 9/11, 2001 attacks and the subsequent war on terror, Muslims have grappled with their place in American society and have faced backlash on issues ranging from their patriotism to whether they could construct places of worship\n\nDr. Nawal Nour\n\nIn the face of all this, Muslims continue to defy the odds and are increasingly becoming a visible and important tapestry in communities across the US. This month, a former Somali refugee Ilhan Omar became one of two first Muslim women elected to Congress, an election win that many Somali candidates replicated in the state of Minnesota. Yet the current wins aren’t void of Islam’s roots in America, which dates back to the 16th century: way ahead of the Transatlantic slave trade and the arrival of shackled Africans from present-day West Africa.\n\nPhysician, scientist, radiologist and biomedical engineer Elias Zerhouni\n\nBeyond politics, African Muslims have served in industries as diverse as journalism, medicine, law, and scientific research. There’s Mohamed El-Erian, originally from Egypt, who is the chief economic advisor of at Allianz SE, the parent company of Pimco which he successfully headed between 2007 and 2014. There’s Khalid Khannouchi from Morocco, who once scrubbed dishes in Brooklyn but rose to set world records in marathons.\n\nMohamed El-Erian, the chief economic adviser at Allianz\n\nThere’s Nawal Nour from Sudan, credited with creating the first clinic to address female genital mutilation in the United States. Elias Zerhouni, born in Algeria, was a director at the National Institutes of Health and served as one of the first two science envoys appointed by Obama. The distinguished poet Khaled Mattawa from Libya has been lauded for exploring the intersection of culture, narrative, and memory. And there’s singer Akon, born to a musical family from Senegal, who later nurtured his global music career.\n\nSpace scientist Farouk El-Baz\n\nDespite its brevity, Oguntoyinbo’s book stands as a primer on Islam in modern-day America. It acts to prove what theologians like Amir Hussain asserted: “There has never been an America without Muslims.”\n\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.\n",
      "Folder": "Feedly",
      "Timestamp": "1543164941",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.451166Z"
}