{
  "id": "7c792b8a77244986b70efa8df07dad6d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/13543-instead-of-throwing-away-your-greens-make-them-into-meatballs",
      "Title": "Instead of Throwing Away Your Greens, Make Them into Meatballs Food52",
      "Selection": "We're serious about keeping farmers market produce on the menu all year long. Alexandra Stafford of Alexandra Kitchen shows us how to store, prep, and make the most of it, without wasting a scrap.\n\nToday: Hold onto your carrot tops! And onion tops! And turnip tops! And beet greens, too. You can turn all of those greens into a delicious snack. \n\nA few months ago, I discovered a fritter recipe that both quelled my anxiety about the indundation of dark leafy greens and made me wish it would never end. \n\nThe recipe comes from Twelve Recipes by Chez Panisse’s Cal Peternell, who, one evening as a snack for his family, fried little balls of sautéed greens mixed with stale bread and onions. His family devoured the balls, mistaking them for real meatballs and thus earning them the name “fried greens meatlessballs.” \n\nIn early spring, I made the meatlessballs with chard and kale, the two greens Peternell suggests. When CSA season began, I used turnip and beet greens, then broccoli rabe and mustard greens. Every green I tried worked.\n\nI soon found myself churning out meatlessballs every Tuesday evening, the day I pick up my farmshare. For once, I found myself using the roots' greens in their prime, not salvaging them from the vegetable bin at the end of the week. I discovered, too, I could make the mixture ahead of time and store it in the fridge until dinnertime. My family loves them and, as Peternell notes in Twelve Recipes, “the hot little balls make a nice snack or appetizer, but also are good later, to eat at room temperature out of hand on the go.” I like them cold, days later, straight from the fridge. \n\nUnfortunately, just as I found my meatlessballs rhythm, the weather turned, and in our weekly CSA newsletter, the farmers assured us we could look forward to heat-loving crops—cucumbers, zucchini, peppers, and tomatoes—in the weeks ahead. The season of greens was nearing its end. \n\nOn Tuesday, I picked up my vegetable share to discover the worst had come true: not a leaf in site. Despite the warning from the farmer, I wasn’t ready for the change, for crunchy Greek salads, stewy zucchini gratins, dripping tomato tartines.\n\nCould I somehow make the season of meatlessballs persist through the warmer months? I scanned my share. There were carrots, green tops intact, and lots of onions, pure white oblong bulbs goosenecking into stiff, bright green stalks. Perhaps the meatlessballs could have one last hurrah? \n\nI gave it a go, quickly pulsing the carrot and onion greens in the food processor—finely chopped greens, I have learned, help the balls hold their shape—before sautéing them with the onions, garlic, cumin, and cilantro. I folded in the feta, breadcrumbs, and egg, then fried them up as usual, in cherry-sized portions, using a fork to turn them every few minutes until they turned golden all around.\n\nOnce again, the recipe didn’t let me down. This batch tasted a little grassier, a little greener, but they were just as delicious and disappeared just as quickly. Meatlessballs? I’d say miraculousballs. \n\nBut once you've made your fair share of fried greens meatlessballs, there's more to do with those carrot and onion greens:\n\nFor the carrots:\n\nRemove the greens from the roots and store both parts in a bag in the refrigerator. Carrot greens will tire more quickly than their roots, so they should be used quickly.\n\nPurée the greens into pesto, toss with roasted carrots, and drop dollops of burrata over top—call it a meal with a loaf of crusty bread.\n\nCarrot greens can also be stuffed into chicken cavities, added to soups and stocks, or minced into chimichurri, salsa verde, and green harissa. Keep in mind that carrot greens can be bitter and adjust seasonings accordingly. \n\nFor the onions: \n\nAssuming you are handling recently harvested onions that haven’t been cured for long-term storage, remove the greens from the bulbs and store both in the refrigerator.\n\nThe tender portions of the greens can be left attached to the onion bulb, which can be sliced and braised or grilled or sautéed.\n\nThe tender portions can also be removed completely and sautéed alone, as you would use an onion. or finely chopped and used like fresh scallions.\n\nThe tougher portions of the greens can be frozen and reserved for adding to meat and vegetable stocks. \n\nFried Greens Meatlessballs\n\nServes 3 to 4 as an appetizer\n\n1 bunch greens\n3 tablespoons olive oil or grapeseed oil1 small yellow onion, dicedSalt, to taste2 cloves garlic, chopped1/2 cup cilantro1 tablespoon cumin seeds1 cup fresh breadcrumbs1/4 cup crumbled feta1 or 2 eggsOil for frying\n\nSee the full recipe (and save and print it) here.\n\nPhotos by Alexandra Stafford\n",
      "Folder": "Feedly",
      "Timestamp": "1437159375",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.885985Z"
}