{
  "id": "7cd459fc23764f76bd0f5838f88ea0a9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/17833-the-best-deals-at-restaurant-supply-stores-the-tools-to-get-elsewhere",
      "Title": "The Best Deals at Restaurant Supply Stores (& the Tools to Get Elsewhere) Food52",
      "Selection": "Maybe you’ve never been to a restaurant supply store. They're often located in out-of-the-way strip-malls or concentrated in particular parts of town. They're large and intimidating, devoid of the free samples or festive music. They're overwhelming.\n\nOr maybe, you’re already a restaurant supply store fanatic.\n\nBecause there are two reasons to visit a restaurant supply store that outweigh all reasons not to: They are cheap, and they have everything.\n\nCal Peternell’s Essential Tools for Your First Kitchen (& Every Kitchen Thereafter)\nby Cal Peternell\n\nThe low prices and utilitarian look of restaurant supply store wares might make you suspicious: Does the quality suffer? I would argue no. As their name might suggest, restaurants typically stock their kitchens from these sorts of mega-shops, and, on the whole, their basics are just as durable as what you would find anywhere else. Plus, they offer a huge variety of options, so you can pay bottom-dollar for a totally passable tool or shell out a little more for a higher-quality iteration.\n\nThis is not to say that these gadget meccas are the right place to buy everything you need to stock your kitchen. Yes, their wares are inexpensive, but they’re typically not the most attractive options around. And while most goods in the restaurant supply store are cheaper than what you would find anywhere else, that’s not always the case. But if you’re on a budget, if you tend to work your kitchen tools to death, or if you don’t care too much about aesthetics (let’s say you’re looking to stock a kitchen temporarily), read on.\n\nHow to Hack the Kitchen Tools You Need (+ Why Not to Buy Them)\nby Alice Medrich\n\nTo help navigate the twisting aisles of your local restaurant supply store, we’ve compiled a list of what is worth buying—and what is not.\n\nThe Basics\n\nRestaurant supply stores have an incredibly wide selection of all the basics, so treat it as a one-stop shop to stock your kitchen with the essentials. They often aren’t the most aesthetically pleasing, but they are relatively durable and extremely versatile.\n\nCarbon steel wok: For all of your stir-fry needs.\n\nSaucepans: Go for stainless steel over aluminum. Though aluminum heats more quickly, acidic foods, like tomatoes, can degrade the pan.\n\nNon-stick fry pans: Sunny-side up eggs. Enough said.\n\nHow to Season a Wok\nby Grace Young\nFlag Cake Meets Baked Alaska (Can Be Made in Flip Flops)\nby Ali Slagle\n\nSet of stainless steel mixing bowls: Metal mixing bowls can also double as the top half of a double boiler, be the mold for your next Baked Alaska, and serve as the basin for a handy-dandy ice bath, in addition to all your everyday mixing needs.\n\nMetal cooking spoons: They might not be attractive, but these spoons will be the workhorses for all of your sauces, soups, and chilies.\n\nWhisk: Heavy duty, no-frills.\n\nFlippers and Stirrers\nby Brette Warshaw\nToo Many Cooks: What's your Favorite Kitchen Gadget?\nby Food52\n\nAluminum sheet pan: One can never have too many sheet pans, especially restaurant-style ones that have a lip to ensure your granola doesn’t skid off the pan when you’re taking it out of the oven. Plus, restaurant supply stores keep small half-size sheet pans, which work well for roasting vegetables for one or reheating leftovers. Plus, since they’re super cheap, you can use them to make your stickiest and messiest recipes without any guilt about ruining them.\n\n“Utility” spring-loaded tongs: From flipping vegetables on the grill to twirling pasta in sauce, you will use these far more than you think you will—buy two.\n\nBar set: If you’re stocking your bar for the first time, restaurant supply stores are the perfect one-stop shop for tools. For under $10, you can get a shaker, a jigger, a bar spoon, and a strainer.\n\nCutting boards: They may be white plastic and not especially attractive, but these cutting boards are very utilitarian (and easier than wood boards to wash).\n\nThe Best Cutting Boards & How to Care for Them\nby Leslie Stephens\n\nRestaurant Tools\n\nSince restaurant supply stores gear their wares towards professional chefs (hence the name), they often have gadgets outside the tool kit of the typical home cook. While it can be hard to justify purchasing single-use items, when they’re this affordable, they may very well be worth it (if you have the space to store them, that is).\n\nKitchen shears: From snipping open packages of frozen peas to slicing pizzas to cutting herbs, kitchen shears come in handy in all sorts of situations.\n\nMetal dough scraper: For the avid bread baker—or baker in general—these are a super helpful. Not only do they make dividing dough crazy easy, for, say, a braided challah or rolls, but they are also helpful for de-doughing countertops.\n\nThe Kitchen Tool You're Not Using Enough\nby Amanda Sims\n\nPlastic dough scraper: A million times better than a spatula for getting that last bit of cake batter out of the bowl.\n\nHeat-proof spatula: You might be asking, “Why would I need a heat-proof spatula?” Until you get one yourself. These babies are like wooden spoons that get in every nook and cranny of your pan, plus they’re great for making scrambled eggs. And they don’t absorb any flavor!\n\nFood mill: If you find yourself making large batches of tomato sauce or mashed potatoes on a semi-regular basis, it is extremely helpful.\n\nWooden steamer baskets: For those times you make dumplings, or decide to experiment with DIY rice noodles, or just want some simple steamed broccoli.\n\nYes, You Can Make Soup Dumplings at Home\nby Kenny Lao\n6 Tools for Making Pizza\nby Anthony Falco\n\nSpider: The perfect sidekick to all of your fried food adventures — also useful for grabbing bobbing gnocchi or tortellini.\n\nAsian soup spoons: For your next ramen night, or anytime you want to eat miso soup.\n\nWooden pizza peel: Sure, you could use a sheet pan to transfer your pizza into the oven, but the pizza peel just has so much more flair.\n\nAluminum sizzling platter: Since aluminum conducts heat so well, these platters are well-suited to keeping meat (or anything) warm in the oven until you’re ready to eat.\n\nHand-Carved Pizza Peel\nSuper Benriner Mandoline\n\nThe Price Isn’t Right\n\nThese items you may be tempted to buy while you’re at the restaurant supply store, but they’re not markedly less expensive (and, in some cases, they’re actually more expensive) than what you would find at a local store. The price difference, however, is typically marginal, so if you’re feeling like you want to do a one-stop shop, go right ahead and throw these things in your cart:\n\nMeat thermometer\n\nPlastic-handled, carbon steel workhorse knives\n\nVegetable peeler\n\nMicroplane\n\nMandoline\n\nRotary sifter\n\nCast-iron skillets\n\nWhat’s the Best Way to Care for Cast Iron?\nby Lindsay-Jean Hard\nHow to Make the Perfect Milkshake\nby Sarah Jampel\n\nJust Say No\n\nRestaurant supply stores are dens of temptation for cooking nerds, kitchen geeks, and the gadget-obsessed. These are the items you may feel the urge to buy because they are very cool and you could probably impress people, but in reality they are highly impractical. Just say no.\n\nGiant pots/pans/steamers of all stripes (unless you’re planning a crawfish boil): The storage situation is just a nightmare. You’ll find these pots two years after you buy them in your garage, serving as a den for spiders.\n\nAluminum jerky shooter : This is a tool to help people make large quantities of jerky at one time. Yes, it’s cool—but no, you probably don’t need it.\n\nWhipped cream dispenser : You can do this by hand, people!\n\nFrench fry dicers : See above.\n\nMilkshake maker : Just use a blender.\n\nWhich kitchen tools do you buy at the restaurant supply store? Which do you splurge on? Tell us in the comments below!",
      "Folder": "Feedly",
      "Timestamp": "1473179915",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.716864Z"
}