{
  "id": "7d5f1c8c45bb48cab03a6692a44bb484",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.getrichslowly.org/financial-rules-of-thumb/",
      "Title": "18 favorite financial rules of thumb (and some useful money guidelines) Get Rich Slowly",
      "Selection": "After twelve years of reading and writing about money, I’ve come to love financial rules of thumb.\n\nFinancial rules of thumb provide helpful shortcuts for making quick calculations and decisions. You don’t always have time (or want to take the time) to create elaborate spreadsheets when choosing a course of action. In these cases, it’s nice to have some rough guidelines you can rely on.\n\nYou’ve probably heard of the “rule of 72”, for example. This shortcut says that if you divide 72 by a particular rate of return, you’ll get the number of years it’ll take to double your money. If your savings account yields 4%, say, it will take about 18 years for your nest egg to increase by 100%. But if you were able to earn 12% on your investment, that money would double in six years.\n\nLike all rules of thumb, the rule of 72 isn’t precise. It doesn’t give an exact answer but a ballpark figure. Financial rules of thumb don’t always hold true. But they’re true enough for us to make loose plans based on them.\n\nI have some engineer friends who’d get tense at this sort of sloppy guesswork, but most of the rest of us are happy to trade a bit of precision for speed. That’s what rules of thumb are all about!\n\nThe trick, of course, is knowing which rules of thumb to use. Most are handy, but some common guidelines do more harm than good.\n\nRules Gone Wild\n\nIn the past, you’ve probably seen my rant about some of my most-hated financial rules of thumb. Let’s look at three things I think conventional wisdom gets wrong (and what I believe are better alternatives).\n\nHow much should you save for retirement?\nFor instance, I get frustrated when I hear financial advisers push the idea that you should base your retirement savings on 70% of your income. Instead of estimating your retirement needs from your income, it makes far more sense to base them on spending. Your spending reflects your lifestyle; your income doesn’t.\n\nI think a better rule of thumb for determining retirement needs is this: When estimating how much you’ll need to save for retirement, assume you’ll spend as much in the future as you do now. Use 100% of your current expenses to calculate your retirement spending. (And if you want to build in a safety margin, base your future needs on 110% of your current spending.)\n\nHow much should you spend on a house?\nAs I mentioned last week, another rule of thumb that makes me cranky is this common guideline espoused by all sectors of the homebuying industry: “Buy as much home as you can afford.” No no no no no! Of all financial rules of thumb, this is probably the worst. It’s certainly one of the most prevalent. This is how folks end up house poor, chained to a mortgage they resent.\n\nLenders quantify this guideline by saying your housing payments should be nor more than 28% or 33% or 41% of your income. But, as David Bach wrote in The Automatic Millionaire Homeowner, “You should generally assume that the amount the bank or mortgage company is willing to loan you is more than you should borrow.” A better rule of thumb? Spend as little on housing as possible. Spending less than 25% of your net income is best — less than 20% is even better.\n\nHow much life insurance should you carry?\nA third rule that bugs me is the one for determining how much life insurance you should buy. Different experts give different answers. Some say your policy should cover five times your annual income. Others say ten times. And Suze Orman recommends 20 times annual income needs.\n\nThe truth is that not everyone needs life insurance. Like all insurance, it’s designed to prevent financial catastrophes. You only need it if other people — like a spouse or children — would face financial hardship when you die. If you don’t have kids, if your spouse has a good income, or you have substantial savings, then life insurance isn’t a necessity.\n\nEven if you do need life insurance, you probably don’t need to carry as much as your insurance agent is willing to sell you. To find out the amount that’s right for you, check out the Life Insurance Needs Calculator from the non-profit Life Happens organization. (How much life insurance should I carry? According to this calculator, I shouldn’t have any at all. And I don’t.)\n\nUseful Financial Rules of Thumb\n\nFinancial rules of thumb usually aren’t this bad. In fact, most are useful. Here are eighteen of my favorites.\n\nWhen estimating income, $1 an hour in wage is equivalent to $2000 per year in pre-tax earnings. The reverse is also true: $2000 per year in salary is equal to $1 an hour in hourly wage. (This rule works because the average worker spends roughly 2000 hours per year on the job.)\n\nHow wealthy should you be? According to the authors of The Millionaire Next Door, the following “wealth formula” can tell you if you’re on target: Divide your age by ten, then multiply by your annual gross income. Your net worth should be equal to this number (less any inheritances). So, if you’re 40 and make $50,000 per year, your net worth should be $200,000. If you have less than half the expected amount, you’re an “under-accumulator of wealth”. If you have twice the target, you’re a “prodigious accumulator of wealth”. (Note that the authors are well aware that this formula doesn’t work well for young people; it’s meant to be used by folks nearing retirement age.)\n\nOn average, each dollar an American spends represents about $2.50 of after-tax value in ten years or $10 in thirty years. (If you live outside the U.S., the consequences of spending that dollar are probably even greater.) This is due to two reasons: taxes and compounding. When you buy something, you spend after-tax dollars. On average, Americans have to earn $1.33 to have $1.00 left over.\n\nInflation is the silent killer of wealth. In the U.S., inflation has averaged 3.18% over the past hundred years. A lot of folks figure a 3% inflation rate when making money calculations. I think it’s safer to assume 3.5% — or even 4% — average inflation in the future.\n\nHistorically, U.S. stocks have earned long-term real returns (meaning inflation-adjusted returns) of about 7%. Bonds have long-term real returns of around 2.5%. Gold and real estate have long-term real returns of close to 1%.\n\nIf you withdraw about four percent of your savings each year, your wealth snowball will maintain its value against inflation. During market downturns, you might have to withdraw as little as three percent. If times are flush, you might allow yourself five percent. But four percent is generally safe. (For more on safe withdrawal rates, check out this article from the Mad Fientist.)\n\nBased on the previous rule of thumb, there’s a quick way to check whether early retirement is within your reach. Multiply your current annual expenses by 25. If the result is less than your savings, you’ve achieved financial independence — you can retire early. If the product is greater than your savings, you still have work to do. (If you’re conservative or have low risk tolerance, multiply your annual expenses by 30. If you’re aggressive and/or willing to take on greater risk, multiple by 20.)\n\nBuilding on the above, Mr. Money Mustache’s shockingly simple math behind early retirement gives us a useful rule of thumb for determining how long you’ll need to save before you’re financially independent. Figure out your current saving rate (or profit margin, if you prefer). Subtract this number from 60. Roughly speaking — and assuming you’ve started from a zero net worth — that’s how long you’ll need to work before your nest egg is big enough to support you in retirement. (Note that this rule breaks down at saving rates over 40%. If you save a lot, subtract from 70.)\n\nJoe from Stacking Benjamins likes what he calls the “penny approximation”: Assuming a safe withdraw rate of roughly four percent, every $100 you save gives you one penny per day in perpetuity. Once you stack enough Benjamins you have enough pennies to sustain you forever. If you change your own brake pads and save $200, thats two cents a day for the rest of your life because you avoided paying a mechanic.\n\nI hate detailed budgets because they bog people down. Instead, I’m a fan of budget frameworks that focus more on the Big Picture. My favorite budget framework is the Balanced Money Formula: Spend no more than 50% of your after-tax income on Needs, put at least 20% into savings (including debt reduction), and spend the rest (around 30%) on Wants. This is a great beginner budget, but it’s also useful for transitioning to the mindset of Financial Independence. If you decide early retirement is a goal, then part of your Wants spending becomes additional savings.\n\nIf you own your home, it’s wise to set aside money for maintenance and repairs. Each year, contribute 1% of your home’s current value to a separate account. If you don’t spend the money, keep it there for future remodeling and improvements.\n\nIs it better to buy or to rent? The price-to-rent ratio is a useful rule of thumb for making this decision. Find two similar places, one for sale and one for rent. Divide the sale price of the one by the annual rent for the other. The result is the P/R ratio. Say you find a $200,000 house for sale in a nice neighborhood, and a similar home for rent on the next block for $1000 per month, which is $12,000 per year. Dividing $200,000 by $12,000, you get a P/R ratio of 16.7. If the P/R ratio is low, it’s better to buy. If the price-to-rent ratio is over 15, it’s probably better to rent.\n\nHow much does it cost to raise a child? As a rule of thumb, budget $10,000 per child per year. That’s not quite a quarter of a million dollars per kid, but it’s close.\n\nIf you get a windfall, use 1% to treat yourself. (Or maybe 2%, tops.) Put the rest in a safe place and ignore it for six months. After you’ve had time to think about it, then take action. So, if you inherit $100,000 from Aunt Marge, only allow yourself a $1000 splurge. Stash the remaining $99,000 someplace you won’t be tempted to spend it.\n\nTo approximate a new vehicle’s five-year cost of ownership (in monthly terms), double the price tage and divide by 60. Looking at a brand-new Mini Cooper ? Double that $30,000 sticker price to get $60,000, then divide by 60. Is it really worth $1000 per month to get rid of your crummy Ford Focus?\n\nThe standard rule of thumb is to save at least 10% of your income. I think a better goal is to aim for 20% — and more is better. Financial guru Liz Weston says that if you’re young, you should follow this guideline: “Save 10% for basics, 15% for comfort, 20% to escape.”\n\nNobody agrees how much you should set aside for an emergency fund. Even the experts offer advice ranging from $1000 up to 12 months of expenses. (The most common suggestions range from three to six months of expenses.) One clever rule of thumb to determine how much you should have set aside: Your emergency fund should cover X months of expenses, where X is the current unemployment rate. In other words, because the U.S. unemployment is about 4% right now, you should aim to have enough money in the bank to cover four months of expenses.\n\nAccording to Consumer Reports, wen you’re faced with the repair of an appliance (such as a refrigerator or washing machine), you should buy a new one if the appliance is more than eight years old (or if the repair would cost more than half what it would take to buy a replacement).\n\nIt’s important to remember that rules of thumb aren’t set in stone. They’re guidelines. They’re meant to help you make quick evaluations, not actual life-changing decisions. Financial rules of thumb are a starting point. Start with them, then adjust for your individual goals and situation.\n\nOther Useful Financial Guidelines\n\nStrictly speaking, rules of thumb deal with numbers. Still, there are a lot of non-numeric guidelines that I think are useful to know. If you’ve done any reading about personal finance, for example, you’ve probably heard the admonition, “Pay yourself first.” While not strictly a rule of thumb, this guideline is very similar.\n\nHere are some other useful financial guidelines:\n\nThe more you learn, the more you earn. In the U.S., education has a greater impact on work-life earnings than any other demographic factor. Your age, race, gender, and location all influence what you earn, but nothing matters more than what you know.\n\nBank a raise. When you get a salary bump, don’t increase your spending. Stay the course and put the added income into savings.\n\nAlways take the employer match on the 401(k).\n\nNever touch your retirement savings — except for retirement.\n\nNever co-sign on a loan. (Ever.)\n\nAvoid paying interest on anything that loses value. It’s okay to finance a home or a college education but avoid taking out a loan on a car.\n\nSpeaking of cars: When you buy a vehicle, buy used or buy new and plan to drive it for at least ten years. (Do both and you’ll save even more!)\n\nDon’t mess with the IRS. When it comes to taxes, don’t try to cheat. Pay what you owe. Claim all the deductions you deserve, but don’t try to stretch things.\n\nIn general, save an emergency fund first; pay off high-interest debt second; and begin investing (at the same time you pay down remaining debt) last.\n\nIt almost always makes more sense (and cents) to repair your old car than to buy a new one.\n\nIf you’re not willing to pay cash for it, then it doesn’t make sense to buy it on credit. (I have a friend whose guiding principle is: “If I wouldn’t buy five, why would I buy one?” Similar idea taken to an extreme.)\n\nSave for your own retirement before saving for your children’s college education. They can get loans for school. You can’t get loans for retirement.\n\nNow it’s your turn. What rules of thumb did I miss? Do you disagree with any of those I suggested? What are some of your favorite rules of thumb?\n\nThe post 18 favorite financial rules of thumb (and some useful money guidelines) appeared first on Get Rich Slowly.\n",
      "Folder": "Feedly",
      "Timestamp": "1526360769",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.505464Z"
}