{
  "id": "7d6b1ec49e834d2baa12a4b69565f453",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1164308/i-waited-too-long-to-try-to-have-a-baby-with-my-husband-or-did-i/",
      "Title": "I waited too long to try to have a baby with my husband. Or did I Quartz",
      "Selection": "This story is part of a series called Craigslist Confessional. Writer Helena Bala has been meeting people via Craigslist and documenting their stories for over two years. Each story is written as it was told to her. Bala says that by listening to their stories, she hopes to bear witness to her subjects’ lives, providing them with an outlet, a judgment-free ear, and a sense of catharsis. By sharing them, she hopes to facilitate acceptance and understanding of issues that are seldom publicly discussed, at the risk of fear, stigma, and ostracism. Read more here. Names have been changed to protect her subjects’ anonymity.\n\nLinda, late 30s\n\nI met my husband when I was 26 years old; we dated for a year before moving in together, and then we got married at 30. I was so thrilled on our wedding day—it felt like the beginning of a new life for us. We had plans to travel and buy a home, and we agreed that we both wanted children down the road. But…we still felt so young; we were in no rush.\n\nAfter we’d been married for about a year, I started to notice that all of my friends were having babies. I’d been completely oblivious to the “timelines” and the “ticking biological clocks” that women supposedly feel once they’re in their thirties. I decided that I wasn’t really “ready” to be a mom, mostly because I didn’t have that “feeling” that women so often describe. I didn’t think that childbearing was magical: I was afraid what it would do to my body. I was afraid of breastfeeding; I was afraid of dropping the baby; I was afraid I wouldn’t rise to the challenge of motherhood.\n\nBut I think, most of all, I was afraid of what a baby would do to our marriage. My husband and I were always so in love; we were best friends. We shared common interests and hobbies. We loved hiking and being outdoors—how would a baby fit into that? Would I become consumed, forced to leave us on the back-burner? Would we become one of those couples who stayed together for the sake of the children—who went out for a rare date night and spent the hour eating in silence?\n\nI feel like this is typical of men: because I wasn’t leading the charge on wanting to get pregnant, my husband stayed happily mum. Two more years passed before our families got involved and people started asking questions—why aren’t you trying to get pregnant? When can we expect a grandchild? Soon you’ll be too old to have kids—your body will not bounce back as easily as it once could have. And I’d love to say that we were focusing on our careers, or that we had a plan, or that we had just changed our minds and didn’t want children. But that wasn’t the truth: the truth is that we were just failing to start. Neither of us felt strongly enough to actually try. We just got complacent. We were afraid of change.\n\nWe bought a home. We settled into careers. We neared our mid-thirties. And we ran out of excuses.\n\nSo we started trying to conceive. “One and done,” my husband boasted that first time. But I got my period, and his enthusiasm dissipated. The second time around, I started paying more attention to my body. I downloaded an application and tracked my cycle. Again, no baby. But that was fine: I’d read that it takes the average couple about six months to conceive. Because I was already in my mid-thirties, if we weren’t pregnant by six months, I’d have to go in to check that I wasn’t having fertility issues.\n\nBy month four, I had everything down to a science. I had ovulation kits and basal body thermometers, and I’d taught myself how to read my cervical mucus. My husband complained that I was taking the romance out of baby making but I didn’t really listen: it was so unlike me to not be good at something, especially something that was supposed to be as “natural” and easy as having a baby.\n\nMonth four turned out to be my month. I ran through my cache of pregnancy tests and got one positive after another. We celebrated but decided to keep the news to ourselves since miscarriages are common before 12 weeks. And it’s a good thing that we did, because about eight weeks into the pregnancy, I miscarried.\n\nAnd then I miscarried again. And again. And again. Five times over the next two years. I felt exhausted and beaten. My body felt a mess. My hormones had the run of the place, and our marriage started to fall apart. It wasn’t so much the repeated losses—although those were difficult—but the fact that I became totally consumed with just getting pregnant. It became the one thing I couldn’t do, and naturally, the only thing I ever wanted. I’d get my hopes up every single time; he didn’t. I think that to protect himself, he became detached. Every time I failed, I felt crushed. And he felt a little farther away.\n\nHe moved out of the house. We chose not to get a divorce. We went to therapy. We were cordial. Everything was very mature—we just weren’t in love anymore. And then he told me that he met someone. And then he got her pregnant. And then…she was born. And she is beautiful.\n\nFor a very long time, I felt that I would never be happy again. But life goes on, with or without you. I took our savings and went to a fertility specialist. I picked a donor, got inseminated, and then I held my breath for eight weeks. And then for twelve. And then for sixteen. When she was born, I finally breathed again. And she is beautiful, too.\n\nRead more Craigslist Confessionals here. To share your story with Helena, email her at craigslistconfessionalqz@gmail.com. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1514133973",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.559774Z"
}