{
  "id": "7d7de091bbe84a7eba622549d682861d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.artofmanliness.com/articles/4-recommended-books-for-soon-to-be-and-new-dads/",
      "Title": "4 Recommended Books for Soon-to-Be and New Dads The Art of Manliness",
      "Selection": "When Kate was pregnant with our first kiddo, I wanted to do the best I could to help her out during her pregnancy, as well as prepare for being a father to Gus when he finally arrived on the scene. So I did what any 21st century dad-to-be would do: I hopped on Amazon to see what books were out there on the subject.\n\nWhat I discovered was that there wasn’t much useful information available for soon-to-be-fathers and new dads.\n\nMost of the books out there for new dads were short on useful information but chock-full of funny illustrations that made being a dad look comically manly, tips that implied that fathers will be natural bumblers, and one-liners about losing access to your wife’s boobs since they’ll be squatted on by a baby blocker. It’s like they thought men were morons, couldn’t imagine that a dude would be sincerely interested in prepping to be a good dad, or felt that a guy who had such an interest might feel so insecure about it that the information he sought needed to be presented in a satirically masculine, punch-you-in-the-arm style.\n\nThis was eight years ago.\n\nToday, it hasn’t gotten any better.\n\nBooks for new dads continue to put an emphasis on eye-rolling and often condescending yuks instead of providing fathers information they can actually put into practice.\n\nBut a few useful books for soon-to-be and new dads do exist. After reviewing a whole lot of them, below I highlight 4 that I think are the best.\n\nNote: If you’re not one to read a whole book on parenting, I think we do a really excellent job of presenting a cliff notes version of all the basics you need to know in the following articles:\n\nA Man’s Guide to Pregnancy\n\nHow to Take Care of a Pregnant Wife\n\nGetting Ready for the Baby Bomb\n\nYour Progeny Enters the World\n\nNew Dad Survival Guide\n\nThe Skillset\n\nThe Mindset\n\nWhat to Expect When You’re Expecting\n\nYes, it’s primarily geared towards moms-to-be, but this classic baby book is jam-packed with useful information about pregnancy that an expectant dad might also want to know. From fetal development to tips on how to handle the first few months of your baby’s life, a lot of the information is useful for both new parents. Throughout the book they also have callouts geared just towards dads (including how you do the sex when your wife is pregnant and how long you’ll need to wait after birth before you can resume relations). I actually found this the most useful book I read as an expectant dad.\n\nI’d add that some women don’t like this book because they feel that reading about so many potential problems/symptoms creates unnecessary stress, but this is actually a good reason for you to read it too. As a dad, you’ll often play the role of the more dispassionate researcher/diagnoser, i.e., your wife will feel concerned that baby has X problem, and you’ll be the one who looks into it, and offers reassurances: “It’s much more likely that it’s actually Y benign issue. We’ll ask the doctor. Don’t worry about it.”\n\nWhat to Expect the First Year\n\nDo you go to the doctor for that cough? What do you do if your baby isn’t sleeping? Is my baby developing normally? These are just a few of the questions that new parents will ask once they bring home their bundle of joy.\n\nA book that both Kate and I found quite useful during the first twelve months of Gus’ life was What to Expect the First Year. Pretty much any concern or question you might have during the first year of your baby’s life will be addressed in this book (and it’s generally best to just consult one standard source like this on such questions rather than trolling through dozens of forums filled with anecdotal stories).\n\nAll meat and no filler. Two thumbs up.\n\nThe Expectant Father: Facts, Tips, and Advice for Dads-to-Be\n\nThis is the probably the best book geared exclusively towards expectant fathers. No lame jokes. Just straight up useful information. The Expectant Father covers the pregnancy process and how dads can help in it, as well as provides tons of useful info for dads on raising a kid.\n\nThey also cover why dads are so important in the development of a child and how children influence fathers. After the What to Expect books, this would be the one “dad-to-be” book I’d recommend.\n\nGreat Expectations: Becoming a Dad: The First Three Years\n\nWritten by social worker and psychotherapist David Carr, Great Expectations is unique in that it not only covers the psychological development your new kiddo will go through during the first three years of his or her life, it gets into the transformation that will happen in your psyche too. Alongside standard practical tips, Carr offers advice on how to handle the adjustment to your new role as a father and the way your life will change once your baby arrives. \n\nThe post 4 Recommended Books for Soon-to-Be and New Dads appeared first on The Art of Manliness.\n",
      "Folder": "Feedly",
      "Timestamp": "1542610599",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.426693Z"
}