{
  "id": "7da73d11237349ffa7ed762c2d197968",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://work.qz.com/1115384/this-simple-exercise-will-help-you-build-a-good-slide-deck/",
      "Title": "This simple, five-minute exercise will help you build a better presentation Quartz",
      "Selection": "The first step to giving a great presentation is to think long and hard about the point you want to make (I outlined some techniques for doing so in this article). The next step is to take everything you know (what I call an “information monster”) and reduce it to what will most effectively convey your point (what I call a “story rainbow”).\n\nI do this by using a small mental framework to clear my head before I start making slides.\n\nInstructions:\n\nTake a piece of paper and draw lines with a thick pen. It’s important that you use a thick pen because ink from a thick pen takes up space and makes the boxes smaller. This forces you to only write what you need to write. If you don’t use a thick pen, then you have to constrain yourself to only write what you need to write, which takes more discipline.\n\nEach box represents a slide. Still using thick pen, write your presentation in short sentences. This forces simplicity and, most importantly, cohesion. Repeat the key word or theme of your presentation as much as you can tolerate.\n\nHere’s an example of how I filled in the boxes during this exercise for an article on making pointy presentations (the word “pointy” is my key word or theme):\n\nMost presentations don’t make a point\n\nPresentations without points suck\n\nToday, we’re going to learn how to make pointy presentations\n\nHere’s a Balloon Fish (they are pointy)\n\nThis is a Zen way of forcing out all the noise in your head. It helps you to focus on what is most important, it gets you out of your screen, and it gives you loving constraints within which to work (the paper, the boxes, the ink, and having sentences or phrases that connect).\n\nThe Story Rainbow will thank you. The Information Monster will not.\n\nThis article is part of a Quartz series on how to make “pointy” presentations.\n\nMark Pollard is the CEO at Mighty Jungle, a brand strategy agency in New York.\n",
      "Folder": "Feedly",
      "Timestamp": "1509655952",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.530174Z"
}