{
  "id": "7e8b92ce058b497d84139937a741b7ae",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/67982/Four-New-Objects-We-Didnt-Expect-to-See-From-Ikea",
      "Title": "Four New Objects We Didn't Expect to See From Ikea Core77",
      "Selection": "Ikea's getting ready to release their 2018 catalog. While it won't be available until August, we got a look at a pre-release version, and went through it to see if anything jumped out at us. We found the new furniture offerings to be standard fare, but there are four new objects that we didn't quite expect to see:\n\nSNOFSA Clock $12.99\n\nMade from glass and powder-coated steel done up with a brass finish, this visually arresting, Art-Deco-ish clock speaks of the designers being given some leeway.\n\nÖSTERNÄS Leather handles $9.99/2pk and $12.99/2pk\n\nMade from \"Through dyed grain leather from cattle, with a treated and pigmented surface and stainless steel,\" these leather handle pulls take a cue from luxury furniture, and will go a long way towards dressing up an otherwise plain storage unit.\n\nTILLSYN Hourglass $7.99\n\nIt's not Marc Newson's $12,000 Hodinkee model, though it borrows the colors of the beads. I've also recently spotted hourglasses for sale at CB2; in this age of digital timers, are throwback hourglasses becoming a thing?\n\nFADO Table lamp $19.99\n\nBuyers can choose between a yellow or grey tint for the glass globe, which is roughly 9\" in diameters. The Edison-looking bulb within is actually an LED bulb. It's obviously a mood light and not a task light, but it's a damn sight better looking than the cheapie paper-clad models Ikea is known for.\n\nThe 2018 Ikea Catalog will be available to the public in early August.\n",
      "Folder": "Feedly",
      "Timestamp": "1501102236",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.568836Z"
}