{
  "id": "804b0aa423124d70a6f3c63bddcef1f3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.com/its-time-get-your-southwest-companion-pass/",
      "Title": "It’s Time Get Your Southwest Companion Pass Frequent Miler",
      "Selection": "Now is the time to set the wheels in motion towards your Southwest Companion Pass.  The end of the calendar year is the ideal time to sign up for Southwest credit cards in order to earn huge numbers of qualifying points quickly.  If you earn the Companion Pass early enough in the calendar year, it will be good for almost 2 full years: the rest of the year in which it is earned and all of the next.  Keep in mind that the most recent great offers for the Southwest personal cards (100K points after $12K spend) are scheduled to end soon: Tuesday, December 7th.\n\nThe Southwest Companion Pass is awesome.  Sure, it’s not as awesome as the companion pass-ish thingy that Aeropan now offers (details here), but it doesn’t require a million dollars of spend.  The Southwest Companion Pass only requires earning 125,000 qualifying points in a calendar year, and points earned on credit cards (including welcome bonuses) qualify.\n\nOnce you earn 125,000 qualifying points, you can add a companion for free to all of your Southwest flights for the rest of that year and all of the next year.  That’s true regardless of whether you book flights with cash or with points.  If you fly Southwest a lot with a companion, or you want to, this is obviously an incredible deal.\n\nStrategies\n\nEven though Chase offers three different personal Southwest cards, they’ll only let you have one at any given time.  Plus, you can’t get the welcome bonus for a personal card if you’ve earned the welcome bonus on any of the personal cards in the past 24 months.  These rules do not apply to Southwest business cards.  With business cards, it’s true that you can’t sign up if you currently have the exact same card or if you’ve earned the bonus on the same card in the past 24 months.  But, you can sign up if you have a different business card or any personal Southwest card and it doesn’t matter when you last earned bonuses on those cards.  All of that boils down to the following:\n\nIf eligible, you can sign up for any 1 of the Southwest personal cards (but only 1).\n\nIf eligible, you can also sign up for the Southwest Rapid Rewards Performance Business Credit Card.\n\nIf eligible, you can also sign up for Chase Southwest Airlines Rapid Rewards Premier Business Card.\n\nKeep in mind that you won’t be approved for a Southwest card if you are over 5/24.  If you are approved, the Southwest business cards won’t add to your 5/24 count, but the personal cards will.\n\nChase's 5/24 Rule: With most Chase credit cards, Chase will not approve your application if you have opened 5 or more cards with any bank in the past 24 months.\n\nTo determine your 5/24 status, see: 3 Easy Ways to Count Your 5/24 Status. The easiest option is to track all of your cards for free with Travel Freely.\n\nWith that info, here are a couple of strategies for earning the Companion Pass:\n\nStrategy One: 1 Card\n\nThrough December 7th, each of the personal cards are currently offering a total of 100K points after $12K spend:\n\nCard Offer\n\nChase Southwest Airlines Rapid Rewards® Plus Card\n\n \n\n \n\n➥More\n\n \n\nⓘ $1139\n1st Yr Value Estimate\n\nUp to 100K Points\n100K: 50K after $2K spend in 3 months plus 50K after a total of $12K spend in 12 months\n(Offer Expires 12/7/2021)\n\n$69 Annual Fee\n\n \n\n \n\nThis card is subject to Chase's 5/24 rule (click here for details).\n\nRecent better offer: None. This is the highest public offer we've seen.\n\n \n\n \n\nChase Southwest Airlines Rapid Rewards Premier Credit Card\n\n \n\n \n\n➥More\n\n \n\nⓘ $1109\n1st Yr Value Estimate\n\nUp to 100K Points\n100K: 50K after $2K spend in 3 months plus 50K after a total of $12K spend in 12 months\n(Offer Expires 12/7/2021)\n\n$99 Annual Fee\n\n \n\n \n\nThis card is known to be subject to Chase's 5/24 rule.\n\nRecent better offer: None. This is the highest public offer we've seen.\n\n \n\n \n\nChase Southwest Airlines Rapid Rewards Priority Credit Card\n\n \n\n \n\n➥More\n\n \n\nⓘ $1127\n1st Yr Value Estimate\n\nUp to 100K Points\n100K: 50K after $2K spend in 3 months plus 50K after a total of $12K spend in 12 months\n(Offer Expires 12/7/2021)\n\n$149 Annual Fee\n\n \n\n \n\nThis card is known to be subject to Chase's 5/24 rule.\n\nRecent better offer: None. This is the highest public offer we've seen.\n\n \n\n \n\nIf you sign up now, your first statement closing date will be in January 2022.  As a result, all points earned on the card will credit in 2022 and will count towards the Companion Pass in 2022.  If you quickly spend $25K on your new card, you’ll earn a total of 125,000 points and a Companion Pass that is valid for the rest of 2022 and all of 2023.\n\nHow can you spend $25K so quickly?  One option is to pay (or overpay) estimated taxes.  Another option is to pay bills with Plastiq.  Both options incur fees (~2% and 2.85%, respectively), but that can be well worth it to get the Companion Pass.\n\nNote too that it might not be necessary to spend so much.  In 2021, Southwest gave all members 25,000 qualifying points towards the Companion Pass.  If they do the same in 2022 then you’ll only need to spend $12,000 on your new card in order to earn the full welcome bonus and the Companion Pass.\n\nStrategy Two: 2 Cards\n\nThe current Southwest business card offers aren’t as good as the personal card offers, but if you get both (or one personal and one business), you’ll have more than enough points for the Companion Pass.  Here are the current business card offers:\n\nCard Offer\n\nChase Southwest Airlines Rapid Rewards® Premier Business Card\n\n \n\n \n\n➥More\n\n \n\nⓘ $693\n1st Yr Value Estimate\n\n60K miles\n60K after $3K spend in 3 months\n\n$99 Annual Fee\n\n \n\n \n\nThis card is subject to Chase's 5/24 rule (click here for details).\n\n \n\n \n\nSouthwest Rapid Rewards Performance Business Credit Card\n\n \n\n \n\n➥More\n\n \n\nⓘ $841\n1st Yr Value Estimate\n\n80K points\n80K after $5K spend in first 3 months\n\n$199 Annual Fee\n\n \n\n \n\nThis card is subject to Chase's 5/24 rule (click here for details).\n\n \n\n \n\nWith the offers available at the time of this writing, you would only need to complete $8K spend across the two business cards in order to earn the welcome bonuses.  And with that spend, you would end up with nearly 150,000 Southwest points.  Boom.\n\nA downside to signing up for two cards is that it will be a bit over two years before you can sign up for either card again.  If your goal is to earn a Companion Pass every few years, this would limit your options.  On the other hand, if you have a regular companion who can alternate with you in earning the Companion Pass, you can stretch out your sign-ups to approximately once every four years.\n\nConclusion\n\nThis is a great time to sign up for one or more Southwest cards if you’re interested in earning a Companion Pass.  By earning the pass early in 2022, it will be valid for nearly two full years!\n\nThe post It’s Time: Get Your Southwest Companion Pass appeared first on Frequent Miler.\n",
      "Folder": "Feedly",
      "Timestamp": "1638669227",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.069084Z"
}