{
  "id": "80d8cb5ffeb14d76acc4c5410e3bffe0",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/culture/2016/12/13/13918728/la-la-land-screenplay-emotional-spectacle",
      "Title": "La La Land is a spectacle of pure cinema. But its real power comes from its screenplay. Vox - All",
      "Selection": "Damien Chazelle’s screenplay is a testament to the power of specificity among spectacle. \n \n[Spoilers for La La Land follow.]\n\nMore than any other movie this year, La La Land is a spectacle of pure cinema — an ecstatically directed and technically impressive visual stunner that moves from one show-stopping, heart-grabbing musical set piece to another. The movie has already won awards for its cast and score, garnered more Golden Globe nominations than any other 2016 film, and is currently the frontrunner for most of the Academy Awards’ visual, directing, music, and acting categories. \n\nWith a movie like La La Land, it would be all too easy for the screenplay to be inoffensive and incidental, a bridge between big moments designed mostly to move viewers from one sequence to the next. But much of the movie’s power is directly attributable to writer-director Damien Chazelle’s script, which offers delicate, funny, and emotionally nuanced dialogue even while sticking to a rigorous, balanced structure that moves the characters through the highs and lows of their lives. \n\nYes, La La Land is a movie about characters who spontaneously burst into song and dance. But it’s also a movie about characters who talk to each other in ways that are real and raw and rarely seen in any kind of film, musical or otherwise. \n\nSpecificity transforms La La Land’s central couple from generic types into distinctive characters\n\nThe lovely specificity of La La Land’s dialogue goes a long way toward defining the movie’s two main characters and the world they live in. The film’s pair of protagonists, Mia (Emma Stone) and Sebastian (Ryan Gosling), are both classic starving artists: Mia hopes to be an actress, while Sebastian is a jazz musician who wants to revive the form. They are, in some ways, fairly generic types, but Chazelle’s dialogue establishes them as oddball individuals with distinctive lives. \n\nSebastian is forced by a club manager to play nothing but simple-minded Christmas songs, as he obsesses over an old jazz hangout that has been converted into a “samba-tapas” joint; his sister comes to his tiny, untidy apartment to lecture him about not making enough money. His love for chaotic and difficult jazz is a window into his own personality: intense, a bit complicated, perhaps a bit hard to love. \n\nDale Robinette/Lionsgate\nSebastian loves jazz. Like, really loves jazz.\nMia, meanwhile, works a mundane job in a coffee shop on a studio lot, and has to deal with fussy customers and a disinterested boss. She’s frequently ignored in acting auditions, and after work, she attends parties where young Hollywood creatives talk nonsense about franchise development and world building. It’s a funny way of establishing her milieu, and also a kind of winking joke about a film that is very much outside the studio franchise mold and manages an impressive amount of nontraditional world building on its own. \n\nThe early scenes between Mia and Sebastian are just as much fun, and just as revealing. Their first extended interaction comes while trying to find their cars after an exhausting Hollywood party. Mia drives a Toyota Prius, so of course the line of parked cars is almost all Priuses. It’s another gentle joke about Los Angeles, but also about the characters; Sebastian, it turns out, had parked his classic car near the house and was only pretending to walk to his own car. \n\nThese might come across as incidental scenes; few, if any, would make a highlight reel of the movie’s most memorable moments. But they give the city of Los Angeles a sense of personality and particularity, and they do the same for the two protagonists. La La Land makes Mia and Sebastian relatable by providing just enough information that you can easily imagine these characters living lives offscreen, before the movie introduces you to them. They aren’t simply there to serve the needs of the story — they exist on their own, outside of its bounds. \n\nAt the same time, these little connecting scenes also help give the movie a realistic emotional grounding, setting up the stakes for the characters and ensuring that the big payoffs at the end actually land. \n\nChazelle’s screenplay creates an emotional reality that helps sell La La Land’s flights of fancy\n\nLa La Land frequently takes off on flights of romantic fancy, especially after Mia and Sebastian start to become a couple. This a movie where the two lead characters hoof their way through a planetarium and finish by dancing weightlessly among the domed-in stars. It’s an audacious gambit, even in a musical, but it works in part because of the connection the screenplay builds between viewer and character. Their star dance isn’t grounded in any practical reality, but it is grounded in their specific yet relatable emotional reality. \n\nWhen Mia and Sebastian lift off, the movie is showing us how they feel. With flatter, less believable characters, this sort of extravagant visual metaphor would come across as if La La Land is trying to project something onto them. Instead, the movie’s wilder impulses feel as if they emanate from inside the characters and the joyous, tumultuous relationship they share.\n\nDale Robinette/Lionsgate\nSebastian and Mia prepare for liftoff at the planetarium. \nChazelle’s screenplay gets it right when things go wrong too: The movie is divided into seasons, which mirror the emotional weather of Mia and Sebastian’s relationship. And in the second half of the movie, as fall descends and the tensions between Mia and Sebastian’s artistic ambitions grow, there’s a scene in which the two meet for dinner in their apartment. Sebastian is home from tour to surprise Mia, who is putting on a one-person play, and the two begin to argue about their choices. \n\n“Maybe you just liked me when I was on my ass because it made you feel better about yourself,” he says. “Are you kidding?” she asks, both terrified and annoyed. His brutal response: “No.” Then the apartment smoke alarm goes off as the dinner he intended to surprise her with burns — a metaphor for their relationship. \n\nThis pivotal little scene, in a cramped, nondescript Los Angeles apartment, is presented as both a gritty, realistic portrait of a couple on the verge of a breakup and a kind of dark fantasia: The apartment glows a weird green hue, and as the scene unwinds, it takes on the air of an increasingly unpleasant waking dream. It’s as emotionally grueling as just about any cinematic depiction of a troubled relationship I’ve ever seen, and darkly honest about the ways ambition can bring couples together as well as drive them apart.\n\nA screenplay is more than just language, and by La La Land’s end, it fully embraces the sense of fantasia the movie has built up. In the film’s finale, Mia and Sebastian have both achieved their creative ambitions — he owns a jazz club, and she’s a successful movie star — but they’re no longer together. They run into each other again one night at his club, and for a moment, an alternate-history version of their relationship runs through Mia’s mind, and plays out onscreen. It’s a version of their story in which there’s no tension, no frustration, and they end up happily together. \n\nThis brief journey through another life is portrayed with the same sort of cinematic sweep and emotional grandeur as the rest of the film, as a kind of dance through an imagined memory — but it is, ultimately, a literary device, a feature of the script, an idea that was written on the page before it was filmed. And it’s set up by all of the small and delicate moments before it, by the specificity of the characters and their lives, by their peculiar quirks and idiosyncrasies, and by the light-footed highs of their best moments together. \n\nLa La Land’s emotional strength is at least partly attributable the fact that Chazelle wrote and directed the movie himself, and that he was able to write with much of the music already complete. “That helped me maintain a certain emotional tone or register, and told me where we needed to be emotionally at any given part of the movie,” he told The Verge’s Tasha Robinson.\n\nThat continuity between vision and execution is apparent in every frame of La La Land. But at an even more basic level, Chazelle recognizes something that I wish more filmmakers, especially those interested in cinematic spectacle, understood: Getting the little moments right is what makes the big moments work so well. \n\nLa La Land is currently in limited release in select cities. It expands nationwide December 16.",
      "Folder": "Feedly",
      "Timestamp": "1481686146",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.681284Z"
}