{
  "id": "837e5eef9b794752acfff77337a282b4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/2017/11/01/singapore-miles-for-alaska-flights/",
      "Title": "Save Your Miles! The New Cheapest Way to Get to Hawaii and More From the West Coast! Million Mile Secrets",
      "Selection": "Spending more miles and points than you have to doesn’t make sense.  That’s why folks are excited about the new, cheapest way to get to Hawaii from West Coast cities!\n\nNow that Alaska Airlines and Singapore Airlines are partners, you’ll be able to book one-way coach flights on Alaska Airlines to Hawaii from cities like Los Angeles, San Francisco, and Seattle for only 12,000 Singapore Airlines miles!  That’s 500 miles cheaper each way than the previous cheapest method!\n\nAnd even if you don’t collect Singapore Airlines miles, you likely have easy access to them.  Because Singapore Airlines is a transfer partner of all 4 flexible points programs.\n\nThe Singapore Airlines partner award chart for Alaska Airlines flights might be a little confusing at first glance.  But there are some award flights that offer very good value (and a few that do NOT!).\n\nAlaska Airlines Flies to 4 Hawaiian Destinations – Honolulu, Maui, Kauai, and the Big Island. And Now You Can Use Singapore Airlines Miles to Book Cheap Award Flights!\nI’ll share details of the new Singapore Airlines award chart for Alaska Airlines flights.  And show you where you’ll save miles (and which awards to avoid!).\n\nUsing the Singapore Airlines Award Chart for Alaska Airlines\n\nLink:   Singapore Airlines Partner Award Chart for Alaska Airlines Flights\n\nThe Singapore Airlines award chart for Alaska Airlines flights is different from their award chart for their own flights and with Star Alliance partners.\n\nSingapore Airlines classifies Alaska Airlines destinations into 5 zones:\n\nThe Singapore Airlines Award Chart for Alaska Airlines Is Zone Based, but It’s NOT as Straightforward as It Seems\nAward prices displayed are for one-way flights.  Round-trip flights cost double the number of miles.\n\nNote:   This chart applies to Alaska Airlines flights only (NOT Virgin America).\n\nYou’ll See One-Way Award Pricing for Coach and First Class Alaska Airlines Award Tickets on the Singapore Airlines Award Chart\nBut finding the number of miles you’ll need for an award flight is NOT as simple as finding the price between the zones of your departure and arrival airports.  Because Singapore Airlines does NOT allow transfers (connections) or stopovers on Alaska Airlines awards.\n\nSo, similar to using British Airways Avios points, award prices are for single segments.\n\nThe best deals are on non-stop flights.  That’s because Singapore Airlines charges extra miles for connecting flights.  So first check if your home airport has non-stop flights on Alaska Airlines.\n\nNote:   You can check using Google Flights.\n\nFor example, a one-way, non-stop award ticket from Washington, DC, to Los Angeles (Zone 4 to Zone 1) would cost 12,000 Singapore Airlines miles.  But a ticket from Washington, DC, to Los Angeles via Seattle or Portland would cost 19,500 Singapore Airlines miles (12,000 miles for Zone 4 to Zone 1, plus 7,500 miles for Zone 1 to Zone 1).  That’s not a good deal!\n\nBecause of this pricing method, there are gaps in the award chart.  These are between zones where NO non-stop Alaska Airlines flights exist, like from the East Coast (Zone 4) to Hawaii or Alaska (Zone 5).  These routes require a connection.\n\nAward Chart Sweet Spots\n\nBecause each segment is priced separately, using Singapore Airlines miles for Alaska Airlines flights is generally only a good deal if you’re flying a route that doesn’t require a connection. \n\nHere are some of the best bargains (all prices one-way in coach):\n\n1.   Flights to Hawaii, the Caribbean, and Mexico for 12,000 Singapore Airlines miles:\n\nWest Coast (California, Oregon, Washington) to Hawaii (this is the new cheapest way to get from the West Coast to Hawaii of any airline)\n\nFly Non-Stop on Alaska Airlines to Honolulu for 12,000 Singapore Airlines Miles One-Way in Coach and Visit Waikiki Beach …… Or to Kahului, Maui, Where You Can Take in the Sunrise From the Summit at Haleakala National Park for the Same Price …… Or Fly to Lihue, Kauai, Known As the Garden Island for Its Lush Vegetation and Gorgeous Landscapes …… Or Even Fly to Kona, on the Big Island, and Visit Hawaii Volcanoes National Park\n\nLos Angeles to Havana, Cuba\n\nLos Angeles to Havana Is Also Just 12,000 Singapore Airlines Miles One-Way in Coach. Emily Had an Incredible Time There When She Visited Cuba With Her Friends!\n\nLos Angeles to San Jose, Costa Rica\n\nVisit Central America for Super Cheap When You Book Alaska Airlines Award Flights With Singapore Airlines Miles\n\nSeattle to Cancun (one of Alaska Airlines’ longest routes!) … these flights can cost $600+!  This is a perfect example of when booking an award flight can get you tremendous value.  For example, 12,000 Chase Ultimate Rewards points are worth $120 in cash back or a little more when you book through the Chase Ultimate Rewards travel portal.  But transfer them to Singapore Airlines for this Alaska Airlines award flight and you’re getting at least 5X the value!\n\nBring a Book! Seasonal Non-Stop Flights Between Seattle and Cancun Clock in at 6+ Hours One-Way\n\nLos Angeles to 8 cities in Mexico\n\nSave Big on a Mexican Getaway When You Fly From Los Angeles Using Singapore Airlines Miles for Alaska Airlines Award Flights\n\nSan Francisco or San Diego to Mexico City\n\nFolks in San Diego and San Francisco Can Visit Mexico City for Cheap, Too\nTo compare, Alaska Airlines charges 17,500 Alaska Airlines miles for the same flights.\n\nFly to Havana From Los Angeles on Alaska Airlines for Just 12,000 Singapore Airlines Miles Each Way\nThat said, on some of these routes (like Los Angeles to Mexico) you’ll spend less using British Airways Avios points for the same flights.  Because their award chart is distance-based, so shorter routes cost fewer points.  For example, you’d pay just 7,500 British Airways Avios points for a one-way coach flight between Los Angeles and Los Cabos, Mexico.\n\nAnd keep in mind, you’ll usually pay far more on these routes using American Airlines, Delta, or United Airlines miles.\n\n2.   Cheap Award Flights Within the Continental US and to Alaska\n\nYou can also find good deals on these routes:\n\nWest Coast to the Midwest for 9,500 Singapore Airlines miles (this would be 12,500 miles in many programs)\n\nJust a Small Sampling of the Routes You Can Fly Between the West Coast and Midwest on Alaska Airlines for Just 9,500 Singapore Airlines Miles\n\nNon-Coastal Western states to Alaska for 11,500 Singapore Airlines miles on some routes including Las Vegas to Anchorage (Alaska Airlines charges 12,500 miles, American Airlines 15,000 miles, and United Airlines 17,500 miles)\n\nFlights Between Anchorage and Las Vegas or Phoenix Are Cheaper Using Singapore Airlines Miles for Alaska Airlines Award Flights Than Other Airlines Charge\nMost other routes tend to be about the same price or only slightly cheaper than using Alaska Airlines miles.\n\nAward Flights to Avoid\n\nThis new award chart isn’t all good!  There are definitely a handful of redemptions you want to avoid:\n\nFirst Class award prices aren’t that great – more than double the price of coach for shorter routes, and more than triple for longer routes – like 89,000 Singapore Airlines miles round-trip from California to Hawaii (no thanks!).  To compare, you could spend 80,000 Alaska Airlines miles for the same flights.  \n\nLike using British Airways Avios points, flights with connections will dramatically increase the price, in most cases making it no longer worth it\n\nFlights within Alaska are much more expensive than using Alaska Airlines miles or British Airways Avios points\n\nAlways Compare to the Price of a Paid Ticket\n\nIf you can find cheap paid fares, it may not be worth using miles.  Especially because taxes and fees can be fairly significant on international flights.\n\nFor example, I found a flight from Los Angeles to Mexico City for ~$140, and ~$56 of that is taxes and fees (some of which you’ll still pay on an award ticket).  So you’d be spending 12,000 Singapore Airlines miles to save just over $100.  That’s not worth it.\n\nLikewise, flights within California are often under $100 round-trip, in which case you’re better off buying a ticket than redeeming 7,500 Singapore Airlines miles for that flight.  On the other hand, when prices are high, this could be a good deal.\n\nThis Flight Regularly Costs Under $200, so Redeeming 12,000 Singapore Airlines Miles Is Generally NOT Worth It – Especially Because You’ll Pay International Taxes and Fees Regardless\nAlthough the Singapore Airlines chart is in many cases slightly cheaper than using British Airways Avios points to book Alaska Airlines flights, it’s also much more common to see transfer bonuses to British Airways.  Always do the math for your situation!\n\nEarn More Singapore Airlines Miles\n\nSingapore Airlines miles are super easy to earn, because they’re a transfer partner of all 4 main flexible points programs:\n\nAMEX Membership Rewards\n\nChase Ultimate Rewards\n\nCiti ThankYou\n\nStarwood Preferred Guest\n\nSo even if you don’t think you have Singapore Airlines miles, if you collect points in any of the above programs, you can transfer them to Singapore Airlines!\n\nThis makes Alaska Airlines award flights far more accessible than they were in the past!\n\nYou can also earn Singapore Airlines miles from flying.  They’re part of the Star Alliance, so you can credit paid flights any Star Alliance member (like United Airlines) to Singapore Airlines.  As well as flights on Alaska Airlines or JetBlue.\n\nHow to Book Alaska Airlines Flights With Singapore Airlines Miles\n\nYou can NOT search for partner flights on the Singapore Airlines website.\n\nSo the easiest way to check for available Alaska Airlines award flights is through the American Airlines website.  Any Alaska Airlines flight that appears on aa.com should be available to book with Singapore Airlines miles.\n\n \n\nThis Alaska Airlines Flight Is Available for Booking With American Airlines Miles, so It Should Be Available to Other Partners Like Singapore Airlines\nYou can also search on the Alaska Airlines website, but be aware that it will show you higher-priced awards that aren’t available to partners.\n\nOnce you’ve found the flights you want, call Singapore Airlines at 800-742-3333 to book over the phone.\n\nNote:   Singapore Airlines still does NOT have Alaska Airlines flights loaded into their system.  So they couldn’t verify the taxes and fees on these tickets.  But I suspect they’ll be similar to what other airlines charge for domestic (~$6 each way) and international routes.\n\nBottom Line\n\nUsing Singapore Airlines miles to book Alaska Airlines award flights can be an excellent deal on certain routes, like the West Coast to Hawaii for 12,000 Singapore Airlines miles one-way in coach!\n\nBut the good deals are limited to non-stop Alaska Airlines flights only, because connecting flights are priced as 2 separate segments.  And flights in First Class are often much more expensive than booking with other miles.\n\nThat said, it’s easy to earn Singapore Airlines miles, because they’re a partner of all 4 transferable points programs.  So if you’re in a city with lots of non-stop Alaska Airlines flights, this could be an excellent way to save miles.\n\nAlaska Airlines flights still haven’t been loaded into Singapore Airlines’ system, but once they are you can call to book.\n\nWould you consider using Singapore Airlines miles for Alaska Airlines award flights?\n",
      "Folder": "Feedly",
      "Timestamp": "1509590170",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.530690Z"
}