{
  "id": "84a9358433a44caa9bebe6a69f937f57",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.frugaltravelguy.com/2017/09/why-the-southwest-card-60k-promotion-marks-the-best-time-of-the-year.html",
      "Title": "Why the Southwest Card 60k Promotion Marks The Best Time of the Year Frugal Travel Guy",
      "Selection": "For those who do not already have the Southwest Airlines Visa Credit Card: happy days are back again. Qualifying accounts who apply for the card can receive 60,000 Southwest Rapid Rewards points after spending $2,000 in the first 90 days from opening the card – an increase from the regular sign up bonus. To make things even better, the Southwest Airlines Visa Business Credit Card has the same bonus, offering qualified travelers up to 120,000 Rapid Rewards points towards their next trip.\n\nWhile Southwest may not come with all the amenities of our favorite carriers, flying aboard this low-cost carrier can be an easy and efficient way to see North America. If you have never considered giving the Southwest credit cards your attention, now may be the perfect time to do so. Here are the three reasons you may want to add at least one Southwest card to your wallet today.\n\nLow cost for award flights\n\nAlthough the cost of a Southwest flight can be comparable to those on a legacy carrier, the “Luv” airline makes up for it with some rather generous policies. This includes two free checked bags and no blackout dates on all of their flights.\n\nWhile Southwest prices Rapid Rewards flights based on the actual cost of a flight, studies show the award cost of a Southwest flight is significantly lower than those aboard the legacy carriers. In a 2015 survey, flights paid for in Southwest Rapid Rewards points cost an average of 9,497 rewards points – almost three times less than their legacy competition. Those applying for one of these cards for the Rapid Rewards alone could go a long way on 60,000 points.\n\nLow annual fee and anniversary miles\n\nTo make things better, the Southwest Airlines Visa credit card matches the low-cost mindset of the carrier. Those who find themselves loyal to the airline after using their Rapid Rewards points can keep the card with long-term benefits.\n\nThe $69 annual fee is lower than other airline credit cards, offering the opportunity to earn Rapid Rewards points at a low fee. Additionally, frugal travelers who keep this card receive 3,000 Rapid Rewards points every year on their anniversary, adding immediate value for the annual fee. The card also earns double points on Southwest Airlines purchases, getting them closer to their next free trip faster.\n\nThe Southwest Companion Pass\n\nArguably the most important benefit of applying for both cards is the Southwest Airlines Companion Pass. Often considered one of the best benefits in consumer aviation, the Companion pass allows travelers to fly a friend or family for free on the same itinerary, effectively turning every flight into a buy one, get one free promotion.\n\nTo earn the companion pass, flyers must earn 110,000 Southwest Rapid Rewards points in one calendar year by all means available: spending on the Southwest credit cards and flying aboard the carrier. By applying for the card with the 60,000 points bonus, travelers are halfway towards earning the companion pass. With both cards, travelers can earn the Companion pass by spending $4,000 in the first three months of opening the card.\n\nFor those who don’t have the Southwest card yet, now may be the time to strike. With plenty of upside, these cards can help travelers get to their next destination for a low overall price.\n\n \n\nAre you adding the Southwest Airlines credit cards to your wallet with this promotion? Let us know your thoughts in the comments below!\n",
      "Folder": "Feedly",
      "Timestamp": "1505580539",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.552064Z"
}