{
  "id": "85500f79fab444c991ad8c52f35bbe29",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://millionmilesecrets.com/2017/05/24/travel-checklist/",
      "Title": "Use This Handy Travel Checklist When Packing for Your Next Getaway Million Mile Secrets",
      "Selection": "Preparing for a trip can be stressful, especially if you’re leaving for more than a few days.  I put together a travel checklist you can use, so you don’t forget anything important!\n\nUsing a checklist can save you time and possibly even money.  Because certain items, like electronics chargers and medicines, can be expensive in foreign countries.  And you don’t want to spend your precious vacation time searching for an item you could have brought from home. \n\nPower Adapters Are an Important Item to Consider When You’re Traveling Abroad\n\nLet’s take a look at the list!\n\nMy Travel Checklist\n\nUse this handy checklist to make sure you don’t forget anything important when you take off on your next adventure!\n\n1.   Things to Do Before You Leave\n\nMake copies of important travel documents – It’s nice to make a copy of your ID so you can carry the copy around and leave the real thing somewhere safe in your hotel room.\n\nAlert credit cards and banks of travel – Charges or ATM withdrawals can be declined if the bank doesn’t know you’re traveling.\n\nDownload maps and entertainment – This is important if you won’t have internet in-flight or when you land.\n\nSend flights and accommodation information to trusted person – This is helpful in case something happens to you.\n\nPrepare your home – Throw out the trash, wash dirty dishes, hold newspaper delivery and mail, etc.\n\nDon’t Forget to Call Your Bank Before You Leave Town\n\n2.   Items to Bring\n\nID (passport, driver’s license, student ID, etc.) – You’ll need a passport for international travel and a driver’s license if you plan to rent a car.  It’s also important to check your passport’s expiration date, because some countries require a certain number of months of validity past your date of travel.  And some spots offer student discounts!\n\nTickets – Don’t forget your plane, train, or bus tickets!  Or your entry tickets for an event or museum if you printed or received them at home.\n\nCredit cards and cash – Make sure you’ve figured out how you’ll pay for things once you land.  This is especially important in more remote locations, like Cuba.\n\nHealth insurance cards – It’s important to understand what your insurance does and does NOT cover while abroad.  In case you need extra coverage.\n\nLetter of consent for children traveling without both parents – If you’re traveling abroad with a child under 19 years old, you’ll need a letter of consent if one or both parents aren’t present.  You can find more information about a parental consent letter here.\n\nPower adapters – Make sure you know which type of adapter you’ll need to charge things like phones and computers.  This chart from REI can be useful in figuring that out!\n\nComfort items for your flight – Don’t forget those “must haves” during your time in the air.  Million Mile Secrets team member Scott brings moist towelettes on long flight to combat face dryness.  And lots of folks bring items like pillows, face masks, slippers, and more.\n\nTechnology – Double check to make sure you bring along your cell phone, laptop, tablet, or whatever other devices you plan on using.  And don’t forget your camera either!  Plus an extra memory card, charger, and tripod or selfie stick if you need it.\n\nSelfie Sticks Are Especially Important When Traveling Via Camel\n\nHeadphones – Noise cancelling headphones can be a lifesaver!\n\nMedicines and toiletries – I always recommend carrying any important medicines in your carry-on.  Consider toiletries like contact solution, mouthwash, and lotion for longer flights.  And anti-itch cream if you’re going to a bug prone area.\n\nLoyalty cards and lounge passes – Don’t forget to bring your Global Entry card, Priority Pass card, or lounge passes if you have them.\n\nGuide books and reservation information – If you won’t have an internet connection when you land, it’s important to write down things like reservation confirmation numbers and hotel addresses.  And you can’t go wrong with a great guide book!\n\nChange of clothes – After a long flight it’s nice to be able to put on a clean shirt.  This is likely a MUST if you’re traveling with kids (a set for you and them)!\n\nBottom Line\n\nYou can use this handy travel checklist every time you’re packing for a trip to ensure you don’t forget any important items!\n\nBecause you wouldn’t want to be stuck on a long flight without your favorite neck pillow.   And you don’t want to spend your vacation searching for items you could have brought from home.\n\nWhat are your “must haves” for longer trips?\n\n        \n\nComments\n\nSpeaking from my experience, you do not need to bring your ... by TomT\n\n[…] Travel Checklist:  Some people enjoy packing for a trip ... by Daily Points: TSA Changing Screening Policies, Flight Deals to Europe, SPG Hot Escapes and a Travel Checklist! - Travel Miles 101\n\nRelated Stories\n\nEarn Easy British Airways Avios Points for Hotel Stays!\n\n7 Fun US Cities to Explore With Free Breakfast & Wi-Fi Using Limited-Time Card Offer\n\nReaders Share Their Favorite Ways to Use Southwest Points\n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1495670143",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.670061Z"
}