{
  "id": "8577c1ebde7f4bd9bdb47d87aa7e3c5a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/21251-how-to-make-better-sheet-pan-chicken",
      "Title": "Crispy, Speedy Chicken Dinner, All in a Sheet Pan's Work Food52",
      "Selection": "Many sheet pan chicken recipes are deceptively alluring. They breezily suggest you fill your trusty sheet pan full of chicken and assorted ingredients, put it in the oven, go do whatever you need to do (laundry, exercise, you name it!), and come back later to a perfectly cooked, wholesome dinner. But when drawn in by this promise, I’m usually let down. Sometimes the chicken is done way before the vegetables (or vice versa), the ingredients steam instead of brown, or the whole deal takes a lot more time in the oven than advertised. This set-it-and-forget-about-it approach works well for slow cookers, but not for one-pan chicken dinners, which need more care and attention to coax out the best flavors of very different ingredients.\n\nSo I did what I do whenever I want a better approach: I set out on a little research project, gathering tips and tricks for better sheet pan chicken from smart people across the food world. I combined the best strategies into one recipe—this roasted sheet pan chicken with broccoli, chickpeas, and parmesan. It’s speedier, crispier sheet pan chicken, with lots of boldly-flavored ingredients to keep the meal square and interesting. The tips and tricks behind this dinner’s deliciousness are listed below, in the order that they’re used in the recipe.\n\nSheet Pan Chicken With Broccoli, Chickpeas, and Parmesan\nby EmilyC\n\n1. Add baking powder for better browning. Dry the chicken well (I like to use bone-in, skin-on chicken thighs) and rub a mixture of baking powder, salt, and other seasonings all over the chicken to promote browning and crispier skin. It’s a trick often used for chicken wings. Baking powder raises the chicken’s pH level so the proteins break down more efficiently, leading to better browning (via Serious Eats).\n\n2. Sear the chicken in the oven. Place an empty sheet pan in the oven while it heats to 500° F. Start the chicken skin-side down on the hot sheet pan (it’ll sizzle and start to sear when it hits the pan), then lower the heat to 425° F. Wait about 15 minutes before flipping the chicken, or until the fat from the skin has rendered (via Simply Recipes Sheet Pan Chicken with Roasted Broccoli and Potatoes).\n\n3. Add big, bold flavors. Add diced preserved lemon peel to the pan drippings to up the boldness, brightness, and complexity of the whole dish (via Canal House’s Chicken Thighs with Lemon).\n\n4. Stagger entry of ingredients. Nestle the broccoli, chickpeas, and sun-dried tomatoes amongst the chicken thighs after they’ve been flipped. For best results, cut the broccoli into really small pieces to create more surface area for browning and ensure a quick roast (via Melissa Clark and many others).\n\n5. Boost browning (again!). Sprinkle parmesan over the entire dish for its final roasting time to enhance browning and flavor (via Diana Henry’s One Pot Parmesan Roast Chicken and Cauliflower).\n\n6. Crisp vegetables while the chicken rests. Spread the broccoli, chickpeas, and sun-dried tomatoes evenly across the sheet pan (tossing them a few times in the pan drippings) and return them to the oven for a few extra minutes; they’ll get browner, crispier, and more delicious.\n\nThere are a few steps to getting here, hassle-free.\nPhoto by Bobbi Lin\n\nThanks to the rocket-hot sheet pan, this is one of the speediest sheet pan chicken dinners I’ve made. The high heat not only benefits the chicken but the broccoli, chickpeas, and sun-dried tomatoes, too (the little bits of crispy-chewy, almost burnt sun-dried tomatoes are absolutely addictive). Set a timer twice when making this dinner—the first time to remind yourself to flip the chicken, and the second time to check its doneness—so there are no surprises, or burnt dinner!\n\nThis may not be a set-it-and-forget-about type of dinner, but it’s simple to make and can be on the table in less than an hour. With a little attention to detail (and a few smart tricks), all of us can consistently prepare a better sheet pan chicken dinner. And with results this good, the laundry can always wait until tomorrow.\n\nSheet Pan Chicken With Broccoli, Chickpeas, and Parmesan\n\nBy EmilyC\n\nFor chicken and spice rub:\n\n6\nchicken thighs, bone-in and skin-on (about 2.5 pounds total)\n\n2\nteaspoons kosher salt\n\n1/2\nteaspoon freshly ground black pepper\n\n1\nteaspoon baking powder (not baking soda!!)\n\n2\nteaspoons paprika (smoked or regular)\n\n2\nteaspoons ground cumin\n\n1\ntablespoon olive oil\n\nFor rest of sheet pan:\n\n2\nmedium crowns of broccoli (about 1 1/2 to 1 3/4 pounds in total), thinly sliced into small florets\n\n1\n16-ounce can chickpeas (drained and rinsed)\n\n1/3\ncup sun-dried tomatoes packed in olive oil\n\n1\ntablespoon olive oil from sun-dried tomato container\n\n1/2\nteaspoon kosher salt, plus more to taste\n\n2\ntablespoons finely diced preserved lemon peel (from one-half preserved lemon)\n\n1/3\ncup finely grated parmesan cheese\n\nA few wedges of lemon, if desired\n\nView Full Recipe",
      "Folder": "Feedly",
      "Timestamp": "1515429678",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.556539Z"
}