{
  "id": "860a8332f2a64cf99d0597d10977afab",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/hawaii-awards-amex-transfer-bonus/",
      "Title": "How to Book Round-Trip Flights to Hawaii for Just 19,000 Points The Points Guy",
      "Selection": "Although we’ve seen some incredible cash deals to Hawaii recently, nothing beats paying just $11.20 out of pocket for a round-trip to Hawaii. However, while there’s no shortage of mileage options between the US mainland and Hawaii, not many of them are cheap.\n\nBut there’s an award sweet spot that just got even sweeter thanks to a new transfer bonus. Now through October 1, you’ll get a 40% bonus when transferring American Express Membership Rewards to Aer Lingus Avios, British Airways Avios or Iberia Avios.\n\nThis transfer bonus sweetens all kinds of sweet spots in the Avios award chart, and recently we’ve been diving into the best of these sweet spots. So far, we’ve shown you how to fly to Ireland for 10,000 points each way or try out American Airlines lie-flat business class seats for just 12,000 points each way.\n\nToday, we’ll focus on how you can fly to Hawaii for just 19,000 Membership Rewards points round-trip.\n\nIn This Post\n\nThe Sweet Spot\n\nMost airlines’ award charts price award flights based on the origin and destination regions. For example, American Airlines’ award chart prices economy award flights from anywhere in the continental US to Hawaii for 22,500 miles one-way for MileSAAver awards — although it may sometimes charge less through its Economy Web Special deals.\n\nInstead of this region-based award pricing, British Airways’ award chart is based on the distance of the flight. And lucky for us award travelers, British Airways is a partner with American Airlines and Alaska Airlines so you can use British Airways Avios to book mileage flights to Hawaii on both of the US-based carriers.\n\nMost flights between the US West Coast and Hawaii are under 3,000 miles in distance, and British Airways charges 13,000 Avios each way — or 26,000 Avios round-trip — for nonstop award flights between 2,001 and 3,000 miles. Each individual award flight is priced separately, so you’re going to want to focus on nonstop flight options when possible.\n\nAmerican Express Membership Rewards need to be transferred to partners in increments of 1,000 points. So, during the 40% transfer bonus, you’ll need to transfer 10,000 points to get enough for a one-way (with 1,000 Avios remaining) or 19,000 points for a round-trip (with 600 Avios left over).\n\nRoutes\n\nAmerican Airlines\n\nAA flies to four different destinations in Hawaii from three of its US hubs: Los Angeles (LAX), Phoenix (PHX) and Dallas-Fort Worth (DFW). While DFW to Hawaii is more than 3,000 miles, all eight of the routes from LA and Phoenix to Hawaii qualify for the 13,000 Avios sweet spot:\n\nLos Angeles (LAX) — Honolulu, Oahu (HNL)\n\nLos Angeles (LAX) — Lihue, Kauai (LIH)\n\nLos Angeles (LAX) — Kahului, Maui (OGG)\n\nLos Angeles (LAX) — Kailua/Kona, Hawaii (KOA)\n\nPhoenix (PHX) — Honolulu, Oahu (HNL)\n\nPhoenix (PHX) — Lihue, Kauai (LIH)\n\nPhoenix (PHX) — Kahului, Maui (OGG)\n\nPhoenix (PHX) — Kailua/Kona, Hawaii (KOA)\n\nImage generated using Great Circle Mapper.\n\nAlaska Airlines\n\nSeattle-based Alaska Airlines boasts “over 175 weekly flights to Hawaii” departing from nine different US gateways to four Hawaiian destinations. I count a total of 27 individual routes that fall under the 3,000-mile threshold for this redemption, and here’s a rundown of your options organized by the four airports in Hawaii:\n\nTo Honolulu, Oahu (HNL) from:\nAnchorage (ANC)\nLos Angeles (LAX)\nOakland (OAK)\nPortland (PDX)\nSan Diego (SAN)\nSan Francisco (SFO)\nSan Jose (SJC)\nSeattle (SEA)\n\nTo Kahului, Maui (OGG) from:\nAnchorage (ANC)\nLos Angeles (LAX)\nOakland (OAK)\nPortland (PDX)\nSacramento (SMF)\nSan Diego (SAN)\nSan Francisco (SFO)\nSan Jose (SJC)\nSeattle (SEA)\n\nTo Lihue, Kauai (LIH) from:\nOakland (OAK)\nPortland (PDX)\nSan Diego (SAN)\nSan Jose (SJC)\nSeattle (SEA)\n\nTo Kailua/Kona (KOA) from:\nOakland (OAK)\nPortland (PDX)\nSan Diego (SAN)\nSan Jose (SJC)\nSeattle (SEA)\n\nHere’s a map of 25 of these routes — chopping out service from Anchorage (ANC):\n\nImage generated using Great Circle Mapper.\n\nSearching Award Availability\n\nThe best place to find award availability for all of these flights is on American Airlines’ website. Since it partners with Alaska Airlines, you will get both AA and Alaska award results. Remember that AA has two different award searching tools and each can return different results. I’d recommend using the old search tool for this search as you’ll want to be able to limit the results to MileSAAver awards.\n\nTo do that, you’ll want to choose “non-stop only” from the drop-down and choose “Economy MileSAAver” tab if the route is showing Economy Web Special availability.\n\nHow to Book\n\nNow that you know the routes, you might be wondering how to take advantage of this opportunity. Thankfully, we have step-by-step instructions on how to do so (click here).\n\nFirst, make sure that you find award availability before transferring points. Then, to transfer points, log in to your American Express account, navigate to the point transfer page and select “Transfer Points” under the British Airways Avios tile. In our experience, Amex Membership Rewards transfer to British Airways Executive Club instantaneously. You’ll want to transfer 10,000 MR points to get enough Avios for a one-way award or 19,000 points for a round-trip.\n\nOnce the Avios are in your account, search for the award flight you found on British Airways’ website, select your flight option from the search results and then click “Continue” at the bottom. Read and agree to the terms on the next page, clicking “Continue” again to progress. On the next page, your personal information should be populated from your account profile. Update as needed and click “Continue” again. On the final page, complete your payment information to finalize the booking.\n\nUnfortunately, not all American Airlines award flights are showing up on BA’s website. For some reason, BA isn’t showing any redeye flights back from Hawaii in the search results. While you still should be able to book these flights when calling BA, it may be worth checking with a BA phone agent that the award flights are available before transferring your points.\n\nAlso, Alaska awards aren’t searchable or bookable through British Airways’ website. For both of these types of awards, you’re going to need to search award availability on AA’s website and then call BA to book these awards.\n\nRemember to use a credit card with trip delay and baggage insurance protection. Top choices are the Citi Prestige® Card ($500 per passenger for 6+ hour delay) for bookings made before September 22, the Chase Sapphire Reserve ($500 per ticket for 6+ hour or overnight delay), Chase Sapphire Preferred Card ($500 per ticket for 12+ hour or overnight delay) and the Citi Premier℠ Card (12+ hour delay) for bookings made before September 22.\n\nEarning Points\n\nSince this transfer bonus only runs for two months, the promotion is going to be best for those who already have Membership Rewards points already in their account. But if you don’t have points in your Amex account — or want to resupply after taking advantage of this deal — here are three great credit card welcome bonuses that are currently available:\n\nThe Platinum Card® from American Express: 60,000-point welcome bonus for spending $5,000 in the first three months of Card Membership (also check the CardMatch tool for a possible targeted 100,000-point bonus; targeted offer subject to change at anytime).\n\nThe Business Platinum® Card from American Express: Up to 75,000-point welcome bonus: 50,000 bonus points after you spend $10,000 and an extra 25,000 bonus points after you spend an additional $10,000 all on qualifying purchases within your first 3 months of Card Membership.\n\nAmerican Express® Gold Card: 35,000-point welcome bonus for spending $2,000 in the first three months of card membership (also check the CardMatch tool for a possible targeted 50,000-point bonus; targeted offer subject to change at anytime).\n\nBottom Line\n\nFlying between the mainland US and Hawaii using British Airways Avios has long been an award sweet spot. Thanks to the 40% transfer bonus for transferring American Express Membership Rewards points to British Airways Avios, you’re now able to book round-trip award flights for even less, paying just 19,000 Amex points and $11.20 in taxes and fees. Just make sure that you transfer MR points to Avios by October 1, 2019 to take advantage of this transfer bonus.\n\nFeatured image by anyaberkut via Getty Images",
      "Folder": "Feedly",
      "Timestamp": "1566450206",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.352146Z"
}