{
  "id": "861fb93c85dd477c8725f11beb3beda3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/new-money/2016/11/23/13715276/clinton-trump-booming-economy",
      "Title": "The 2016 election pitted booming cities against stagnant rural areas Vox - All",
      "Selection": "Brookings Institution / Mark Muro\n\nThe 2016 election was a virtual tie, with Hillary Clinton narrowly winning the popular vote, while Donald Trump won just enough states for a majority in the Electoral College. But if elections were based on economic output instead of population, the 2016 election would have been a blowout for Clinton.\n\nThat’s the takeaway from this graphic produced by the Metropolitan Policy Program at the Brookings Institution. Brookings researchers looked at county-level election returns and compared it with data on economic output for those same counties. It found that the counties Clinton won accounted for 64 percent of the nation’s economic output, while Trump’s counties produced only 36 percent.\n\nThe reason is simple: Clinton won almost every significant urban county in the US. Of course she won traditionally liberal counties like Los Angeles County, New York County (Manhattan), Cook County (Chicago), and Philadelphia County. But she also won major cities in deep red states — like Fulton County (Atlanta), Harris County (Houston), and Dallas County. The most populous counties Trump won were Maricopa County (which includes Phoenix) and Tarrant County, Texas, (which includes Fort Worth but not nearby Dallas).\n\nThe data comes with one important caveat: Brookings used GDP data that’s based on where people work, not where they live. So some — perhaps many — of the workers who contributed to the economies of large Clinton counties commuted into the city from nearby counties that lean more Republican.\n \nMark Muro, the Brookings researcher who compiled the data, says that if you look at income rather than GDP — in other words, if you count economic output based on where people live instead of where they work — Clinton’s counties accounted for 59 percent of the economy instead of 64 percent.\n\nA changing economy drove a changing political map\n\nPhoto by David Becker/Getty Images\n\nThis might not seem all that surprising. After all, everyone knows that urban areas tend to be more liberal than rural ones. But one of the striking things about this trend is how recent it is.\n\nMuro also crunched some numbers on the 2000 election — the last time a Republican won the presidency but not the popular vote — and found some striking differences. In 2016, Donald Trump won only one of the 10 largest counties: Maricopa County (Phoenix), Arizona. But George W. Bush won half of those same 10 counties in 2000. In addition to Maricopa County, he also won Dallas County and Harris County (Houston) in Texas, as well as San Diego and Orange counties in California.\n \nIn other words, the 2000 political landscape had Republican-leaning metropolitan areas like Houston, Dallas, and San Diego as well as Democratic-leaning ones like New York and San Francisco. Now, by contrast, large counties almost always skew Democratic even when they’re in the middle of deep red states like Texas.\n\nThe result: The counties Al Gore won accounted for just 54 percent of the nation’s economic output — far less than Clinton’s tally of 64 percent.\n\n“We've seen a re-sorting going on over the last 15 years,” Muro says. “There's a default of professional America — cosmopolitan, well-educated, millennial, middle management. That often has a similar political feel, no matter where you are.”\n\nIn other words, the politics of urban professionals in Houston and Dallas are more like those in Boston or Seattle than they would have been in 2000.\n\nOf course, educated yuppies are just one slice of the Democratic coalition. Working-class Hispanic and African-American voters also form key Democratic constituencies, and they’re also concentrated in big cities.\n\nBut this was also true in 2000 — and back then, these minority voters weren’t enough to push more conservative urban areas like Dallas, Harris, and Orange counties into the Democratic column. It’s the combination of minority voters plus a new crop of highly educated urban professionals that painted so many cities blue in the 2016 election.\n\nAnother way of looking at this, Muro told me, is to compare the number of counties won in the 2000 and 2016 election. In 2000, Al Gore won 659 counties (there are a bit more than 3,000 counties in the United States). In 2016, Clinton won only 493 counties — yet she’s on track to beat Trump by a wider margin in the popular vote than Gore’s margin against Bush in 2000.\n\nJavier Zarracina / Vox.com\n\nWhat accounts for this deepening urban-rural divide? Economists are going to be debating that for the next four years at least. But a reasonable starting point is this chart showing how the economy has performed during the past three economic recoveries.\n\nThis chart, originally created by the Economic Innovation Group, shows that the 1990s were a time of healthy economic growth for the smallest counties. They actually added jobs at a faster rate than big urban centers. But in the most recent recovery, the pattern has been reversed. The largest counties have been adding jobs at the fastest rate in at least a generation. The smallest counties have been adding jobs only half as fast, and that constitutes the slowest job growth these areas have seen in decades.\n\nSo the natural conservatism of rural areas combined with resentment at the Democratic president who presided over an unusually weak economic recovery in rural areas. At the same time, the natural liberalism of urban areas was reinforced by a strong urban recovery under a Democratic president. It’s not too surprising that this produced an election that was sharply polarized between urban and rural areas.\n",
      "Folder": "Feedly",
      "Timestamp": "1479913110",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.751141Z"
}