{
  "id": "86b7bbd7761549289a228d9c8087e792",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1127838/egypt-artists-el-side-effect-merge-everyday-scenes-from-egypt-with-outer-space/",
      "Title": "This photo collection visualizes everyday Egypt in outer space Quartz",
      "Selection": "In a popular 1988 song, the Egyptian actor and singer Medhat Salah sang about the desire to live in Kawkab Tani—or another planet. In the track, Salah spoke of wanting to put (in Arabic) an “impervious, tall, and abominable barrier between him and his self, between his body and soul, between day and night.”\n\nAlmost three decades later, the song is now an inspiration for a new photo project from the Egyptian art collective El Side Effect. At the heart of the new project—named after Salah’s song—is escapism and the distraction and relief that virtual reality offers from unpleasant realities. The collection visualizes scenes from everyday Egypt, amplified through evocative displays of outer space.\n\nThe “Kawkab Tani” or “Another Planet” project amplifies daily life through evocative displays of outer space. (Courtesy/ El Side Effect)\nIn the photos, we see Egyptians going about their daily grind, working at farms and selling goods at busy markets. Men in loose jellabiya garments lead their working horses and mules. Others crowd in a shop to buy the daily staple of pita bread. A man smokes shisha, another drinks tea; a woman and her son sit at a park, while another woman enjoys a swim clad in a hijab. But the mundane become momentous as the display of planetary bodies and star constellations add a complex twist to every image and improves the meaning behind it.\n\nEl Side Effect hopes wants Egyptians “to see everyday Egypt in a different light.” (Courtesy/ El Side Effect)\nThe conceptual artwork and the photos are by the creatives Ahmed Shalaby and Sarah Eweda, both of whom co-founded El Side. (Abdelrahman Ahmed also took some of the photos.) Eweda tells Quartz that the group was driven by the notion that art was everywhere around us, and that it could provide not only commentary on daily life but also challenge assumptions and tradition.\n\n“Sometimes you just want to distract yourself from reality and escape this world,” Eweda says. “Living here is getting harder by the minute, and to keep going you do what you do to escape.”\n\nPlanetary bodies and star constellations add a complex twist to daily mundane activities. (Courtesy/ El Side Effect)\nThe collection is being published at a time when African photographers and filmmakers are increasingly using digital storytelling and virtual reality to convey complex stories. Artists across the continent are also utilizing science fiction to reimagine historical narratives like the Mau Mau uprising in Kenya, or the future of local communities like the Maasai.\n\nIt is also no secret that space exploration has become a pressing priority for many African nations. Governments from Ethiopia to South Africa, Egypt, and Nigeria have manufactured, launched, or operated satellites, all in the hope of powering their economic, technological, scientific, and even their military and intelligence ambitions.\n\nEl Side Effect say they want to make art accessible to all Egyptians. (Courtesy/ El Side Effect)\nEl Side’s photos also come at a time when Egyptians do need a lot of escape from their daily realities. Austerity measures imposed by the International Monetary Fund increased inflation, while deadly terrorist attacks continue to put a dent in Egypt’s image as a favorite tourist destination. The government continues to crack down on activists, and has blocked hundreds of websites as part of what it says is curbing websites that are “publishing false information” and “supporting terrorism.”\n\nEweda hopes the photos will offer Egyptians a fantasy break from this sometimes harsh reality. “We basically want them to see what we see. We want them to see everyday Egypt in a different light.”\n\nWith high inflation and low incomes, Egyptians do need an escape from reality. (Courtesy/ El Side Effect)\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1512236881",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.565465Z"
}