{
  "id": "880104759bec42ac9dab4368a5dd1416",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/18632-25-board-games-tailored-to-your-holiday-crowd-from-the-rowdiest-to-all-ages",
      "Title": "25 Board Games Tailored To Your Holiday Crowd, from the Rowdiest to All Ages Food52",
      "Selection": "When you're home for the holidays—or hosting others—what's your tactic for convincing the troops to put down their phones, back away from the TV, and interact with each other? Me, I'm a true believer in the humble board game (with a side of wine). Whether the political conversations are making you batty or the kids are hyped up and you need to just direct their energy somewhere, the board game is here for you.\n\n5 Card Games to Know (and Snacks to Eat While Playing)\nby Samantha Weiss Hills\n\nBut which game is right for your group? Here's your game, based on who's around. (And if you don't have the one that's right for you, maybe it's time to upgrade?):\n\nFor The Rowdy Bunch\n\nGuillotine\nPictionary\n\nCards Against Humanity\nThe self-proclaimed \"party game for horrible people.\" Break this out after the bourbon's on the table and the little ones have retired for the evening.\n\nPictionary\nMake sure the teen artist who can draw is on your team.\n\nSorry\nIn my house, when you knocked someone off the board you did so in a flamboyant fashion while yelling \"SORRY\"! We didn't really raise our voices all that often, so it was invigorating. I suggest you try it.\n\nYahtzee\nEveryone should have their own signature dice shake, because even if you come in second, you'll look cool doing it.\n\nGuillotine\nSomewhat macabre in title, but pretty harmless in practice. You line up a bunch of characters from the French revolution and collect them with action cards—gather the most points (i.e. the most valuable characters), and you win.\n\nFor The Readers and Wordsmiths\n\nTaboo\nMoby Dick, The Card Game\n\nTaboo\nDon't say it, don't say it! Until someone guesses it, that is.\n\nScrabble\nBut you already own this one, right? Right?\n\nScattergories\nA personal favorite! Roll the alphabetical dice and then race against opponents to scribble out as many words as possible that relate to a list of categories before time is up.\n\nMoby Dick\nA new card game for the literature lover, described by the creators as such:\n\nExperience the thrill, the awe and the terror of The White Whale in this card-driven narrative adventure game based on the classic book by Herman Melville. Set sail with 2 to 4 players, and follow Ahab and the crew of the Pequod to their inevitable, fated destruction. Roll custom engraved dice, collect beautiful raw wood oil tokens, and assemble a crew of hardy sailors ready to take on the boundless adventure of the open ocean.\n\nBananagrams\nBe your own best Will Shortz, but do it quickly and use up all those tiles!\n\nFor The Competitive Set\n\nTrivial Pursuit Master Edition\nJenga\n\nMonopoly\nBut only the version with paper money!! Do not even reach for the one with a credit card reader. (P.S. There is also a Star Wars version, my fellow nerds.)\n\nClue\nThis classic game pits you against each other to find out who committed the perfect—or not so perfect—crime. (Mr. Mustard is usually my alias.)\n\nTrivial Pursuit\nEven if you can't complete your pie before someone else does, you can impress your family members with obscure sports facts.\n\nJenga\nLots of trash talk until the tower topples right into your beer.\n\nFor The Group In It For The Long Haul\n\nThe Game of Life\nSettlers of Catan\n\nSettlers of Catan\nNever rely on the longest road—it gets you nowhere. And plan for about 3 hours for this one.\n\nEvolution\nOnly click on this if you plan to have 5 free hours somehow during the holidays, and you're cool with masquerading as a reptile, bird, or insect.\n\nRisk\nTo be honest, looking at the Risk board gives me anxiety, but it's good for occupying competitive siblings who want you to know just how strategic they are.\n\nThe Game of Life\nSpinning the wheel is the best part because, at least in my childhood version, it sounds like what I imagine the Wheel of Fortune does.\n\nFor All Ages\n\nChinese Checkers\nCandyland\n\nTwister\nYou're gonna need stretch pants for this one.\n\nUno\nOne of the easiest card games to grasp right from the beginning—and also one of the easiest to annoy everyone by reversing the order 4 times!\n\nCandyland\nWe always put real candy to be won at each new location—good incentive to occupy kiddos while you drink wine in the other room.\n\nTrouble\nPortable enough for distraction in the car and to go right to the table when you arrive.\n\nOperation\nThat buzzer when you hit someone's abs while trying to remove a rib stays with you, even after the game's over.\n\nParcheesi\nGet all your pieces to home base before the others do. Or else!\n\nChinese Checkers\nContrary to what the name suggests, this game is German in origin. Race across the board by hopping other players and making single-space moves to take the other corner. You got this.\n\nYou look like you might need some snacks handy with all that playing...\n\nJacques Pépin's Fromage Fort \nby Genius Recipes\nChevre Devils\nby gingerroot\nCaramelized Onion Dip\nby ADRIENE\nSweet and Spicy Pretzel and Nut Mix\nby drbabs\nOvenly's Secretly Vegan Salted Chocolate Chip Cookies\nby Genius Recipes\nSuper Fudgy Brownies\nby Merrill Stubbs\n\nLet's hear it: What is your favorite board game to rally family around? Tell us in the comments below!",
      "Folder": "Feedly",
      "Timestamp": "1481587902",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.739477Z"
}