{
  "id": "8934a585ad0245e9a0b313565c5c9d4f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://stratechery.com/2017/faceless-publishers-take-2-internet-trends-2017/",
      "Title": "Faceless Publishers, Take 2; Internet Trends 2017 Stratechery by Ben Thompson Member Feed",
      "Selection": "Good morning,\n\nIt was great to meet so many of you over the past few days. If I missed anyone, my apologies!\n\nOn to the update:\n\nFaceless Publishers, Take 2\n\nI feel like yesterday’s column, Faceless Publishers, was a bit of a miss, primarily to a lack of clarity on my part.\n\nLet me start by explaining what Faceless Publishers are not:\n\nMedium — This is probably the question I got the most: didn’t Medium seek to be a faceless publisher? The answer, because it’s Medium, is complicated. As far as I can tell, Medium has had three distinct “strategies”:\n\nI believe that Medium’s original goal, as laid out in this 2015 Daily Update, was to be a destination site populated by the long tail of online publishing. Being a destination site with a feed would lend itself to inline advertising; as should be obvious, being a destination site is the exact opposite of being a faceless publisher.\n\nIn 2016, Medium announced Medium for Publishers, which actually looks a lot like what I proposed yesterday. From the Daily Update in which I wrote about the announcement:\n\nAll publishers have basic needs when it comes to infrastructure: except for a few exceptions (that may not be exceptions), no text-based site is differentiated by its content management system, just like no web service is differentiated by its data center, just like no commerce site is differentiated by its payment processor, and just like no startup is differentiated by its office space. In other words, what Medium is offering to all publishers from the one-person blog to the biggest magazines is very much in the same vein as AWS, Stripe, or WeWork: by leveraging scale we can take care of the infrastructure of your business better than you can on your own, and you can spend your time focusing on what differentiates your business.\n\nThis wasn’t the full extent of yesterday’s idea — I think a faceless publisher should handle not only the tech and monetization platform but also some scalable business operations — but it’s pretty far down the road, and it was because of this goal that sites like The Ringer and many others signed up for Medium’s platform.\n\nUnfortunately, as far as I can tell on the outside, Medium did some work on the tech stack but basically nothing on the monetization platform; there was a half-hearted effort to sell some promoted stories and a beta of an individual site membership program, but nothing substantial came of either.\n\nFinally, earlier this year, Medium laid off 50 employees who mostly worked in the “sales, support, and other business functions” part of the company, shuttered its promoted stories product, and 404’d its individual site membership program. By all accounts most of the sites that had moved to Medium under the promises of Plan 2 had little to no warning, and were instead treated to Ev Williams’ declaration that ad-supported media was a “broken system”. A few months later, Williams announced the Medium membership model, in which readers subscribed to Medium for what I called the “Medium Newspaper”.\n\nThis current strategy is in direct opposition to that of a faceless publisher: Medium wants to own the consumer relationship with a strong brand that commoditizes writers, which I think is precisely backwards. I believe that writers and small publications should and will own the consumer relationship, and be supported by a scalable publisher that operates as a service, not an owner.\n\nFederated Media — Federated Media had the business model right; founded in 2005, Federated Media was basically an ad network for online publishers that sold at scale kept a percentage of revenue. The problem is that back then it was far easier for individual sites to monetize on their own, which meant that if a site like TechCrunch or GigaOm became large, it was more profitable to simply sell ads themselves (or use other ad networks); that is no longer an issue today, because the reality of digital advertising is that it is far more difficult for a single site to monetize efficiently. Federated Media was arguably a business that was simply 10 years too early.\n\nThat said, even if Federated Media had succeeded, it was still not a faceless publisher — it was an ad network. Sites were still responsible for their own tech stack and business operations.\n\nLee Enterprises — Lee Enterprises (you could easily substitute in another large newspaper publishers) owns 54 daily newspapers, for which it provides online services, ad sales, some content, etc. It actually is, in function, what I think a faceless publisher should be. The difference is twofold: first, Lee Enterprises is built around print newspapers, with all of the limitations both financially and especially culturally that entails; second, Lee Enterprises owns all of the publications it services, which limits its scale. In other words, I think it has the wrong business model.\n\nSo what is a faceless publisher? It is a service company that provides all of the functionality but for the content necessary to build an online publication, and sells it as a service (likely as a percentage of revenue). The actual publications and associated audiences are built and earned by writers and journalists free to focus on what they do best. Several of you picked up on what is probably the best analogy: e-commerce platforms like Shopify, Square, or even Amazon Merchant Services.\n\nThat gets to my final point: while I used Vox’s deal with The Ringer as a jumping-off point, I am most excited about this model in the context of the sort of subscription-based sites that I wrote about in The Local News Business Model.\n\nMore broadly, I think the Internet will reshape the kinds of businesses that make sense: instead of vertical business built around distribution, businesses with high fixed costs and low marginal costs (like faceless publishers) will be services on which high variable cost business like content publications are built. It is already happening in e-commerce, in cloud services, and I think publishing will be next.\n\nInternet Trends 2017\n\nMary Meeker outdid herself at this year’s Code Conference, delivering 355 slides on 2017’s Internet Trends. As I do every year, I picked out my favorites:\n\nRemember the old adage that print dollars are being replaced by digital dimes and mobile pennies?\n\nIt turns out that a lot of mobile pennies are worth more than some lesser number of digital dimes, which themselves are worth more than even fewer print dollars.\n\nTwo other interesting notes on this slide, which is always one of my favorites: first, while mobile is only 21% of spend compared to 28% of attention, last year it was only 12% of spend compared to 25% of attention; it’s growing fast. Second, while TV time share decreased last year, it was up this past year (while advertising share continued to fall); I suspect that is the Netflix effect (Netflix, of course, has no ads).\n\nI wrote about Facebook and Google’s (then-impending) dominance in The Reality of Missing Out; the sheer dominance of the two companies in digital advertising is arguably one of the biggest factors impacting tech startups since the creation of AWS. There really isn’t room for anyone else.\n\nAs a thought experiment, imagine someone told you in 1995 (for reference, the Playstation launched at the end of 1994) that the number of gamers would increase 2600% in 21 years (while the world population would only increase 30%). You wouldn’t have believed it, right?\n\nThe problem is that in 1995 you probably didn’t imagine the smartphone revolution, which is the clear prerequisite to this level of growth. That’s understandable, but it should also be a reminder of how easy it is to underestimate the future because of the mind’s propensity to assume the world is static. It’s not.\n\nThis, even more than cord-cutting, is the true bear case for sports leagues and TV networks (and, as I noted in The Sports Linchpin, much of the post-war economy). And it’s why Twitch may prove to be Amazon’s most YouTube-esque acquisition.\n\nAh yes, there’s the Netflix Effect.\n\nTencent — thanks to WeChat — is dominant in China (most of the non-WeChat apps, except for QQ, flow from WeChat).\n\nYou can’t understand the China mobile scene (including Tencent’s top and bottom-line growth) without understanding gaming; by extension, given that most of those China dollars flow through App Stores, Apple’s WeChat Problem goes deeper than simply hardware sales.\n\nThis is why India is the most important country for long-term growth:\n\nThis one probably comes as a shock to many of you: people trust Google with their data more than anyone, including Apple.\n\nThings are getting better.\n\nThe Daily Update is intended for a single recipient, but occasional forwarding is totally fine! If you would like to order multiple subscriptions for your team with a group discount (minimum 5), please contact me directly.\n\nThanks for being a supporter, and have a great day!",
      "Folder": "Feedly",
      "Timestamp": "1496327810",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.594769Z"
}