{
  "id": "89cabc85fac644ffad31793c21e85980",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2018/06/san-francisco-substitution-rent-damn-high.html",
      "Title": "San Francisco substitution the rent is too damn high Marginal REVOLUTION",
      "Selection": "Restaurateurs who say they can no longer find or afford servers are figuring out how to do without them. And so in this city of staggering wealth, you can eat like a gourmand, with real stemware and ceramic plates. But first you’ll have to go get your own silverware.\n\n…Restaurateurs here have taken a model familiar to taquerias and fast-casual, cafeteria-style places like Sweetgreen and Chipotle Mexican Grill, and pushed it further up the fine-dining food chain. Call it fast-fine, they suggest, or fine-casual. Or counter service “in a full service environment” that includes $11 cocktails and $22 pan-roasted salmon.\n\nBy the way, rent is not the only problem:\n\nOn July 1, the minimum wage in San Francisco will hit $15 an hour, following incremental raises from $10.74 in 2014. The city also requires employers with at least 20 workers to pay health care costs beyond the mandates of the Affordable Care Act, in addition to paid sick leave and parental leave.\n\nEven the dosa is troubled:\n\nIn December, he opened a counter-service version of Dosa in Oakland. The new restaurant serves cardamom- and fenugreek-spiced cocktails. But there’s also a self-service water station, and a busing station for diners inclined to clear their own tables. (If they aren’t, an employee will do the job.)\n\nHere is more from Emily Badger (NYT).  Addendum: Hadur in the comments writes: “Who could have predicted that this would happen in America’s most high-tech city?”\n\nThe post San Francisco substitution the rent is too damn high appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1530404010",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.492550Z"
}