{
  "id": "89e17620739549d495b739a5e24c354e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/2017/04/disney-mondo-gallery/",
      "Title": "Satisfy Your Inner Child and Adult With Gorgeous Disney Posters for Grown-Ups WIRED",
      "Selection": "From kids sleuthing around pretending to be the Great Mouse Detective to Elsa wannabes singing “Let It Go” until their parents inadvertently memorize the lyrics, every generation has its Disney fans. But as they get older, it becomes harder for adult die-hards to find a poster for their favorite Mouse House flick that really brings a room together. Mondo’s latest print collection solves that problem with style. \n\nNever Grow Up: A Disney Art Show features the work of 30 artists, each of whom got to commemorate their favorite animated Disney movie of the last 80 years—from Ken Taylor’s futuristic take on 2014’s Big Hero 6 to James Flames’ twist on 1937’s Snow White and the Seven Dwarves. \n\nFor Mondo, the Austin, Texas-based gallery and print shop, Disney is a natural fit. “The movies were a big part of our childhood, and are a big part of our lives now,” says co-founder and creative director Mitch Putnam. The same is true for the artists. Flames, for example, learned to draw by tracing Uncle Scrooge’s beak and Mickey Mouse’s ears, and still remembers watching the re-released Snow White when he was five years old at the Kingsway Theater in Brooklyn. He was so taken with the movie that he cut out the newspaper review and folded it into his sketchbook, drawing her bow and outstretched hands again and again. In his poster for the Mondo show, Flames drew Snow White and the woodland creatures emerging from a drafting table, commemorating the illustrators who created the first-ever feature-length animated film. \n\n“There’s somebody who actually drew all these pictures, and made them come to life,” says Flames. “For me, art was always synonymous with Disney.”\n\n101 DalmatiansJonathan Burton\nNever Grow Up, which Mondo is presenting alongside Cyclops Print Works, will run from April 28 through May 13. Once the show opens, 200-500 copies of each poster go up for sale. During the first weekend, they’ll only be available in-person at the Mondo gallery; after that, they go online. But once they’re gone, they’re gone—so if those Disney fans really want to spruce up the living room, they might want to start planning a trip to Austin. \n\nGo Back to Top. Skip To: Start of Article.\n",
      "Folder": "Feedly",
      "Timestamp": "1492471237",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.610657Z"
}