{
  "id": "8a3702a7680c49eb814067a3ee233635",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2017/12/30/16832964/trump-business-washington-hotel",
      "Title": "Trump is “definitely still involved” in his hotel business, a new report says Vox - All",
      "Selection": "Even as president, Trump keeps up on how his Washington, DC hotel is doing.\n\nPresident Donald Trump’s isn’t so separate from his businesses as he would like the public to think. Throughout his campaign and through his first few months as president, Trump has said he would distance himself from his Trump Organization and hand it over to his sons in lieu of divesting entirely, which ethics experts say he should. They fear that otherwise he will use the presidency for his own personal gain or that his policies will be influenced by his business interests.\n\nAs far as the president flagship hotel in Washington, DC goes, Trump is “definitely still involved,” according to an email sent by the hotel’s director of revenue management first reported by the Daily Beast.\n\nOn Friday, that site published a September 12th email from Jeng Chi Hung, the director of revenue management for the Trump International Hotel in Washington. In it he wrote that he met with Trump, who asked specific questions about the hotel and his business. The message says:\n\nThe company is interesting to work for being under the Trump umbrella. DJT is supposed to be out of the business and passed on to his sons, but he's definitely still involved... so it's interesting and unique in that way. I had a brief meeting with him a few weeks ago, and he was asking about banquet revenues and demographics. And, he asked if his presidency hurt the businesses. So, he seems self aware about things, at least more than he lets on. I am far left leaning politically, so working here has been somewhat of a challenge for me. But, it's all business.\n\nIt’s not clear when Hung met with Trump. Mickael Damelincourt, the hotel’s managing director, told the Daily Beast that Hung made Trump’s comments up “in an effort to enhance his sense of importance to a former employer.”\n\nTrump’s refusal to completely separate himself from his vast business holdings has been a source of ethical consternation since his election. Shortly before his inauguration, Trump and one of his lawyers, Sheri Dillon, outlined a vague plan for the president-elect to distance himself from his company at Trump Tower in New York. They announced he would put his businesses in a trust managed by his two adult sons, Eric and Donald Jr., and the Trump Organization’s chief financial officer, Allen Weisselberg.\n\n“I could actually run my business and run government at the same time. I don't like the way that looks,” Trump said. “But I would be able to do that if I wanted to.”\n\nEthics experts have argued that Trump should divest — sell off — his assets entirely and put their value into a blind trust, an investment portfolio of which he would have no knowledge or control.\n\n“The president is now entering a world of public service,” Walter Shaub, former director of the Office of Government Ethics, the government agency that oversees executive branch policies related to conflict of interest, said in a speech at the Brookings Institution at the start of the year. “He's going to be asking his own appointees to make sacrifices. He's going to be asking our men and women in uniform to risk their lives in conflicts around the world. So no, I don't think divestiture is too high a price to pay to be the president of the United States of America.”\n\nShaub resigned in July to join the Campaign Legal Center, a group that works on campaign finance and ethics in government. “In working with the current administration, it has become clear to me that we need improvements to the existing ethics program,” he said in a press release at the time. It’s perhaps telling that Shaub felt he couldn’t reform the government from the inside.\n\nTrump’s Washington Hotel has been especially problematic\n\nSome of Trump’s businesses have struggled since his election — for example, a Trump-branded hotel in Manhattan’s SoHo neighborhood dropped the Trump name after a number of high-profile clients refused to stay there, and his golf clubs and hotels in more liberal-leaning areas appear to have declined in business and, in some instances, revenue.\n\nBut the Trump International Hotel in Washington, DC, which Trump opened while campaigning for the presidency, has flourished. According to the Wall Street Journal, the hotel brought in $18 million in revenue in the first four months of 2017, in part by hiking its room rates. It made a nearly $2 million profit during that time period, despite budgeting for a $2.1 million loss.\n\nThe hotel has become a sort of White House extension since the president took office. Foreign dignitaries, lobbyists and Republican lawmakers often visit the hotel in hopes of getting in Trump’s good graces. The Washington Post in May sent reporters to the hotel every day, where they spotted a range of figures and organizations, including former Trump campaign adviser Corey Lewandowski, business groups promoting Turkish-American relations, and former New York Mayor Rudolph Giuliani.\n\n“Jimmy Carter put his peanut farm into a blind trust that had the power to sell it,” Noah Bookbinder, executive director of the bipartisan watchdog group Citizens for Responsibility and Ethics (CREW) in Washington, recently told Vox. “It wasn’t as though you had foreign powers or lobbyists trying to hang out at the peanut farm to try and influence the president. It didn’t have that kind of mixing of business and the office.”\n\nTo a large extent, Trump’s presidency marks the first time such an ethical conundrum has been seen in the White House; it’s also shown that the rules governing presidential ethics and conflicts of interest are more guidelines or norms than enforceable laws.\n\nCREW sued the president in January, claiming that Trump’s business interests were causing conflicts of interest and violating the US Constitution — specifically, the foreign emoluments clause, which prohibits Trump from receiving anything of value from foreign governments. This month a federal judge dismissed the case, and the flow of foreign dignitaries, lawmakers and Trump allies through the Trump hotel lobby continues unabated.\n\n“Our statement as released from Mickael Damelincourt is accurate and there is nothing more to add,” said Trump International Hotel spokeswoman Patricia Tang in an email. “There is no conflict of interest.”\n",
      "Folder": "Feedly",
      "Timestamp": "1514686485",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.510315Z"
}