{
  "id": "8a5cd448d51742fea88ca270790ac34f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.com/book-some-las-vegas-strip-hotels-via-airbnb/",
      "Title": "Book some Las Vegas strip hotels via Airbnb Frequent Miler",
      "Selection": "Gary Leff at View from the Wing notes that there is a way to save on rooms at some Las Vegas strip properties: book via Airbnb to side-step the resort fee and potentially save some cash as well.\n\nSeveral Las Vegas properties have condos. Gary lists properties like The Signature and MGM, which I believe has been available in the past via Amex Fine Hotels & Resorts, as well as casino-less properties like MGM’s Vdara and Hilton’s Elara. I wouldn’t expect to earn elite nights or credits when booking through Airbnb (like you would for MGM nights booked through MGM or Hyatt for instance). However, if you’re saving and getting a nice condo-like room, that may not matter much to you.\n\nOf course Arbnb adds its share of fees that might not make booking this way much more appealing, but surely that will be a function of timing, prices and your needs in the given situation. It’s interesting at least to note that Airbnb is even an option for booking mainstream strip properties.\n\nOne major reason why I’m not big on Airbnb is something Gary notes: the danger of being completely out of luck when a host cancels on you at the last minute. That said, I’d generally be less concerned about that in Las Vegas versus other markets given the huge inventory of rooms that I can’t imagine will be terribly full any time in the near-term. I’d be confident that I’d find some sort of backup plan if the reservation fell through, which might make me more apt to take advantage of this Airbnb option if price and room type dictated that it was the right deal for me.\n\nOf course, I’m more likely to book Delano via Chase’s Luxury Hotel Collection given great rates, an all-suite property, and the standard free-breakfast and $100 resort fee benefits of LHC. That has become my go-to play for Las Vegas stays and likely will continue to be for the foreseeable future — whenever it is that I get back to Las Vegas again.\n\nThe living room of a standard suite at Delano, which is by far my preferred Las Vegas Strip property given the combination of value and comfort.\n\nThe post Book some Las Vegas strip hotels via Airbnb appeared first on Frequent Miler.\n",
      "Folder": "Feedly",
      "Timestamp": "1608408170",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.255539Z"
}