{
  "id": "8ad9839f9124401eba2d86f6a05ad9ff",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/family-to-kauai-success-story/",
      "Title": "60,000 points got our family to Kauai — reader success story The Points Guy",
      "Selection": "Today I want to share a story from TPG reader Krzysztof, who took advantage of an award chart sweet spot to book a family vacation:\n\nOur family of four visited Hawaii back in 2014. We spent 15 days there, visiting Oahu, Maui and the Big Island and booking most of the trip with points. We had a blast, but we were unable to visit Kauai, and have been talking about going back to spend some time on the Garden Isle for a while. Finally, the moment has arrived.\n\nWith more and more loyalty devaluations, planning a Hawaii trip with points is now more challenging, but by no means impossible. A few months ago, I read an article about a sweet spot of the Turkish Airlines loyalty program Miles & Smiles, which offers round-trip economy awards from the U.S. to Hawaii for only 15,000 miles. The airline is a member of the Star Alliance along with United Airlines, which offers lots of flights to Hawaii. Finding saver economy award space isn’t easy (especially in the summer), but we were lucky enough to find four seats from Philadelphia to Lihue in July, 2020.\n\nI didn’t have miles in my Miles & Smiles account, but fortunately I had accumulated 65,000 Citi ThankYou points through bonus offers and spending. ThankYou points can be transferred to Turkish Airlines at a 1:1 ratio, so I had enough. I called Miles & Smiles customer service before transferring the points to confirm availability and possibly hold a reservation so that there would be enough time to complete the transfer. Unfortunately, we could not book the awards by phone, so I had to either visit a Turkish Airlines sales office or book by email. Since I live about three hours from the nearest office (at JFK), the only option left for me was email.\n\nI was skeptical about booking tickets through email, especially due to the time sensitivity of the process, but I was pleasantly surprised when I received a response from an agent a few hours after my initial email. The agent confirmed the availability of the requested seats, but could only hold them until the end of the day. I knew that transfers to Miles & Smiles are not instantaneous and sometimes take days to process, but luckily, the miles were in my account the next morning and I was able to book the tickets the same day.\n\nThe total cost: 60,000 ThankYou points plus $22.40 in taxes for four round-trip tickets to Lihue in July of 2020. The redemption value was incredible, as the cash cost of these tickets was more than $3,200! I was able to book our hotels using points as well: We will be staying five nights at the Hilton Garden Inn Kauai Wailua Bay (200,000 Hilton Honors points with the fifth night free) and three nights at the Grand Hyatt Kauai (75,000 World of Hyatt points). The combined cash cost of the two bookings is well above $4,000. We are all very excited and are currently planning our activities. Kauai, here we come!\n\nFor more TPG news delivered each morning to your inbox, sign up for our daily newsletter.\n\nYou have a variety of good options for booking award flights to Hawaii, including British Airways awards starting at 13,000 points each way from the West Coast, and increasing opportunities to use the Southwest Companion Pass as the airline continues to add service to the Hawaiian Islands. But the gem of the bunch is Turkish Airlines. In addition to economy awards for 7,500 miles each way, you can book domestic first-class awards for just 12,500 miles each way, which is less than many frequent flyer programs charge for economy flights on the same route. Both are incredible deals if you can find availability.\n\nThe upside of a good deal (and the downside of a bad one) compounds when you’re traveling as a family or in a group. The process for booking Miles & Smiles awards is more complicated than some, and depending on your other options, the savings might not justify the extra effort if you only need a single ticket. Multiply those savings by three or four people, however, and suddenly the extra effort becomes much more worthwhile. Just like going out of your way to maximize rewards earned, you should account for the value of your time and energy when you’re deciding how to redeem.\n\nRelated: The best way to fly with kids to Hawaii\n\nI love this story and I want to hear more like it! In appreciation for sharing this experience (and for allowing me to post it online), I’m sending Krzysztof a gift card to enjoy on future travels, and I’d like to do the same for you. Please email your own award travel success stories to info@thepointsguy.com; be sure to include details about how you earned and redeemed your rewards, and put “Reader Success Story” in the subject line. Feel free to also submit your most woeful travel mistakes. If your story is published, we’ll send you a gift to jump-start your next adventure. Due to the volume of submissions, we can’t respond to each story individually, but we’ll be in touch if yours is selected.\n\nSafe and happy travels to all, and I look forward to hearing from you!\n\nFeatured photo by M Swiet Productions/Getty Images.\n",
      "Folder": "Feedly",
      "Timestamp": "1574406801",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.355808Z"
}