{
  "id": "8b4f40b2b42b439290abe768bad047ff",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://ritholtz.com/2017/05/whos-afraid-amazon-9-surprising-retail-winnerstraditional-retailing-far-dead-judge-success-best-buy-home-depot-wal-mart-others/",
      "Title": "Barrons Who’s Afraid of Amazon 9 Surprising Retail Winners The Big Picture",
      "Selection": "Creative destruction has defined the retailing business since the moment after its birth. Today it bears the face of Jeffrey Bezos and the name Amazon.com, the internet-based retailer Bezos founded in 1994 that changed the way America shops, and even lives. As Amazon has grown into a behemoth, traditional retailers have been forced to adapt in radical ways. Many have failed, and the casualties are mounting by the day.\n\nBut don’t mourn yet for a sector still beloved by consumers—and one that still could offer potentially rich rewards for investors. You wouldn’t know it from last week’s cavalcade of dismal earnings reports from companies as varied as J.C. Penney (ticker: JCP), Office Depot (ODP), and http://ift.tt/1AEjI9f(M), or the widespread selloff in retail stocks, some of which have fallen as much as 50% in the past year. Yet nimble retailers such as Best Buy (BBY),Nordstrom (JWN), and Home Depot (HD), which have developed differentiated products and services, stand a good chance of prospering in coming years—and rewarding shareholders nicely.\n\nBarron’s has identified nine retail plays that could thrive in a marketplace growing more competitive by the hour. Also on our shopping list: Costco Wholesale (COST) and Wal-Mart Stores (WMT) in the big-box category;http://ift.tt/1M7Owzj (LOW) in home improvement; art-auction expert http://ift.tt/1rIs1X6 (BID); GGP (GGP), a mall real-estate investment trust; and Party City (PRTY), a party-goods supplier. (For more retail picks, see the Q&A with Dana Telsey.)\n",
      "Folder": "Feedly",
      "Timestamp": "1495645552",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.598716Z"
}