{
  "id": "8ca63ac6e38242dd8bca2bf3c9627f54",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/915988/take-it-from-khrushchevs-granddaughter-melania-trump-is-the-perfect-autocrats-wife/",
      "Title": "Take it from Khrushchev’s granddaughter Melania Trump is the perfect autocrat’s wife Quartz",
      "Selection": "There are many institutions of democracy that US president Donald Trump has attempted to undermine during his short time in office, including the judiciary and the independent press. He is governing by Twitter and by decree, like the budding autocrat he is.\n\nAs a former Soviet, I recognize these symbols of creeping authoritarianism. A first post-Soviet “tsar” of Russian democracy, Boris Yeltsin also chaotically ruled by decree, arguing that communists would undermine him and painting himself as the lone hero of the new Russia. Trump, who is eager to go it alone in his quest for the parochial and reactionary “America First,” fights not communism, but liberal democracy, with its foundations of shared responsibility.\n\nIndeed, Trump’s insistence on making “ultimate decisions” all by himself unite him with autocratic leaders who value personal rulings over general laws. In fact, his wife Melania Trump’s striking invisibility at White House events further underscores similarities between the 20th-century Soviet Union and America of 2017. Last month, during Japanese Prime Minister Shinzo Abe’s visit to the United States, Mrs. Abe had to tour the US Capitol alone, while Melania’s absence marked a dramatic break in the established political protocol. And in the first three weeks after the inauguration, even Melania’s official Twitter account, the preferred information medium of this whole presidency, posted just one tweet announcing her as the First Lady.\n\nOn Sunday, “hosting” the annual Governors Ball, she appeared robotic, barely present at the event that she had allegedly planned. In a statement (not a personalized welcome) she declared that the ball was about unity and not politics, a plan that got quickly derailed by her husband’s promise to undo the Affordable Care Act. Remember, at his press-conference a few weeks ago, Trump told us that one of her causes is to advocate for women. Yet at the ball he only welcomed “Governors, their wives and daughters.” He does know that women can be, and are governors, in the United States, right? Mrs. Trump isn’t responsible for the president’s words, but she clearly wasn’t consulted, either.\n\nAttending Trump’s address to Congress Tuesday, Melania served a similarly decorative purpose. Dressed in a $9,600 sparkling black outfit, she almost sleepwalked to her seat and remained still as a statue.\n\nIn an autocracy, institutions such as the FLOTUS position—not fully formal, yet relevant—are the easiest to undermine. In Russia—first a monarchy and then a communist dictatorship—where “unsharable” power of the leader has been personalized and centralized to an extreme, there was barely ever a true “first lady,” her very fate providing a symbolic commentary on the regime.\n\nJoseph Stalin’s Gulags—mass incarceration and prosecution of everyone suspected of opposing his personal power—were foreshadowed by the death of his wife, Nadezhda. Lacking a role to perform in the Kremlin’s politics, she committed suicide in 1932. According to a 1988 report in the New York Times, a Stalin biographer wrote that she killed herself ” after she spoke her mind about Comunist Party purges and the famine and was met by a flood of vulgar abuse from Stalin.”\n\nDuring the less repressive periods, such as Nikita Khrushchev’s post-Stalinism era or Mikhail Gorbachev’s perestroika, the first wives could enter the public stage. Khrushchev’s wife Nina, in her flowery dress that almost by design looked like a home gown, embraced a role of a “national mother.” She traveled with her husband abroad, delivering his message of “communism with a human face.” Three decades later, given her husband’s liberalizing reforms, Raisa Gorbachev finally seized a chance to transform the Russian first wife’s position into a real democratic institution of the first lady, publicly caring for causes such as education. Appearing an equal partner to the first Soviet president, she made Gorbachev’s reforms visible to the outside world.\n\nThe fragile institution, however, couldn’t survive Russia’s centralized system for long. With the collapse of communism, when Russia fancied itself a democracy in the early 1990s for Yeltsin and the early 2000s for Vladimir Putin, both presidents briefly attempted to support the first lady’s role. Their wives attended international meetings and accompanied their husbands to summits with world leaders. Putin’s (now former) wife Lyudmila even picked a cause—prison reform for incarcerated women. But her first lady star dimmed quickly. She herself explained that Putin, as a traditional man, expected his wife to stay home. Her fashion choices also didn’t lend credibility to the position—one time meeting with Great Britain’s Queen Elizabeth she sported a dramatically larger hat than that of the Queen. The ever image-conscious Putin decided that he was better off as a lonely crusader. Unceremoniously divorcing Lyudmila in 2013, he thus finalized his Kremlin-style bromance with Dmitry Medvedev, Russia’s puppet president from 2008 to 2012.\n\nIndeed, its flirtations with democracy notwithstanding, Russia is so patriarchal that even its de facto first lady is a man. Medvedev’s four years aimed to bring some civilizing influence to Putin’s tough-guy persona: he was to give the appearance of fostering modernization and encouraging economic reform, just as first ladies dole out cookies and make sure that cutlery is a match.\n\nEmulating the Putin-Medvedev dynamic, Trump—constantly concerned with appearing an ultimate macho-man—seemingly embraces and admires vice president Mike Pence more than he does his wife. Pence serves a clearer purpose for Trump, packaging the president’s megalomania into the palpable language of the Republican politics.\n\nSurely, American first ladies have not always had to be the wife of the president. The role of the White House hostess has been performed, well, not by another man, but by their daughters or cousins, as was the case of the 19th-century bachelor James Buchanan. In the modern incarnation of American democracy, however, the job requires a spousal touch. In recent decades, the East Wing has played an increasingly political role in support of POTUS.\n\nIn this White House, however, Trump’s eldest daughter Ivanka has been more prominently featured than Melania. Appearing with his wife in public, just like the patriarchal types of the old, Trumps shows little affection—rare holding hands or making other small gestures. The Trumps’ seemingly cool relationship presents no “sense of the person behind Melania’s Slavic mask.” Some say that this exported fashion model from Eastern Europe is “scared”; others suggest “she doesn’t want to be there” at all. All of this is projection. What is clear is that Melania’s role in the White House is to follow her master’s plan—to serve as a kept woman with a perfect posture, a poster image, a magazine cover, a billboard display.\n\nAs the objectified first lady, Melania is not designed to speak and function in public life. Even her fashion—monochrome outfits in jewel tones—betrays that overdressed Barbie nature. Hot pink or baby blue are sure signs of ambition, and yet ambiguity. Her now famous Tootsie-style pussy bow fuchsia outfit worn at a presidential debate last fall could have been a strong feminist and ironic rebuke of Donald’s “pussy grabbing” advances to women. Yet her fashion choice has only confirmed her traditionalism, her affinity with frilly fashions of the 1980s, when she was coming of age in a provincial communist town of Sevnica, Slovenia.\n\nEven Melania’s first lady “cause”—cyberbullying—is oxymoronic. How could she confront that problem when her husband is the US cyberbully-in-chief? Such Orwellian twists—war is peace and so on—are all in keeping with this aspiring autocracy.\n\nFrench philosopher Charles Fourier once noted that social progress is evaluated by the way it treats women. As such, the way that first ladies conduct themselves reflects more than just their personalities and values. As with Russian first wives, they symbolize the nature of the presidency.\n\nThe spectacularly fit Michelle Obama’s highly visible focus on health encouraged Americans to exercise and eat well; it prompted her husband to stop smoking and set an example for the nation. Hillary Clinton, filled with her own political ambition, brought discipline and force to her husband’s meandering and seductive style of leadership. To mark the new era of civil rights, Rosalynn Carter pointedly sat in on her husband’s Cabinet meetings. Jacqueline Kennedy, a fashion icon married to the most charming man on earth, famously redecorated the White House.\n\nAnd so Melania’s strikingly nonexistent White House life marks a dramatic departure from the institutional rules of American democracy—one of many such departures that have increasingly become the unfortunate hallmarks of this new administration. The position of the first lady, as Rebecca Mead notes in the New Yorker, is “inherently retrogressive.” But other presidential wives have tried to make the best of the role. Melania does not have such agency, precisely because this is a White House that does not value women at all.\n\nFollow Nina on Twitter. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1488658153",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.707881Z"
}