{
  "id": "8efafdf4a7d64f21a336fdd4a95cd39d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://blog.google/products/google-nest/how-google-helping-me-connect-family-year/",
      "Title": "How Google is helping me connect with family this year The Official Google Blog",
      "Selection": "In a normal year, my family would be planning for our 12-hour flight to South Africa, my home country, to see family for the holidays. But since we can’t do that this year, we’re trying to reimagine the usual gatherings and traditions—the same way we’ve already reimagined work, school, birthdays and other holidays.\n\nI’ve been thinking back to how we coped with lockdown in March and April, and using that to figure out how to close out the year. Like every other family with small children, I am not entirely sure how I managed it—and let’s be honest, most of the time I relied on pure survival tactics. But I also developed a range of new hacks and skills, making use of a few practical Google products. As we prepare to do it all again, with shorter days and colder weather, these are some of the lessons I’ll take with me:\n\nStorytime Hour with Granny comes with a free printout to color with each story.\n\nNear or far, loved ones can be close\n\nSo many families are dispersed across the globe. I live in the UK, but I’m originally from South Africa, and my family still resides there. I haven’t ever experienced what it’s like to have parents living nearby, but somehow during lockdown the thing I needed most was to have my mum there to lend a hand with the kids or just pop in for a cup of tea. My children were not in school, and I was managing a large project at work. To add insult to injury, my kids also openly admitted that my storytelling was just not up to scratch during our daily school lessons, and that they’d prefer to “hear from Granny, because she does the funny voices.”\n\nNecessity being the mother of invention, “Storytime Hour with Granny” was born. \n\nWe began a tradition of setting up a Google Meet every afternoon, so she could read a story to her grandchildren for an hour. We set up the call in Google Calendar, where it was easy for her to simply click on the Meet link, and for one precious hour, my children were transported to another place, mesmerized by old storybooks. (And I transported myself to my home office for some less mesmerizing but blessedly uninterrupted focus time while listening to questionable music and sipping coffee that wasn’t cold, for a change.)\n\nSometimes you need to consult the biscuit instructors. Yes, that is a job. \n\nCreate a class\n\nAs much as my kids loved the connection with their grandmother, they also needed to connect with their friends. My son is in his third year of primary school, so he’s not old enough to socialize virtually on his own. So I set up a weekly “class assembly” where he could connect with his peers, say hello and spend most of the hour pulling faces at each other. Using Google Meet on my laptop meant we could see all 30 kids and their parents joining from their homes. (Even if, at times, the camera was pointed towards the ceiling or only the top of a child’s head.) \n\nEach week we picked a different topic to talk about. When it was my turn, I hosted a banana bread-making class, where I asked the Google Assistant to pull up a simple recipe from YouTube that we could all follow easily. As a backup, the Google Assistant can quickly provide answers to questions such as “How many tablespoons is one cup?” (It was also helpful with the many other fundamental questions lockdown brings, such as “How many blues are there in the world?” and “What does a peregrine falcon sound like?” among others I needed reminding of, such as what day of the week it was.)\n\nBesides all the helpful features, Nest Hub Max can display a seemingly infinite carousel of photos.\n\nShare and display your photos \n\nAs my parents live far away, this year I have decided to gift them a Nest Hub Max for Christmas. I know my mum will keep it in the kitchen, which means she can watch YouTube videos, stream Netflix content, listen to music and make video calls on Google Duo, all while she’s preparing meals or having tea. It also means my parents won’t need to set up their laptop for Storytime Hour anymore; they can just dial in straight from this nifty device. \n\nBut the thing I’m most excited about is the Nest Hub Max’s photo frame feature. All grandparents love photos, but they seem to have taken on new significance in the absence of face-to-face visits—even the not-so-photogenic ones (and like many families who take photos on the fly, we have plenty of those action shots). And now my children won’t have to say, “Take a picture! Don’t forget to send it to Granny! Did you send it to Granny? You forgot, didn’t you?” Soon they’ll be able to automatically see and enjoy those moments in a shared photo album from Google Photos shown on the display, whether it’s that vacation we took to Croatia pre-lockdown, or a macro close-up of my daughter’s forehead. To enable this, all you need to do is set up the Nest Hub photo frame feature.\n\n“That’s a really great photo of your arm...or is that my arm?”\n\nHelp with bedtime\n\nWhen the days slip into more days that feel exactly the same as all the other days, creating a set daily schedule—especially for bedtime—has been key to helping my children settle down. I set up a Routine using the Google Assistant on a Google Nest Mini in the kids’ room. As they’re getting into their pajamas and bouncing off the walls, I say the command that, frankly, Mary Poppins would’ve been grateful for: \"Hey Google, bedtime.\" I’m given tomorrow’s weather forecast (informing us, almost always, that we’ll need to pack an umbrella) and any scheduled calendar events. It then sets an alarm for the morning and dims the lights, ready for story time. To help them nod off, it also plays relaxing sounds, turning the noise off automatically after an hour when they are hopefully sound asleep. This has really helped them adjust to their own rhythm at home, even if it doesn’t always go to plan—which, let’s be honest, is at least 50 percent of the time. But at least the chaos is accompanied by the lulling background noise of crashing waves.\n",
      "Folder": "Feedly",
      "Timestamp": "1607199695",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.265226Z"
}