{
  "id": "8f2b2c249ef248c8833f2e3765b86717",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://skillet.lifehacker.com/these-cheddar-biscuits-are-better-than-red-lobsters-1829391921",
      "Title": "These Cheddar Biscuits are Better Than Red Lobster's Skillet",
      "Selection": "Unless you are devoid of tastebuds and a heart, you probably love a bread basket. A good complimentary bread, served before the meal, does more than whet your appetite; it breeds loyalty. Case in point: I will go to Red Lobster. Those cheesy, salty, aggressively seasoned Cheddar Bay Biscuits are worth the trip to the seafood chain, but you can actually make them at home, and you can make them better.\n\nJust as there are ‘process’ killers and ‘product’ killers, I like to think that there are process…\n\nRead more Read\n\nIf you need ‘em quick and dirty, there is a Red Lobster branded mix. I have nothing against a mix, but I was curious if the convenient, just-add-water route was the way to go. Would the mix produce a biscuit worthy of the Red Lobster name? Or was there an even better, homemade biscuit recipe to be found on the internet?\n\nAs we found with our brownie taste test, homemade is not always better, but I figured these cheddar drop biscuits from Queen Martha were a good place to start, comparison-wise. First, I made the mix. It was simply a matter of adding water and cheese, mixing until a shaggy dough just formed, and dolloping out 1/4-cup portions onto a parchment lined baking sheet. I baked them until they were golden brown, then brushed them with a mixture of butter and whatever was in that mysterious seasoning packet.\n\nThey certainly looked the part and, when fresh out of the oven, they tasted pretty much exactly like the biscuits you would get in a Red Lobster franchise. The box stresses that one should consume them immediately, and after they cooled, I understood why. Once the biscuit turns room temperature, the flavors become muted, the texture gets rather cake-y, and—if you eat more that one—a headache sets in. (At least that’s what happened to me.) If you needed a quick trip to Cheddar Bay, and were confident in your ability to quickly eat several biscuits before they cooled, this box mix is not a bad choice.\n\nBut for just a little more time and effort, you can have a much better, butterier, more cheese-forward biscuit. I did not need 16 biscuits, so I halved Ms. Stewart’s recipe. If you also wish to make eight cheesy, buttery, clouds of joy, you will need:\n\n1 cup all-purpose flour\n\n1 teaspoon baking powder\n\n1/4 teaspoon baking soda\n\n1/2 teaspoon white sugar\n\nPinch of cayenne pepper (I did not halve her original measurement, which was a pinch.)\n\n3 tablespoons cold butter, cut into pieces\n\n3 ounces shredded sharp cheddar\n\n1/2 cup + 2 tablespoons buttermilk\n\n1 1/2 tablespoons chopped chives\n\nWhisk all of the dry ingredients together, then work the butter in to the mixture with a pastry cutter or your hands, until the butter is fully incorporated and “pea-sized lumps remain.” Add the cheese, buttermilk, and chives, and stir until everything is just combined. Dollop out 1/4-cup-sized portions onto a parchment lined baking sheet, and bake for 15 minutes at 425℉, until the biscuits are golden brown.\n\nThey’re just cheesier!Photo:  Claire Lower\n\nThough Martha did not say to do so, I brushed these babies with a mixture of 2 tablespoons melted butter, one teaspoon of garlic powder, and one tablespoon of chives. This was a good call on my part. These were, in a word, transcendent when they first came out of the oven. They didn’t quite achieve the height of the box-mix biscuits, but I was too focused on the flavor to care that much. Though the boxed-mix biscuits were borderline uncanny in their likeness to those found in Cheddar Bay, their beauty faded in mere minutes, and they just didn’t taste as gloriously cheesy and buttery as Martha’s. (As a self-identified Cheddar Goblin, cheesiness is important.)\n\n The cheddar in these carby wonders had poked out here and there, forming wonderful little Frito-like bits around the biscuit. That, coupled with the flavor of real chives and tangy buttermilk made these some of the best drop biscuits I’ve ever had. (They were also still tasty the next morning, which is another thing that is important to me.)\n",
      "Folder": "Feedly",
      "Timestamp": "1538205290",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.472873Z"
}