{
  "id": "90108db586ff402e96cfd701da283710",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/24489-best-cookbook-recipes-food52",
      "Title": "Your 22 Favorite Recipes (Ever!) From Food52 Cookbooks Food52",
      "Selection": "Food52 is 10 years old! To celebrate a decade of all things kitchen and home, we're rolling out our top recipes, tips, and stories for another victory lap, along with some of our very favorite memories over the years. Go on, take 'em in!\n\nWhere would we be without cookbooks? Our favorites, new and old, occupy several shelves in our kitchen and form towers on our nightstands. Our cookbooks teach us countless skills and techniques that we use nearly every day. Cookbooks inspire us to roll up our sleeves and try new recipes, as they become increasingly dog-eared, sauce-stained, well-loved in the process. Our co-founders, Amanda Hesser and Merrill Stubbs, first met while researching and writing the Essential New York Times Cookbook. Yes, that's right—because of cookbooks, Food52 was born!\n\nAnd here we are, ten years later, still reading and cooking and learning from our cookbooks. We put on an annual tournament of cookbooks to find the year's very best one. We've even whipped up some cookbooks of our own (eleven, in fact!), gathering together our favorite recipes from Food52ers of all stripes: community members, columnists, and a few veritable Geniuses.\n \nSo to ring in our big tenth anniversary, we're looking back at all the books we've brought into the world, and recalling some of the most beloved recipes from each volume. These are the ones you've rated and reviewed the most on Food52, or cooked at home and showed off on social media.\n \nWe'll sprinkle in some of our favorite behind-the-scenes moments from along the way, too: photographs and stories, pivotal lessons learned, and all the ways the books (and we!) have grown. We'll also share with you a sneak peek of our forthcoming cookbook, Dynamite Chicken, which you can pre-order, well...now!\n\nBuckle up, because it's time for a brisk stroll down memory lane.\n\nThe Food52 Cookbook, Volumes 1 & 2\n\nTo know our first cookbooks is to know the backbone of Food52: our recipe contests. Held weekly, to start, then eventually monthly, and now quarterly, our contests helped make Food52 a gathering place for the very best home-cooked recipes, passed along from cook to cook.\n \nOur first cookbook, The Food52 Cookbook, Volume 1, celebrates this important part of Food52’s history, featuring 140 seasonal recipes that are also all previous recipe contest winners. And in addition to the recipes, the book includes profiles of community members, tips, and stories from Amanda and Merrill, and behind-the-scenes photos of the making of each dish.\n \nIn the follow up, The Food52 Cookbook, Volume 2, we published 75 all-new contest-winning recipes from our community, including even more context, tips, and tricks, plus illuminating background stories.\n\nAmanda and Merrill sifting, stirring, and testing contest recipes.  \n\nThe Most Popular Recipes From 'The Food52 Cookbook, Volumes 1 & 2'\n\n1. Secret Ingredient Beef Stew\n \nHundreds of you have made this hearty beef stew and told us how much you love it. Rather than a single \"secret ingredient,\" a \"complex mix of components\" makes this dish sing: tomatoes and tomato paste, diced vegetables, red wine and vinegar, and anchovies (the \"secret\" that takes it over the top). Amanda and Merrill recommend using richly marbled chunks of beef for the best flavor and texture.\n \n2. Double Chocolate Espresso Cookies\n \nThese bittersweet, deeply chocolatey cookies are great for grown-ups and kids alike; just don't munch on them too close to bedtime. They're crisp on the edges and chewy in the middle, with chunks of melty chocolate throughout, aka the perfect cookie. From one community member (and lucky haver of these cookies): \"Wow, wow, wow. This is the best chocolate thing I have ever made.\"\n \n3. Short Rib Ragu\n \nIn this umami-packed stew, tomato paste, anchovies, and porcini mushrooms are cooked down with wine, and in go several pounds of short ribs. The meat cooks for hours in a Dutch oven (hint: your slow cooker or Instant Pot work well here, too) until it becomes fall-apart tender, then it's topped with a zingy, herby gremolata before serving. This ragu is wonderful over pasta and polenta, or with a side salad and a big glass of red wine.\n \n4. Burnt Caramel Pudding\n \nThis rich, egg-thickened custard from community member Midge has just five ingredients, but the finesse in treating each ingredient elevates the dish to \"dinner-party fare\": First, cook down sugar until it becomes a dark amber color, then add in cream to make a caramel. After that, gently heat egg yolks to temper them, incorporate the caramel you've just made, and bake it off in a water bath to create a silky, utterly delicious pudding.\n\nGenius Recipes: 100 Recipes That Will Change the Way You Cook\n\nHere’s the cookbook that changed everything, based on our beloved, long-standing, and award-winning Genius Recipes column by Creative Director Kristen Miglore. It also kicked off an exciting new chapter of our cookbook series.\n \nGenius Recipes: 100 Recipes That Will Change the Way You Cook is packed with the smartest, most influential recipes of our time—many of which the Food52 community brought to us!—and our cooking is all the better because of it. A good number of you thought so, too, helping the book to become a New York Times bestseller.\n \nThe lessons we've learned from the book are manifold: how to amp up a humble fried egg with a touch of wine vinegar in the pan; how to make the creamiest vegetable soup without a lick of cream; and how to make the tastiest (and most interesting) kale salad we've ever tried.\n \nBut on top of all the nuggets of cooking wisdom, we learned so much about how to make a book extra beautiful—mapping out all the photos, side-by-side like the pros, and lovingly fussing with a plate of spaghetti until it looked just right.\n\nThe Most Popular Recipes from 'Genius Recipes'\n\n5. Marcella Hazan's Tomato Sauce With Onion & Butter\n \nKristen's said that this Genius sauce is the reason she started the column (and proudly on the cover of the book!), and boy, are we glad this recipe came her way. Hundreds of Food52ers have made, reviewed, and cherished this sauce, likely because of its simple ingredients, straightforward technique, and incredibly delicious, versatile results.\n \n6. Nigella Lawson's Dense Chocolate Loaf Cake\n \nRichly chocolatey? Check. Delightfully squidgy? Check. Easy as can be? Most certainly, check. Additional things to describe it: \"extraordinarily moist,\" \"a cross between a cake and pudding,\" and \"fudgy and delicious.\" If that doesn't convince you, we're not sure what will.\n\nBaking: 60 Sensational Treats You Can Pull Off in a Snap\n\n exclusive \n\nFrom Our Shop\n\nSigned Copy: Food52 Baking Cookbook\n \n $23–$46 \n  More Options  Shop Now \n\nFor our next book—this time, a single-subject volume focused on baking of all stripes—we turned to our community again for the recipes (get to know all those contributors here), picking some of the most iconic baking recipes on Food52.\n \nIn this collection of 60 recipes, savory and sweet, we wanted to put together a \"handbook on back-pocket, anytime baking,\" helping baking experts and \"non-bakers\" alike see that homemade treats needn't just be reserved for special occasions. You won't have to get your hands on any special equipment or ingredients for the recipes in this book; in fact, a good number of them just call for a mixing bowl and a big wooden spoon.\n \nAnd on top of all the recipes, we sprinkled in a host of helpful tips, tricks, and baking basics: how to accurately measure flour, how to keep brown sugar soft, how to assemble and frost a cake, and more.\n \nFor a little behind-the-scenes action, take a look at our photographer James Ransom's favorite photos in the book, and check out the story behind the deliciously chocolatey magic espresso brownies on the cover, from community member ChefJune.\n\nThe Most Popular Recipes from 'Baking'\n\n7. Chocolate Dump-It Cake\n \nThis cake, originally from our co-founder, Amanda Hesser's mother, Judy, captures the true essence of this baking book: It's got a short and super-simple list of ingredients, requires just a little bit of elbow grease, and the results are rich, intensely chocolatey, and absolutely stunning. You can find it in the \"Everyday Cakes\" section in our Baking cookbook, but, hot tip: It makes for a great breakfast, straight out of the fridge. We guarantee it.\n\n8. Peach Tart\n \nThis minimalist peach tart, also by Judy Hesser via Amanda, has earned a cult following on Food52 (almost 500 of you gave us your thoughts about it!). The simplest-as-all-heck crust, made with oil, flour, sugar, and salt, gets pressed into a tart pan and layered with ripe summer peaches. Cover the whole thing in a pebbly, buttery streusel mix, and you have one of summer's greatest (and least fussy) desserts.\n\nVegan: 60 Vegetable-Driven Recipes for Any Kitchen\n\n exclusive \n\nFrom Our Shop\n\nSigned Copy: Food52 Vegan Cookbook\n \n $23–$46 \n  More Options  Shop Now \n\nReleased in tandem with Baking, we set out on a similar aim with our next single-subject book, on vegan cooking: We wanted to show the world that plant-based meals are extremely delicious, and anyone can make (and love!) them. And we could think of nobody better to help us with this than Gena Hamshaw, cookbook author, nutritionist, recipe developer and food blogger, and columnist of the ever-popular New Veganism column on Food52.\n \nIn this book, Gena brought us 60 super-flavorful plant-based recipes, plus a wealth of tips on vegan cooking and eating. She showed us how to thrive by harnessing fresh, seasonal produce, supplementing with tofu, nutritional yeast, and cashew cheese (we're obsessed with it now, because of her).\n \nBy reading and cooking from this book, we became much savvier plant eaters (though we may have burnt a few sweet potatoes along the way...just like in the photo below). And by testing hundreds of recipes for it, Gena said she, too, became a better home cook.\n\nThe Most Popular Recipes from 'Vegan'\n\n9. Vegan Lentil Sloppy Joes\n \nWe'll leave it to Food52er Liesje to extol the virtues of this take on Sloppy Joes: \"As a vegan, I love hearty meals that evoke memories without trying to mimic meat. This recipe is loved by me and my omnivore guests too.\" It's cheap and cheerful, super-filling, and nutritious, too.\n \n10. Vegan Date Nut Bread\n \nThis date-nut bread does it all: It's fluffy, nutty, a little spicy, and sticky-sweet, and ready to be your breakfast or afternoon snack anyday. Better yet, it's a one-bowl recipe with ingredients you very likely have in your pantry at this very moment.\n\nA New Way to Dinner: A Playbook of Recipes and Strategies for the Week Ahead\n\n exclusive \n\nFrom Our Shop\n\nSigned Copy: A New Way to Dinner, by Amanda Hesser and Merrill Stubbs\n \n $35 \n Shop Now \n\nAnyone who knows our co-founders, Amanda Hesser and Merrill Stubbs, knows that they are very busy people. But anyone who knows Amanda and Merrill knows, too, that they are master meal planners. You may be wondering: How do they make it work? Us, too. The answer: a little resourcefulness, a little ingenuity, and an arsenal of versatile, adaptable, stretch-them-for-the-whole-week recipes.\n \nLuckily for us, A&M shared their skills in our next marquee cookbook, A New Way to Dinner, a treasure trove of seasonal menus, recipes, strategies, and shopping lists, that'll let you eat well (and stress-free) for the whole week.\n \nIt goes without saying that we learned a thing or two (or a hundred) from A New Way to Dinner: Prep and cook all your fresh produce on Sunday, ahead of the week, and it'll never go to waste. A good, zingy green sauce can always transform a meal. An up-turned casserole dish with parchment on top makes a fine baking sheet stand-in. Slow-cooked pork shoulder can be used a zillion ways. The list goes on.\n\nThe test kitchen cooking something spicy while photographing 'A New Way to Dinner.' Photo by Kristen Miglore \n\nIncorporating playful props in the photo shoot.  Photo by Kristen Miglore \n\nThe Most Popular Recipes from 'A New Way to Dinner'\n\n11. Baked Pasta with Chicken Sausage\n \nInspired by the very Genius baked pasta from Al Forno in Providence, RI, this baked pasta can be made ahead and baked off when you're ready to eat, and it feeds a crowd. It can also be riffed dozens of ways, with different types of sausage or ground meat, vegetables of all sorts, and, of course, any melty cheese you like best.\n \n12. Chicken Fingers\n \nThese oven-baked chicken fingers are a Food52 favorite for a reason. Not only are they dang delicious, they can be repurposed in seemingly infinite (okay, at least eight) ways: chicken Parmesan, chicken Caesar salad, chicken subs, chicken ramen, chicken enchiladas...the list goes on.\n\nMighty Salads: 60 New Ways to Turn Salad into Dinner\n\n exclusive \n\nFrom Our Shop\n\nStamped Copy: Food52 Mighty Salads\n \n $23–$46 \n  More Options  Shop Now \n\nWe love salad. Seriously! And we especially love bountiful, inspiring, stick-to-your ribs salad. That's why for our next single-subject book, we put together a collection of our kinds of salads, with the help of longtime Food52er and salad whisperer, EmilyC.\n \nTurns out, our kinds of salads are chock-full of grains, beans, cheeses, meats, and crispy-crunchies of all sorts. Some have leaves, and some don't. Many can be made ahead, tasting even better on days two and three. All of them have serious personality, and more importantly, staying power. All of them make room to play and riff, and virtually none of them are possible to mess up.\n \nIn addition to the recipes, the book includes our cleverest salad tips and tricks, and 50 (!) flavor-packed dressings and vinaigrettes. (And speaking of dressing, here's our little hack for making it gleam and glisten on camera.)\n\nThe Most Popular Recipes from 'Mighty Salads'\n\n13. Petits Pois À La Française Redux\n \nHello, Cover Girl! This recipe, which is featured on the cover of Mighty Salads, is also a favorite amongst the Instagram community, likely because of its beautiful green hues and (optional, but not really) jammy eggs. Delicate peas, crispy bacon, and charred scallions and Romaine lettuce come together with a creamy, tangy buttermilk–crème fraîche dressing, to create a \"understated at first, then surprisingly interesting and completely irresistible\" dish.\n \n14. Grilled Peach And Apricot Salad\n \nThis recipe is also an Instagram favorite. It's got a bit of everything: sweet and smoky grilled peaches and apricots, salty cured prosciutto, funky, creamy goat cheese, and sturdy Tuscan kale. It's one of the main reasons we can't wait for stone fruit season each year.\n\nIce Cream & Friends: 60 Recipes and Riffs\n\n exclusive \n\nFrom Our Shop\n\nSigned Copy: Food52 Ice Cream & Friends\n \n $23–$46 \n  More Options  Shop Now \n\nWhat do salad and ice cream have in common? 1) We really love them. 2) They're equally easy to make. 3) They're both subjects of our companion single-subject cookbooks, released on the same day. That's right! Along with Mighty Salads came Ice Cream & Friends, because balance.\n \nIn this collection of 60 recipes—some from our community archives, and some from ice cream master, Cristina Sciarra—we set out to debunk the mysteries of ice cream (and its other frozen friends) in an approachable, straightforward, and down-right delicious way.\n \nLike our baking book, we wanted to make sure the recipes were, first off, delicious, and second, gadget-and gizmo-minimal, so pretty much anyone could get churning at a moment's notice. We also gave a whole mess of ideas for homemade toppings and riffs, because ice cream can always use a, well, friend.\n \nAnd as we put together the book, we discovered that ice cream is simply swoon-worthy (no surprises there), and actually fairly agreeable to photograph (with a few expert tips, of course).\n\nTasting burnt toast ice cream for the first time. Photo by Kristen Miglore \n\nThe Most Popular Recipes From 'Ice Cream & Friends'\n\n15. Malted Vanilla Ice Cream With Chocolate-Covered Pretzels\n \nThis is the pinnacle of ice cream: crunchy, salty-sweet, chocolate-y, and with an incredible depth of flavor because of the malt. A secret ingredient in the ice cream base makes it a churn like a dream, and keeps it from freezing too hard. Can you guess what it is?\n \n16. Saltine Cracker Brownie Ice Cream Sandwich\n \nWhat's better than an ice cream sandwich? A brownie and saltine cracker ice cream sandwich. And even better than that? When shortcut no-churn ice cream nestles between those very layers.\n\nAny Night Grilling: 60 Ways to Fire Up Dinner (& More)\n\nGrilling can be a bit intimidating. But it doesn't have to be! With a little know-how and advance planning, you can fire up a meal in no time. And who better than cookbook author, Texan, and ultra-chill griller Paula Disbrowe to show us the way?\n \nThanks to Paula, our next single-subject book was possible. Because of her—and Any Night Grilling—we now know how to get coals going in the blink of an eye, marinate before work to grill right on cue for dinner, and even make a cheeky, smoky cocktail to go with our meal. We also have 60 stellar recipes to cook over charcoal.\n \nPaula's given us all the classics we know and love, like hot dogs and juicy burgers, but has also shown us how to make freshly grilled magic from those humblest of foods, grilled bread and boneless, skinless chicken breast. And if we want to grill in the wintertime, or when the weather's not quite right, Paula's got us covered there, too.\n\nThe styling team getting the lighting *just* right Photo by Alexis Anthony \n\nProp stylist, Amanda Widis, picking the perfect set of utensils. Photo by Alexis Anthony \n\nThe Most Popular Recipes From Any Night Grilling\n\n17. Party Wings With Cholula Butter\n \nCrispy, meaty, sticky wings are the quintessential party snack. Even better when they're coated in smoky-spicy Cholula hot sauce after a trip to the grill, and a dunk in butter. These wings are a little different than your usual sports-bar fodder: Their skin is perfectly charred and crunchy, their insides are tender and light, and they're a little messy to eat, sure, but not greasy in the slightest.\n \n18. Cauliflower Steaks With Green Harissa\n \nYep, vegetarians can and should grill, too, and this impressive-as-heck cauliflower steak proves it. The deeply charred, extremely flavorful green harissa that accompanies—made of grilled tomatillos, onions, serrano chiles, and a ton of herbs—is a play on a green sauce served at Los Angeles' Gjusta. Use any leftovers for your sandwiches, eggs, and roast chickens abound.\n\nGenius Desserts: 100 Recipes That Will Change the Way You Bake\n\n exclusive \n\nFrom Our Shop\n\nSigned Copy: Genius Desserts, by Kristen Miglore\n \n $35 \n Shop Now \n\nAfter publishing 100 recipes that changed the way we cooked, Kristen knew we needed to show our baking a little love, too. So she put together 100 more life-changing recipes in the follow-up volume—this time, entirely desserts. Best of all? The Food52 community played a huge part in helping her find those little-known gems.\n \nAside from learning that you can put a whole orange in a cake, and that the best tool for this 2-ingredient dessert is...a potato (yes, really), Kristen also learned a whole lot about cooking in general, and about life itself.\n\nThe Most Popular Recipes from 'Genius Desserts'\n\n19. Ovenly's Secretly Vegan Salted Chocolate Chip Cookies\n \nNo butter? No eggs? No milk? No problem. The smartypants bakers at Ovenly discovered a way to make chewy-middled, crispy-edged chocolate chip cookies, leveraging just oil and water for moisture. These cookies taste better the longer you rest them—don't skip this step, as it makes them truly worth the wait.\n \n20. Maialino's Olive Oil Cake\n \nHow do we love thee, olive oil cake? Let us count the ways. This is truly the cake to end all cakes—rich, custardy, and pleasantly nutty from the olive oil. Top it with slow-roasted strawberries, and you have yourself a dessert that's mighty genius.\n\nDynamite Chicken: 60 Never-Boring Recipes for Your Favorite Bird\n\nWhat's for dinner tonight? If you're anything like us, the answer is probably \"chicken.\" Yep, this protein is our dinner mainstay for a reason: It's the ultimate blank canvas, taking on the flavors of any punchier companions we pair with it. But chicken's blessing is also its curse—it can get a little one-note, fast. We wanted to make sure that never happened again.\n \nThat's why we teamed up with chef and writer, Tyler Kord, to give you 60 totally not-boring, totally delicious recipes for our very favorite bird. In Dynamite Chicken, which comes out on October 8, Tyler's given us weeknight recipes and more ambitious weekend projects; party chicken and chicken to eat when we're feeling a little blue; and, perhaps most importantly, chicken that even the pickiest kids will love.\n \nTyler's also taught us how to break down and spatchcock a whole chicken, and how to cook it in a number of super-versatile ways. And throughout, his friendly voice confidently guides us—and makes us belly-laugh.\n\nCitrus-roast chicken, ready for roasting.  Photo by Brinda Ayer \n\nChicken pizza: Before and after.  Photo by Brinda Ayer \n\nThe Most Popular Recipes From 'Dynamite Chicken'\n\n21. Broiled Chicken Thighs With Plum Tomatoes & Garlic\n \nInspired by our co-founder, Merrill's, Braised Chicken Thighs With Plum Tomatoes & Garlic, this winning weeknight dish couldn't be simpler: Pile up juicy plum tomatoes, lots of garlic and fresh thyme, and bone-in, skin-on chicken thighs onto a sheet pan, then roast in a hot oven and broil it right at the end. The result? Crisp chicken skin, juicy dark meat, and a charred tomato–thyme sauce that's best sopped up with crusty bread.\n \n22. Roast Chicken with All of the Vegetables in Your CSA\n \nOkay, so this isn't technically a Food52-favorite recipe (at least not yet), because it's brand-spanking-new to the site. Hooray! Here's an exclusive peek at our newest book, and a chicken dish that's sure to join your regular weeknight rotation this season. All you have to do is quarter a whole chicken (or buy it in quarters), season it simply with salt and pepper, and toss it in a pan with your favorite seasonal vegetables. The coolest part? You'll stagger the veg based on their cooking times, just chucking them in the same pan as the chicken. And you'll end up with tender, juicy chicken and perfectly cooked vegetables, right in time for dinner.\n\n Which Food52 cookbook, past or future, is your fave? Let us know in the comments. \n",
      "Folder": "Feedly",
      "Timestamp": "1568177366",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.346942Z"
}