{
  "id": "9074811d3149449aa5f7c6a6aa4980a7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.artofmanliness.com/2017/05/17/phone-skype-interview-tips/",
      "Title": "How to Ace Your Next Phone or Skype Interview The Art of Manliness",
      "Selection": "Before you ever get the chance to extol your virtues to a potential employer during an in-person interview, it’s likely you’ll have first answered some questions over the phone or via Skype (or other video software). It’s easier for all parties, especially for the first round when you’re really just trying to feel each other out.\n\nIt can be easy to be less prepared for these types of interviews — they just don’t feel like they carry the same weight as meeting someone face-to-face. But taking a lax approach would be a mistake. In many ways, this first impression is more important, because it’s just that — a company’s first impression of the kind of employee you’d be. You’ll never make it deeper into the hiring process if you’re stopped at the gate.\n\nIn general, you want to prepare for these interviews just as you would the in-person variety: go into it knowing how to tell your career story in just a couple minutes, explain unconventional aspects of your resume, answer behavioral questions — that sort of thing.\n\nTo get you started, here are a few articles we’ve done about job interviews:\n\nHow to Control a Job Interview\n\n10 Questions to Ask in a Job Interview\n\nHow to Ace a Job Interview\n\nHow to Prepare for and Rock a Behavioral Job Interview\n\nHow to Talk About Your Unconventional Background\n\nBe sure to read up on those, as I’m not going to cover all the general basics of interviews below. Rather, while I’ll take you through some classic interview tips, they’ll be focused specifically on the context of handling a phone and/or video conversation.\n\nTips That Apply to Both Phone & Skype Interviews\n\nChoose a Quiet, Reliable Location\n\nStick to your house for phone and Skype interviews. Don’t try to do it at a coffee shop; that’ll annoy both the interviewer (background noise can make it hard to hear you), and the other coffee shop patrons as well. Plus, you just aren’t in control of your environment. The crashing sound of someone spilling a drink nearby can throw you off your game.\n\nOf course you want to choose a place with reliable cell service and/or internet. If your home office is in the basement, but you don’t get good cell service down there, head upstairs. For a phone call, your parked car can even work great (so long as you aren’t in a parking garage, where cell service is always spotty). If you know there’s a corner of the house where the wifi is spotty, best not to head there for your video chat.\n\nAnd if your own abode doesn’t work, ask a friend or family member if you can steal a room for 30-60 minutes.\n\nOf course, don’t do the interview at your workplace, and especially not on company time!\n\nThere are additional location considerations when video chatting, which I’ll cover in more detail below.\n\nDress & Groom Appropriately\n\nThis is obvious if it’s a video interview — you can’t look like a schlub in front of an interviewer. On the phone, though, you might be tempted to rock some sweats and not bother with combing your hair. I don’t recommend that.\n\nRather, whether the interview is on the phone or over video, dress and groom just as you would if it was an in-person meeting. It gets you in the right mindset for the position you want to hold. If you go through the routine of getting ready for an interview, you’ll jump into things as if you were right in the interviewer’s office. That time spent getting ready even serves to allow you to rehearse things in your mind versus sitting on the couch watching TV right up until it’s time for the interview. Your head just won’t be in the game in the same way.\n\nSo shower, shave, and even for a phone interview, throw on a decent outfit. For a video chat, you’ll want to dress one notch up from the position you’re applying for, which often means donning a shirt and tie or a suit. (And no, don’t wear a nice top while in your underwear; what happens when you unexpectedly need to get up to grab something?)\n\nBe On Time\n\nFor an in-person interview, showing up 15 minutes early is on-time. You don’t want to be flying in the doors right when the interview is supposed to start.\n\nFor phone or Skype interviews, the rules are a little different. While you don’t want to call 15 minutes early, you should be at your desk and ready to go at least that much time in advance. Check your cell service, internet connection, etc. You also want just a few minutes to get in the right mindset, look over your resume and cover letter one last time, have a sip of water, etc.\n\nAlso be sure you’ve nailed down details of who’s calling who. You don’t want your potential employer waiting for 10 minutes just because you were supposed to dial in to a conference line and you’ve been sitting there staring at your phone.\n\nSpeak Clearly and Enunciate\n\nWhile you want to do these things in person too, they’re even more important with a phone or video interview. Speak a little more loudly than you normally would, a little more slowly, and really focus on enunciating your words. You know how it goes on the phone or over Skype — even with the best connections things are easily muddled or missed and an “I’m sorry, what was that?” is almost inevitable. Reduce those awkward exchanges as much as possible.\n\nHone in On Non-Verbal Cues\n\nMuch of conversation happens through our body language — the gestures we make, facial expressions, even minor shifts in how we’re sitting. Those are obviously entirely absent in phone calls, and harder to read in video interviews. So you really have to pay extra attention to things like tone of voice and subtle changes in inflection to know when to chime in with an answer, or even just to give an affirmative “Sure” or “Yeah, that makes sense” to show that you’re listening attentively. Better, in my opinion, to speak up a little too much versus sitting silently for too long and letting the interviewer wonder if you’re paying attention.\n\nIn general, you do this simply by practicing. When on the phone with other people, really practice active listening. Nod your head even though they can’t see you and offer short phrases to show you’re listening (as mentioned above). If you’re in the process of interviewing for jobs, make it a habit to pick up the phone a little more just so you can get comfortable with it. Call your friends, your parents, the local Thai place (rather than ordering online), etc.\n\nYou’ll then carry these practices over to when you’re on a phone call where a prospective employer, and the future of your career, are on the line.\n\nBe Prepared for Some Small Talk\n\nIn a phone interview you’re often speaking with someone from HR or a hiring manager — not necessarily the person who will be your supervisor or team leader. You usually only meet those folks in person and in follow-up rounds of interviews. Phone/video interviews are generally meant to be introductory — they’re just trying to get to know you, get a feel for what you’re like, etc.\n\nWith that, you’ll often have some small talk at the start as a sort of test to see how you handle a new situation and new person. So be prepared to have some friendly topics at hand to discuss for a few minutes. (This is especially true for when you’re going to be talking to more than one person; sometimes the second person is late in getting on the line, and you’ll need to banter with the person who’s present until they do. If you’re not ready for small talk, the silence will quickly get awkward.)\n\nNow, this small talk exchange is trickier than with an in-person interview because you’re not likely to be in the same locale. Talking about the beautiful spring weather or the local sports team isn’t going to work necessarily. So find out where your interviewer is located, and do a quick search of their local news to see if anything would be worth talking about.\n\nSay you’re interviewing for a job in Seattle but you’re in the Midwest. It’s easy to find out that Seattle has had record rainfall this winter and spring, so you could say something like “I’ve read that your area has been deluged with rain this season; I bet you’re ready for summer to make an appearance.”\n\nIf you don’t know much about the weather where they are, you can always ask if it’s been hot, cold, warming up, cooling down (depending on the season).\n\nYou could also focus on industry small talk. In the tech world? Discuss some of the new iPhone rumors — there’s always some of those out there, no matter the time of year. In publishing? Bringing up a new book you recently read and loved is always a safe bet. (Actually, that one applies to most industries!)\n\nIf the interview takes places around a holiday, you can ask if they plan on/did anything fun or traveled for it.\n\nAnother option is to look them up on LinkedIn or Twitter — see if they’ve been to a recent conference that you also attended: “I noticed from LinkedIn that you went to ‘X’ Conference this year. I was there too; who was your favorite speaker?” Did they tweet out an article recently? Read it, then be ready to talk about it with them.\n\nSit Up Straight\n\nSitting up straight isn’t just for mental professionalism; it projects your voice better and helps you sound more confident by opening up your airways. If you’re lying down or even just hunched over, your body is compressed, and your voice will give that away.\n\nSmile\n\nYou may think your voice sounds decently friendly and animated when you’re talking to someone by phone or Skype, but it may not sound that way to the person on the other end. When we’re disconnected from an actual human — even if it’s a video interview — it’s just harder and not as natural to smile and project warmth; your voice may come off flat, or even crabby.\n\nTo up the warmth you convey via technology, smile while you talk, especially right away at the beginning of the call when you’re introducing yourself. Smiling makes your voice and demeanor exude a friendlier vibe. Plus, it’ll make you feel calmer; research shows that smiling during stressful activities, even if it’s fake, decreases your heart rate and stress level.\n\nTips Specifically for Phone Interviews\n\nWalk around and make gestures (especially if you’re nervous). Studies have found that when your arms and hands are constrained while you communicate (like when you put your hands in your pockets), you feel more nervous and use more language fillers (like “umm”). This is because you’re unable to gesticulate and thus are less confident your message is getting across. So even though the person you’re talking to on the phone can’t see your body language, gesticulate anyway to make yourself feel better.\n\nWalking around seems to help loosen you up as well, and can make you feel, and sound, more dynamic. Pace around slowly, of course; you don’t want to stride so vigorously you become out of breath!\n\nLook in the mirror as you talk. As mentioned above, part of what makes phone calls awkward is that you can’t see the facial expressions the other person is making as you speak. Looking at yourself in the mirror can help lessen this effect; rather than talking into an empty abyss, it tricks your brain into thinking you’re talking to another human face-to-face and may help you speak more confidently.\n\nAs a bonus, the aforementioned studies on forced smiling showed that its happiness-inducing effect is increased when you watch yourself grin in the mirror.\n\nTips Specifically for Skype/Video Interviews\n\nLocation, location, location. When doing a video interview, you of course want to choose a location that looks good as a background. Your home office is great. Dining room works. Messy bedroom? Not so much.\n\nAlways test your location well before the interview. Have a Skype chat with a friend and ask them if anything looks weird or distracting in the background. Do your best to mitigate anything in your environment that could be a distraction.\n\nAlso be sure to check your lighting. It seems like every Skype call I make involves fidgeting with lights, adjusting blinds/curtains, and spinning around in my office chair to try to find the right lighting so that I’m not backlit, nor in a spotlight. If you can, make your test call with your friend at the time of day your interview is scheduled for so that you can have an idea of what the natural lighting will be like. Play around with things and get them just right so that when it’s time for the interview, your environment is perfectly set up to make your call a good one.  \n\nAlso be sure kids, pets, and any other possible interruptions are securely corralled to avoid a “BBC dad” moment (even though the public loved it, in the context of a job interview, such an incident may read to the interviewer (even subconsciously) as a sign that your life is a little chaotic).\n\nLook into the camera. This is always the tricky part about video interviews on a computer. Do you look into the camera at the top of the screen, or do you look at their face (and yours, to make sure you look okay)?  \n\nThe consensus is definitely that you should be looking at the camera in order to establish “eye contact” — even if that’s not really what it feels like. That way, however, you’re looking at the interviewer straight on rather than with a slightly downward look. Sure, you’ll of course check the interviewer’s face and yours occasionally, but do your best to intentionally look into the webcam for the majority of the interview.\n\nThe post How to Ace Your Next Phone or Skype Interview appeared first on The Art of Manliness.\n",
      "Folder": "Feedly",
      "Timestamp": "1495060713",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.602078Z"
}