{
  "id": "922e2d7631c74717833b9271dcf86fab",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/these-are-the-exclusive-perks-amex-and-marriott-members-get-at-coachella/",
      "Title": "These Are the Exclusive Perks Amex and Marriott Members Get at Coachella The Points Guy",
      "Selection": "The Coachella Valley Music & Arts Festival, one of the world’s largest music festivals, kicks off next Friday in Southern California’s Coachella Valley.\n\nAmerican Express and Marriott both have exclusive experiences in conjunction with Coachella. Marriott and SPG Rewards members are invited to the loyalty tent in the general admission area. The tent includes amenities like free wi-fi, frozen treats and comfortable seating. Marriott and SPG elites get access to even more preferred seating and refreshments — they’ll also enjoy access to skin treatments with chilled jade rollers and rose water face mists.\n\nRemember that the Platinum Card from American Express offers complimentary SPG Gold Status. The Marriott Rewards Premier Credit Card offers cardholders 15 elite night credits each year — enough to qualify automatically for Silver Elite status.\n\nThe hotel chain allowed rewards members to bid on packages that included a stay at one of three designer yurts at Coachella’s VIP campground. Unfortunately, all auctions have already closed.\n\nAmerican Express will reopen its Platinum House at the Parker Palm Springs for its second year. The house will only be open for Coachella’s first weekend from 11am to 5pm on Saturday April 14 and Sunday April 15.\n\nActivities include SoulCycle classes taught by Senior Master Instructor Stacey Griffith in the morning and an afternoon packed with performances from musical artists like Justine Skye and Julia Michaels. TPG himself plans on attending Saturday afternoon  — he completely soaked up the experience last year.\n\n Sunkist by Platinum   Stop by the Platinum House at the Parker- no Coachella passes needed, just an Amex Platinum + 3 free guests. 3pm @beberexha performs. Come play! #amexplatinum #amexambassador\n\nA post shared by  Brian Kelly (@briankelly) on Apr 15, 2017 at 2:40pm PDT\n\nYou’ll have to be an Amex Platinum or Centurion cardholder to get into the Platinum House. Fortunately, cardholders are allowed to bring up to three guests each.\n\nAmex cardmembers get access to a variety of complimentary perks at Coachella, including a $10 statement credit after spending $10 at participating Coachella vendors. You’ll need to download the Coachella app and enroll your Amex card in the app to be eligible. Other perks include a free ferris wheel ride for you and a guest, access to the priority Uber lane and admission to the Amex Card Member Club for you and three guests.\n\nFeatured image by Matt Winkelmeyer/Getty Images for Coachella.\n",
      "Folder": "Feedly",
      "Timestamp": "1523062266",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.523449Z"
}