{
  "id": "945bf2a7353c464798d2075706ab8184",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/10/why-you-should-visit-kauai-hawaii/",
      "Title": "Why You Should Visit Kauai, Hawaii, This Fall The Points Guy",
      "Selection": "The return of sweater weather and pumpkin spice means that summer is finally, officially over. Or is it? This fall, instead of packing away those linen shirts and summer whites, consider a trip to Kauai, Hawaii’s Garden Isle, where temperatures linger in the 70’s all year long, even in January.\n\n1. Visit Places From Your Favorite Movies\n\nDo it for the Instagrams. Kauai offers several ways to drop in on real life locations from Hollywood films. From helicopter tours to ATV rides, you can get up close and personal with scenes you’ll instantly recognize from popular movies. Kipu Ranch Adventures offers ATV trips that include not just the grassy fields of Jurassic Park and The Descendants, but views of private beaches and expansive high cliffs as well. Just make sure you’re wearing clothes you don’t mind getting dirty in — there’s nothing more gratifying than hitting a giant mud puddle at full speed — and pack a swimsuit as some tours feature scenic waterfall or swimming stops.\n\n2. Feast on the Island’s Best Poke\n\nFor many years, poke, a raw fish salad, was a Hawaiian delicacy that even locals shrugged at. Enter a new generation of chefs and restauranteurs who upped the ante on toppings and made it the next big thing world-wide. The best part about poke in Kauai is that it remains a local favorite, which means even stellar versions are affordable, if not downright cheap. Head to Makai Sushi — a local favorite tucked in the corner of an unassuming supermarket — for the Gorilla Poke Bowl ($16), which is packed with ahi, salmon, ono, sushi rice and avocado, among other things. You may have to wait in line, but you won’t be disappointed.\n\nIf you ask the friendly locals where they go to eat, chances are they’ll point you to Konohiki Seafood, a small specialty market with a takeout counter. This is one spicy tuna dish you’ll be raving about for day — oh, and  it costs less than $10.\n\n3. Zip Line Superman-Style\n\nThere’s zip lining and then there’s flying like a superhero over lush Hawaiian canyons level zip lining. In May, Outfitters Kauai debuted the Flyline, Hawaii’s longest zip line, measuring more than 3/4 of a mile long. Unlike other zip lines, this one straps users in a prone head first position so you soar like Superman over the tops of the trees. At 50 feet, the launchpad is the tallest in the state and you can expect to reach top speeds between 50 and 60 mph. For the slightly less adventurous, Outfitters Kauai offers a range of more traditional zip line options, like diving via zip line into a natural lava swimming hole. Also of note: the 1800-foot tandem zip line, which allows users to fly upside down and race a buddy.\n\nImage courtesy of Outfitters Kauai.\n4. Get Your Fill of Hawaiian-Style Shave Ice\n\nYou can’t throw a rock in Kauai without hitting an adorable shave ice stand. When everyone on the same island competes to have the best shave ice, the consumer wins. Spend a day hopping from stand to stand, sampling the subtle variations of the cold treat. Head to Tege Tege, a charming food truck perched inside a food truck court just off Kuhio Highway, where the good stuff is made one at a time with a hand-cranked ice machine and topped with organic fresh fruit. It’s not a fast process, so there are typically lines, but the payoff is a delicate, not-overly sweet treat that’s all but designed for social media posts. If you find yourself on the other end of the island, check out Wishing Well Shave Ice, an island staple since 1983. Trust the professionals and opt for the suggested combinations, like the Local, made with strawberry, vanilla, li hing mui syrup and vanilla ice cream. And yes, always get your shave ice with ice cream.\n\n5. See the Island From a New Perspective\n\nEntire sections of the island are only accessible by boat, or for the super-outdoorsy, via a strenuous hike. The Na Pali Coast, on the northwest tip of the island, is defined by impressive sea cliffs — or pali —waterfalls and virgin wilderness. Kauai offers a whole range of boat tours that suit groups as well as individuals. Capt. Andy’s Sailing Adventures offers sunset tours, snorkeling trips and day trips to this part of the island. While no boat tour can guarantee dolphin sightings, friendly pods do tend to make appearances, so get those cameras ready.\n\nWhat are some of your favorite things to do in Kauai? Tell us about them, below.\n\nFeatured image by M Swiet Productions / Getty Images. All other photos by the author except where otherwise indicated. \n",
      "Folder": "Feedly",
      "Timestamp": "1507424058",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.540279Z"
}