{
  "id": "949c6857c31549f2b512b0ce3821b574",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/cuban-players-are-powering-the-white-sox/",
      "Title": "Cuban Players Are Powering The White Sox FiveThirtyEight",
      "Selection": "The Chicago White Sox haven’t had a winning season since 2012 — and it’s been even longer since they were truly relevant. The last postseason series the South Siders won came in the 2005 World Series, when they beat the Houston Astros for their first championship since 1917. As a general rule, the Pale Hose are practically never among the most electrifying teams in baseball.\n\nThis year, however, is different. After a slightly rocky start to the season, the ChiSox have won nine of their last 12 games — including two of three against the crosstown rival Cubs over the weekend — raising their playoff chances to 94 percent according to the FiveThirtyEight prediction model. And they’re doing it with a very particular source of production: a record-breaking ensemble of Cuban-born stars.\n\nOn Aug. 1, the White Sox became the first team in MLB history to have an all-Cuban top four in their lineup when they started their contest against the Kansas City Royals off with center fielder Luis Robert, third baseman Yoán Moncada, first baseman José Abreu and catcher Yasmani Grandal hitting in order. (The quartet went 11-for-22 with 17 total bases in the game.) That group also dominated for the Sox against the Cubs this weekend, with 10 total home runs and 16 runs batted in.\n\nChicago has plenty of American-born talent on hand, of course, led most notably by shortstop Tim Anderson, who has an 1.063 on-base plus slugging with 1.3 wins above replacement1 already this season. It also has a wealth of Latin American talent from outside Cuba, headlined by Dominican left fielder Eloy Jiménez (0.7 WAR). But even so, it’s true that the White Sox would not be winning anywhere near as much — or be anywhere near as exciting to watch — without Robert, Moncada, Abreu and Grandal leading the way.\n\nIt’s early still, but no team has ever gotten as much from its Cuban players as those four are tracking to give Chicago in 2020. Together, the quartet has already generated 3.61 WAR in 29 games, which would work out to 20.2 WAR over a full, 162-game season. Going into this season, the MLB record for WAR (per 162 games) by Cuban players on one team was 14.6, by Zoilo Versalles, Tony Oliva, Camilo Pascual and Sandy Valdespino of the 1965 Minnesota Twins. That club came within a game of winning the World Series with a core of Latin American players signed by scout Joe Cambria while the team was still the Washington Senators, who also show up high on the list in 1959:\n\nThe White Sox have a historic Cuban connection\n\nMost wins above replacement (WAR) per 162 games generated by Cuban-born players for MLB teams in a single season, 1901-2020\n\nLatin-Born Players\n\nCuban-Born Players\n\nSeason\n\nTeam\n\nWAR*\n\nShare of Tm\n\nWAR*\n\nShare of Tm\n\n2020\n\nWhite Sox\n\n26.9\n\n45.9%\n\n20.2\n\n30.7%\n\n1965\n\nTwins\n\n14.6\n\n31.5\n\n14.6\n\n31.5\n\n1968\n\nIndians\n\n16.3\n\n39.1\n\n13.8\n\n32.7\n\n1964\n\nTwins\n\n12.5\n\n27.7\n\n12.6\n\n27.7\n\n1959\n\nSenators\n\n11.2\n\n38.4\n\n11.2\n\n38.4\n\n1970\n\nTwins\n\n16.5\n\n33.4\n\n10.9\n\n22.2\n\n1954\n\nWhite Sox\n\n16.3\n\n32.6\n\n10.7\n\n21.4\n\n1969\n\nTwins\n\n19.6\n\n36.4\n\n9.9\n\n18.5\n\n1923\n\nReds\n\n9.4\n\n21.3\n\n9.4\n\n21.3\n\n1962\n\nTwins\n\n10.7\n\n24.9\n\n9.1\n\n21.0\n\n1963\n\nTwins\n\n9.4\n\n18.4\n\n9.1\n\n17.9\n\n1963\n\nPhillies\n\n9.2\n\n21.6\n\n8.8\n\n20.7\n\n2019\n\nAstros\n\n21.1\n\n32.1\n\n8.4\n\n12.6\n\n1970\n\nAthletics\n\n10.0\n\n22.9\n\n8.1\n\n18.1\n\n1967\n\nIndians\n\n9.0\n\n29.8\n\n7.9\n\n23.7\n\n*Per 162 team games.\n\nSources: Baseball-Reference.com, FanGraphs\n\nThe 1968 Cleveland Indians, who rank third on the list above, also deserve mention for the stellar trio of starter Luis Tiant, center fielder José Cardenal and catcher Joe Azcue. (Tiant in particular had an incredible season that year, leading the American League with a 1.60 ERA.) But it’s also no coincidence that the majority of teams on the list are concentrated in a very tight range of seasons. Aside from the Senators, most teams had not considered Latin America as a serious source of talent — to their great detriment — until the 1950s. (Cincinnati Reds pitcher Dolf Luque stood out in the 1920s,2 but he was very much the exception.) What followed was an era of Latino stars who rose to become some of the best in baseball, led by the likes of Tiant, Pascual, Versalles, Puerto Rico’s Roberto Clemente, Juan Marichal of the Dominican Republic and Tony Pérez of Cuba. Chicago even had its own Cuban superstar in Minnie Miñoso, who starred for the Sox in four different decades.\n\nUnfortunately, MLB’s Cuban heyday came to an end around when the United States began an embargo against the country in 1960, forcing countless subsequent stars into a terrible choice between defecting (which can be a dangerous act for numerous reasons) and giving up their major-league dreams to play for far less than their worth on government-owned teams. It’s no coincidence that, as the generation of players who began their careers in the 1950s — and starred through the 1970s — retired, there was a huge dropoff in Cuban production at the MLB level:\n\nThat trend reversed some in the late 1980s and into the ’90s, as José Canseco and Rafael Palmeiro emerged as perennial All-Stars — though both grew up in Miami after their parents left Fidel Castro’s Cuba for the U.S. An arguably greater watershed moment came with pitcher Liván Hernández’s midnight defection in 1995, aided by scout Joe Cubas. Hernández dominated the 1997 postseason, earning World Series MVP honors with the Florida Marlins, and his brother Orlando made a harrowing journey to America by boat several months later. Along with countryman José Contreras, the Hernández brothers starred for six World Series champions from 1997 through 2005, powering a Cuban revival in the 21st century.\n\nThat renaissance continued with the emergence of such talented Cuban hitters as Yunel Escobar, Kendrys Morales, Alexei Ramírez, Leonys Martín, Yoenis Céspedes and Yasiel Puig, to go with a new generation of fireballing pitchers headlined by Aroldis Chapman and José Fernández. The same era also helped produce Robert, Moncada, Abreu and Grandal — all building blocks behind the White Sox’s impressive 2020 season.\n\nAbreu landed in Chicago first, signing as an international free agent in 2013 and winning Rookie of the Year honors in his debut season the following year. He has generated 21.0 WAR in his career, or 3.0 per season — fourth most of any Cuban player ever, behind Fernández, Palmeiro and Tiant — with a career OPS 36 percent better than league average. So far this year, he’s been the South Siders’ best player with 11 home runs and 1.6 WAR.\n\nThen came Moncada, who was acquired from the Boston Red Sox in 2016 as part of the Chris Sale trade — which cost Chicago an all-time pitcher but gained them one of the best young infielders in all of baseball. Since the start of 2019, only four third basemen — Alex Bregman, Anthony Rendon, Matt Chapman and Nolan Arenado — have more WAR than Moncada’s 6.0 mark, and Moncada (who turned 25 in May) is younger than any of them.\n\nRobert arrived next, after defecting in the winter of 2016-17. Although he hasn’t been quite as good as Abreu, he might be the most exciting player in Chicago — if not the entire major leagues — in 2020 so far:\n\nThough he strikes out a ton (in 36 percent of plate appearances, to be exact), Robert hits the ball hard, runs very fast and has been one of the best defensive center fielders in baseball this year. Robert may be a rookie, but the second-best prospect in all of baseball going into the season3 hasn’t really needed much of an adjustment period before excelling against MLB competition.\n\nThe final piece, Grandal, was added as a free agent last fall after enjoying a solid 2019 season (3.8 WAR) with the Milwaukee Brewers. After coming to America as a child under a special Cuban immigration lottery, Grandal lived and went to college in Miami before being taken with the 12th overall pick in the 2010 draft. Including 2020, he’s been the second-best catcher in baseball by WAR (behind Buster Posey) since first becoming a regular in 2014.\n\nTogether, the White Sox’s Cuban connection has been the primary force behind the team’s long-awaited breakout season. They have hit 26 combined home runs with an .863 OPS and 206 total bases. They’ve also produced a little less than one-third of the team’s WAR, with Abreu and Robert in particular ranking as two of the team’s three best players (sandwiched around Anderson). No other team in baseball history has showcased Cuban talent so front and center, and there will likely be more where that came from as the season goes on.\n\nThe White Sox’s success is also another milestone in the evolution of MLB’s Cuban players, whose contributions have grown by leaps and bounds over the past decade. Back in 2016, it looked like the influx of players from Cuba would increase even more dramatically after then-President Barack Obama loosened the U.S.’s embargo on the country. A couple of years later, MLB had even agreed with the Cuban government to streamline the path for players to play in America. That agreement was scuttled, however, when the Trump administration declared it illegal last year. But even if the relationship between countries remains fraught, Cuba’s baseball talent can’t be denied — and there’s no greater proof of that than the turnaround transpiring in Chicago this summer.\n\nCheck out our latest MLB predictions.\n",
      "Folder": "Feedly",
      "Timestamp": "1598313567",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.283297Z"
}