{
  "id": "9502f41b312a42b1a42f03019b4c9b35",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2017/10/20/16507902/indiana-lawrence-county-needle-exchange",
      "Title": "An Indiana county just halted a lifesaving needle exchange program, citing the Bible Vox - All",
      "Selection": "The program has overwhelming evidence behind it. But that wasn’t enough to save it.\n\n“People will absolutely die as a result.”\n\nThat’s how Chris Abert of the Indiana Recovery Alliance described the consequences of an Indiana county’s decision to stop a needle exchange program, which provides clean syringes to drug users in an effort to stop the spread of infectious blood-borne diseases like HIV and hepatitis.\n\nLawrence County commissioners’ reasoning: morals — and the Bible.\n\n“It was a moral issue with me. I had severe reservations that were going to keep me from approving that motion,” County Commissioner Rodney Fish, who voted against the program, told NBC News. “I did not approach this decision lightly. I gave it a great deal of thought and prayer. My conclusion was that I could not support this program and be true to my principles and my beliefs.”\n\nBefore he cast his vote, Fish quoted the Bible — specifically, 2 Chronicles 7. It says, “If I shut up heaven that there be no rain, or if I command the locusts to devour the land, or if I send pestilence among my people; if my people, which are called by my name, shall humble themselves, and pray, and seek my face, and turn from their wicked ways; then will I hear from heaven, and will forgive their sin, and will heal their land.”\n\nThe empirical evidence, however, is on the needle exchange programs’ side. Abert said that it’s led to a 50 percent decrease in hepatitis C cases in Lawrence County so far this year. And multiple reviews of the evidence by the World Health Organization, the Centers for Disease Control and Prevention (CDC), and others have overwhelmingly supported needle exchanges.\n\nAbert also argued that, if anything, the Bible teaches people to help those in need — exactly what a needle exchange program aims to do. “Christians believe their spiritual life is defined by how well they mirror Christ’s work in their daily lives,” he told me.\n\nBut that didn’t persuade commissioners, and they voted against the program.\n\nIndiana’s troubled history with needle exchanges\n\nThis isn’t the first time needle exchange programs have proven controversial in Indiana.\n\nIn 2015, the southeastern part of the state suffered an HIV epidemic linked to the injection use of Opana, a prescription painkiller that’s been widely misused throughout the opioid crisis. Back then, state lawmakers — including then-Gov. Mike Pence — were opposed to a needle exchange program. It was only after the HIV epidemic worsened that Pence finally relented, allowing a needle exchange program in Scott County and later signing a law that lets counties set up needle exchange programs if they prove they have an epidemic.\n\nBut some counties have been resistant to the concept. NBC News reported that earlier this year, Madison County also shut down a needle exchange program due to pressure from the local prosecutor and Indiana Attorney General Curtis Hill, who was elected in November and opposes needle exchange programs.\n\nLawrence County was among the several that got permission for a needle exchange program. But this month, the program was halted pending reapproval from county commissioners. The law requires county approval for the program on an annual basis, even though the needle exchange does not use county or state funding.\n\nOn Tuesday, county commissioners voted against the needle exchange program. They heard from some members of the community who were opposed to the program, but Abert said that a drug court judge, academics, and health care providers also testified in favor of it. Ultimately, the commissioners sided with the opposition.\n\n“It came down to morally, they’re breaking the law. I can’t condone that,” County Commissioner Dustin Gabhart said, according to Indiana Public Media. “Yes, it’s a problem. Yes, it needs to be resolved. I could not give them the tools to do it.”\n\nNeedle exchanges save lives. Period.\n\nThe common argument against needle exchange programs, echoed by Indiana officials, is that they enable drug use by providing people with the tools to use drugs. And, they claim, that may lead to more drug use.\n\nThe claims are not borne out by the evidence. A 1998 study from researchers at Johns Hopkins University found needle exchange programs generally reduced the spread of HIV without increasing drug use. A 2004 study from the World Health Organization, which analyzed two decades of evidence, produced similar results. A 2016 review of 15 studies by the CDC did as well.\n\nAs one example, the CDC noted that once Washington, DC, was able to implement a needle exchange program, an evaluation “showed a 70 percent decrease in new HIV cases among [injection drug use] and a total of 120 HIV cases averted in two years.”\n\nThis is, frankly, not a remotely controversial topic in the research: Needle exchange programs save lives. Many people are going to find ways to use drugs no matter what, and providing them with clean syringes at least eliminates some of the risk tied to that drug use.\n\nExperts also say needle exchange sites can be crucial for linking people to addiction treatment. For an upcoming story, John Brooklyn, an addiction doctor in Vermont, told me that these programs can be critical for “meeting people where they are.” The idea is simple: Addiction treatment staff can drop by these needle exchange programs and offer their services. People won’t always take up the suggestion, but it helps reinforce that treatment is around and available.\n\nIndiana’s story, though, shows the one thing holding back these successful public health programs: stigma that treats addiction as a moral failure instead of a medical issue.\n\nSo despite the public health evidence, officials will often cite moral objections to needle exchange programs. And more people will die as a result.",
      "Folder": "Feedly",
      "Timestamp": "1508549703",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.614777Z"
}