{
  "id": "953a00815dd6442f84630bcc26a75bbf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/951055/a-new-generation-of-even-faster-fashion-is-leaving-hm-and-zara-in-the-dust/",
      "Title": "A new generation of even faster fashion is leaving H&M and Zara in the dust Quartz",
      "Selection": "Zara and H&M are the world’s two largest fashion brands. Not by coincidence, they’re also the pioneers of fast fashion. Zara is able to take a coat from design to the sales floor in 25 days (paywall), and it can replenish items even more quickly.\n\nIn the past couple of decades, the two companies have steadily trounced much of their competition, outdoing them on price and speed to claim an ever-larger share of shoppers’ spending. But both are being beat at their own game by even faster competitors.\n\nBritish fashion retailers ASOS and Boohoo are both able to design, produce, and have clothing ready for shoppers on the sales floor quicker than Zara and H&M, according to a research note Goldman Sachs sent investors last month, and the two millennial-focused, social-media savvy brands are enjoying the rewards. On April 4, ASOS lifted its sales forecast for the year, expecting sales to grow between 30% and 35%. Boohoo also recently raised (pdf) its earnings forecast, predicting sales growth of around 50% for the year. Unbeknownst to many, its shares rose more in 2016 than those of any other Western European consumer-related company with a market capitalization of more than $500 million.\n\nGoldman Sachs charted the correlation between supply-chain lead times and like-for-like (LFL) sales growth, and the results show just how much speed matters. It allows brands to respond to the market quickly, which means they can adjust their inventory to match trends as they happen, and it keeps them from having to produce a large amount of stock in advance that then risks not selling and being discounted.\n\nSpeed wins. (Screen capture of Goldman Sachs note to investors)\n\nIt helps that both ASOS and Boohoo are online retailers, meaning they—unlike many of their fashion rivals—aren’t suffering from an overabundance of brick-and-mortar stores whose sales are being cannibalized by ecommerce. (Zara and H&M, after years of rapidly expanding, have recently announced plans to ease back on their rate of opening new stores to shift focus online.) And while both ASOS and Boohoo are starting from a smaller sales base, making it easier to achieve high growth, the analysts at Goldman Sachs still argue that their roughly “four-week design-to-store model is integral to their success.”\n\n Defiant by nature. Jeans by ASOS. Express yourself with colourful denim for SS17 – in badass bleaching or super-sweet pastel hues. Your blue jean babies have had their colour done – this is acid wash reloaded. Cos you've never let a little thing like a rulebook stand in your way. #JeansByASOS\n\nA post shared by ASOS (@asos) on Apr 3, 2017 at 1:24am PDT\n\nH&M is aware it’s falling behind, announcing plans recently to invest in and rethink its supply chain. Most of its manufacturing takes place in Asia in order to keep prices down, but it’s considering moving more production closer to Europe, to countries such as Turkey, which would let it get items to stores more quickly. That proximity is key to the speed of its faster rivals. (Even Japanese retailer Uniqlo, which emphasizes that it isn’t driven by trends, has acknowledged that it needs to speed up.)\n\n Ultimate BABE  ( @sofiajamora) #myboohoostyle #boohooontheroad #dzz61170\n\nA post shared by boohoo.com (@boohoo) on Apr 2, 2017 at 7:02am PDT\n\nBoth Zara and H&M saw a slowdown in sales growth this year, and their margins are also under pressure, leading some to wonder whether the fast-fashion industry is crumbling under the same forces as other retailers. On the contrary, it’s getting even faster.",
      "Folder": "Feedly",
      "Timestamp": "1491483396",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.615268Z"
}