{
  "id": "9582f2be5f834642a49cc34e0ef47675",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/849178/stop-normalizing-a-useful-google-chrome-extension-that-autocorrects-alt-white-to-neo-nazi/",
      "Title": "A useful Google Chrome extension autocorrects “alt-right” to “neo-Nazi” Quartz",
      "Selection": "Since the election of Donald Trump, the controversial term “alternative-right” or “alt-right” has emerged in mainstream media to describe a loose configuration of people who rally behind incendiary, white nationalist polemic in the US.\n\nBut an anonymous New York City-based designer says that the use of “alt-right” instead of “white supremacist” is nothing more than linguistic sanitation, and has created two Google Chrome extensions to fix that. The extensions automatically replace all instances of the term “alt-right” on the internet with “white supremacist” or “Neo-Nazi.”\n\n“This gentle sounding name is the rebranding of White Supremacy and White Nationalism, and its normalization must be stopped,” the designer, operating under the pseudonym George Zola wrote on his/her website.\n\nRebranded hatred is still hatred. Rebranded white supremacy is still white supremacy. Rebranded nazism is still nazism. #StopNormalizing\n\n— #STOPNORMALIZING (@STOPNORMALIZING) November 29, 2016\n\nHe’s not the only one to call out the term “alt-right.” On Nov. 28, the AP updated its style guide stating that “alt-right” should only be used in quotation marks and with a definition. In a blog post, John Daniszewski, AP’s vice president for standards noted that the news agency has simply described such beliefs as “racist, neo-Nazi or white supremacist” in the past.\n\nThe term “Alternative-Right” originates with Richard Spencer, president of the far right advocacy group National Policy Institute (NPI) who used it in a speech in 2010 speech and recently led members in a “Hail Trump” salute, as the Atlantic captured on video. It was propagated by fringe media exec Steve Bannon, now a senior strategist for Trump.\n\nThe free web browser extension for “white supremacist” was downloaded 1,200 times on its first day, Nov. 16. As of Nov. 29, links to the extension had reportedly been shared 63,000 times on Facebook.\n\nZola tells Quartz that he developed the Neo-Nazi version in response for a clamor for the more loaded term, and says he’s focusing on getting the extensions ready for FireFox and Safari.\n\n“I’m not sure how much further we’ll take the Chrome Extension approach, we have larger goals of making noise,” Zola explains. “Any way we can prompt conversation and get people to consider the importance of their own word choice as well as question the word choice of the media is what we’re aiming for.”\n\nZola also shares that the response to his self-initiated political protest has been shockingly positive. “When we started this, I expected a lot of hate mail. However, the response has been overwhelmingly positive and personally touching,” he says. The project has even drawn out personal stories from those affected by Nazi occupation. “We’ve received messages of hope…we’ve inspired them by presenting simple yet powerful messages of defiance.”\n",
      "Folder": "Feedly",
      "Timestamp": "1480549715",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.689361Z"
}