{
  "id": "95e98dff3a5344e3b0fb3e242339de5f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/900346/muslim-ban-airport-protests-the-photo-thats-become-an-icon-of-muslim-jewish-solidarity-at-us-airport-protests/",
      "Title": "A photo of two dads has become the icon of Muslim-Jewish solidarity at US airport protests Quartz",
      "Selection": "There were many moving pictures from the protests at US airports this week. But one captivating image from Chicago stands out as a reminder of solidarity in the face of anti-immigration policies that the Trump administration is working hard to institutionalize.\n\nOn Jan. 30, Chicago Tribune photographer Nuccio DiNuzzo captured a brief encounter between Meryem, a 7-year old Muslim girl wearing a hijab and Adin, a 9-year-old Jewish boy in a kippah. Both kids were hoisted on their fathers’ shoulders for a better view, holding cardboard signs of support for those stranded by the new US president’s surprise ban on travelers from seven Muslim-majority countries.\n\nMeryem’s sign said “Love, Love” while Adin’s echoed, “Hate Has No Home Here.”\n\n“I knew that this was an important picture to make,” said DiNuzzo to the Chicago Tribune.\n\nChance encounter.\n\nAdin’s father, Rabbi Jordan Bendat-Appell, told the Tribune that he drove his son to Chicago’s O’Hare airport to teach him a lesson in standing up for what he believes in. Adin’s maternal grandparents are Holocaust survivors. Meryam’s father Fatih Yildirim had brought his family to the same airport to deliver homemade chocolate chip cookies for lawyers assisting detained travelers.\n\nAs they waited for travelers to emerge from the arrival gates, the two fathers struck a quick friendship, exchanging foodie tips about kosher steakhouses. Says Bendat-Appell to the Huffington Post, “What was wonderful was that it was a very human interaction—not a Jew and Muslim, but two human beings who look enough alike to be brothers—standing up for what is right,” he said. “We are happy if this photograph can bring a bit more love and light into this world.”\n\nBendat-Appell says their families have made plans to meet for Shabbat dinner. “I’m making steak, he is bringing baklava.”\n",
      "Folder": "Feedly",
      "Timestamp": "1485996577",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.718351Z"
}