{
  "id": "95f6b2a0505245848d64af6faf124fb3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/policy-and-politics/2017/2/2/14452388/muslim-ban-immigration-order-islamophobia-racism-muslims-hate",
      "Title": "Islam isn’t a race. But it still makes sense to think of Islamophobia as racism. Vox - All",
      "Selection": "Orientalism, the ancient brand of hate behind today’s anti-Muslim attitudes, explained.\n\nIranian actress Taraneh Alidoosti is the star of the Oscar-nominated film The Salesman, but as Al Jazeera reports, she’s planning to boycott the Academy Awards ceremony in protest of Donald Trump's executive order temporarily banning immigrants from seven Muslim-majority nations, including Iran.\n\nWhy? “Trump’s visa ban for Iranians is racist,” she tweeted Thursday.\n\nTrump's visa ban for Iranians is racist. Whether this will include a cultural event or not,I won't attend the #AcademyAwards 2017 in protest http://pic.twitter.com/CW3EF6mupo\n\n— Taraneh Alidoosti (@t_alidoosti) January 26, 2017\n\nShe’s not the only one who characterizes it this way. Trump’s statements about Muslims and proposal of what he called “Muslim ban” during his campaign, combined with his remarks about Mexican immigrants, inspired a wide consensus that it was fair to call him a racist.\n\nNow that a ban on immigration from seven predominantly Muslim countries is a reality, this criticism of his administration has deepened. It’s a rallying cry for activists and a concern of critics for whom the policy flies in the face of what they would like to think are modern American values.\n\nBut supporters of the executive order resist the application of the “r-word” here, saying that even if the order did explicitly target Muslims, that still wouldn’t be racist. After all, they argue, Islam is a religion, not a race. Muslims include people from a wide variety of ethnic backgrounds — including many from countries affected by the ban whose national origins would fall under the “white” category on the current US Census if they were allowed in.\n\nTo understand why, despite all this, it makes sense to talk about anti-Muslim bigotry — both as expressed by the Trump administration and in general — as a kind of racism, you need to know about the roots of Islamophobia, and about how racial categories can shift with the political winds.\n\nThe roots of anti-Muslim hate: Orientalism\n\n“Pre-9/11, the predecessor of Islamophobia was called Orientalism,” said Khaled Beydoun, a law professor at the University of Detroit who also works with UC Berkeley’s Islamophobia Research and Documentation Project. “That was the system that mothered Islamophobia; it feeds and provides many of the same stereotypes, systems of fear, and caricatures.”\n\nOrientalism, as explained by the eminent Middle East scholar Edward Said, who first developed the concept in his groundbreaking book of the same name, is essentially the cultural and historical lens through which the Western world perceived, defined, and “otherized” the East, and particularly the Muslim Middle East.\n\nBeydoun said this centuries-old worldview “stereotyped Muslims as civilization threat and menace” long before it was dubbed “Islamophobia.” In his view, the anti-Muslim hate and bigotry that has been the topic of many public conversations over the past decade in the West is really just “essentially an extension of the fear and vilification of not only Muslims but everyone perceived to be Muslim that’s been taking place for centuries.”\n\nThis, according to Beydoun, has “brought about the conversion of Islam from religion to race, which as a result spawns popular perception of Muslims as exclusively Arab, and in turn blinds many from seeing Islam as a multiracial and ethnic faith group, of which black Muslims rank as the biggest group in America.”\n\nEven though many American Muslims are black, and the former head of the largest Muslim organization in the US was a white woman, the bigotry of Orientalism doesn’t always pay attention to these details. That means centuries-old biases against Arabs haven’t had to change much to evolve into today’s anti-Muslim attitudes — they’ve just been refreshed and relabeled.\n\nIgnorance and confusion mean contemporary anti-Muslim hate isn’t actually about religion\n\n“When you’re Arab and Muslim, the categories can get conflated,” said Maytha Alhassen, a doctoral candidate in the department of American studies and ethnicity at the University of Southern California who has family roots in Syria and Lebanon. “When I’ve spoken to media, there’s been a distinct interest in looking at Islam as ‘those brown people from over there.’”\n\nShe said the many stories of Sikhs — who practice a religion totally separate from Islam — targeted in anti-Muslim attacks seem to provide an additional indication that this brand of hate is not as focused on an understanding of Islam as a religion. Instead, these actions are carried out against those who are perceived as culturally and ethnically “other.”\n\nAlhassen said she’s not even a fan of the term “Islamophobia,” in part because the “neurolinguistic programming” that comes from putting together “Islam” and “phobia,” is part of how people try to defend their sentiments about people who practice Islamic traditions. “Anti-Muslim hate,” and “anti-Muslim rhetoric” are better. But, she said, “I like to be specific ... if we’re talking about that ‘brown other’ that also could be Muslim, I use ‘Orientalist.’”\n\nShe said she’d use that term in particular to describe the sentiments in Trump’s executive order, including references to keeping out people who commit “honor killings” or persecute individuals based on sexual orientation and gender. These stereotypes are what she calls “classic Orientalist tropes.”\n\nPeople who are “white” now might not be later\n\nToday, the \"white\" category of the US Census is available to \"a person having origins in any of Europe, the Middle East, or North Africa.\" Many Muslims, including those from countries targeted by Trump’s recent executive order, would check that box.\n\nBut that shouldn’t be the end of the debate about whether attitudes and policies toward people in this group can be “racist.”\n\nHistory proves that the set of people who get to be categorized as “white” in America is heavily informed by various immigrant groups' popularity, not biological differences.\n\nAccording to a timeline published as part of the Race: The Power of an Illusion series, when immigration to the US from Southern and Eastern Europe increased in the late 1800s and early 1900s, many of the new arrivals worked low-paying jobs, were clustered in urban ghettos, and were seen as \"not quite white.\" In fact, Germans, Greeks, Irish, Italians, and Spaniards have all — either legally or as matter of public opinion — been excluded from the \"white\" category at some point.\n\nAs political priorities change, American racial definitions adjust right along with them.\n\nSo, for example, people of Mexican birth or ancestry were \"white\" until the 1930 census snatched that privilege back. Since then, their status — white or Hispanic — has flip-flopped several more times, all depending largely on whatever the current thinking was about their role in labor or immigration.\n\nSimilarly, courts went back and forth in the early 20th century about whether people from Japan were white, finally deciding in 1933 that they weren't, based on \"the common understanding of the white man.\" (Sounds really official, huh?)\n\nAnd what it took to be \"black\" once varied so wildly throughout the country (from one-quarter to one-sixteenth to the infamous one drop of African ancestry) that people could actually change their legally recognized races by crossing state lines.\n\nThen suddenly, in 2000, the government decided that Americans could be more than one race, adding options to express this to the census. In other words, one day you had to be a single race in the eyes of the government, and the next day you could be as many as you pleased.\n\nWith these constant changes, it's hard to make the case that the concept of race is anywhere near stable or to see the current census categories as the decisive factor in whether anti-Muslim attitudes are racist or not.\n\nAlhassen has researched how people from the Middle East and North Africa ended up under the “white” category in the first place. Long story short: The 1790 Naturalization Act gave naturalization to free whites. So the way people argued for citizenship or eligibility for citizenship was to prove their whiteness. Some cases went all the way up to the Supreme Court and set the standard. One argument — known as the “cradle of civilization” argument — was that people who came from the region where Christianity and Western civilization originated should be deemed white. It worked.\n\nBut Alhassen has also been involved with a movement to change this categorization. As a result of this movement, the Census Bureau is currently taking into consideration the views of people of Middle Eastern and North African descent who have told the Census Bureau they don't want to be categorized as \"white\" any longer.\n\nWhy don’t they? Because it doesn’t describe their experience. “Federally, we are white, but when you’re from the Middle East and North Africa, one of the few times you realize that is when you’re filling out these fed forms applying for schools. I don’t have the social protection of being white,” Alhassen explained.\n\nIt's unclear whether the Census Bureau will get behind these changes and, if so, whether the Office of Management and Budget will approve them in time for the 2020 Census. But if the change takes effect, plenty of people who are considered white right now won't be in three years.\n\nThat, according to Alhassen, would make sense because “these communities do not feel like they’re white.” And the perception of experiencing racism — both in individual anti-Muslim attacks and now, in the policies of an administration with close ties to white nationalism — is a big part of that.",
      "Folder": "Feedly",
      "Timestamp": "1486079522",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.641297Z"
}