{
  "id": "971a89f043684c66b652c2f413f5c7b1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1095899/gun-ownership-in-america-in-three-charts/",
      "Title": "Three percent of the population own half of the civilian guns in the US Quartz",
      "Selection": "Stephen Paddock stockpiled an arsenal of weapons before committing the deadliest mass shooting in modern US history in Las Vegas. The bloodshed and the scope of Paddock’s weaponry, extreme as it may seem, have returned gun control to the forefront of the US national debate.\n\nJust how common is it for Americans to own multiple guns? And who owns them?\n\nHere is a look at the distribution of gun ownership in America:\n\nDo Americans own a lot of guns?\n\nIn both absolute and relative terms, the answer is yes. The US tops the list of countries with the most guns, owning about half the world’s guns while making up only 5% of the world population.\n\nIn relative terms, the US has the highest number of guns per capita. There were an estimated 89 to 100 guns for every 100 Americans in 2013–around one firearm per person.\n\nThe country with the second highest number per capita is Serbia, at 75.6 guns per 100 people.\n\nHow many people own guns in America?\n\nAnswering this requires a more nuanced look at the gun ownership. Only a quarter of Americans own guns, according to numbers from General Social Survey and Gallup in 2013. This means that many American gun owners have more than one gun.\n\nHow many guns does an average American gun owner possess?\n\nThe average American gun owner owns three guns, according to a 2015 survey conducted by Harvard and Northwestern University. More than a half of them own just one or two, whereas 14% of them–7.7 million or 3% of the US population–own anywhere between eight to 140 guns. This 3% of the population owns half of the civilian guns in the US. The police found 47 guns associated with Paddock in three different locations two days after the massacre, which puts him among the 3%.\n\nA note of caution: Gun ownership surveys always contain a degree of inaccuracy. As long as Americans can still legally purchase guns in many states without a permit or license, there doesn’t seem to be a systematic method of tracking the population of US gun owners.\n\n \n\nRead next: Stephen Paddock shared a trait with other mass killers: He abused women\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1507327508",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.619872Z"
}