{
  "id": "976c51de36354c57a95559793dbda965",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/12/instagrammable-places-morocco/",
      "Title": "13 of the Most Instagrammable Places in Morocco The Points Guy",
      "Selection": "Does any country evoke a sense of mystery as resolutely as Morocco? From the maze of souks in Marrakech to the windswept dunes of the Sahara and everything in between, this diverse North African kingdom rocks the casbah and will spice up your Instagram feed at the same time.\n\nFor those who think some of the sights risk being cliché, well, perhaps you haven’t found the right filter. The most magical thing about this country — other than the fantastic, fragrant food — is its authenticity. You find it everywhere: from master craftsmanship in the souks to exquisite hidden riads to the smile of the guy who’s serving you a sweet mint tea. So, linadhhab (let’s go!); here are 13 ideas for Instagram gold.\n\n1.  The Antique Doorways of Fez\n\nUp until 1912, the city of Fez was the capital of modern Morocco and is considered one of its four imperial cities (along with Rabat, Meknes and Marrakech). Its car-free Fez el Bali medina, a World Heritage Site, is a walled area with atmospheric souks and elaborate carved doorways, reminders of the architectural marvels of the Marinid dynasty which held sway here from the 13th to 15th centuries. The green-tiled roofs are soothing, but at street level, stroll and ‘gram those entryways to your heart’s content.\n\nA post shared by Elsa Esmeraldo (@dirty_stop_over) on Sep 27, 2017 at 3:57pm PDT\n\n2. Jemaa el-Fnaa Market\n\nIn an early episode of Absolutely Fabulous, Edina asks Patsy why her daughter Saffy can’t go to Morocco on her own since they are separately “going to Marrakech.” Saffy points out to her space-cadet elders that Marrakech is in Morocco, but the point is taken: For many travelers, Marrakech is synonymous with Morocco. It’s both enigmatic and iconic, nowhere more so than in the vast Jemaa el-Fnaa market square located inside the walled medina. This is where you’ll find everything from acrobats to astrologers to fire-eaters and bellydancers, but most famously a wealth of shopping opportunities.\n\nA post shared by Anna – Luxury Travel&Lifestyle (@jetset_anna) on Dec 9, 2017 at 8:00pm PST\n\n3. Koutoubia Mosque\n\nThe minaret of this landmark mosque, completed in 1199 by the Berber ruler Almohad Caliph Yaqub al-Mansur, has been featured on many an iconic vintage travel poster. It rises 253 feet above the southwest section of the city’s walled medina. The elegant structure features decorative arches, pointed merlons and lovely ceramic inlays, which influenced the design of the Giralda belltower of the Seville Cathedral.\n\nA post shared by Moe (@sanmoetrip) on Dec 10, 2017 at 1:34pm PST\n\n4. Chefchaouen\n\nIf you like blue, this town in northwestern Morocco, set inland from Tangier in the Rif Mountains, is the place for you and your Instagram account. From its houses, walls and alleyways to pretty much every manmade structure in=between, it’s all blue, all the time. Savor the panorama of the medina’s bright blue hues from the top of the casbah tower, or stick to ground level and the winding lanes where you’re likely to find a cat or two on an innocent quest for some love on the ‘gram.\n\nA post shared by Best City Breaks (@bestcitybreaks) on Dec 9, 2017 at 2:43am PST\n\n5. Your Own Semi-Private Riad\n\nWith its vast Atlantic and Mediterranean littorals and arid but oasis-studded interior, Morocco never fails to stun. In terms of urban oases, it’s all about the riads: traditional Moroccan townhouses or palaces with interior courtyards. This is where tranquility to the tune of elaborate tiling, lush gardens and fountains await. Chances are if you stay in a boutique-style hotel in Marrakech or Fez you’ll be able to luxuriate in a real riad — which you may want to keep to yourself (but not before you ‘gram it).\n\nA post shared by Sarah Owen (@sarahsarahowen) on Oct 7, 2017 at 2:11am PDT\n\n6. Ben Youssef Madrasa\n\nThis iconic former madrasa, or Islamic college, in Marrakech is one of Morocco’s architectural treasures. Founded in the 14th century by the Marinid sultan Abu al-Hassan, historically it is the country’s largest madrasa. With its stunning mix of girih geometric patterns, elaborately carved wooden doors and zellige tile work, the place seems like it was made for quite contemplation — and in latter days, for Instagram.\n\nA post shared by Paola Gambuzza (@paolagambu) on Dec 8, 2017 at 12:05am PST\n\n7. El Jadida\n\nSituated on Morocco’s Atlantic coast south of Casablanca, El Jadida was designated as a UNESCO World Heritage Site on account of the huge stone ramparts built by the Portuguese in the 16th century. These thick walls frame the star-shaped Fortress of Mazagan (the Portuguese name for El Jadida). While jumping off the 26-foot-high walls into the water below (on the seaside flank) may be inadvisable, it can be fun to observe some of the more adventurous locals doing just that. Another cinematic site is the old Portuguese cistern: its eerie rows of underground stone pillars made an appearance in Orson Welles’ film version of Othello and are sure add a shot of haunting beauty to your feed.\n\nA post shared by Sharlyne (@sharlyne_andrea) on Dec 1, 2017 at 4:54am PST\n\n8. Merzouga Dunes\n\nLocated far inland near the Algerian border, Merzouga is a main point of entry to the swath of Sahara sand dunes known as Erg Chebbi. The lofty, wind-swept dunes here and at close-by Hassi Labied form the backdrop and focal point for organized camel rides and other desert adventures. As such it’s the gateway to many highly Instagrammable moments: but no complaints about the dust, please!\n\nA post shared by Fadhu Mariam (@raajethere) on Oct 6, 2017 at 1:26am PDT\n\n9. Ouarzazate\n\nEast of Marrakech and south of the Atlas Mountains, Ouarzazate is home to the impressive Taourirt Kasbah and both the town and epic desert landscape to the south have long been favored as film locations. Scenes of everything from Lawrence of Arabia to Game of Thrones have been filmed in and around Ouarzazate, whose name comes from a Berber phrase meaning “no noise.” No worry though: The town’s mighty walls and ochre tones will slay the ‘gram in silence.\n\nA post shared by Eran Abulafia (@eran.about) on Dec 5, 2017 at 2:12pm PST\n\nA post shared by Eran Abulafia (@eran.about) on Dec 5, 2017 at 2:12pm PS\n\n10. Aït-Benhaddou\n\nThis ksar (fortified village) along a onetime caravan route near the southern slopes of the High Atlas mountains is a beautiful pre-Saharan habitat whose densely arranged dwellings, fashioned from clay brick, are always ready for their close-up. These earthen casbahs are protected by a ring of defensive walls and evocative corner towers. No wonder, then, that it’s another popular film location, with everything from Time Bandits to Babel to Gladiator having shot  sequences here.\n\nA post shared by Rie.Hotaru (@rie_0209) on Dec 10, 2017 at 2:46am PST\n\n11. Tangier\n\nWhile it may be lacking in iconic sights and doesn’t have the same mystique as Morocco’s imperial cities, Tangier (or Tangiers) is exotic all the same. From Berber origins to Phoenician trading post to Roman city to the present day, it’s a historic melting pot of cultures, and with its location at the entrance to the Strait of Gibraltar makes for great Insta opps in any season.\n\nA post shared by Alia Chergui (@aliachergui) on Dec 10, 2017 at 1:29am PST\n\n12. Asilah\n\nBreezy and easygoing, Asilah is situated less than 20 miles south of Tangier on Morocco’s Atlantic coast. A town with Phoenician roots, its centuries-old seaside ramparts were built by the Portuguese and there is Spanish heritage as well.  The twisting lanes and mainly white buildings of the medina, many with ornate mashrabiya projecting windows, will you have you thinking of Mykonos with a très cool North African twist — and it all makes for Instagram gold.\n\nA post shared by Freya  (@freyaleif) on Dec 8, 2017 at 9:30am PST\n\n13. Ouzoud Falls\n\nWhen you think of Morocco the desert is probably what first comes to mind, so coming across the delightful Ouzoud falls is doubly refreshing. They’re located near a village in the Middle Atlas Mountains called Tanaghmeilt. The 360-foot-tall cataract makes for a popular day trip from Marrakech, which is about 90 miles southwest. And before you stow your ‘gram cam look out, because there are monkeys vying for your attention here, too.\n\nA post shared by D A V I D (@drtango) on Dec 8, 2017 at 10:51pm PST\n\nFeatured photo of one of the most colorful alleyways in the city of Chefchaouen, Morocco by Jeremy Villasis / Getty Images\n",
      "Folder": "Feedly",
      "Timestamp": "1514144572",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.559072Z"
}