{
  "id": "98e3c865acfa43df8151d254eca35fe9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/13710-how-to-never-overcook-salmon-or-other-fishes-again",
      "Title": "How to Never Overcook Salmon (or Other Fishes) Again Food52",
      "Selection": "Every week, Food52's Executive Editor Kristen Miglore is unearthing recipes that are nothing short of genius. Today: The most foolproof way to cook any fish—and a petition for a new cooking term.\n\nThe most unfair implication of slow-roasting is the slowness part. Sure, there are plenty of benefits—gentler cooking, a cooler kitchen, a both technique- and zen-driven lifestyle—but speed (and, by association, weeknight-friendliness) isn't one of them. Or is it?\n\nUnlike slow-roasted pork or chicken or even tomatoes, the perks that come along with turning down the oven happen to come much faster with fish, as most things do. Fish needs a new marketing campaign: Fish is always fast. Its connective tissue and protein structure are more delicate than those of other meats, says Harold McGee, and should generally be cooked as little as possible. And so, fish is the only case where slow-roasting can take as little as 15 minutes. Low-roasting would be more accurate than slow-roasting—we should start seeding a change in terminology, and tell Google about it.\n\nThere are all sorts of variations on the idea—Michel Bras and Paula Wolfert famously added a pan of boiling water to the bottom of the oven to help the fish steam; Alice Waters tops her slow-cooked fish with a perky lemon relish; and our own Erin McDowell translates the method to a cold pan on the stovetop.\n\nBut perhaps the simplest, fastest, and most versatile slow-roasting technique comes from Sally Schneider in A New Way to Cook. All you need: a thin coat of olive oil, salt, and a 275° F oven.\n\n  \n\nSchneider learned about the technique for salmon close to 20 years ago, she wrote to me, \"So I asked, 'What if I applied it to other fish?' and tested them out to discover that the dead-simple technique works great for all sorts of fish and shellfish\"—from striped bass and cod to sea scallops to steakier fish like tuna and swordfish.\n\nSlow-roasting makes a beautifully tender, evenly cooked, not-one-bit-dry piece of fish. If you miss the 120° F, just-starting-to-flake mark and take it out late, it will still be good—even carryover cooking after taking it out of the oven won't outrun you, because there isn't much velocity behind it. This makes the technique perfect for dinner parties and newer fish cooks, whom the \"Fish is always fast\" marketing will hopefully reach soon.\n\n\"Over the years, it’s proven to be an essential technique I’ve riffed on endlessly,\" Schneider told me. \"You slow-roast the fish, then embellish it any way you want or with whatever is on hand; therein lies the opportunity to improvise.\" In her later version in The Improvisational Cook, she suggests all kinds of sauces, from fennel oil to brown butter and vinegar. I topped mine with Greek yogurt speckled with chives.\n\nYears ago, I learned a memorable analogy about speed and cooking from my friend Anita Shepherd, after I burned a pan of bacon and had to ride my bike around Little Italy looking for another package late at night—this was before she became a vegan chef and coconut milk yogurt developer (and before I cooked bacon for dinner more often than I should).\n\nShe told me cooking is like coming up to a stop light. If you're going slowly, it's easy to hit your mark. If you're going fast, you'd better hope that you have very good aim (and strong brakes). Low, slow roasting is fish's built-in brake.\n\nSally Schneider's Slow-Roasted Salmon (or Other Fish)\n\nSlightly adapted from A New Way to Cook (Artisan, 2003)\n\nServes 4\n\n1 teaspoon extra-virgin olive oil1 1/2 pounds thick salmon fillet, or other fish like striped bass or cod (1 large fillet or four 6-ounce fillets)Kosher saltA small bunch of fresh thyme sprigs (optional)Chopped fresh herbs like chives, and Greek yogurt to finish (optional)\n\nSee the full recipe (and save and print it) here.\n\nGot a genius recipe to share—from a classic cookbook, an online source, or anywhere, really? Please send it my way (and tell me what's so smart about it) at kristen@food52.com.\n\nThe Genius Recipes cookbook is here—and a New York Times Best Seller! It's a mix of greatest hits from the column and unpublished new favorites—all told, over 100 recipes that will change the way you cook. It's on the shelves now, or you can order your copy here.\n\n \n\nPhotos by James Ransom",
      "Folder": "Feedly",
      "Timestamp": "1438814151",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.844089Z"
}