{
  "id": "99109fed718a4ca59a9e2cbc9a004738",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/2017/09/27/this-is-a-big-deal-fly-to-hawaii-with-points-you-probably-already-have/",
      "Title": "This Is a Big Deal! Fly to Hawaii With Points You (Probably) Already Have Million Mile Secrets",
      "Selection": "Last month, I let you know Alaska Airlines added Singapore Airlines to their list of valuable airline partners.\n\nAnd now, via Travel Codex, you can redeem Singapore Airlines miles for Alaska Airlines flights!\n\nThis New Partnership Can Get You to Hawaii for Fewer Miles!\nI’ll tell you why this is such good news.\n\nRedeem Singapore Airlines Miles for Alaska Airlines Flights!\n\nLink:   Alaska Airlines and Singapore Airlines Partner Up\n\nLink:   Singapore Airlines Award Chart for Partner Airlines\n\nLink:   Singapore Airlines Award Chart With Alaska Airlines\n\nI’m excited that we can now redeem Singapore Airlines miles for flights on Alaska Airlines for a couple of reasons.\n\nFirst, more options for redeeming miles & points is always a good thing!\n\nAnd, earning Singapore Airlines miles are extremely easy.  Because Singapore Airlines is a transfer partner of all 4 major flexible points programs:\n\nAMEX Membership Rewards\n\nChase Ultimate Rewards\n\nCiti ThankYou\n\nStarwood Preferred Guest\n\nSo even if you don’t think you have Singapore Airlines miles, if you collect points in any of the above programs, you can transfer them to Singapore Airlines!  This makes flying on Alaska Airlines much easier.\n\nI’m also happy with the newly published Singapore Airlines award chart!  Most prices are pretty standard.  But there are some sweet spots!\n\nThe New Award Chart for Using Singapore Airlines Miles for Alaska Airlines Flights\n\nColorado to Hawaii (Zone 2 to Zone 5) – 11,500 Singapore Airlines miles\n\nNew York to Texas (Zone 4 to Zone 3) – 7,500 Singapore Airlines miles\n\nWashington to New Mexico (Zone 1 to Zone 2) – 7,500 Singapore Airlines miles\n\nIllinois to California (Zone 3 to Zone 1) – 9,500 Singapore Airlines miles\n\nNorth Dakota to Costa Rica (Zone 2 to Zone 4) – 7,500 Singapore Airlines miles\n\nNote:   You’ll need to call Singapore Airlines ticketing at 800-742-3333 to book partner awards.\n\nFlying from the West Coast to Hawaii now only costs 12,000 Singapore Airlines miles.  That’s cheaper than using British Airways Avios points!  However, we still don’t know how much flights will cost from the East Coast to Hawaii.\n\nAlaska has NOT released their chart for redeeming Alaska Airlines miles for Singapore Airlines flights.  But I’ll keep you updated once we find out!\n\nBottom Line\n\nWe now have another way to use our miles & points for free flights!  Starting today, you can redeem Singapore Airlines miles for flights on Alaska Airlines.\n\nSingapore Airlines is a transfer partner of all 4 flexible points programs, so it’s easier than ever to book an award seat on Alaska Airlines!\n",
      "Folder": "Feedly",
      "Timestamp": "1506701361",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.543964Z"
}