{
  "id": "9abc7c38d1f7455e96f599aea2914e25",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2017/6/7/15758816/donald-trump-comey-crisis",
      "Title": "Donald Trump’s presidency is an American crisis Vox - All",
      "Selection": "America isn’t being made great. It’s being made weak.\n\nOn Friday, January 6, FBI Director James Comey met with President-elect Donald Trump. His task was awkward; he needed to inform Trump that the FBI’s counterterrorism unit was investigating claims that Russia had embarrassing blackmail material on the billionaire real estate developer.\n\nSomething in Trump’s reaction disturbed Comey. “I felt compelled to document my first conversation with the President-Elect in a memo,” he recalls in testimony prepared for the Senate Intelligence Committee. The compulsion to record the conversation was fierce and immediate; Comey didn’t even wait to get back to his hotel. “I began to type it on a laptop in an FBI vehicle outside Trump Tower the moment I walked out of the meeting.” From then on, Comey began documenting all his meetings with Trump. “This had not been my practice in the past,” he says.\n\nOn January 27, Comey again found himself in a strange situation with the president, caught by surprise when a dinner invitation that originally included his family turned into Comey having dinner with Trump, alone, in the White House’s Green Room. Trump immediately asked if Comey wanted to remain in his job, and said many other people would want it — a request Comey found strange, as Trump had already asked him to stay on as FBI director, and Comey had already accepted.\n\n“My instincts told me that the one-on-one setting, and the pretense that this was our first discussion about my position, meant the dinner was, at least in part, an effort to have me ask for my job and create some sort of patronage relationship,” Comey says. Trump would soon make that perfectly clear. “I need loyalty, I expect loyalty,” the president told his FBI director.\n\nIn subsequent meetings, Trump would ask Comey to “lift the cloud” Russia was casting over his presidency, to announce publicly that Trump was not being investigated, and to squelch the investigation into former National Security Adviser Michael Flynn’s activities. In their final conversation, Trump asked for Comey’s cooperation, saying, “I have been very loyal to you, very loyal; we had that thing you know.” Comey says he did not know what “that thing” was. Shortly thereafter, Comey was fired.\n\nComey’s testimony is being parsed for evidence that Trump has obstructed justice, and thereby committed an impeachable offense. Legal analyst Jeffrey Toobin thinks the case is open and shut. “Comey's statement establishes obstruction of justice by Trump,” he writes. “Period.”\n\nThat is an important discussion to have, but I want to focus on the bigger, simpler picture. Donald Trump’s presidency has thrown America into crisis.\n\nThere are two levels to this crisis. The first is the crisis of legitimacy at the highest levels of the American government. As Ben Wittes, editor of Lawfare, writes, “Comey is describing here conduct that a society committed to the rule of law simply cannot accept in a president.” He continues:\n\nThis document is about ... whether we can trust the President — not the President in the abstract, but the particular embodiment of the presidency in the person of Donald J. Trump — to supervise the law enforcement apparatus of the United States in fashion consistent with his oath of office. I challenge anyone to read this document and come away with a confidently affirmative answer to that question.\n\nTrump’s behavior, in Comey’s telling, is more befitting of a Mafioso than a president. He asks, repeatedly, for loyalty, and shows no evident understanding of the norms or institutions that bind American presidents. His actions would be worrying if they came from the regional manager of a Scranton paper firm; they are terrifying coming from the most powerful man in the world.\n\nBut the crisis does not end with Comey. This is the 138th day of Donald Trump’s presidency, and what do we have to show for it? No major legislation has passed, nor is any major legislation close to passage. Of Trump’s major priorities, only 8 percent of Americans want the House-passed (and Trump-endorsed) American Health Care Act signed into law, and a majority oppose the White House’s decision to pull out of the Paris climate agreement.\n\nAmerica’s deepest alliances are fraying, and Trump’s recent visit to Europe left German Chancellor Angela Merkel — a politician known for her understatement, not her overstatement — to say that “the times in which we could completely depend on others are, to a certain extent, over.”\n\nAt the center of all this, Trump is running a chaotic and understaffed government. He has named nominees for only 80 of the 558 key appointments he needs to fill, and only 40 of them have cleared Senate confirmation. Last night brought news that Attorney General Jeff Sessions was considering resigning, and last week brought news that Trump’s communications director had been fired. Trump is tweeting out criticisms of his own Justice Department, investigators are digging into first son-in-law Jared Kushner’s contacts with Russia, and chief eldest child Ivanka Trump has wrested the cover of US Weekly for a profile focusing on her disagreements with her father. Amid all this, Trump’s approval rating is down to a miserable 38 percent.\n\nThis isn’t a reality show, and it’s not a pulp novel. This is the most powerful country the world has ever known being run by a man singularly unqualified to run it. Our president lacks legitimacy, our government is paralyzed, our problems are going unsolved. As we abdicate global leadership, both our allies and our enemies step into the void we leave unfilled. Meanwhile, at home, we are discussing whether the president obstructed justice within his first 100 days in office, and anxiously awaiting the Senate’s questioning of former FBI Director Comey.\n\nAmerica is not being made great. It is being made weak, and it is only getting worse.",
      "Folder": "Feedly",
      "Timestamp": "1496890793",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.664373Z"
}