{
  "id": "9b1fae976e634c90af7ab52f5635d024",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/04/at-the-airport-lost-passport-quora/",
      "Title": "What Should I Do If I Lose My Passport The Points Guy",
      "Selection": "Quora.com is a question-and-answer site where content is written and edited by its community of users. Occasionally we syndicate content from the site if we think it will interest TPG readers. This article originally appeared on Quora.com in response to the question, I’m at the Airport with 90 Minutes Before My Flight When I Realize I Have Lost My Passport. What Should I Do? and was written by Brian Teeter, author of 300 Healthy Travel Tips and publisher at Healthy Trekking.\n\nIf you’re destitute and outside the country, your local embassy or consulate can help. Every US embassy and consulate has an American Citizen Services (ACS) office to help American travelers in emergencies, including receiving wired funds from the US and replacing lost passports. Visit their Get Help in an Emergency website, or call for assistance. If you’re traveling abroad, dial 001 (202) 501-4444; in the US, call (888) 407-4747.\n\nHave Backups Ready\n\nThis is why it’s so important to have photocopies of:\n\nYour passport identification page\n\nThe front and back sides of your credit and ATM cards\n\nYour driver’s license\n\nPhone numbers of your banks, credit card issuers and travel insurance carrier\n\nContact information for your local embassy or consulate\n\nIf you still have your phone and can connect to the internet, we hope you stored scans of these documents and contacts safely so you can download them from a cloud storage location like Dropbox. We’ll award you extra points if you left a set with a trusted family member or friend back home, since they can do a lot to help you fix things.\n\nContact the Police\n\nNo matter if you’re traveling domestically or to a faraway country, absolutely, positively file a police report about your loss or theft. It’s an essential prerequisite to filing a claim on a travel insurance policy, canceling credit or ATM cards, even getting assistance from a traveler’s aid service or your embassy in getting emergency cash, not to mention a new passport. In many cases, the police might have an idea of the pickpockets or thieves who may have stolen your wallet, phone, or purse and could help to get it back.\n\nReplace Your Passport ASAP\n\nYou will need a replacement passport to return home and for just about anything else you will need to do while you’re abroad. This is a top priority. Locate and contact your nearest embassy or consulate. You can find your closest US embassy at this link; Canadian citizens can find embassy locations at this directory. Ask to speak to the Consular Section to report your passport as lost or stolen. You will need to appear in person to get a replacement, something you can usually do in a few days — if your situation is urgent, the embassy may be able to expedite processing. You will also need a police report, especially if you require expedited processing, but be prepared to pony up: a replacement US passport will cost $140. Canadian citizens can expect to pay $190 (Canadian dollars — that’s a lot of bacon). For details on Canadian passports, visit this site. US citizens whose passports are lost or stolen can also contact the National Passport Center by calling (877) 487-2778, or their after-hours number: (202) 647-4000.\n\nTo make this a lot easier, be sure to do the following before you embark on your travels:\n\nMake a Xerox copy (and upload a digital scan to a secure cloud storage location) of your passport’s information page and any visas. It’s a smart idea to store your scanned images on an encrypted USB flash drive hidden in your luggage or hotel safe.\n\nJot down and securely store the address, phone and website of your closest embassy or consulate of the countries you will visit before leaving on your trip. Make sure to store this information on your phone, too, not to mention in the cloud and on that hidden USB flash drive you brought with you. (You did do that, right? Right?) Here’s why: To get that replacement passport you so desperately need, you must do this in person.\n\nBring along some extra passport photos. You’re probably thinking, “Yeah, right.” Well, bucko, this is why you should. Getting a passport photo taken in a foreign country when you don’t have time, money or a passport is a pain in the butt-tocks. When things go sideways, it pays to be prepared.\n\nIt’s a smart idea to enroll in the US State Department’s STEP program in advance of your trip, as it helps US citizens traveling abroad by listing your trip itinerary and information with the nearest US embassy or consulate in the countries you plan to visit so you can receive emergency information and assistance in case of a natural disaster, civil unrest or family crisis. Plus, enrolling in STEP can help your family and friends contact and assist you in an emergency.\n\nConsider Getting a US Passport — And a US Passport Card\n\nAlmost everyone knows about passports. Less well-known is another form of a US passport, the wallet-size passport card. We think spending $55 to register for a passport card in addition to your passport makes sense.\n\nBut first, know that a passport card has limitations. You can’t use it for international air travel. That might sound like a deal-breaker, but stay with us. A passport card can be used to enter the United States from Canada, Mexico, the Caribbean and Bermuda at land border crossings and ocean ports of entry.\n\nBig deal, you say? Consider this: A passport card can be used as a valid form of ID when making purchases abroad and carrying a passport card rather than a passport when you’re taking in the sights of Rome, Tokyo, or Stockholm can give you the peace of mind that your real passport can be securely stored in your hotel room safe.\n\nNow, imagine if you lost your real passport while traveling outside the US. If you still have a passport card, appearing at your closest US embassy to get a replacement passport will be much easier because the information on it will help the embassy staff with the information they need. Plus, even though you would still need a conventional US passport for a return flight home, a passport card can help you with many financial transactions until you can get a replacement.\n\nFeatured image courtesy of Tetra Images via Getty Images.\n",
      "Folder": "Feedly",
      "Timestamp": "1493062548",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.609901Z"
}