{
  "id": "9b8a4dd001bf4de6a152d13354c82d30",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://sports.vice.com/en_us/highlight/bears-drop-balls-at-record-pace-including-one-of-the-worst-youll-ever-see",
      "Title": "Bears Drop Balls At Record Pace, Including One Of The Worst You'll Ever See VICE Sports",
      "Selection": "The Chicago Bears stink, as everyone knows, which means their only real capacity for surprise and joy lies in the details. At 2-9, the Bears probably aren't as bad as the Cleveland Browns, who are winless and probably will stay that way. But that doesn't mean Chicago can't try to be its worst possible self. And that's pret-tay, pret-tay, pret-tay bad.\n\nCase in point: Sunday at Soldier Field against the Tennessee Titans, down 20 points with backup-backup-backup quarterback Matt Barkley at the helm, the Bears mounted an unlikely and impressive fourth quarter comeback. Making his first career NFL start, Barkley threw for 210 yards in the fourth alone, and the Bears found themselves one more short completion from a stunning victory. Of course it didn't happen, because two different Chicago receivers each dropped a pass in the end zone, including the particularly egregious above drop by Josh Bellamy with less than a minute to go.\n\nThis has to tie for the worst drop in NFL history that isn't Jackie Smith of the Dallas Cowboys in Super Bowl XIII. Undaunted, without daunts of any kind, Barkley tried again and threw another sharp pass that was dropped by Deonte Thompson, who at least was diving and actually had a defender to deal with. So that's some kind of excuse, I guess. But there's no excuse for this: The Bears dropped the ball A LOT on Sunday:\n\nBears receivers dropped 10 passes today. That is the most for a team in a game in the PFF era(2006-2016) http://pic.twitter.com/aH3430bfoD\nNathan Jahnke (@PFF_NateJahnke) November 27, 2016\n\nThree of those ten drops happened in the end zone. Not so good. Despite the historic futility of his teammates, Barkley did a good job of acquitting himself on the field and off, and was seen on the sideline encouraging Bellamy about his mistake.\n\nHe also spoke up for his receivers after the game:\n\n\"We win as a team and we'll lose as a team,\" said Barkley, who insisted he never got frustrated with all the drops. \"During the game, I don't get wrapped up in the emotions of all that negativity. I'm trying to keep guys going, keep the tempo pressed and one play at a time.\"\n\nPerhaps something good will come of this for the Bears, like Matt Barkley becoming a viable backup QB, or their receiving group learning something about grit and character and blah blah blah instead of being emotionally scarred for life. But more likely, none of that will happen.\n\nThe Bears lost to the Titans 27-21.\n",
      "Folder": "Feedly",
      "Timestamp": "1480425323",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.690402Z"
}