{
  "id": "9bab2b49588f4275a76fcf72eaad5ef9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1085281/weight-loss-researchers-may-have-found-a-way-to-convert-bad-fat-into-good-fat-that-burns-calories/",
      "Title": "Researchers may have found a way to convert “bad” fat into “good” fat that burns calories Quartz",
      "Selection": "Researchers working with mice may have found a way to convert “bad” white fat—which hoards calories, contributing to weight gain and obesity—into “good” brown fat—which actually helps burn calories.\n\nThe findings raise the prospect of developing more effective treatments, in people, for obesity and diabetes related to weight gain.\n\nWhite fat stores calories and pads our bellies, hips, and thighs. In contrast, brown fat, found near our necks and shoulders, burns calories through a process that generates heat.\n\nThe researchers found that blocking the activity of a specific protein in white fat triggered the fat to begin to brown into beige fat, a type of fat in between white and brown. Blocking the protein to create beige fat caused the fat cells to heat up and burn calories.\n\n“Our goal is to find a way to treat or prevent obesity,” says first author Irfan J. Lodhi, assistant professor of medicine in the endocrinology, metabolism, and lipid research division at Washington University in St. Louis. “Our research suggests that by targeting a protein in white fat, we can convert bad fat into a type of fat that fights obesity.”\n\nBeige fat was discovered in adult humans in 2015. Though it is almost like an intermediary between white fat and brown fat, Lodhi says it functions more like brown fat and can protect against obesity.\n\nHis team conducted a series of experiments in mice, creating a genetic strain of animals that didn’t make a key protein in their white fat cells. Those mice had more beige fat and were leaner than their littermates, even when they ate the same amount of food as other mice. They also burned more calories.\n\n“Mice normally have very low levels of the protein, called PexRAP, in their brown fat,” he says. “When we put the mice into a cold environment, levels of the protein also decreased in white fat, allowing that fat to behave more like brown fat. Cold induces brown and beige fats to burn stored energy and produce heat.”\n\nWhen Lodhi’s team blocked PexRAP in the animals, the mice converted white fat into beige fat that could burn calories.\n\nMore than two-thirds of adults in the United States are either overweight or obese. Some 30 million people have diabetes. These findings study suggest that if therapies could help convert their bad fat into good fat, those numbers might start to decline.\n\nLodhi says if the PexRAP protein could be blocked safely in white fat cells in humans, people might have an easier time losing weight.\n\n“The challenge will be finding safe ways to do that without causing a person to overheat or develop a fever, but drug developers now have a good target,” he says.\n\nThe study appears in the journal Cell Reports.\n\nNational Institute of Diabetes and Digestive and Kidney Diseases of the National Institutes of Health (NIH) grants supported this work. Startup funds from the Washington University department of medicine and a Pilot & Feasibility Grant from the Washington University Diabetes Research Center provided additional funding. The China Scholarship Council provided additional support.\n\nThis article was originally published in Futurity. Edits have been made to this republication. It has been republished under the Attribution 4.0 International license.\n\nRead next: Losing your sense of smell may help you lose weight—and it has nothing to do with taste\n\nRead next: Low-calorie sweeteners don’t actually help you lose weight\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1506112074",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.547917Z"
}