{
  "id": "9c8cbe8952394edfaf514a2e957753f4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/15664-how-to-make-chicken-wings-how-you-like-them-buffalo-baked-or-otherwise",
      "Title": "How to Make Chicken Wings How You Like Them—Buffalo, Baked, or Otherwise Food52",
      "Selection": "Chicken wings have got a bad reputation for hanging around sketchy bars. It's time to intervene. Because you can make chicken wings that are crispy and tender, that are doused in homemade hot sauce butter or your favorite spices, that are actually addictive and not at all dubious—and you can do it in under a half hour without any frying oil at all (unless you want to). There will be no bottled stuff—only fiery, fruity peppery flavor and dark meat cooked in its own fat (plus a bonus round of wing tips to chew on when nobody's looking).\n\nHere's how to make chicken wings just how you like 'em (without a barstool):\n\nI hope you picked up a few beers. Photo by Bobbi Lin\n\n1. Prep your wings.\n\nAs always, the better quality meat you get the better dinner is going to taste—and in the case of chicken wings, your wallet won't be harmed in the process. Buy whole chicken wings and break them down into three parts yourself; not only will the meat be even less expensive, but the butchering is quick work and you'll have the added bonus of getting some wing tips in the mix. (Wait, wing tips??)\n\nA whole chicken wing has three parts, not just two: the drumette (with a large end like a club), the wingette (flat, with two bones), and the tip (pointy, wing-like, and too-often discarded). To break a wing down into these parts, slip your knife into one of the two joints, rocking it side to side until the blade slides through and separates the parts. You shouldn't have to cut through bone, only cartilage, and you'll get the hang of it after a few wings. Continue until all your drummettes, wingettes, and tips are free agents.\n\nTossed with just a bit of baking powder, your wings will get crispier in the oven. Photo by Bobbi Lin\n\n2. Play your crispy cards.\n\nA chicken wing shall not be battered, as it gets all of its delicate crispness from dried, fried skin. So don't dredge! Don't flour! Don't dip! Instead, towel off as much moisture as you can using paper (or unpaper) towels, and then:\n\nBefore roasting and even before fridge-drying (see below), toss your wings in a little salt and a bit of baking powder, which will both up the pH (encouraging the Maillard reaction + browning), and create bubbles on the surface of the chicken (more bubbles = more and thinner surface area = greater chance of getting crackly). For each pound of wings, toss with 1 scant teaspoon of baking powder before setting out to dry.\n\nIf you have the foresight, let your wings dry out, uncovered, in the fridge overnight, skin-side up like you would a whole chicken before roasting. The less moisture in the skin, the cracklier it's going to become in the oven. If you're making wings tonight, don't worry about setting them out to dry—just let them come to room temperature, towel them off thoroughly, and toss with baking powder and salt before roasting.\n\nMore: The fridge does the same thing for roasted vegetables.\n\nWho says hot sauce comes from a bottle?\nPhoto by Bobbi Lin\n\n3. Prep your sauce or rub.\n\nDecide at the outset: Are you making dry-rub wings (coated in spices) or saucy ones? To me, the humble chicken wing reaches peak deliciousness doused in equal parts butter and hot sauce (triple points if you make the latter from scratch), but it's your decision really. Either way, I behoove you to flavor your wings from scratch. (Otherwise, why are you here?)\n\nSaucy Wings Ingredients + Procedure\n\nOn a scale of spicy to sweet, there are endless options for great wing sauces. To make your own, blend fresh raw ingredients until smooth, then pour the slurry in a saucepan and melt enough butter into it to make it rich and creamy (for every 1 cup of sauce, use 1 stick of butter—be brave). How spicy, how savory, or how sweet it ends up being depends on what you pile in that blender.\n\nYou can never have too much warm, buttery wing sauce. Photo by Bobbi Lin\n\nHere's what to add to your wing sauce based on how you like your wings (tinker with quantities, but heavy on the flavor you like the most):\n\nFor heat: Warm-colored hot peppers (cherry peppers, cayenne peppers, red jalapenos, habanero peppers, etc.); dried chilis, reconstituted in warm water\n\nFor freshness: Citrus (blood orange, grapefruit, lemon, lime, etc.) juice or zest\n\nFor heft: Red or yellow bell peppers; tomatoes; carrots\n\nFor richness: Garlic; shallots; onion\n\nFor sweetness: Honey; molasses; brown sugar\n\nFor pizzaz: Ginger; horseradish root; lemongrass; fresh turmeric; smoked paprika\n\nWhiz your concoction in the blender with enough vinegar to make it smooth—something mild, like rice vinegar, will let the vegetable flavors shine, but something punchier (apple cider vinegar? red wine vinegar?) would impart much more tang.\n\nPhoto by Bobbi Lin\n\nDry-Rub Wings Ingredients + Procedure\n\nFor dry rub wings, you'll want to toss together—you guessed it—a flurry of ground spices and even herbs, which you'll actually toss the wings in before cooking them. For the most flavor, start with whole spices, toast them up in a dry skillet, and then grind them in a mortar and pestle before tossing with the wings (though no one at this company will know if you choose to start with pre-ground spices).\n\nSome ideas for dry-rub ingredients include: cayenne pepper, chili powder, paprika, garlic granules, onion powder, ginger powder, black pepper, brown sugar, celery salt, dry mustard, cumin, coriander, savory, etc. Whatever gets you going, really!\n\nBake.\n\nYou might have realized we are headed towards the oven and not the deep fryer, but that's because we like you and your presently not-grease-splattered kitchen—and because wings that brown on a baking sheet, cooking top-down in their own fat, are really delicious. They'll even get crisp if you stick to the above procedures!\n\n(If you must, must fry your wings, do so twice—as you would a french fry—for maximum crispness: about 20 minutes in oil that's about 250º F, and then after removing and resting, again in oil that's about 400º for 10 minutes, or until brown.)\n\nPhoto by Bobbi Lin\n\nHow long the wings need to cook through can depend wildly on your oven: My most recent batch took about 45 minutes total, while our test kitchen cranked them out in 22. Heat the oven to 450º F, space the baking-powdered, salted wings (that have also been coated in spices, if you're dry-rubbing) out on one or two baking sheets skin side up, slip them in when the oven's hot, and start a timer. The first side will take longer to brown—15 minutes? 25 minutes?—and then, once flipped, the other side will go quickly.\n\nNever fear: Due to their cush fat content, wings are much more difficult to overcook than other chicken cuts. Though don't let them sit in the oven all afternoon.\n\nNot your bartender's chicken wings. Photo by Bobbi Lin\n\nUnstick the wings from the pan (which shouldn't be too hard if you started them fatty-side up) and let rest for 5 to 10 minutes before tossing with that warm, buttery, possibly orange sauce, or serve them up with the sauce in a bowl on the side. Don't forget carrot and celery sticks—which as I'm sure you know are there not just for balance but, dunked in white sauce, to keep your mouth from being too on fire—but do consider adding other crisp vegetables and fruits to the mix: jicama, peeled broccoli stems, green pepper slices, apple sticks, pears, etc.\n\nWhich reminds me: You'll want a creamy, cooling dip to counteract all that richness. Here are two reliable options:\n\nHomemade Blue Cheese Dressing\nby Tara O'Brady\n\n♥\n\n+\n\nButtermilk Ranch in a Jar\nby Tara O'Brady\n\n♥\n\n+\n\nDo you make chicken wings at home? What are your favorite ways to flavor them? Share your ways in the comments.",
      "Folder": "Feedly",
      "Timestamp": "1454339325",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.800798Z"
}