{
  "id": "9d3bf7391bf84bf6999daee2fcd75449",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1050525/the-latest-rand-survey-paints-a-disturbing-portrait-of-the-american-workplace/",
      "Title": "The latest RAND survey paints a disturbing portrait of the American workplace Quartz",
      "Selection": "American jobs are grueling, according to a newly published RAND survey.\n\nFor the first time in 2015, the nonprofit think tank asked its nationally representative survey panel about their attitudes toward the workplace. “The portrait that emerges is of a workplace that is taxing on a lot of dimensions,” says Nicole Maestas, an associate professor at Harvard Medical School and the lead author of the study, which was published Aug. 14. “It’s hectic, fast-paced, and jobs can be emotionally and physically taxing.”\n\nAmong the survey’s results:\n\nNearly three-fourths of Americans report either intense or repetitive physical exertion on the job at least one-quarter of the time.\n\nMore than one-half of Americans report exposure to unpleasant and potentially hazardous working conditions.\n\nNearly one in five Americans are exposed to a hostile or threatening social environment at work, such as unwanted sexual attention and verbal abuse.\n\nMost Americans (two-thirds) frequently work at high speeds or under tight deadlines, and one in four perceives that they have too little time to do their job.\n\nAbout one-half of American workers do some work in their free time to meet work demands.\n\nOnly 38% of workers state that their job offers good prospects for advancement.\n\nNot all of these burdens are equally distributed. Non-graduate workers, for instance, were more likely to report intense or repetitive physical exertion as well as unpleasant and potentially hazardous working conditions. They were less likely to control their own schedules, and more than one in five non-college-graduate, prime-age workers (age 35–49) were subject to frequent changes to their work schedules.\n\nOther burdens, like working under time pressure, were more evenly distributed among those who did and did not graduate from college, though in different forms: Non-graduates were more likely to work at high speeds, while graduates were more likely to face deadline pressure.\n\n“The incidence of these poor working conditions falls harder on workers without a college degree, “Maestas says. “But even there I was surprised in how taxing work can be even for college educated workers.”\n\nPeople did report some upsides. For instance, workers tend to turn to each other for support. More than half of workers described their bosses as supportive, and 56% said that they had very good friends at work.\n\nRAND also asked survey respondents about three sources of meaning in their work. Did they feel : “satisfaction of work well done,” “feeling of doing useful work,” “sense of personal accomplishment,” “make positive impact on community/society,” “opportunities to fully use talents,” and “goals to aspire to?”\n\nAbout 80% said their job provides at least one of those things always or most of the time.",
      "Folder": "Feedly",
      "Timestamp": "1502685146",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.560570Z"
}