{
  "id": "9d41f953cdca46ceab4bd55dbfc04790",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/940599/the-pickiest-of-kids-ate-dozens-of-new-foods-after-a-two-week-training-devised-by-a-psychologist/",
      "Title": "The pickiest of kids ate dozens of new foods after a two-week training devised by a psychologist Quartz",
      "Selection": "If a child is a fussy eater, there’s probably not one single reason why. It could be genes. It could be the subtle hints the child—or small baby—has learned by watching their family at the table. It could be the psychological connections that their parents have helped forge between certain foods and emotions. Then again, becoming choosy about what to eat is also a normal part of development—up to a point.\n\nBut when food selectivity feels severe, parents may worry they’re raising picky eaters who will still be subsisting on cheese pizza and Cheerios by the time they head to college. In extreme cases, the behavior could even be linked to a problem like depression or anxiety, or to another condition, like ADHD.\n\nBut there is hope, even for the pickiest of toddlers. Science has proven that it’s never too late for children (or adults, for that matter) to expand the variety of foods they consume and build a healthier long-lasting relationship with food. In First Bite: How We Learn To Eat, Bee Wilson, a British food journalist, reports on several ways to do this.\n\nWilson reports on a particularly remarkable experiment that introduced new foods to a toddler and a 5-year-old through a method developed and tested by Keith Williams, a psychologist and professor of pediatrics who is now the director of the Feeding Program at the Penn State Health Milton S. Hershey Medical Center.\n\nIn the study, published in the journal Appetite in 2007, Williams worked with two children, a boy aged aged 3, and a girl of 5. Both children had autism and the extremely selective eating habits that often accompany it. The boy would only eat toasted cheese sandwiches and hotdogs, and was often disruptive and aggressive during family meals. At one time, the girl had been open to five foods: bacon, chocolate, eggs, hot dogs, and toast. However, she had not allowed any foods past her lips for six months when she arrived at Williams’ clinic, and was reliant on a gastronomy tube.\n\nThe psychologist designed a repeated exposure protocol, a modified version of the Tiny Tastes idea, to introduce the children to unfamiliar foods in manageable rations during short “taste sessions.”\n\nHere’s the key: these tastes could be as small as a grain of rice, or a pea, to make the sampling as easy as possible for the children. They would be allowed to leave the room to play only after they tasted the new food.\n\nThis treatment also involved “probe meals” in which a child was presented with tablespoons of three or four different foods, not all of them new. In the “meals,” the children were instructed to take a bite of something, but were allowed to leave the room after 10 minutes, whether they had eaten or not. Crying and tantrums were ignored, but any time a child took a bite of food, they were praised and rewarded with positive attention.\n\nThe children’s parents selected which foods were to be introduced to their child’s repertoire, and the micro-entrees were prepared the way the family would normally prepare them at home. (The doctors didn’t use any special cooking techniques, or butter or sugar, to enhance the food’s flavor.)\n\nWhenever a child began eating one of the novel items without any resistance or crying in a taste session, the bites of that food would become larger at subsequent presentations. Next, extra bites were added. Those foods ignored during probe meals would be introduced in taste sessions. In scientific parlance, this gradual change in the environment is called “fading”: the experiment’s rigid structure faded as eating became more natural, which required more effort from the subject over time.\n\nAfter two weeks of such intense therapy, the little boy was eating 65 different foods, and the girl, 49. Checking in on the families three months later, Williams found that both children had continued to eat most of the previously untried foods. Working with colleagues and students, he has since replicated the study twice, training parents in the approach both times, and both studies were just as successful.\n\nExtreme selective eating disorders are more common in children with special needs like autism, but intense, defiant pickiness can be an issue for any toddler and can live on well past childhood. Williams notes that most parents experiment only with “hunger induction”: they simply wait out a child’s refusal to eat what everyone else is having. If that worked, he tells Quartz, he wouldn’t be seeing hundreds of kids every year.“What happens is, the parent gets punished,” he says. “The child may yell, they may cry. Can a parent put up with that until the kid will try a new food?”\n\nWhat scientists know is that a person, young or old, must be exposed to an unfamiliar food many times before they will learn to like it, Williams emphasizes. The protocol is not about nutrition; it’s about debunking beliefs that apples, for instance, taste terrible, or that the only good foods are white ones.\n\nThe amount of food that’s eaten is irrelevant, says Williams, but “what we do know is ingestion counts. Sniffing the food, playing with the food, rubbing the food in your hair —none of that seems to matter.”\n\nWhat’s more, kids who only lick unfamiliar foods, which some methods of dealing with picky children suggest, typically don’t move on to eating them. Worse, they may pick up the habit of licking what’s put before them, not eating it. “We don’t think it helps,” Williams says, “but there’s not a lot of good research on licking.”\n\nIf a child believes that they will gag if they consume a pea-sized piece of asparagus or half a blueberry, he instructs them to start chewing as soon as the tiny amount of food is in their mouth, because chewing and gagging are incompatible human responses. The child should also be allowed to choose the perceived lesser evil among new flavors, and the options should include starches, meats, fruits and vegetables. If the beef doesn’t look appealing, maybe the peach will.\n\nThis recipe for repeated exposure is not going suit every child, and may be too intense for some. It’s also not the only evidence-backed method for broadening a child’s repertoire of foods. Williams co-authored Broccoli Boot Camp, published in 2016, to outline several others.\n\nIn an email to Quartz, Wilson called Williams one of her “greatest heroes.” She found his work “extremely moving,” she said, because “he was so clearly trying to alleviate the huge suffering that goes along with extreme picky eating, for both children and parents.”\n\nThat might sound hyperbolic, but for a working parent who’s exhausted even before a dinner battle begins, it’s easy to feel fatalistic about the way a child responds to food. Williams has shown that there’s no need to be.\n",
      "Folder": "Feedly",
      "Timestamp": "1490490643",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.696219Z"
}