{
  "id": "9d8204ef1c7f445b8a9682c15ef2f0a1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.artofmanliness.com/2018/03/28/how-to-handle-a-promotion/",
      "Title": "How to Be Manager to Your Friends and Peers The Art of Manliness",
      "Selection": "You’ve been in your job at work for a few years, and for almost as long you’ve been angling for a promotion to a higher position. One day the desired slot opens up, and your boss calls you into his office to let you know you’ve got the job. You’re excited, of course. As you should be! But you also feel a bit of trepidation. Even though you’ve thought a lot about getting this promotion, you haven’t really thought much about the reality of what your new position will entail. How will you handle it, particularly being put over folks who used to be your peers? You’ll be managing the folks you used to complain with; you might now be “the man” that folks want to complain about.\n\nMany promotions mean moving up a corporate ladder and managing people you previously worked with on the same level. That’s just how business hierarchies work. Even if you were already a manager, maybe you moved up a rung and are now leading other managers. No matter the scenario, there’s often some awkwardness and politics to navigate.\n\n(Granted, that’s not all promotions. Sometimes you just get a new title, a salary boost, and some new responsibilities, without moving into a new management role. In those cases, your transition is probably a little more straightforward.)\n\nIf you’re in a new position where you’re being asked to oversee your former peers and/or current friends, here are a few tips on how to handle that transition smoothly and successfully:\n\nCelebrate! (But Quietly)\n\nYou’ve earned a promotion! Huzzah! You should rightly celebrate. Get yourself a new suit or briefcase, go out to a fancy restaurant with your family and/or friends, and take some time to appreciate that your hard work paid off.\n\nBut, don’t do those things in front of your coworkers (possibly now your subordinates). Take a pass on the victory lap around the office and the shouts of “Yippee! Suck it, losers!” Wear your new suit to work, of course, but don’t brag about it as a prize to yourself for getting promoted. Don’t mention to your office mates that you had the most expensive, best tasting steak in the world last night. Play it cool, man. Rubbing it in their face, especially if it’s someone you don’t really like, might be exactly what you want to do, but won’t get you started on the right foot in your new position.\n\nAcknowledge the Change\n\nJust because you won’t celebrate your promotion in the face of your coworkers doesn’t mean it has to go totally unacknowledged. It’s not a bad idea to briefly meet face-to-face with the folks you now manage and have a conversation about what the relationship might look like moving forward. You might say something like:\n\n“Of course things are a little different now, but, as your manager, I want nothing more than for you to succeed. Don’t hesitate to come to me with any issues you might have; my goal is to provide you with training, skills, oversight, and an environment that promotes your own success here. Here’s my vision for our team and how we’ll operate . . . Do you have questions or concerns right off the bat? Are there any changes you’d like to see made in how things are run?”\n\nOperate With a Clean Slate\n\nIf you’re now managing some of the people with whom you were once equal peers, it might be hard to forget some of the shenanigans they participated in: the company-sponsored networking event where Bill had a few too many drinks; the time Rob called in sick, but you know he was really just at home watching March Madness (and texting you the whole time).\n\nNow that you’re managing these people, what do you do? The best tactic is to wipe the slate clean of any past misdeeds. That doesn’t mean looking the other way in the face of future poor etiquette or the breaking of company rules, but it does mean you should forgive and forget things that might have happened before you entered your new role.\n\nYou Have More Responsibility Now; Act Like It\n\nWhile a promotion sure enough means a salary boost and sometimes a new office that’s all yours, it also means greater responsibility. You might now have access to more sensitive information, or even just greater access to higher level folks in the company. You’re probably being watched a bit more by both your superiors (not micromanaged necessarily, but in a “can he handle this?” sort of way) and those you’re now in charge of.\n\nIf you used to regularly be 5-10 minutes late, make it a habit to be 5-10 minutes early instead. If you used to commiserate with your peers about lame company policies or engage in gossip about your coworkers, make it a point to stay away from those conversations. In a higher level position, your example means a whole lot more. If you’re occasionally showing up late or gossiping, people will take that to mean that it’s okay to do those things.\n\nAlso be sure you aren’t sharing privileged information with those who aren’t privy to it. Maybe you now know the CEO’s salary, or you found out some weird quirk of his that would make your buddies laugh — hold it in. Take the responsibility of the new position seriously.\n\nDon’t Be Hurt If You’re Treated Differently . . .  \n\nIt’s inevitable that your relationship will change with your former work pals when you’ve been promoted, especially if you’re now directly managing them. Don’t be surprised if you aren’t invited to happy hour, or if breakroom conversation lulls when you show up. There’s a power dynamic in place that just can’t be ignored; your old pals don’t want to put themselves in any sort of compromising position. It’s a hard truth, but something you’ll just have to accept. You don’t want to be the supervisor who desperately wants back in with his old crew.\n\nYour interactions might be a little more stilted, but if you work at making everyone feel comfortable and like they’re heard, you can maintain the good relationships you had before, albeit with slightly different dynamics.\n\n. . . In Fact, You Should Establish Some Boundaries\n\nEven if your coworkers are okay with you still joining them at the water cooler or going out to eat together for lunch, it might be a good idea to intentionally remove yourself — at least a little bit — from those scenarios. If you’re now the boss, maintaining a relationship that’s purely friendly won’t lend you the authority to deal with problems when they come up, be they minor things (like subordinates taking slightly long lunch breaks) or serious (like needing to fire them). Your leadership in general can come in to question if your relationship doesn’t change in the least bit.\n\nIf you disengage from casual chit-chat, and say yes to fewer lunch invitations, you’ll start to cultivate that air of authority that you may need in your new position. It’s not necessarily fun, but again, just comes with the territory of having more responsibility. Embrace the change, and take it as a chance to expand your social life outside the office. Workplace friendships are great at times (in fact you need a work pal!), but don’t tend to be the longest-lasting or most meaningful.\n\nNow, if you’ve been promoted to a different division or office and you aren’t directly overseeing the people you once worked with, there’s nothing wrong with maintaining those relationships as you did before.\n\nMake Changes Slowly\n\nIf you’ve been promoted, it might be because you’ve had some great ideas that have been implemented, and you have even more in this new position about how things should operate. Be careful about changing things too quickly though. Even if some systems and processes are outdated, you don’t want to change up how things have been going for years and years until you’ve been in your new position for a little while. For the new guy on the job to make wholesale fixes will seem foolhardy to others — like you don’t have enough experience to fully appreciate what’s going on. And really, that’s true. Problems will often look different from the inside than they did from the outside; you’ll find out some nuances and complexities you formerly weren’t privy to.\n\nSo take some time to get the lay of the land and get used to your new position before you go about making big, sweeping changes. When you do, it’ll seem more measured rather than an impulsive need to change things for the sake of changing things.\n\nYou don’t want to step on any toes or damage any relationships before you even get started.\n\nLearn What You Have Yet to Learn\n\nChances are good that as you move into a new role, you’ll realize you have a lot to learn. You were likely in your old position for at least a couple years, and in that time, you came to know your daily processes and the ins and outs of your job like the back of your hand. You just intuitively get into a real groove after a period of time, and you’ve likely forgotten how much you had to learn and how rough the going was at the very start.\n\nNow in a new role, even within the same company, you’re sort of starting from scratch again. You have new systems to learn, new supervisors to get in sync with, and most likely, new skills and managerial techniques to hone. \n\nEspecially if you’re brand new to managing people, you’ll need to learn how your team works best and what motivates them, both individually and as a cohesive unit. You’ll also need to bone up on conflict resolution, negotiation, delegation, etc. This is another reason you don’t want to make sweeping changes right off the bat; you may have a lot to learn, especially about how your team operates, and you don’t want to jump the gun before you have enough facts or skills under your belt.\n\nAct Like You Belong\n\nWhen you’re promoted, even if you’ve worked hard at getting there, it can feel like you don’t quite belong — like you’re faking it or pulling one over on your higher-ups. The reality, though, is that you did work hard, and you were chosen for a promotion for a reason. Don’t be timid or demure about the new role; act like you belong there. Fake it until you make it, and assume the mask of command.\n\nConsider even changing your style to reflect the new position. Maybe in your old role you wore the classic office uniform of khakis and a polo or long-sleeve button-up shirt. Now that you’re moving up the ladder, consider subtly upping your wardrobe a level as well, even and especially if you don’t have to. Add a blazer or two to the mix, level up your shoes and other accessories, and heck, even wear a suit now and then (as long as a suit is just one notch or so above what everyone else is wearing; you don’t want to rock one when the workplace uniform is jeans and a polo; in that case, know how to rock a sports jacket with jeans).\n\nYour new duds will not only function as a signal of authority to others, but to yourself as well, helping you psychologically step into your new role and key into a more confident mindset.\n\nMentor Your Subordinates\n\nSupport the people under you as much as possible and help them get better at their jobs. Take the time to teach; don’t just tell them what to do, but show them how to do it, and explain why they do it. Offer praise, both privately and publicly. Listen to their ideas, and if they’re good, pass them on to your own supervisor.\n\nSuch mentorship benefits your subordinates, but it benefits you too; the higher-ups won’t likely give you another promotion until they feel confident someone in your department is ready to take your place. As you help those under you move up, you help yourself move up too!\n\nThe post How to Be Manager to Your Friends and Peers appeared first on The Art of Manliness.\n",
      "Folder": "Feedly",
      "Timestamp": "1522988344",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.525024Z"
}