{
  "id": "9e3461bd0c264b63905614236520a2f6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/59489/Moscow-Designers-Tiny-Apartment-with-Tons-of-Built-In-Storage-Solutions",
      "Title": "Moscow Designer's Tiny Apartment with Tons of Built-In Storage Solutions Core77",
      "Selection": "Alireza Nemati lives in Moscow, where he and his wife live in a tiny apartment—just 35 square meters (about 375 square feet). Fortunately Nemati is a product designer, so, design to the rescue! \"[My] main task,\" Nemati writes, \"was to create a comfortable open space plan with enough area for storage with access to natural light.\"\n\nThe apartment was originally subdivided. It looked like this:\n\nSo Nemati had the walls ripped out, leaving only the bathroom, and planned this:\n\n\"I decided to design a furniture system,\" he writes, \"that would make the most of the existing space.\" Here's how the system fit within the newly empty apartment:\n\nAnd here's what it looks like in photos. If we orient ourselves according to the blueprints above, here is the view looking north. To the left is the bathroom door; at center is plenty of storage; behind the curtain is the front door. To the right we see an elevated sleeping nook and a staircase.\n\nBoth the area beneath the sleeping nook and the staircase itself contain plenty of storage. (You'll notice the staircase is reversed in the GIF below, am not sure why.)\n\nHere's the sleeping nook, paneled in pine.\n\nI like the idea of having a storage area for reading material on only one side of the bed. That way whomever's on that side can regulate what the other reads, granting or denying access to particular books at whim. I find most relationships are held together the same way as suspension bridges: Through tension.\n\nLooking east, we see this large white wall…\n\n…which also contains plenty of storage.\n\nLooking southeast we see aforementioned daylight.\n\nPivoting towards the west we see a dining table, a desk for working and a small efficiency kitchen.\n\nThe bathroom makes nice use of color to give it a little pop.\n\nThere is only one major problem with the apartment—and I don't know that you can blame this 100% on the design—which is that the apartment is haunted. Here you can see an incorporeal phantom creepily ascending to the sleeping nook.\n\nFinding no victims there, the fiendish ghoul then descends the staircase, its murderous rage left unsatisfied.\n\nI spotted the ghastly wraith again in the reflection of the bottom-most framed piece of artwork here. It might be hard for you to see but I have an expert eye.\n\nHe appears to be hoisting a camera in a grotesque mockery of life. I'm told ghosts often carry objects they died with, so most likely this ghost was a camera salesman.\n\nAnyways, cool apartment! If it wasn't for the ghost I'd move in in a heartbeat.\n",
      "Folder": "Feedly",
      "Timestamp": "1484177882",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.726354Z"
}