{
  "id": "a07c1ca07f294f8e87b1f1bd63028473",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2016/7/18/12200916/panorama-ticket-giveaway-2016",
      "Title": "Win a pair of VIP passes to join The Verge at Panorama this weekend! The Verge",
      "Selection": "The Verge is partnering with the Panorama music, art, and technology festival from July 22nd to the 24th at Randall's Island Park in New York City, and we've got a pair of VIP festival passes to give away! The winner will also get early access to two pairs of Doppler Labs' Here Active Listening earbuds.\n\n\nYou'll be able to hear amazing artists including LCD Soundsystem, Kendrick Lamar, Alabama Shakes, and Arcade Fire. You will also see the amazing technology and art at The Lab, presented by The Verge and powered by HP. The winner will receive:\n\n\n\nTwo (2) VIP passes to the Panorama Festival\n\n\n Two (2) pairs of Doppler Labs' Here Active Listening wireless earbuds\n\n\nBecause the VIP passes include access to private bars with spirits, you must be 21+ to enter. They do not include transportation or lodging, so we're keeping entry to residents of New York, New Jersey, and Connecticut. More details below!\n\n\nHow to Enter\n\n\nPanorama VIP Tickets Giveaway\n\n\n\n\n\n\n\nTERMS & CONDITIONS\n\n\nNO PURCHASE NECESSARY. The Verge Panorama Festival VIP Ticket Giveaway starts on July 18th, 2016 at 9AM ET and ends on July 19th, 2016 at 9AM ET. Open only to eligible legal residents of the NY Tri-State Area (New York, New Jersey, and Connecticut), 21 years or older. Click here for Official Rules and complete details, including entry instructions, odds of winning, prize details and restrictions, etc. Void where prohibited or restricted by law. Sponsor: Vox Media, Inc.\n\n",
      "Folder": "Feedly",
      "Timestamp": "1468881575",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.732135Z"
}