{
  "id": "a0a2c955af0e4157ae2338af839ff86f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2019/1/31/18205539/chris-christie-book-tour-jared-kushner-feud",
      "Title": "Why Chris Christie and Jared Kushner hate each other so much Vox - All",
      "Selection": "In his new book, Christie accuses Kushner of exacting a revenge plot over a decade-long family feud.\n\nOne of the strangest — and most consequential — feuds in Donald Trump’s orbit has long been the enmity between presidential son-in-law Jared Kushner and former New Jersey Gov. Chris Christie. And now it’s back in the news because Christie has aired his grievances in a new book.\n\nChristie is currently making the rounds promoting Let Me Finish, a memoir recounting his upbringing, political rise, and time spent in — and out of — President Trump’s inner circle. Christie has made clear in the book, and on his press tour promoting it, that he still has a bone to pick with Kushner and his entire family over a clash that began more than a decade ago.\n\nIn 2004, Christie, then the US attorney for New Jersey, investigated the Kushner family patriarch Charles. The tale that ensued is a salacious one that involves illegal campaign contributions, videotapes, and a sex worker. Christie’s prosecution culminated in a prison sentence for Charles Kushner.\n\nA decade later, Christie became a prominent supporter of Trump’s presidential candidacy, and Trump named him to lead transition planning. But just after the election, Christie claims, Jared Kushner engineered Christie’s ouster.\n\nNow, in the book, Christie is trying to settle scores. One chapter is titled “Jared’s Meltdown,” and elsewhere he accuses Kushner of orchestrating a political “hit job” against him.\n\nChris Christie’s Charles Kushner prosecution, briefly explained\n\nCharles Kushner was (and still is) a prominent New Jersey real estate developer who built Kushner Companies, a billion-dollar real estate empire. In the late 1990s and early 2000s, he was also a big name in the state’s Democratic Party politics as a prominent donor and ally to Jim McGreevey, who served as governor of the state from 2002 to 2004. McGreevey named Kushner as commissioner for the Port Authority of New York and New Jersey, but Kushner resigned from the post in 2003 when questions about his political donations started to percolate.\n\nIn the early 2000s, a feud erupted between Charles Kushner and his siblings, Murray Kushner and Esther Schulder, and his brother-in-law, Bill Schulder. And this feud had serious legal implications.\n\nMurray filed a lawsuit accusing Charles of diverting money from their businesses to political candidates, among other misdeeds. Then an accountant turned whistleblower filed a subsequent lawsuit saying he was fired when he provided evidence that Murray’s allegations were true.\n\nSo then-US Attorney Chris Christie began investigating the matter. As New York magazine reported, Charles Kushner’s allies viewed the probe as political — maintaining that Christie, an ambitious Republican appointee, was using a pretext to go after a top Democratic donor. And Charles blamed his relatives.\n\nSo in an attempt to retaliate against the family members he believed were out to get him, Charles arranged for a sex worker to be paid $10,000 to seduce his brother-in-law Bill and secretly taped the encounter. He then sent the tape and photographs to his sister Esther, Bill’s wife. (He also tried to pay a sex worker to seduce the accountant, but the accountant turned the woman down.)\n\nChristie writes about meeting with the Schulders regarding the incident and claims Esther Schulder expressed confidence her brother had been behind it. Christie says she told him that “Charlie plays on people’s weaknesses” and that her husband “had a weakness.” Investigators were eventually able to link Charles to the tapes.\n\nCharles Kushner was arrested; in 2005, he pleaded guilty to 18 counts of tax evasion, witness tampering, and making illegal campaign donations. He was sentenced to 18 to 24 months in prison. (Christie had pushed for a stiffer sentence because he said Kushner failed to demonstrate “acceptance of responsibility” for what he had done.) Charles served 14 months in a federal prison in Alabama and served out the rest of his sentence in a halfway house in New Jersey.\n\nAfter his release, Charles went right back to work. But the ordeal was a formative experience for his son, Jared. In a 2009 interview with New York magazine’s Gabe Sherman, it was clear he hadn’t let go of what happened and sees his father as a victim:\n\n“His siblings stole every piece of paper from his office, and they took it to the government,” Jared maintained. “Siblings that he literally made wealthy for doing nothing. He gave them interests in the business for nothing. All he did was put the tape together and send it. Was it the right thing to do? At the end of the day, it was a function of saying ‘You’re trying to make my life miserable? Well, I’m doing the same.’”\n\nIndeed, Kushner advocated for the criminal justice bill passed by Congress last year and said his interest in the matter stems from his father’s experience.\n\nJared Kushner allegedly brought his Chris Christie hate to the Trump campaign and the White House\n\nIn the ensuing years, Christie became governor of New Jersey and a rising star in Republican politics, and Jared Kushner married Donald Trump’s daughter Ivanka. So as Trump ran for president in 2016, their paths crossed.\n\nKushner had a top role on Trump’s campaign. Then after Christie himself dropped out of the race, he became one of Trump’s most prominent early endorsers and surrogates. And in the spring of 2016, the campaign tapped him to begin planning for a potential transition should Trump win the election.\n\nChristie writes in his book that Kushner had a “meltdown” when he heard this news. He writes that Kushner tried to keep Trump from bringing him on. Subsequently, he writes, the pair agreed to put the past behind them — but the president’s son-in-law kept working against him behind the scenes. Christie writes that former Trump campaign chair Paul Manafort told him Kushner tried to push him out of the transition as well.\n\nEventually, Kushner’s efforts were successful: Christie was fired from the Trump transition team just a few days after the election. According to Christie’s book, Steve Bannon told him “the kid” — as in, Jared — was the reason he was forced out:\n\n“The kid’s been taking an ax to your head with the boss ever since I got here,” he blurted out. “It’s been constant. He never stops. Ancient bitterness, I guess.”\n\nChristie wrote that Kushner, “apparently seething over events that occurred a decade ago, was exacting a plot of revenge against me, a hit job that made no sense at all for the man we had just helped elect.”\n\nBut as for the stuff with Jared’s father, Christie has no regrets.\n\n“If a guy hires a prostitute to seduce his brother-in-law and then videotapes it and then sends the videotape to his sister to attempt to intimidate her from testifying before a grand jury, do I really need any more justification than that?” Christie said in a recent interview with PBS. “I mean, it’s one of the most loathsome, disgusting crimes that I prosecuted when I was US attorney.”\n\n\"It's one of the most loathsome, disgusting crimes that I prosecuted...and I was the U.S. attorney in New Jersey.\"@ChrisChristie talks about prosecuting Charles Kushner for tax evasion, illegal campaign contributions and witness tampering. #FiringLineShowPBS pic.twitter.com/rBNn0j0bCY\n\n— Firing Line with Margaret Hoover (@FiringLineShow) January 29, 2019\n\nIn an interview with NPR, Christie also issued a warning about Kushner’s power in the White House. “There is simply no one more influential in the White House on the president than Jared Kushner,” he said. “He’s not the only person who he listens to, but I don’t think anyone has more influence than Jared has.”\n\nThe news moves fast. Catch up at the end of the day: Subscribe to Today, Explained, Vox’s daily news podcast, or sign up for our evening email newsletter, Vox Sentences.\n",
      "Folder": "Feedly",
      "Timestamp": "1549135281",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.429669Z"
}