{
  "id": "a2103863fa5f4e7e81101e768ae00a9d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/ultimate-guide-chase-ultimate-rewards/",
      "Title": "The Ultimate Guide to Chase Ultimate Rewards The Points Guy",
      "Selection": "Chase issues nearly 30 different credit cards, including co-branded hotel and airline cards, but only three — two consumer and one small business card — give you full access to the company’s lucrative Ultimate Rewards program and all its airline and transfer partners. Another four cards — two business and two personal — are what you might call UR-adjacent: they’re cash-back cards that can turn into points cards when paired with one of three primary UR cards.\n\nTogether, these seven cards pack a mighty punch when it comes to generating travel rewards, whether through welcome bonuses or good, old-fashioned spending. And whether you’re applying for your first credit card or you’re a seasoned card pro looking to complement a UR card already in your wallet, one or more of these cards might be right for you, Let’s take a deep look at this program, with an analysis of each of the seven cards, what they offer, how to redeem the points and how it all fits together in the Ultimate Rewards universe.\n\nIn This Post\n\nEarning with Credit Cards\n\nFirst, here’s a quick glance at the sign-up bonus, rewards structure, annual fee and benefits for each of the seven Ultimate Rewards credit cards:\n\nSign-Up Bonus\n\nBonus Categories\n\nAnnual Fee\n\nPerks\n\nChase Sapphire Reserve\n\n50,000 points after you spend $4,000 in the first three months\n\n3x points on travel and dining purchases\n\n$450\n\n$300 annual travel credit, a fee credit for Global Entry or TSA PreCheck, Priority Pass Select lounge access\n\nChase Sapphire Preferred Credit Card\n\n50,000 points after you spend $4,000 in the first three months\n\n2x points on travel and dining purchases\n\n$95 (waived the first year)\n\nDelayed baggage insurance, trip interruption/ cancellation insurance and primary car rental insurance\n\nInk Business Preferred Credit Card\n\n80,000 points after you spend $5,000 in the first three months\n\n3x points on the first $150,000 spent in combined purchases on travel, shipping purchases, internet, cable and phone services, advertising made with social media sites and search engines each year\n\n$95\n\nCell phone protection up to $600 per claim for damage or theft\n\nChase Freedom\n\n$150 (15,000 Ultimate Rewards points) after you spend $500 in the first three months\n\n5% back/5x points on select rotating quarterly bonus categories up to $1,500 per quarter\n\n$0\n\n0% intro APR for 15 months from account opening on purchases and balance transfers, then a variable rate of 16.49% to 25.24%\n\nChase Freedom Unlimited\n\n$150 (15,000 Ultimate Rewards points) after you spend $500 in the first three months\n\nUnlimited 1.5% back/1.5x points on every purchase\n\n$0\n\nPurchase protection, extended warranty protection, zero liability for unauthorized charges\n\nInk Business Cash Credit Card\n\n$500 (50,000 Ultimate Rewards points) after you spend $3,000 in the first three months\n\n5% back/5x points on the first $25,000 spent in combined purchases at office supply stores and on cellular phone, landline, internet and cable TV services annually; 2% back/2x points on the first $25,000 spent in combined purchases at gas stations and restaurants annually\n\n$0\n\n0% intro APR for 12 months on purchases and balance transfers, then a variable rate of 14.74% to 20.74%\n\nInk Business Unlimited\n\n$500 (50,000 Ultimate Rewards points) after you spend $3,000 in the first three months\n\nUnlimited 1.5% back/1.5x points on every purchase\n\n$0\n\nPurchase protection, extended warranty protection, free employee cards\n\nThat’s a lot of information, so let’s take a deeper dive into each card and what each one offers.\n\nChase Sapphire Reserve\n\nThe crown jewel in Chase’s credit card lineup, Sapphire Reserve is packed with value that far exceeds its $450 annual fee. It’s an excellent travel rewards credit card that every frequent flyer should consider carrying in his or her pocket. Read the full review.\n\nSign-Up Bonus\n\nThe 50,000-point bonus after you spend $4,000 in the first three months is worth a mammoth $1,050, according to TPG’s latest valuations. The welcome bonus alone is equivalent to more than two years of the annual fee. Note that you can have either the Sapphire Reserve or the Sapphire Preferred, but not both cards at the same time.\n\nEarning\n\nYou’ll earn 3x points per dollar spent on all travel and dining purchases worldwide and 1x points on everything else. Chase is generous with what counts as a 3x purchase for both bonus categories. For travel purchases, you’ll earn 3 points per dollar on airlines, hotels, motels, timeshares, campgrounds, car rental agencies, cruise lines, travel agencies, discount travel sites, passenger trains, buses, taxis (including Uber and Lyft), limousines, ferries, toll bridges and highways and parking lots and garages.\n\nAs for what counts as a dining purchase, essentially any establishment that serves (as opposed to sells) food or drinks counts, including bars (even ones that don’t serve food), coffee shops and restaurant delivery services. As long as a merchant classifies itself in a restaurant category when applying to accept credit cards, the purchase will qualify.\n\nPerks\n\nSapphire Reserve benefits could be worth hundreds of dollars annually. The primary benefits include:\n\nA $300 annual travel credit that will be automatically applied toward any purchases that qualify as travel.\n\nPriority Pass Select membership, which gives you access to more than 1,000 airport lounges across the world. Beginning August 26, 2018, you’ll be limited to two free guests per visit. You’ll be charged a $27 fee for each additional guest.\n\nAn application Fee Credit for Global Entry or TSA PreCheck once every four years. If you’re already enrolled, you can use the credit to cover a friend or family member’s application fee.\n\nVisa Infinite Perks, which include primary rental car insurance, trip cancellation and delay coverage, lost luggage reimbursement, a concierge service and access to the Luxury Hotel & Resort Collection.\n\nChase Sapphire Preferred\n\nIf the Sapphire Reserve’s $450 annual fee leaves you feeling cold, the Sapphire Preferred is a great option for travel rewards. It will set you back $95, although the annual fee is waived the first year. Read the full review.\n\nSign-Up Bonus\n\nLike the Sapphire Reserve, the Sapphire Preferred offers a 50,000-point bonus after you make $4,000 in purchases within the first three months. You can also earn another 5,000 bonus points by adding an authorized user and making a purchase within the first three months. Again, you can have either CSP or the CSR, but you can’t have both cards at the same time.\n\nEarning\n\nThe lower annual fee this card carries means it also offers slightly less value when it comes to rewards. You’ll earn 2x points per dollar spent on all travel and dining purchases worldwide and 1x points on everything else. The broad definitions of travel and dining purchases apply here, as well.\n\nPerks\n\nSapphire Preferred doesn’t have all the bells and whistles of the Sapphire Reserve, but its list of benefits is still potentially valuable, including:\n\nPrimary rental car coverage, which means you can avoid involving your own personal auto insurance policy when loss or damage occurs. Most cards offer secondary car insurance, which means you have to first look to your own or other primary coverages, if any, before the card’s coverage will step in and cover any losses.\n\nTrip delay insurance ($500 per ticket) and trip cancellation insurance (up to $10,000). It also features $100 per day in coverage for up to five days in baggage delay insurance and up to $3,000 per person in lost luggage reimbursement.\n\nPurchase protection up to $500 per claim and $50,000 per account.\n\nNote that the Reserve offers the same (or, in some cases, superior) travel protections.\n\nInk Business Preferred\n\nLaunched in 2016, the Business Preferred card is the anchor of Chase’s small business card portfolio. It does a fine job trying to offer a little something to many different kinds of businesses both in terms of its rewards and its benefits. It’s the only small business card Chase offers that is part of the Ultimate Rewards program, meaning you don’t need another credit card to take advantage of valuable Chase points. The card charges an annual fee of $95. Read the full review.\n\nSign-Up Bonus\n\nEarn 80,000 Ultimate Rewards points after you spend $5,000 on purchases in the first three months from account opening. That large spending requirement comes with a large reward, the biggest currently among any Chase card. Those points are worth $1,680 based on TPG’s most recent valuations.\n\nEarning\n\nBusiness Preferred offers a diverse list of bonus categories designed to reward spending on common office purchases. Earn 3 Ultimate Rewards points per dollar on the first $150,000 spent in combined purchases per account anniversary year in the following categories:\n\nTravel, including airfare, hotels, rental cards, train tickets and taxis\n\nShipping purchases\n\nInternet, cable and phone services\n\nAdvertising purchases made with social media sites and search engines\n\nIf you max out these categories by spending the full $150,000, you’ll take home a total of 450,000 Ultimate Rewards points at a value of $9,450, a fantastic return of 6.3%. All other spending earns 1x points.\n\nPerks\n\nBusiness Preferred comes with a fairly long list of familiar Chase card benefits, including trip cancellation/interruption insurance, primary rental car coverage and purchase protection. The perk that stands out, though, is cell phone protection. When you charge your monthly cell phone bill to the card, you and eligible employees on the plan receive up to $600 per claim for damage or theft of cell phones. Claims are limited to three in a 12-month period and you must pay a $100 deductible per claim.\n\nChase Freedom\n\nThough the Freedom isn’t technically a credit card that earns Ultimate Rewards points, Chase allows users to convert Freedom’s cash-back rewards into transferable UR points when combined with the account of a card that does earn points, which are the three cards listed above. This move can turn a fee-free card that earns 5% cash back on quarterly categories into something much more powerful. Read the full review.\n\nSign-Up Bonus\n\nEarn $150 cash back after you spend $500 on purchases during your first three months after account opening. You can earn an additional $25 after you add your first authorized user and make a purchase within the same three-month period. You’ll boost the value of the bonus to $315 when you convert your cash back to 15,000 points by transferring them to a Chase account that is part of the the Ultimate Rewards program.\n\nCurrent Freedom cardholders or previous cardholders who received a bonus within the last 24 months will not qualify for this offer.\n\nEarning\n\nChase Freedom has a rotating series of bonus categories that switch every quarter. Those categories pay 5% cash back on up to $1,500 in combined purchases. Earn 1% cash back on all other purchases. The bonus categories for July, August and September 2018 are Lyft, Walgreens and gas stations. Other recent bonus categories have included grocery stores, PayPal transactions and internet, cable and phone services.\n\nWhen earning cash back, you’ll be able to score a maximum of $75 per quarter on the bonus categories ($1,500 in purchases at 5% cash back). But if you pair the card with another Chase credit card that’s part of the Ultimate Rewards program, the points can then be transferred to Chase’s travel partners and can be worth more than double the annual value of the card’s cash-back rewards. As an example, $1,500 in purchases at 5x points equals 7,500 UR points per quarter — those points are worth $157.50, according to TPG valuations.\n\nPerks\n\nYou’ll receive some fairly standard rewards card benefits perks, including purchase protection, which covers your new purchases for up to 120 days against damage or theft up to $500 per claim and $50,000 per account, and extended warranty protection, which extends the time period of a US manufacturer’s warranty by an additional year on eligible warranties of three years or less.\n\nChase Freedom Unlimited\n\nChase Freedom Unlimited eschews category bonuses for a flat cash-back rate for all purchases. As with Chase Freedom, you can transfer your rewards from this card to an account earning Ultimate Rewards to improve the redemption rate significantly. There is no annual fee. Read the full review.\n\nSign-Up Bonus\n\nThe welcome bonus on the Chase Freedom and the Chase Freedom Unlimited are identical. Earn $150 cash back after you spend $500 on purchases during your first three months after account opening and an additional $25 after you add your first authorized user and make a purchase within the same three-month period.\n\nEarning\n\nThe card earns a flat 1.5% cash back on all purchases, which can be converted to 1.5 Ultimate Rewards points when paired with a UR card. That makes the total return 3.15% when transferred, according to TPG’s latest valuations.\n\nInk Business Cash\n\n(Photo by Eric Helgas for The Points Guy)\n\nThe Ink Business Cash offers generous returns on a broad spectrum of office expenses — from supplies to utility services — without charging users an annual fee for the privilege. It’s a cash-back card, but (once again) can be converted to a UR-earning machine if you own one of the three Ultimate Rewards cards Chase issues. Read the full review.\n\nSign-Up Bonus\n\nEarn $500 cash back after you, spend $3,000 in the first three months after account opening. Pair up the card and turn that bonus into 50,000 Ultimate Rewards points worth $1,050.\n\nEarning\n\nEarn 5% cash back on the first $25,000 spent in combined purchases at office supply stores and on internet, cable, cellular phone and landline services each account anniversary year (then 1%). Earn 2% cash back on the first $25,000 spent in combined purchases at gas stations and restaurants each account anniversary year (then 1%) and 1% cash back on all other purchases.\n\nHowever, you can boost your rate on the 5% cash back categories to an effective return of 10.5% (based on TPG’s valuations) if you move your points to another Chase card with Ultimate Rewards and transfer to one of the 13 Chase travel partners described below. At that rate, if you max out the 5% category and convert the rewards to points, your return is worth as much as $2,625.\n\nPerks\n\nYou won’t find any of the airport-related perks associated with some premium travel rewards credit cards. Instead, Ink Cash offers a number of modest benefits offered on other Chase cards, including purchase protection, primary rental car insurance and extended warranty coverage. If you redeem your points for cash, you can receive your money in the form of an account statement credit or through an electronic deposit into an eligible US  checking or savings account.\n\nInk Business Unlimited\n\nIntroduced in spring 2018, Business Unlimited rounds out Chase’s small business suite of cards. It mirrors the rewards structure and redemption options offered by its consumer card sibling, the Chase Freedom Unlimited. Like the consumer card, it too charges no annual fee. Read the full review.\n\nSign-Up Bonus\n\nEarn $500 cash back after you spend $3,000 in the first three months after account opening. You can turn the bonus into 50,000 Ultimate Rewards points — and more than double your return — if you pair the Ink Business Unlimited with a card that earns UR points. According to TPG’s current valuations, 50,000 UR points are worth $1,050.\n\nEarning\n\nEarn 1.5% cash back per dollar spent on all purchases, which can be converted to 1.5 Ultimate Rewards points when paired with a UR card. You can boost this rate to an effective return of 3.15% (based on TPG’s valuations) on all spending if you move your points to another Chase card with Ultimate Rewards points.\n\nPerks\n\nThe card benefits on the Ink Business Unlimited are identical to those offered by Ink Business Cash, including purchase protection, primary rental car insurance and extended warranty coverage. If you redeem points for cash at 1 cent each, you can receive your money in the form of an account statement credit (which would reduce your card balance, but not your minimum monthly payment) or through an electronic deposit into an eligible US checking or savings account.\n\nRedeeming at the Travel Portal\n\nWhile all seven of these credit cards can redeem Ultimate Rewards points for statement credits or toward third-party gift cards at a flat rate of 1 cent per point, the options available through the premium cards offer far more value for travel redemptions in two separate ways.\n\nFirst, if you don’t want to worry about learning award charts and chasing award availability, you can redeem Ultimate Rewards points on any of the seven UR cards through the Chase travel portal. Depending on which Ultimate Rewards card or cards you have, you’ll get a different value for your points. Here’s how the redemptions break down:\n\nTravel Portal Value\n\nAccess to Transfer Partners?\n\nChase Sapphire Reserve\n\n1.5 cents per point\n\nYes\n\nChase Sapphire Preferred\n\n1.25 cents per point\n\nYes\n\nInk Business Preferred\n\n1.25 cents per point\n\nYes\n\nChase Freedom\n\n1 cent per point\n\nOnly when paired\n\nChase Freedom Unlimited\n\n1 cent per point\n\nOnly when paired\n\nInk Business Cash\n\n1 cent per point \n\nOnly when paired\n\nInk Business Unlimited\n\n1 cent per point\n\nOnly when paired\n\nUnsurprisingly, you’ll get the most value via the travel portal with Chase’s most premium card: the Chase Sapphire Reserve. But you’ll still get increased value with either of the other two Ultimate Rewards-enabled cards, and all three cards have the same ability to transfer points to Chase’s travel partners.\n\nTransferring to Partners\n\nThe second way of redeeming Ultimate Rewards for travel is through those 13 airline and hotel transfer partners. That’s where, with some time and effort, you can get the very best value, such as premium cabin redemptions to international destinations that normally cost thousands of dollars.\n\nOne of the best features of the transfer partners is that your points transfer to every one of them at an even 1:1 ratio — 1 point for 1 point — and in the majority of cases, your points will transfer instantly from Ultimate Rewards to the airline or hotel program.\n\nProgram\n\nTransfer Ratio\n\nTransfer Time\n\nAer Lingus\n\n1:1\n\nInstantaneous\n\nBritish Airways\n\n1:1\n\nInstantaneous\n\nFlying Blue (Air France/KLM)\n\n1:1\n\nInstantaneous\n\nHyatt\n\n1:1\n\nInstantaneous\n\nIberia\n\n1:1\n\nInstantaneous\n\nIHG\n\n1:1\n\n1 day\n\nKorean Air\n\n1:1\n\nInstantaneous\n\nMarriott\n\n1:1\n\n2 days\n\nRitz-Carlton\n\n1:1\n\n2 days\n\nSingapore Airlines\n\n1:1\n\nSame Day**\n\nSouthwest\n\n1:1\n\nInstantaneous\n\nUnited\n\n1:1\n\nInstantaneous\n\nVirgin Atlantic\n\n1:1\n\nInstantaneous\n\n** While points transferred from Ultimate Rewards to Singapore Airlines processed on the same day for us, the confirmation email from Chase states that it can take up to 2 business days for Ultimate Rewards transfers to appear in your Singapore KrisFlyer account.\n\nThere are literally dozens of ways to utilize these transfer partners to get maximum value for your Ultimate Rewards points. Here’s just a sampling:\n\nTransfer your points to British Airways and take advantage of round-trip transatlantic awards on Aer Lingus for 26,000 Avios on off-peak dates from Boston to Shannon or Dublin.\n\nTransfer 30,000 points to Hyatt and spend just $375 for three nights at the Park Hyatt Dubai, which normally would cost $1,580 with taxes and fees.\n\nTransfer 25,000 miles to the Air France/KLM Flying Blue program and book a one-way economy-class fare from Newark to Tel Aviv. That flight can get you a redemption rate of 7.4 cents per point.\n\nTransfer 45,000 miles to Korean Air’s SkyPass frequent flyer program and book a round-trip first-class award seat on non-alliance partner Delta for a redemption return of about 6.3 cents per point.\n\nBook a first-class flight on Korean Air using 80,000 points (typical fare is ~$5,000), which will get you more than 6 cents per point in value.\n\nTransfer 76,000 points to the Singapore KrisFlyer miles program to fly in Singapore Airlines’ luxurious Suites Class one way from New York (JFK) to Frankfurt. That redemption can be worth nearly 13 cents per point.\n\nTransfer 80,000 points to Korean Air to book a first-class flight that goes for nearly $5,000, getting you more than 6 cents per point.\n\nWith so many options, you’ll want to review some of our favorite tips and tricks on redeeming Ultimate Rewards points. We’ve listed a number of the very best ones in the “Further Reading” section below.\n\n5/24 and Household Rules\n\nYou may be considering applying for one or more of these cards to boost your bonus category rewards-earning potential or to fill in the gaps on your rewards for everyday spending. This is a smart idea, but make sure you mind Chase’s 5/24 rule, which bars you from gaining approval for another Chase card after you’ve opened five or more personal credit cards across all banks in the last 24 months. In other words, you can’t run out today and apply for all seven Chase UR-related cards and expect to get approved for them all.\n\nThe 5/24 rule applies to all seven of the cards listed above, including the business cards. However, if you’re approved for a Chase business card, it will not add to your 5/24 total — meaning you must be under 5/24 to be approved for an Ultimate Rewards business card, but you will still be at the same 5/24 total after approval.\n\nAlso, Chase allows you to transfer points to one other member of your household, so if either you or your spouse has one of the main three Ultimate Rewards cards, you can use that one card to maximize your points by running all your redemptions through it. However, be careful that you only transfer back and forth between you and that one other person, as in the past Chase has shut down accounts who were transferring Ultimate Rewards to multiple people or to folks outside their household.\n\nFurther Reading\n\nNow that you’ve learned the basics of Chase Ultimate Rewards, you’ll find more advanced information in our multitude of guides on the subject. Here our some of our favorites:\n\nMaximize Your Wallet With the Perfect Quartet of Chase Cards\n\nThe Chase Ink Card Showdown: Cash vs. Preferred vs. Unlimited\n\n10 Tips for Using the Chase Ultimate Rewards Travel Center\n\nRedeeming Chase Ultimate Rewards for Maximum Value\n\nThe Best Business-Class Seats to Book Using Chase Ultimate Rewards Points\n\nTop 5 Ultimate Rewards Redemptions Achievable With One Sign-Up Bonus\n\nTPG Readers Reveal the Best Ways to Redeem Ultimate Rewards Points\n\nBottom Line\n\nThe Chase lineup of Ultimate Rewards cards (and UR-adjacent cards) offers something for just about every type of rewards card user. Examine your spending patterns and apply for the mix of cards that will help you maximize earning welcome bonuses and rewards. For most people, that means focusing on the four consumer cards in the Chase portfolio, but if you’re a small business owner, you have seven different cards to think about. In any case, you’ll always want to consider cards that complement the types of spending you do in your work and business life.",
      "Folder": "Feedly",
      "Timestamp": "1532154223",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.488553Z"
}