{
  "id": "a229ea9dc1cf43399cb3ab2297ae608b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://fivethirtyeight.com/features/most-welfare-dollars-dont-go-directly-to-poor-people-anymore/",
      "Title": "Most Welfare Dollars Don’t Go Directly To Poor People Anymore FiveThirtyEight",
      "Selection": "Twenty years after President Bill Clinton fulfilled his vow to “end welfare as we know it,” it’s fair to say: mission accomplished. The old U.S. welfare system is dead. Whether the system that replaced it is better for the poorest Americans remains the subject of fierce debate.\n\nThe welfare reform bill that Clinton signed into law 20 years ago this month fractured the U.S. welfare system, from one managed mostly by the federal government to one largely directed by individual states. As each state became empowered to spend its welfare grant as it saw fit, one monolithic system devolved into 50 different ones — with far less money going directly to low-income families.\n\nThe 1996 reform didn’t result in a reduction in total spending on welfare, now known as Temporary Assistance for Needy Families. Since 1998, the first year for which we have complete data, total TANF spending — both from federal block grants as well as required state matching funds — has remained essentially flat, after adjusting for inflation,1 according to data from the Center on Budget and Policy Priorities, a left-leaning think tank that is critical of welfare reform. Per-person spending has fallen, however: In 2014 there were about 12 million more people below the poverty level than in 1998, according to the Census Bureau. The U.S. population has grown nearly 20 percent during that time.\n\nPerhaps the more significant change, though, is in how that money is being spent. Welfare reform replaced the old, federally run cash assistance program with a system of state-administered block grants. Under TANF, states can spend welfare money on virtually any program aimed at one of four broad purposes: (1) assistance to needy families with children; (2) promoting job preparation and work; (3) preventing out-of-wedlock pregnancies; and (4) encouraging the formation of two-parent families.\n\nSome states have interpreted those purposes — especially the last two categories — “very, very loosely,” said LaDonna Pavetti, a researcher at the Center on Budget and Policy Priorities. After-school programs to reduce teen pregnancy, for example, can be funded through TANF block grants.\n\nThe result has been a dramatic shift of resources away from cash assistance and toward spending on other programs. In 1998, nearly 60 percent of welfare spending was on cash benefits, categorized as “basic assistance.” By 2014, it was only about one-quarter of TANF spending. That shift has happened despite a burgeoning economics literature suggesting that direct cash transfers are in many cases the most efficient tool to fight poverty.\n\nSome of the money that used to go to cash assistance now goes to other noncash aid programs, such as child care assistance or work-related activities, and to refundable tax credits that are essentially a different form of cash transfer. But by far the biggest increase comes in what Pavetti’s group classifies as “other,” which the center says “covers a broad range of uses, including child welfare, parenting training, substance abuse treatment, domestic violence services and early education.” Those programs might be worthwhile in their own right, but they don’t have much to do with the original goals of welfare. In 2014, about one-third of TANF spending went to “other” areas, up from 12 percent in 1998.\n\nThe shift in spending varies greatly from state to state. California gives close to half of its total welfare dollars directly to low-income residents in the form of cash assistance. Georgia, by contrast, spends 80 percent of its funds on programs in the “other” category, and gives just 8 percent directly to families in cash.\n\nThe level of benefits also spans a wide spectrum. In 2012, the maximum monthly amount a single parent with two children could receive varied from $770 in New York to just $170 in Mississippi. And that’s assuming they could qualify. The maximum monthly earnings for this hypothetical individual to be eligible for TANF was as high as $1,829 in Wisconsin but as low as $268 in Alabama.\n\nSHARE OF TOTAL SPENDING\n\nSTATE\n\nTOTAL WELFARE SPENDING\n\nCASH ASSISTANCE\n\n“OTHER” CATEGORY\n\nAlabama\n\n$189m\n\n21.0%\n\n58.0%\n\nAlaska\n\n86\n\n46.0\n\n3.9\n\nArizona\n\n356\n\n9.0\n\n74.8\n\nArkansas\n\n141\n\n7.9\n\n68.2\n\nCalifornia\n\n6,705\n\n45.9\n\n22.3\n\nColorado\n\n316\n\n25.1\n\n65.2\n\nConnecticut\n\n497\n\n16.8\n\n63.0\n\nDelaware\n\n106\n\n20.1\n\n9.8\n\nD.C.\n\n264\n\n22.8\n\n31.8\n\nFlorida\n\n999\n\n16.6\n\n40.3\n\nGeorgia\n\n509\n\n8.4\n\n79.6\n\nHawaii\n\n264\n\n22.2\n\n26.1\n\nIdaho\n\n46\n\n14.4\n\n35.7\n\nIllinois\n\n1,220\n\n6.3\n\n27.8\n\nIndiana\n\n267\n\n8.8\n\n37.4\n\nIowa\n\n221\n\n22.8\n\n32.5\n\nKansas\n\n159\n\n14.3\n\n34.5\n\nKentucky\n\n259\n\n51.1\n\n11.7\n\nLouisiana\n\n219\n\n9.3\n\n66.1\n\nMaine\n\n85\n\n52.9\n\n10.2\n\nMaryland\n\n596\n\n19.6\n\n33.3\n\nMassachusetts\n\n1,100\n\n26.6\n\n29.8\n\nMichigan\n\n1,396\n\n12.0\n\n65.8\n\nMinnesota\n\n551\n\n15.6\n\n8.4\n\nMississippi\n\n99\n\n14.5\n\n16.7\n\nMissouri\n\n395\n\n21.2\n\n61.2\n\nMontana\n\n53\n\n29.9\n\n17.4\n\nNebraska\n\n116\n\n20.1\n\n8.7\n\nNevada\n\n98\n\n50.9\n\n35.1\n\nNew Hampshire\n\n62\n\n35.1\n\n20.5\n\nNew Jersey\n\n1,293\n\n16.9\n\n46.0\n\nNew Mexico\n\n215\n\n22.0\n\n29.4\n\nNew York\n\n5,729\n\n30.5\n\n26.9\n\nNorth Carolina\n\n612\n\n8.9\n\n39.9\n\nNorth Dakota\n\n37\n\n12.5\n\n60.1\n\nOhio\n\n1,125\n\n25.1\n\n17.5\n\nOklahoma\n\n197\n\n9.3\n\n32.0\n\nOregon\n\n341\n\n41.1\n\n35.0\n\nPennsylvania\n\n1,059\n\n24.2\n\n21.1\n\nRhode Island\n\n176\n\n13.2\n\n53.7\n\nSouth Carolina\n\n271\n\n8.1\n\n77.4\n\nSouth Dakota\n\n25\n\n61.2\n\n25.1\n\nTennessee\n\n267\n\n30.5\n\n26.3\n\nTexas\n\n888\n\n7.2\n\n72.8\n\nUtah\n\n94\n\n26.2\n\n23.6\n\nVermont\n\n93\n\n20.0\n\n12.8\n\nVirginia\n\n289\n\n34.4\n\n23.9\n\nWashington\n\n974\n\n18.6\n\n41.2\n\nWest Virginia\n\n141\n\n21.7\n\n26.1\n\nWisconsin\n\n657\n\n22.9\n\n24.9\n\nWyoming\n\n29\n\n10.8\n\n53.0\n\nUS Total\n\n31,889\n\n26.5\n\n34.1\n\nShare of welfare spending in cash assistance and share described as “other” by state, 2014\n\nSource: Center on Budget and Policy Priorities\n\nThe effects of these changes are hotly disputed and difficult to measure. Welfare reform entailed much more than just creating the block-grant program. It imposed strict work requirements and set limits on how long people could receive benefits, among other changes. (Those requirements also vary by state.) A variety of other policy changes, such as the expansion of the Earned Income Tax Credit, came around the time of welfare reform but weren’t formally part of it.\n\nThis much is clear: The various reforms resulted in fewer low-income families getting cash assistance. That was the point, after all. In 1996, 68 out of every 100 low-income families received cash assistance nationwide; but by 2014, that fell to 23 out of every 100 such families.\n\nAdvocates for welfare reform hoped that pushing families off of cash assistance would lead more of them to find work. There is evidence that happened. Between 1995 and 2000, the share of never-married mothers working rose from 49 percent to 66 percent; although since then, it has fallen, especially during the Great Recession. The extra income boost that came from work, prodded by the work requirements embedded in the law, helped lift many out of poverty.\n\nBut critics argue that the poorest Americans fared less well. According to the Census Bureau, the number of children living in deep poverty — defined as living in families with incomes less than 50 percent of the poverty line — has risen during the past 20 years. And in a new book, sociologists Kathryn Edin and Luke Shaefer argue that what they call “extreme” poverty — families living on $2 a day or less — has as well, and that welfare reform is to blame.\n\nOther experts disagree. In a new report responding to Edin and Shaefer’s book, economist Scott Winship of the conservative Manhattan Institute argues that official figures understate the noncash benefits that people with low incomes often receive, such as food stamps. Overall, welfare reform led to a decline in child poverty when these benefits are incorporated, he argues. And he says that extreme poverty of the kind Edin and Shaefer documented is almost nonexistent for families with children.\n\n“There is little evidence that welfare reform caused an increase in hardship or extreme cash poverty,” Winship wrote.",
      "Folder": "Feedly",
      "Timestamp": "1472129543",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.783910Z"
}