{
  "id": "a22a3d259d1c45fa9eb3d2a8c5d3eecd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1761630/why-americans-have-stopped-moving-geographically-even-for-work/",
      "Title": "Americans have stopped relocating, and it could dramatically affect society Quartz",
      "Selection": "The story of America is one of moving.\n\nA total of 13.6% of Americans today were born in another country, and most of us are descended from immigrants. This story of migration also includes moving within the country. Over the last 200 years, Americans have settled the frontier, moved away from cities toward suburbs, and migrated away from cities in the Northeast toward the South and West.\n\nThis narrative that Americans are constantly moving within the country is no longer true.\n\nOver the last 35 years, the number of Americans who have moved—within their county, state, or out of state—has steadily declined to nearly half of their previous levels.\n\nBetween March 2018 and 2019, only 1.5% of Americans moved from one state to another, and 5.9% moved from one home to another while remaining in the same county.\n\n1999-2005 inter-state migration rates are adjusted per Kaplan (2013). 1985 values are interpolated as the average of 1984 and 1986 values.\n\nWhy are Americans more rooted?\n\nThe decision to move is a complex one. People are often searching for better opportunities but must also take into account factors like family characteristics, lifestyle, and community.\n\nI have studied American migration for over 20 years, and I see no evidence linking the migration decline to changes in the way people make those decisions. Rather, I see three broad changes that have changed the outcome of those decisions.\n\nFirst, real incomes have remained flat for over the last 35 years. Americans have been able to improve their standard of living only by both working more and borrowing more. That includes an increase in the number of women working, leading to the growth of dual-income households.\n\nThe increase in both family and personal debt both makes selling a house more difficult and reduces financial resources available for a move. Meanwhile, the growth of dual-income households restricts moves, because any long-distance move would require both partners to find a suitable job in a new destination.\n\nSecond, the baby boomer generation has squeezed younger generations out of housing and job opportunities.\n\nFinally, Americans are less likely to move due to the widespread adoption of advanced information and communications technologies, such as the internet and smartphones.\n\nMy colleague and I investigated the role of these technologies in both the US and Northern Ireland. In these studies, we compared people who accessed and used the internet at home, in various ways, to people who did not, and found that internet access was strongly associated with decreased mobility.\n\nWe conclude that internet use, and likely all forms of advanced information and communication technologies, allow people to remain in a place, yet access a growing array of remote employment and educational opportunities. Moving is just not as necessary as it once was.\n\nWhat’s more, advanced information and communications technologies improves the quality of information available about possible places to move. We believe this makes decisions about whether and where to move more efficient and reduces the chances that people will move to a place that they don’t like.\n\nRootedness is the new normal\n\nThe currently low levels of geographic mobility are likely to be permanent.\n\nAn important principle of migration is that it is self-reinforcing—having moved once enhances the chances of moving again. Moving is expensive and stressful, especially for people who have not migrated before. But having moved once, additional moves become less stressful, new opportunities become available and additional moves become more efficient and less costly.\n\nThis self-reinforcing process works in the other direction as well. Having never moved or having moved very little reduces the chances of moving or moving again; migration is viewed as risky, expensive and disruptive. Plus, the longer a person stays in a location, the more attached they grow to their home and job and community.\n\nSince the current US population is more rooted than ever, I think it is likely that the country will continue to have lower migration rates into the future. Young adults who have been raised during the period of declining migration rates of the last 35 years are now less likely to migrate as a consequence. They may then pass this legacy on to their own children.\n\nThe impacts of a more rooted society\n\nI believe that the migration decline and associated increase in rootedness will have dramatic effects on American society.\n\nRootedness has many positive outcomes, such as greater attachment to place and more meaningful social and community connections. These connections to place may then serve to provide social and economic support during periods of economic uncertainty.\n\nSecond, I suspect that the decline in migration will present a challenge to large corporations and regional economic development agencies, for example, which rely upon migration to attract and retain talent.\n\nFinally, the government’s approaches to resolving regional economic disparities will have to change. Federal and state governments traditionally have not intervened much in regional labor and housing markets, under the presumption that high levels of migration serve to reallocate people from areas with few opportunities and toward areas with many opportunities.\n\nThe decline in migration indicates to me that federal and state policy must shift more toward “place-based” policies, emphasizing training and education, along with developing industries tailored to local skills and resources, similar to what is more common in Europe.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n",
      "Folder": "Feedly",
      "Timestamp": "1575779135",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.353340Z"
}