{
  "id": "a2ef175f6e084974bac30f607dcbca19",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/07/la-photographers-follow-instagram/",
      "Title": "12 Los Angeles Photographers to Follow on Instagram The Points Guy",
      "Selection": "The City of Angels has always been pegged as a dream destination for world travelers. It was named the sixth-most instagrammed city in 2016 — an indicator of its 21st century popularity — and as a testament to its status as one of the world’s great cultural destinations, the International Olympic Committee (IOC) just named Los Angeles as the host city of an upcoming Olympic Games.\n\nBut not everyone has the time — or the points and miles — to travel there, so if you haven’t yet planned your beach vacation or are waiting for the summer season to cool off before heading to Disneyland, we have some some amazing Instagram photographers to satiate your LA travel appetite.\n\n1. @nathanielwood\n\nPhotographer Nathaniel Wood has the inside scoop on what’s new and happening, inviting outsiders to take a look at the city through his lens with a mixture of landscape and portrait photos. His subjects? The quintessential LA trifecta: sun, celebrities and people who want to be celebrities.\n\n2. @killthecity\n\nNick Rufo, another Angeleno photographer, loves his city and wants others to see its beauty. His style — he shoots mainly landscapes and the occasional portrait — has drawn its fair share of fans and he’s amassed over 10,000 followers, with photos ranging from angelic blue skies and skyscrapers to portraits of up-and-coming rappers and skateboarders.\n\n3. @john.logic\n\nA 21-year-old SoCal native, John Logic has been taking photos for just over two years. He acknowledges that he isn’t the only photographer in the world, so he’s always finding ways to differentiate himself. Having always had a passion for art, he carefully chooses the time of day, weather and personality of each thing that he photographs. Seriously, it’s quite an amazing feat to make rush hour in downtown LA look like a hospitable place.\n\n4. @tiffanysbell\n\nFor Tiffany Bell, photography was just a minor interest in her life, but it eventually snowballed into a career. Through her work, she has taken photos of just about everything — from cities, humans, animals, nature and landscapes to interiors, exteriors, food and cocktails. She says photography taught her to “look at the ordinary and find the extraordinary” and it’s true — she’s managed to make gray skyscrapers and dark alleyways look like art in her shots.\n\n5. @laurenlemon\n\nHave you ever wanted to jump into a photo? That’s what LA photographer Lauren Lemon makes us want to do with her rainbow-colored Instagram feed. She uses her art to bring people together and has even promoted public art projects — like photographing a row of houses that had been painted pink due to an impending demolition.\n\n6. @dylan.schwartz\n\nDylan Schwartz is a creative director, photographer and director who has been named one of city’s best Instagrammers by Los Angeles Magazine and has worked with brands like Google, Austrian Airlines and Starwood hotels. That’s probably why his photos seem like they’re straight out of a movie; he’s gone to the extreme to get some of his shots, having flown in helicopters to get the perfect angle of the LA skyline.\n\n7. @dayzdandconfuzd\n\nDavid Ingraham’s first camera was a Kodak Pocket Instamatic. A professional musician by trade, he spends his free time with his current camera of choice: an iPhone. His black-and-white photographs of people walking through various LA neighborhoods make it feel like you’re stepping back in time, but don’t be fooled: his most recent ‘gram was taken this month.\n\n8. @lifeserial\n\nMatt Allard is a writer living in Los Angeles and in his free time, he likes to document his life through photos. In fact, he’s gotten so good at his craft that businesses have partnered with him for ad campaigns. His primary focus is lifestyle photography, and his love for food and coffee is evident in the well-documented café visits on his feed.\n\n9. @kimgenevieve\n\nOriginally from Canada, Kim Genevieve is a lifestyle and commercial photographer based in La La Land. Her unique aesthetic is comprised of bright color palettes and outdoor settings. It’s clear this transplant knows how to blend in with the locals — you’ll find beaches, colorful food and lots of palm trees populating her Instagram feed.\n\n10. @asteryx\n\nNot much is known about the man behind the photos other than the fact that they’re amazing and his name is Terry. His tool of choice for tackling aerial photo shoots are drones, but when he’s on the ground he’ll frame single subjects at the center of unique backdrops — like the urban light art exhibition located at LACMA.\n\n11. @danorst\n\nBy day, Dan Marker-Moore works as a freelancer in the motion graphics industry, doing design and animation, but when work ends, he polishes his skills in photography and videography. He’s captured beautifully composed images of L.A.’s sun-kissed skyline using drones and time-lapse photography to reveal the Milky Way galaxy.\n\n12. @maxwanger\n\nPer his bio, Max Wanger built his first camera out of paper at age seven, and his photography skills have only blossomed since. His feed consists of palm trees, sunlight and water sports — key LA icons. Pair that with adorable photographs of his children, and you’ll never want to scroll away.\n\nAre there any other LA-based photographers on Instagram that you love? Tell us about them, below.\n\nFeatured image courtesy of Paul Mounce/Corbis via Getty Images.\n",
      "Folder": "Feedly",
      "Timestamp": "1500220522",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.652161Z"
}