{
  "id": "a2f71c3e5d0e4b19808deb768a52e134",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/tips-for-traveling-with-kids-when-you-dont-share-the-same-last-name/",
      "Title": "Tips for Traveling With Kids When You Don’t Share the Same Last Name The Points Guy",
      "Selection": "It’s no secret that what was once a “traditional family” structure has drastically evolved over the past few decades. Now, with all types of family arrangements, children may not always share the same last name as their parents. (See our related story on the documents LGBTQ families should never travel without.)\n\nIn today’s modern world, it’s increasingly common for adults to travel with kids that don’t share the same last name. From an immediate family standpoint, perhaps the children have the same last name as the other parent while you still kept your own (like in my case), or maybe the kids have a last name that is a hybrid of both.\n\nMaybe you’re a grandparent, step-parent, legal guardian or chaperone that’s taking a trip with children that aren’t biologically your own. Of course it’s perfectly legal to travel with kids who don’t share your last name or may not be related to you, but these circumstances do require a bit more preparation beforehand to avoid any headaches with security and customs. This is true even if you are the child’s parent.\n\nAs a mom that travels solo often with my two young kids with different last names than mine, I’m aware that there’s a bit more preparation needed on my end before I hit the skies with my offspring.\n\nPhoto courtesy of Angelina Aucello\n\nID for Kids On Domestic Flights\n\nThe TSA does not require children under 18 to provide identification when traveling with a companion within the United States, but some airlines have their own protocols. For example, Southwest strictly enforces its policy requiring adults to provide a copy of a birth certificate for children under the age of 2 traveling as lap infants — even on domestic flights. You should always contact the airline for information on its policies or questions regarding specific ID requirements for travelers under 18.\n\nOf course, traveling domestically with kids is a lot easier than traveling internationally — where you’ll most likely run into more questioning and extra security screenings. But, having your documents in order will allow you to breeze through the process — no matter where you’re flying. Here are our thoughts on the best domestic airlines for families.\n\nID for Kids On International Flights\n\nTraveling internationally with kids subjects travelers to more ID and consent requirements.\n\nFirst and foremost, passports are required for all passengers traveling internationally, regardless of age or last name. Unlike the case of domestic flights, taking a child on an international flight without presence/permission of the other parent or legal guardian is not permitted.\n\nThis requirement is in place to prevent the unfortunate cases of kidnapping, even in families. There is no “official consent form,” so you’ll have to prepare one on your own. As a guideline, it’s generally a notarized and dated statement from one parent/guardian granting permission to the other parent or traveling adult to travel internationally with the child.\n\nIn the letter, be sure to include a statement of permission to travel along with the names of the children, the intended travel dates/destination, the names of the adult(s) permitted to travel with the children, and the names and contact information of the parent(s) granting permission.\n\nPhoto courtesy of Angelina Aucello\n\nI always keep a generic signed/notarized consent form with me when I travel internationally with the kids, but I’ve rarely been asked to show it. In fact, even if both parents are flying together, it’s not a bad idea for each parent to carry a signed and notarized consent form just in case you somehow get separated. If you’re curious, here are our thoughts on the most family-friendly international carriers.\n\nBe Prepared for Extra Time at the Airport\n\nOn a recent trip to London with my 4-year-old son, the UK immigrations officer quickly noticed that my son’s last name differed from mine and slyly “interviewed” my son in a playful manner: “What’s your name, buddy? Are you traveling with just your mom today?”\n\nThen he turned to me and asked me to verify my son’s middle name and DOB. He was looking to see how quickly I responded, kind of like when a bouncer at a nightclub questions if the ID you forked over really is yours.\n\nMind you that process was rather quick and, of course, the questioning of both the child and parent stems from good intentions to verify the relationship between the two.\n\nThe UK Home Office tweeted about this process not too long ago.\n\nIf your family has different surnames, please bring birth or adoption certificates to help get through passport control quicker. https://t.co/7l1Y7ngeCP #fasteruktravel pic.twitter.com/OwHeR72SXs\n\n— Home Office (@ukhomeoffice) August 1, 2018\n\nBottom Line\n\nSadly, parental kidnapping, abduction and child trafficking are very real threats in the world we live in. So, if you’re traveling internationally with a child — even your own — and you don’t share the same last name, you’ll have to come with extra documentation and be prepared to spend some extra time at the airport in some cases. Though it may seem like a hassle, it serves an important purpose.\n\nEven if you’re just traveling domestically, if you think you may run into issues at security or at the check-in counter, it may be wise to bring along a copy of the child’s birth certificate/adoption papers/legal guardianship documents and a generic consent form just for the extra peace of mind. Having a copy of those documents not only works as an ID that shows proof of age, but it also proves your relationship to the child, especially if your last names differ.\n\nWhat have your experiences been like when traveling with kids who don’t share your last name?\n\nAngelina Aucello covers family travel for TPG and writes the popular blog, Angelina Travels. Follow along with all her travel adventures on Twitter and Instagram.\n\nFeatured image by Ippei Naoi / Getty Images\n",
      "Folder": "Feedly",
      "Timestamp": "1542660768",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.453703Z"
}