{
  "id": "a35a0e3118ac4712902c8b3ec1f24970",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/19062-i-m-convinced-stir-fried-rice-noodles-won-my-boyfriend-over",
      "Title": "I'm Convinced Stir-Fried Rice Noodles Won My Boyfriend Over Food52",
      "Selection": "The first time I cooked for my boyfriend, I made stir-fried rice noodles. And while this story does have a happy ending, up until said end, things seemed much more tumultuous.\n\nIt started with the noodles. I couldn't find rice noodles (what?) and had to substitute egg noodles. Then, the grocery store was out of fresh ginger. Faced with the option of using ground ginger or just leaving it out entirely, I chose the latter.\n\n4 Genius Stir-Fry Tricks You (Probably) Don’t Know Yet \nby Kristen Miglore\n\nAlready feeling defeated and so nervous it was painful, I started the stir-fry: Boiling the noodles until they were halfway done, browning the pork, adding a slew of condiments, toasting sesame seeds and peanuts. It was then, at the point in the recipe where you're supposed to add the eggs, I realized I didn't have any eggs. Eggs! A pantry staple. A stir-fry standard. But it was too late to run out to the store. The stir-fry was happening and, my very-new-boyfriend just arrived.\n\nUpon adding the noodles to the skillet, they kind of seemed to disintegrate, turning an off-white color around the edges. I stirred it around some more, letting the noodles cook, and tipped the noodles into a serving dish, garnishing them with sliced scallions, peanuts, and sesame oil and seeds. Shamefully, I served it to him.\n\nBut then, a funny thing happened: He loved it. As in, raved about for weeks and ate three-fourths of the dish. We're still together, so I must've done something right with that stir-fry after all.\n\nStir-Fried Rice Noodles with Minced Pork and Black Bean\nby Kirthana | Theblurrylime\n\nMake this for dinner tonight. It's fast, easy (despite the longish ingredient list, much of which you'll probably have in your pantry), and guaranteed (at least from me) to woo that special someone. I might just be making it, too—for old times' sake.\n\nHere's your grocery list:\n\n1 head of broccoli, chopped into florets\n\n1-inch piece of ginger, finely sliced\n\n3 stalks green onions, chopped (set aside the tops for garnish)\n\n300 grams minced pork\n\n200 grams rice noodles\n\n1/2 cup chopped baby corn\n\n3 teaspoons black bean paste\n\nI told you this was a pantry-heavy meal! You'll also need 5 garlic cloves (finely chopped), 1 small onion (chopped), 1 1/2 teaspoons soy sauce, 1 teaspoon rice vinegar, 1/2 teaspoon chile flakes, 2 tablespoon olive oil (plus extra for the eggs), 3 eggs (lightly beaten), 2 dried chiles (halved and de-seeded), 1 teaspoon sesame oil, 2 teaspoons sesame seeds (lightly toasted), and 2 tablespoons peanuts (coarsely chopped), salt, and freshly ground pepper. If you don't have these, add them to your list, too!\n\nAbout 20 minutes before dinner, cook the rice noodles in a pot of boiling water. About three minutes before the noodles are done, add the baby corn, then add the broccoli about a minute before the noodles and corn are finished cooking. You want the noodles and vegetables to all be al dente.\n\nPour the oil into a wok, add the dried chiles, onion, spring onion bottoms, ginger, and garlic. Sauté for a few minutes until everything softens and lightly browns. Add the pork and, using a spatula, break it up and brown for a few minutes. Next up, add the black bean paste, soy sauce, and rice vinegar. Cook for a few minutes, then taste. If it needs more of anything, add it.\n\nJust 5 minutes away from dinner, in a skillet, lightly toast the sesame seeds and peanuts and set aside. In the same skillet, add a little bit of olive oil and scramble the eggs. Toss the noodles and vegetables into the minced pork mixture, then add the scrambled eggs and toss again.\n\nPut the stir-fry in a serving dish. Garnish with the scallions, peanuts, sesame oil, and seeds. Serve to someone you care about.\n\nSee the full recipe here.",
      "Folder": "Feedly",
      "Timestamp": "1487120288",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.635555Z"
}