{
  "id": "a36ba5a426b6431587addb8c18f8a236",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://ritholtz.com/2019/07/hack-your-vacation/",
      "Title": "Hack Your Vacation (and other behavioral tips) The Big Picture",
      "Selection": "What are you doing for your long weekend? What are your expectations?\n\nI ask because we can improve our vacations via behavioral science. Not just our holiday travel, but our investing, consumer purchases, even our retirement planning. I’ll have more on that on Monday, but since the Fourth of July long holiday weekend begins tomorrow (or even today), let’s discuss what you can do to improve your vacations.\n\nPsychologists and increasingly, economists have developed strategies to improve the decision making process helping to increase happiness and satisfaction from the good and services you buy.\n\nVacations are merely one example. It’s not just consumer goods or services that are impacted by your own psychology. Behavioral issues have a giant impact on our investing success and failure. Indeed, over the past 20 years, the field of behavioral economics has progressed from a backwater of grad school economics departments into a widely accepted, transformative science. Its proponents – folks like Richard Thaler, Robert Shiller, and Danny Kahneman have won Nobel prizes by deciphering how we think about decision-making.\n\nYou can use what we know to put behavioral science to to make better decisions in your financial life. Unfortunately, few put this knowledge to good use. Let’s use one example of consumer spending as an example to see if we can change that:\n\nVacations: Americans work longer and harder than ever, and time off is an important part of one’s mental health. Four behavioral insights might help you get the most of out of them.\n\nAnticipation: Lots of studies 1 have found that much of the pleasure of consumption is in the anticipation of the actual purchase. Use this to your advantage. Have fun thinking about your trip as you make plans. Talk about how much fun it will be to go to ____, see ____ and do ____. The mere act of thinking about and discussing travel brings pleasure, kickstarting the positive memories even before the trip begins.\n\nStart big, have a great peak. Two cognitive biases are in play here. The Primacy/Recency effect is the tendency to place greater impact on beginnings and ends. We recall first and last items on lists better than those in the middle; we judge presentations in part by how we feel about first and last impressions.\n\nThat works in tandem with the Peak-end rule. This “impacts how people remember past events. Intense positive or negative moments (the “peaks”) are heavily weighted in our mental calculus.” Use this to your advantage by making sure there are strong emotional peaks. It could be something as simple as a family gathering or as complex as scuba exploration of a wreck. As much as I love sitting on a Caribbean beach and reading books for a week, I always make sure there is at least one intense (hopefully positive) experience on vacation.\n\nFinish strong: Our final memories of an event– whether it’s a concert, a vacation or even an examination – is disproportionately impacted by how we recall the end of the experience. The final moments of any experience, good or bad, colors our overall impression. Take full advantage of the Primacy/Recency effect by finishing very strong.\n\nOn a trip to Grand Cayman not too long ago, on our last night on the island, we booked a chef’s tasting menu of food and drink at the Kimpton SeaFire’s Avecita restaurant at the chef’s counter (Bloomberg’s Kate Krader agrees with me). A spectacular meal, it was absolutely delightful (and way too much food). After a week of light fare, it was indulgent and memorable. That meal is the first thing I recall when I think about that vacation.\n\nSocialize the experience: Part of the reason experiences end up outperforming purchases is that they create last memories, typically with family and friends. 2  Unlike the way we adapt to physical goods we purchase, our recollections of specific events tend to improve with time and the rosy glow of nostalgia. Chalk it up to our faulty memories that tend to bring up our most recent recall of an event — our memory of the memory — rather than the event itself. That lends itself to making good experiences seem even better in retrospect, as we overemphasize the positives and forget about the negatives.\n\nVacations are part of a broader trend towards experiences over material goods.\n\nThose are a few simple behavioral hacks that will help you get more out of your vacations. There is a rich literature on the topic, feel free to go exploring.\n\n \n\n___________\n\n1. Waiting for Merlot: Anticipatory Consumption of Experiential and Material Purchases; Amit Kumar, Matthew A. Killingsworth, Thomas Gilovich First Published August 21, 2014 Research Article\n\n2. A wonderful life: experiential consumption and the pursuit of happiness, by Thomas Gilovich, Amit Kumar, Lily Jampol. Journal of Consumer Psychology Volume 25, Issue 1, January 2015, Pages 152-165\n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1562225767",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.361401Z"
}