{
  "id": "a3ded7b194a24364aa1327a33f4e4576",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://ritholtz.com/2020/08/public-to-private-equity/",
      "Title": "Public to Private Equity The Big Picture",
      "Selection": "Source: Morgan Stanley\n\n \n \nMorgan Stanley has a fascinating report on reduced number of publicly traded companies, and the rise of SPACs, Buyout funds, and Private Equity:\n\n \n\nOver the past quarter century there has been a marked shift in U.S. equities from public markets to private markets controlled by buyout and venture capital firms. This change has had reverberations for asset managers, investors, executives, and policy makers. In this report we seek to answer the following questions:\n\n• What have been the major drivers behind the shift from public to private equities in the U.S.?\n• Why are there fewer public companies today than there were 25 years ago?\n• What are the long-term trends in buyouts?\n• What are the long-term trends in venture capital?\n• Where do we go from here?\n\nMarkets have become more sophisticated over time as the result of the growth in institutional money management, financial innovation, and sharply lower technology costs. Large institutional investors, including pension funds and endowments, face the prospect of swelling future liabilities and diminished expected returns for most asset classes. As a result, they have reduced their portfolio allocation to public securities and have increased their allocation to private equity, where returns have historically been higher.\n\nFrom the end of World War II through the early 1970s, many companies went public to raise capital to fund their growth. Today, young companies often rely more on intangible assets and have a less voracious appetite for capital. They also have unprecedented access to capital through the private markets. Consequently, many young companies have elected to stay private longer than did the companies of prior generations.\n\n \n\nMore charts after the jump\n\n \n\n \n\n \n\n \n\n \n\nAll data and text sourced from: Morgan Stanley\n\n \n\nThe post Public to Private Equity appeared first on The Big Picture.\n",
      "Folder": "Feedly",
      "Timestamp": "1596778389",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.308925Z"
}