{
  "id": "a4068439cc8940acacc6cdf9e3bfa413",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://thepointsguy.com/2016/07/redeeming-american-express-membership-rewards-maximum-value/",
      "Title": "Redeeming American Express Membership Rewards for Maximum Value The Points Guy",
      "Selection": "There are plenty of ways to use your Amex Membership Rewards points, but some options are much better than others. TPG Senior Points & Miles Contributor Richard Kerr walks you through the best and worst ways to redeem rewards with this loyalty program.\n\nYour points and miles can take you far, but loyalty programs don’t exactly make it easy for you to discover all the options and find the best strategies for redeeming your rewards. More than a year ago, we looked at the best ways to use your Amex Membership Rewards points, highlighting some of the top partners and more. Today, I’ll take into account loyalty program changes over the past year to revisit the strategies you should consider when it comes time to put your hard-earned MR points to use.\n\nEarning Membership Rewards\n\nIn the points and miles world, Membership Rewards have a reputation for being difficult to acquire because of a lack of credit card bonus categories. However, there are dozens of Membership Rewards-earning cards, and I can currently identify nine of them listed on the Amex website that have bonus earning categories:\n\nThe Amex EveryDay Credit Card from American Express\n\nThe Amex EveryDay Preferred Credit Card from American Express\n\nThe Enhanced Business Gold Rewards Card from American Express OPEN\n\nThe Platinum Card from American Express Exclusively for Mercedes Benz\n\nMercedes-Benz Credit Card from American Express\n\nThe Morgan Stanley Credit Cards from American Express\n\nAmerican Express Premier Rewards Gold Card\n\nAmerican Express Gold Card\n\nOnly some of the cards that earn points are advertised publicly. Let’s narrow the field and look at three popular cards that allow you to earn Membership Rewards and have substantial ancillary benefits:\n\nAmerican Express Premier Rewards Gold CardCurrent Sign-up Bonus: 25,000 points when you spend $2,000 in the first three monthsCategory Spending Bonuses: 3x on airfare purchased directly from airlines; 2x at US gas stations, US restaurants and US supermarkets; 1x on all other purchasesOther Benefits: $100 airline fee credit per calendar yearAnnual Fee: $195 (waived the first year)\n\nThe Platinum Card From American ExpressCurrent Sign-up Bonus: 40,000 points when you spend $3,000 in the first three monthsCategory Spending Bonuses: NoneOther Benefits: Airport club access including Delta SkyClub and Priority Pass Select; no foreign transaction fees; $200 annual airline credit; Global Entry $100 statement credit or TSA PreCheck $85 statement credit; free land-based Boingo Wi-Fi access; Amex Fine Hotels & Resorts benefits; automatic Starwood Gold Status; Platinum Companion Ticket.Annual Fee: $450\n\nThe Amex EveryDay Preferred Credit Card from American ExpressCurrent Sign-up Bonus: 15,000 points when you spend $1,000 in the first three monthsCategory Spending Bonuses: 3x US supermarkets on up to $6,000 of purchases annually (then 1x); 2x on US gas stations; 1x on all other purchasesOther Bonuses: Use the card to make 30 or more purchases in a billing period and earn 50% extra points on all those purchases (less returns and credits).Other Benefits: 0% introductory rate on purchases and balance transfers for the first 15 months.Annual fee: $95\n\nRedeeming Membership Rewards: Poor Value Options\n\nUnfortunately, several of the options for redeeming your points represent less than stellar value and should really be avoided. These include:\n\nUse Points for Charges — This is like a cash-back option for covering eligible charges on your billing statement. What are eligible charges? I’ve yet to find a solid definition — though annual fees are definitely excluded — and the fact that American Express can change whatever charges it deems eligible at any time without prior notification. You will only receive 0.6 cents per point with this option, so it’s not a very good return.\n\nShop Amazon — After linking your Amazon and Membership Rewards accounts, you can use points to pay for your purchases at a slightly better (but still poor) value of 0.7 cents per point.\n\nFree Uber rides — You can redeem points for Uber rides at a value of 1 cent apiece. Add an eligible Membership Rewards American Express card as your payment method, and the Uber app will present you with a “Use Points” option to pay for the ride.\n\nThe ability to earn 2x MR points on Uber rides is nice, but using your points for free rides yields little value.\nMembers Give — American Express will donate $10 to a charity of your choice for every 1,000 points redeemed. You can search all charities eligible to receive donations through the Members Give website. There’s a limit of 500,000 points per year, after which the redemption value for giving is cut in half to $5 donated for every 1,000 points redeemed.\n\nShop with Membership Rewards — You can find pretty much anything under the sun via the Membership Rewards online shopping mall. The only thing you won’t find is value, as your points are worth a standard 0.5 cents apiece when redeemed this way.\n\nGift Cards — Redeem your points for gift cards to shops, rental car agencies, restaurants, American Express Gift cards and even Airbnb. Most of the time you redeem points for a flat value of 1 cent apiece, but there are instances that yield slightly better and slightly worse values. Four AMC movie tickets will cost you 4,800 points, with each ticket valued at $12. Occasionally you’ll find specials that offer better than 1 cent per point, but not significantly higher value. Plus, gift cards from high-end brands like Four Seasons and Mandarin Oriental yield redemption values of less than 1 cent per point.\n\nRedeem for Paid Travel — There are a few options in this category with significantly different values. Last year I wrote about how you can pay for travel with points through Membership Rewards. This option gives you a value of 1 cent per point toward airfare, and 0.75-0.85 cents per point for cars, hotels, vacations or cruises. If you have The Business Platinum Card from American Express OPEN, you can redeem points for an airline of your choice (it must be the same airline you choose for the $200 fee credit) and receive 30% of your redeemed points back.\n\nEven with a 30% rebate, there are better ways to use MR points than redeeming them for paid travel.\nRedeem Membership Rewards: Great Value Options\n\nTransferring points to partner hotel and airline loyalty programs represents the best way to get value from this program. Here are some of the best programs and example redemptions:\n\n1. Utilize Etihad Guest Partner Award Bookings\n\nEtihad is one of the more recently added 1:1 transfer partners of the Membership Rewards program. The variety of partner awards you can book through the Etihad Guest program and the uniqueness of the individual partner award charts open up some very valuable routings you can fly for comparatively few miles. You can also still book American Airlines flights at the pre-devaluation costs, as Etihad has not devalued its American award chart. However, using miles for flights on Etihad’s own metal rarely results in a good value for your Membership Rewards.\n\n2. Fly Singapore Airlines Premium Classes\n\nIt’s difficult to find a more luxurious seat in the sky than Singapore Airlines Suites. Fly first class on the A380 for 51,000 Membership Rewards if you book Tokyo to Singapore. From the US, you can fly in a suite on the LAX-NRT route for 74,375 points or JFK-FRA for 57,375 points (all redemption amounts taking into account the 15% discount you’ll get for booking an award online). If you’re short on MR points but have plenty of Chase Ultimate Rewards, note that you can combine the two currencies in order to book Singapore premium classes.\n\nSingapore premium-class awards continue to represent an excellent use of Membership Rewards points.\n3. Choice Hotels/Points + Cash for Preferred Hotel Luxury Properties\n\nThe Choice Privileges program used by Choice Hotels is a 1:1 Membership Rewards transfer partner, and it boasts several properties across typically expensive European cities. For award nights, these hotels range from 8,000-25,000 points. I’ve found this program to be particularly useful when visiting Ireland, a country with few chain hotels.\n\nThe Points + Cash award chart for Preferred Hotel properties when using Choice Hotel points.\nYou can also use Choice points to book Preferred Hotel properties, a group of luxury hotels located around the world. You can now also utilize Points + Cash bookings for Preferred Hotels, an option that’s allowed me to find significant value. There’s surprisingly good availability for booking Preferred Hotels seen via the online search calendar (though you have to call to book Preferred Hotel properties). For example, Chateau Elan is a luxury estate outside of my home area of Atlanta with room rates close to $600 per night on premium weekends. I can transfer 10,000 Membership Rewards to Choice Hotels and book a room for 10,000 points and $187.50.\n\nThere’s award availability throughout the summer for booking the Chateau Elan with Choice Hotel points.\n4. Flying Blue to Hawaii\n\n30,000 Membership Rewards transferred to the Flying Blue loyalty program used by Air France and KLM will get you a round-trip economy ticket to Hawaii on Delta, even from the East Coast. This is a straightforward, excellent deal that should be on your radar.\n\nIt costs just 30,000 miles to fly from the East Coast to Hawaii, and only $5.60 in taxes and fees.\n5. British Airways Avios\n\nThe Avios devaluations both in Membership Rewards transfer ratio and American Airlines short-haul costs still hurt, but that doesn’t mean this currency is now irrelevant. For instance, you can still fly from Boston to Ireland on Aer Lingus for just 25,000 Avios round-trip. Plus, you can still fly short-haul within other countries like Japan for 4,500 Avios each way with no fuel surcharges.\n\nPerhaps the best use of Avios is flying from the West Coast to Hawaii on American or Alaska Airlines for 12,500 Avios each way. Note that Alaska Airlines flights are not bookable on BA.com; you’ll have to call the service center.\n\nMembership Rewards transferred to British Airways equal cheap flights to Hawaii on Alaska Airlines.\n6. Fly Round-Trip on American via Iberia Avios\n\nTransferring your Membership Rewards to Spanish partner airline Iberia can represent savings in both Avios and fuel surcharges depending on the route you want to fly. Unlike British Airways, Iberia charges partner flights on a total round-trip mileage basis, not per segment. This means you don’t have to pay an extra 7,500 Avios to get to an American hub in the US.\n\nIberia also imposes lower fuel surcharges on its own flights like JFK-MAD compared to British Airways award bookings. You can transfer your British Airways Avios to your Iberia Avios account (it could be helpful to combine with Chase Ultimate Rewards transferred to Iberia) provided both accounts are 90 days old and have had some activity in them. The downsides to Iberia are that it doesn’t partner with Alaska and, as mentioned, you have to book round-trip tickets.\n\n7. Transfer to ANA\n\nDue to reduced fuel surcharges and loose routing rules, you can put together an incredible award ticket itinerary using ANA’s Mileage Club. Flying during off-peak dates yields very attractive pricing like 40,000 miles round-trip from North America to Japan in economy on ANA metal. There are quite a few gems to investigate with the program, including reasonably priced around-the-world tickets that allow eight stopovers, but be sure to confirm availability before you transfer points.\n\nDoing your homework with the ANA program can open up some amazing award itineraries.\nBe Smart with Your Points\n\nIf you were able to get in on the recent 100,000-point Platinum Card from American Express offer, TPG Contributor Nick Ewen has suggestions for the best way to use your sign-up bonus. Like the other transferable points programs, American Express Membership Rewards offers some great options to those who do their homework on the various transfer partners and potential redemptions. You could save your points up all year only to have a few statement charges erased, or you could book an intercontinental flight in Singapore Suites for just 57,375 Membership Rewards through Singapore KrisFlyer. Take the above examples to heart, and make sure you’re using your points wisely.\n\nWhat’s the best value you’ve received from Amex Membership Rewards?\n\nFeatured image of the Lofoten Islands in Norway courtesy of Shutterstock.\n\nPremier Rewards Gold Card from American Express\n\nApply Here\n\nReceive 25,000 Membership Rewards® Points after you spend $2,000 on purchases on your new Card in your first 3 months of Card Membership.\n\n3X points for flights booked directly with airlines. 2X points at US restaurants, US gas stations, and US supermarkets. 1X points on other purchases. Terms and limitations apply.\n\nNo matter where you're traveling, when you use your Premier Rewards Gold Card there are no foreign transaction fees from American Express.\n\n$100 Airline Fee Credit. Up to $100 a year in baggage fees and more at one airline.\n\nThere is a $0 introductory annual fee for the first year, then $195.\n\nTerms and limitations apply.  See Rates & Fees\n\nIntro APR\n\nRegular APR\n\nAnnual Fee\n\nBalance Transfer\n\nCredit Rating\n\nN/A\n\nIntroductory annual fee of $0 for the first year, then $195\n\nSee Terms\n\nExcellent Credit\n",
      "Folder": "Feedly",
      "Timestamp": "1467808860",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.794093Z"
}