{
  "id": "a41b973d61a24188afe4cb238e11d5f6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/21632-instant-stock-broth-hack-for-quick-braised-fish",
      "Title": "The Instant, Genius Way to Make Any Fish Dinner More Delicious Food52",
      "Selection": "I'm about to give you a magic wand to make any mild-mannered fish delicious (and it doesn’t involve beer-battering and dousing in malt vinegar).\n\nMartha Rose Shulman’s Quick-Braised Fish With Baby Potatoes & Greens\nby Genius Recipes\n\nBecause, with a few all-star pantry staples and virtually no time at all, you can take any fish dinner and make a brothy-delicious sauce or stew for it. (Or any not fish dinner, for that matter—but we'll get to that.)\n\nIt’s not as if making a stock for seafood soups and stews takes all that long to begin with. Unlike meatier bone-based broths, stock made from shrimp shells or fish bones typically doesn’t simmer for more than 20 or 30 minutes, which puts it squarely into the “eh, might as well” category, if you ever find yourself with a stash of them.\n\nBut with this smart technique, you can hack a super-flavorful broth pretty much out of nowhere—no shell and bone pile required. Bouillabaisse, take a number!\n\nThe trick is nestled in Martha Rose Shulman’s recipe for quick-braised fish with baby potatoes and greens (she used asparagus; in the pit of New York winter, we used some perky greenhouse-grown spinach). “I wanted to make a one-pot meal with fresh Alaskan halibut that did not require the extra time and ingredients for a fish stock,” as she wrote in the New York Times in 2015. “But I did want broth that tasted of the sea, so I did what many cooks in Southern France and Italy do, and pounded anchovies in a mortar and pestle with garlic.”\n\nWhen you take flavorful ingredients like anchovies, garlic, and nuts and crush them together into a paste, they don’t just become a sauce you can smear or soften in oil, but one you can unleash to bloom in water to flavor just about anything, instantly. Or, as Shulman says, “And voilà: a quick Mediterranean broth.”\n\nHere, it’s a delicate fish like halibut (or whatever is swimming nearer to you)—but you can use this technique with all sorts of other things that would benefit from a flavor boost: greens, pasta, couscous, beans. Not only is the trick speedy, it’s endlessly customizable. Pound in shallots or fennel seed or chiles at will, as you might when DIYing herby salsas and pestos.\n\nThe flavors latch on quickly, following a classic sear-and-simmer braise, just sped up for seafood-friendly cook time. And you—with your lovely, not-the-least-bit-boring fish dinner on the table—get to tuck away your magic wand to use another day.\n\nMartha Rose Shulman’s Quick-Braised Fish With Baby Potatoes & Greens\n\nBy Genius Recipes\n\n1/2 teaspoon saffron threads\n\n2 tablespoons lightly toasted almonds\n\n2 garlic cloves, green shoots removed, or 4 green garlic cloves\n\n2 anchovies, rinsed\n\nSalt and black pepper to taste\n\n2 tablespoons extra-virgin olive oil\n\nFour 5- to 6-ounce halibut fillets (or substitute another firm, mild fish)\n\n1 pound baby potatoes, cut in 3/4-inch pieces, or small potatoes, halved and sliced about 3/4-inch thick\n\n3/4 pound asparagus, trimmed and cut in 2-inch lengths (or when asparagus isn’t in season, substitute another green like spinach or peas)\n\n2 tablespoons minced parsley\n\n2 tablespoons minced basil\n\nView Full Recipe\n\nPhotos by Julia Gartland\n\nGot a genius recipe to share—from a classic cookbook, an online source, or anywhere, really? Please send it my way (and tell me what's so smart about it) at genius@food52.com.",
      "Folder": "Feedly",
      "Timestamp": "1519883778",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.492057Z"
}