{
  "id": "a5eb4de705fd4bc3a03c25f40501c48c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://weblogs.baltimoresun.com/news/crime/blog/2011/01/simon_responds_to_bealefelds_c.html",
      "Title": "Baltimore Crime Beat - \"Wire\" creator responds to top cop's criticism - Baltimore crime news: Police, courts and police stories in the city and central Maryland - baltimoresun.com",
      "Selection": "Baltimore Crime Beat - “Wire” creator responds to top cop’s criticism - Baltimore crime news: Police, courts and police stories in the city and central Maryland - baltimoresun.com\n\n\n“The Wire” creator David Simon, during a break between dubbing sessions for season two of “Treme,” responds to comments made recently by Police Commissioner Frederick H. Bealefeld III that the HBO show was a “smear that will take decades to overcome,” reviving a debate that took place throughout the show’s run:\n\nIt is my understanding that Commissioner Bealefeld - by finally choosing to emphasize the quality, rather than the quantity of arrest - has been able to reduce the homicide rate somewhat in our city. If true, this is not only commendable, it is a long time coming. Too long, in fact. \n\nInterestingly, the newspaper that covered his department began making the argument to do exactly that as early as 1994, in a series of articles entitled “Crisis In Blue” (Ed. note: part two can be found here) that carefully articulated the disconnect between the Baltimore department’s aggressive street-level prosecution of the drug war and the root causes of violence in the city. The arguments were furthered in a book entitled “The Corner” that was published three years later. After a new election cycle, however, those arguments were ignored in favor of years of “zero tolerance” of minor street crimes and an obsession with street-level drug enforcement that actually de-emphasized quality police work and led to marked declines in arrest rates for major felonies.  \n\nLater, when a mayor sought to become governor using public safety as an issue, the same police department went further down the path, emphasizing widespread street arrests of dubious quality and legality. This did not reduce crime so much as it violated the civil rights of many city residents and led to the widespread alienation of our jury pool, with many city jurors no longer willing to trust the integrity of testifying officers - a problem that will plague Baltimore law enforcement for years.\n\nFurthermore, on behalf of Mr. O’Malley’s political aspirations, many supervisors in many police districts were engaged in a prolonged campaign to improperly downgrade U.C.R. felonies to misdemeanors so as to further the political claim that crime was under control. This was common knowledge throughout the department and was much remarked upon privately by respected veteran supervisors and investigators, themselves frustrated at the practice. Nonetheless, aggravated assaults became common assaults. Armed robberies became larcenies. Rapes were unfounded.\n\nI do not recall that Commissioner Bealefeld - when he was rising through the ranks during those years - made strenuous public objection to the department’s misdirection, to its statistical flummery, or to the decline in arrest rates that resulted as quality police work was de-emphasized in favor of juked stats.  Perhaps he did so in private, to little avail. And perhaps now that he is in a position to act, he is taking a better path. Again, as a resident of Baltimore, he has my wholehearted support if this is the case.\n\nBut publicly, let me state that The Wire owes no apologies — at least not for its depiction of those portions of Baltimore where we set our story, for its address of economic and political priorities and urban poverty, for its discussion of the drug war and the damage done from that misguided prohibition, or for its attention to the cover-your-ass institutional dynamic that leads, say, big-city police commissioners to perceive a fictional narrative, rather than actual, complex urban problems as a cause for righteous concern. As citizens using a fictional narrative as a means of arguing different priorities or policies, those who created and worked on The Wire have dissented.\nCommissioner Bealefeld may not be comfortable with public dissent, or even a public critique of his agency. He may even believe that the recent decline in crime entitles him to denigrate as “stupid” or “slander” all prior dissent, as if the previous two decades of mismanagement in the Baltimore department had not happened and should not have been addressed by any act of storytelling, given that Baltimore is no longer among the most violent American cities, but merely a very violent one.\nOthers might reasonably argue, however that it is not sixty hours of The Wire that will require decades for our city to overcome, as the commissioner claims. A more lingering problem might be two decades of bad performance by a police agency more obsessed with statistics than substance, with appeasing political leadership rather than seriously addressing the roots of city violence, with shifting blame rather than taking responsibility.  That is the police department we depicted in The Wire, give or take our depiction of some conscientious officers and supervisors. And that is an accurate depiction of the Baltimore department for much of the last twenty years, from the late 1980s, when cocaine hit and the drug corners blossomed, until recently, when Mr. O’Malley became governor and the pressure to clear those corners without regard to legality and to make crime disappear on paper finally gave way to some normalcy and, perhaps, some police work.  Commissioner Bealefeld, who was present for much of that history, knows it as well as anyone associated with The Wire.\nWe made things up, true.  We have never claimed otherwise.  But respectfully, with regard to our critique, we have slandered no one.  And to the extent you can stand behind a fictional tale, we stand by ours - and more importantly, our purpose in telling that tale.\nRespectfully,\nDavid Simon\nBaltimore, MD",
      "Folder": "Archive",
      "Timestamp": "1295760369",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:27:00.109236Z"
}