{
  "id": "a9346950b79041aaace8a4ab965f336f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/20764-genius-broiled-buffalo-wings",
      "Title": "The Genius Little Secret to No-Fry, Crispy Buffalo Wings Food52",
      "Selection": "People have done some truly obsessive things—unnecessarily, as it turns out—in the name of creating the perfect Buffalo wing.\n\nMark Bittman’s Minimalist Buffalo Wings\nby Genius Recipes\n\nOur most dedicated wing scientists have not just deep-fried, but twice-baked, steamed then roasted, fried then baked, and brined then poached then fried. We even got in on it with an egg white-baking soda overnight spa treatment before roasting, and, to be fair, they were wildly delicious.\n\nBut in his classic Minimalist way, Mark Bittman waves his hand dismissively at all of it. He doesn’t pamper his wings at all, just sticks them directly under the broiler to frizzle.\n\nThe skin is still fantastically crispy and the insides juicy, in exactly the way that a high-heat blasted roast chicken is. Chicken skin responds well to scorching temperatures, and wing meat appreciates that you just get it over with fast so it doesn’t have a chance to dry out.\n\nSurprisingly, Bittman’s original recipe focuses on the grill, only offering the broiling option as a casual alternative. But that’s where the real genius comes in, especially for those of us who don’t have a grill (or want wings anytime, even in stormy conditions).\n\nMerrill, Food52’s cofounder and my boss, has been talking up the Bittman method for weeks now, so I’ve filled the Genius version of the recipe with her smart tips.\n\nThe key, Merrill taught me, is to broil the wings all the way to a perfectly crispy-brown, which is how she feeds them to her small children, lightly salted but without spicy sauce. Then, you can sauce and broil them briefly again, which fuses in the spice and re-crisps the skin. Merrill goes one step further for extra messy, spicy wings, and tosses them back in the sauce one last time before serving.\n\nYou can stop at any point in this continuum for exactly the spice and mess level you want, or offer a variety to anyone lucky enough to be part of your wing tasting panel. You can even work in some of Bittman's whopping 11 more sauce options, but why would you want to do a thing like that?\n\nMark Bittman’s Minimalist Buffalo Wings\n\nBy Genius Recipes\n\n3 pounds of chicken wings\n\nNeutral oil\n\nSalt & pepper\n\n1/3 cup relatively mild hot sauce, like Frank’s Red Hot\n\n4 tablespoons melted butter\n\n1 tablespoon sherry vinegar or white vinegar\n\n1 tablespoon minced garlic\n\nBlue cheese dressing and celery sticks for serving (optional)\n\nView Full Recipe\n\nPhotos by Julia Gartland\n\nGot a genius recipe to share—from a classic cookbook, an online source, or anywhere, really? Please send it my way (and tell me what's so smart about it) at kristen@food52.com. Thank you to my boss and wing freak Merrill Stubbs for this one!",
      "Folder": "Feedly",
      "Timestamp": "1508989853",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.533915Z"
}