{
  "id": "a95b9ca18ead4f9da53a284cdfe179b1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1089647/college-degrees-offer-four-times-more-net-worth-to-americans-says-new-fed-reserve-report/",
      "Title": "Americans who go to college are four times better off than everyone else Quartz",
      "Selection": "Few things are both as dreadfully necessary and blisteringly expensive as a college degree in America—once an idle pastime of the privileged elite, now one of the most important entry points into the modern workforce.\n\nWhile Americans without university degrees have seen a fair rise in household income in recent years, they still lag far behind their college-educated peers. Per triennial data from the US Federal Reserve published this week, people with college degrees these days have a median net worth more than four times that of people without. “Shares of income and wealth held by affluent families have reached historically high levels,” the Fed wrote in its report.\n\nIt’s not that college-educated Americans are making dramatically more money than before—in fact, their median net worth has only grown 2% between 2013 and 2016—but rather that those without college degrees still have a long way to go to catch up. In that three-year period for which Fed data was collected, the median net worth for those with only a high school diploma actually jumped around 25%, from $54,100 to $67,100. But the median net worth for those with college degrees is $292,100.\n\nWhat’s the fix for such large disparity? Of course there’s no panacea—but a combination of government policy programs pledging free or reduced college tuition, university-led initiatives to make degrees more accessible to a wider population, and shifts in employers’ hiring priorities could all help. Such efforts are all in the works, but it’s unclear how long it will be until we see their effects in the Fed’s future reports.\n\nUniversity education is also only one facet of the US’s broader struggle with wealth inequality—even as household income in the country is overall on the rise.\n\nRead this next: It’s the end of the university as we know it\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1506660974",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.544171Z"
}