{
  "id": "a9756f57198841e3b1816ba8b970459b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/21915-for-the-spiciest-fried-chicken-make-hot-chicken",
      "Title": "For the Spiciest Fried Chicken, Make Hot Chicken Food52",
      "Selection": "As the story goes, 80-something years ago, Thornton Prince wasn’t exactly the best husband. To teach him a lesson—and show him just how good he had it—his wife made him fried chicken doused in hot pepper, so spicy it burned. One thing led to another and it became a household—and neighborhood and Nashville—favorite, and soon, a business was born. Now, the Prince family is famous not only for having created this iconic dish, but for running one of the city’s most respected establishments: Prince’s.\n\nBeyond its motherland, you can get hot chicken just about anywhere these days. In 2016, Nation’s Restaurant News explained the national boom by KFC’s hopping on the bandwagon, which helped spread the dish’s appeal addictiveness far and wide. Like Thornton, once you try it, you’ll keep coming back for more (and more).\n\nWe’re going to need more napkins for this one.\nPhoto by Bobbi Lin\n\nHere’s how it’s done. Bread bone-in chicken parts: Classically, they’re soaked in buttermilk, then tumbled around in flour—both probably spiced—to yield a sturdy, craggy crust. While other Southern fried chicken stops there, Nashville keeps going. While the chicken cooks, you combine a blend of spices—cayenne is key, plus brown sugar, black pepper, paprika, and garlic powder. Add a pour of hot fry oil—or lard or bacon grease (what, you don’t always have bacon grease on hand?)—and this becomes a makeshift chile oil. When the chicken is done, it goes for a dip, then makes you weep with joy (and capsaicin).\n\nWhen I went to Nashville with a bunch of friends, we went to Hattie B’s, the other hot hot chicken place in town. There, the chicken comes atop slices of squishy white bread, which soaks up the cayenne grease, plus a couple sweet, crunchy pickles for good measure. You can order the chicken in six heat levels: Southern (no heat); mild (touch of heat); medium (warming up); hot! (feel the heat); damn hot!! (fire starter); shut the cluck up!!! (burn notice). I ordered the second to last—when in Nashville, right?—and, in retrospect, I regret this.\n\n 🔥🍗\n \nA post shared by  Emma Laperruque (@emmalaperruque) on Apr 30, 2017 at 1:34pm PDT\n\nSince I probably won’t be going back to Music City any time soon, I wanted to re-create this experience at home (you know, without the cayenne-crying). I started with Hattie B’s recipe, available on the Food Network website. I slightly lowered the cayenne, amped up the accompanying spices, and turned the whole thing into a sandwich. The sesame bun, iceberg lettuce, bread-and-butter pickles—and all the mayo—help tame the burn. At least a little.\n\nNashville-Style Hot Chicken Sandwich\n\nBy Emma Laperruque\n\nView Full Recipe\n\nHave you ever tried (or made) hot chicken before? Tell us more in the comments!",
      "Folder": "Feedly",
      "Timestamp": "1522125174",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.528647Z"
}