{
  "id": "aa99f602ce5b4830bb16169b337c2fb1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.core77.com//posts/79326/This-Mobile-Interface-Aims-to-End-Your-Phone-Addiction-Through-Simple-Design",
      "Title": "This Mobile Interface Aims to End Your Phone Addiction Through Simple Design Core77",
      "Selection": "\"Trap OS\" won a Notable award in the Interaction category of this year's Core77 Design Awards.\n\nTrapOS is a productivity and performance driven mobile operating system designed for simplicity and ease of use across cultural and physical boundaries. It is intended to be a truly universal global interface where users of all abilities and locales can have the same high-quality experience.\n\nABOUT\n\nTrapOS is a productivity and performance driven mobile operating system designed for simplicity and ease of use across cultural and physical boundaries. It is intended to be a universal global interface where users of all abilities and locales share the same high-quality experience.\n\nINSPIRATION\n\nWhen phones have an extremely low battery level, they can go into what is called Battery Trap Mode. This auxiliary mode can only support rudimentary operations with very low processing and power needs.\n\nThe goal was to create a complete operating system that could run entirely in Battery Trap Mode; hence the name TrapOS.\n\nThough we may never achieve a fully functional OS in such extreme conditions, the pursuit is noble. There is always a premium on performance and battery life.\n\nGains in performance and battery life can improve existing devices as well as resurrecting devices that were once obsolete. Product life cycles are extended and older devices are relevant again – potentially having a positive environmental impact.\n\nThis could also lower the entry price point for smartphone ownership, putting technology in economies where it was once out of reach.\n\nNO BRANDING, NO BIAS\n\nWe realized very early that creating a universal operating system would require us to remove any branding and other potential biases.\n\nLuckily, most branding was removed in our text-only system –omitting any branding via app icon artwork.\n\nRoboto Monospace was our chosen. Roboto because it is readily available on most Android devices Monospace was critical because all characters are equally spaced. This removes any spatial bias between characters – ensuring that any offenses or misinterpretations are merely coincidental.\n\nTEXT AS TECHNOLOGY\n\nMany people don't consider text as technology but there are many benefits to using a text only system. Here are a few to consider:\n\n1. Text on a black background has far fewer illuminated pixels and much lower power consumption.\n\n2. Rendering text takes less processing power than graphics. As a result, TrapOS has better performance and increased stability.\n\n3. White text on black has the highest contrast ratio possible. This maximizes legibility for all users.\n\n4. Apps are ordered alphabetically. This method of organization is used by many cultures and has withstood the test of time.\n\n5. Text scales uniformly with no customization to base Android. Its supports users of all visual needs.\n\n6. Localization is standard on all text in Android, making translation effortless.\n\nARCHITECTURE\n\nBy switching to a text-only system, we realized that we had an opportunity to simplify the architecture of the apps as well. Currently, smartphones use an arbitrary system or a most-frequently-used model. We felt like a single alphabetized list was the most simple, intuitive, and democratic strategy.\n\nPROTOTYPE\n\nAs a prototype, we explored removing all graphic elements including system navigation and status bar iconography. This proved to be problematic because controls, percentages, and fractions do not translate into text elegantly. We realized that if we retreated a bit from this hardline text-only stance that it would actually be more intuitive and reduce cognitive load.\n\nRESOLUTION\n\nThe use of a single alphabetized list for apps with system iconography for status and navigation proved to be the most elegant compromise for text and graphic delineation.\n\nUNEXPECTED RESULT\n\nAn unexpected result of TrapOS is that users are required to be more deliberate in their actions – freeing them of visual traps and improving digital health. This is a delightful revelation in the face of cognitive hijacking and unwanted digital addiction.\n\nPOTENTIAL MARKETS\n\nPeople who prefer simplicity - Kids who are addicted to their phones - Adults who worry about digital health - Software engineers who like text UIs - People who are productivity driven - Anyone who need increased legibility - People who use many languages - People who are not tech savvy - Work devices, not social devices - Low cost devices\n\n________________________________________________________________________\n\nVisit the Core77 Design Awards website to view the 2018 Interaction Honorees\n",
      "Folder": "Feedly",
      "Timestamp": "1535346662",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.481471Z"
}