{
  "id": "ab654e9469724420b1a678e2ef808b04",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/future-perfect/2019/4/25/18514798/beyond-meat-ipo-vegan-sustainable-food",
      "Title": "Beyond Meat is going public. Investors are betting on a new future for food. Vox - All",
      "Selection": "Plant-based meat products might fix our food system.\n \nBeyond Meat, the plant-based meat company, is going public next week.\n\nThe company sells burgers that contain no meat, but taste like they do. Its stated goal is to fix our food system. Its initial public offering (IPO) is the latest sign that alt-meat is going mainstream — and that’s a big deal.\n\nIt’s been a good few years for Beyond Meat. National chains including Del Taco, Carl’s Jr., and T.G.I. Friday’s have started carrying their products. They’ve also found their way onto grocery store shelves at Whole Foods, Kroger, and Target. In total, Beyond Meat says its products are available in more than 35,000 outlets, from hotels and college campuses to grocery stores and sports stadiums. Sales have been growing fast — last year the company reported revenues of $87.9 million, up from $32.6 million in 2017.\n\nNow, the company has filed with the Securities and Exchange Commission for an IPO, scheduled for next week. They’ll sell shares in the company for between $19 and $21 per share, allowing them to raise $183 million for additional manufacturing facilities, research and development, and sales. If their stock sells at the high end of that, the company would be valued at $1.2 billion. They’ll be listed on NASDAQ as BYND.\n\nFounded in 2009 by CEO Ethan Brown, the Los Angeles-based company’s products first hit supermarket shelves in 2013. Its rapid rise — food is not an easy industry to break into — reflects intense consumer demand and investor interest in meat alternatives. The company has never been profitable, and lost $29 million in 2018, but its rapidly growing revenues made it a good bet to many investors — as did its positioning on the frontier of a transformation of our food system.\n\n“Beyond Meat was the first company to really set its sights on creating meat from plants that could compete on the basis of the things that meat eaters like about meat,” Bruce Friedrich of the Good Food Institute, which works on policy and investment surrounding meat alternatives, told me. “Before Beyond Meat and Impossible Foods, there was really this sense that plant-based foods was for vegetarians. People like Ethan Brown said, ‘No, we can make plant-based foods that meat eaters like just as much.’” \n\nBrown will soon have a billion-dollar company to prove it. And while it’s the first plant-based meat company to go public, it looks likely that it won’t be the last. The trend that brought Beyond Meat racing to its billion-dollar valuation and IPO are just getting started — and that has the potential to be game-changing, not just for the industry, but for the world.\n\nPlant-based meat alternatives are getting big\n\nThere’s a lot wrong with our food system. Producing meat by raising animals on factory farms produces tons of greenhouse gases, and many analysts think we can’t tackle climate change without tackling the enormous emissions that go into agriculture. Animals in close quarters are fed low-dose antibiotics constantly so they don’t make one another sick, which contributes to antibiotic resistance, a huge threat on the horizon for public health. And animals on factory farms are routinely subjected to intense cruelty and conditions that disgust the average American consumer.\n\nThat’s what inspired people to start working on meat alternatives — and it may be what’s inspiring the consumer enthusiasm that has buoyed them in recent years. Products like veggie burgers, fake chicken, and soy and almond milk are growing in popularity and market share — and even better, they’re getting tastier and harder to distinguish from animal products. \n\nNew breakthroughs in food science have made it easier to imitate the flavor and texture of real meat. While early veggie burgers were almost exclusively purchased by vegetarians, Brown says that 93 percent of Beyond Meat customers buy regular meat too — suggesting the company has succeeded at making something that appeals to meat eaters. \n\nBeyond Meat was among the pioneers of this new generation of plant-based meat, which aimed to replace bean-based veggie burgers marketed mostly to vegans. Now, they’ll be the first plant-based meat company to have an IPO. It’s a remarkable success for the company. It’s also remarkable because food companies rarely go public, Friedrich told me: “The food industry is highly centralized, and most exits are mergers or acquisitions by large food conglomerates.” \n\nLast year, there were rumors that industry giant (and Beyond Meat investor) Tyson Foods was considering buying the company. Beyond Meat stayed independent, though. A few months later, the company added the chief financial officers of Coca-Cola and of Twitter to their board, signaling that it was getting the expertise on-board that it needed to become a huge public company.\n\nThe rest of the plant-based meat industry has been thriving too. Qdoba announced last week that it would be serving Beyond Meat competitor Impossible Foods. Earlier in April, Burger King launched the Impossible Whopper. Industry giants Tyson and Purdue are pursuing their own plant-based product lines. A few years ago, the Impossible Burger was available in a handful of restaurants — now it can be found in more than 5,000.\n\n“There’s a sense that there’s a movement going on that’s much bigger than any one company,” Brown told Vox two weeks ago. \n\nThe interesting thing about that movement is that plant-based meats don’t have to displace all animal meats in order to make a big difference. Every burger replaced with a Beyond Burger has an impact on CO2 emissions, demand for factory farming, and demand for antibiotics. The more the plant-based meat industry grows, the more those impacts will be visible — and that might, in turn, itself fuel more interest in plant-based meats. Beyond Burger’s team doesn’t just believe they’ve found a niche — they say they’ve figured out the “Future of Protein.” Here’s hoping they’re right.\n\nSign up for the Future Perfect newsletter. Twice a week, you’ll get a roundup of ideas and solutions for tackling our biggest challenges: improving public health, decreasing human and animal suffering, easing catastrophic risks, and — to put it simply — getting better at doing good.",
      "Folder": "Feedly",
      "Timestamp": "1556417366",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.410180Z"
}