{
  "id": "abd70c800b29402bb445c52ae78c7054",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.artofmanliness.com/articles/how-a-mens-dress-shirt-should-fit/",
      "Title": "How a Men’s Dress Shirt Should Fit The Art of Manliness",
      "Selection": "Dress shirts are a men’s wardrobe staple and a sartorial workhorse that can go from dressy to sharp casual and from the office to date night at a pub. Button-ups look great with a more formal suit, while button-downs can be worn under a sport coat, with chinos and a tie, or alone with a pair of jeans. And dress shirts are not only thoroughly versatile, they’re also pretty universally handsome and flattering — at least, if they fit well. \n\nUnfortunately, many men are walking around in dress shirts that decidedly do not fit well — being either too small, or most frequently, 1-2 sizes too big. While the wearers themselves may not notice it, other people will. Poorly-fitting dress shirts give you a look that’s unprofessional, sloppy, and just generally less sharp than it could be.\n\nThe reason most men wear dress shirts that don’t fit them right, is that they don’t realize that when they get them off the rack, they’re typically not ready to wear. No off-the-rack shirt is going to fit your measurements perfectly. So once you buy a dress shirt, your next step is to take it to a skilled tailor (here’s how to find one), so he can adjust it so it fits you just right. Alternatively, you can buy a custom-made dress shirt that’ll fit you nicely from the get-go.\n\nNot all adjustments can readily be made by a tailor, so you’ll still want to buy an off-the-rack dress shirt that fits as well as possible from the start (though it’s better to buy a little big than small, so the tailor has something to work with). To aid in your selection process, and enable you to know what later adjustments to make, below we explain what mistakes to avoid in the fit of a dress shirt and how each detail of it should ultimately look and lay. \n\nDress Shirt Collar Fit\n\nThe collar of your dress shirt has one main job: to frame your face. Without a well-fitted collar, you end up with a noticeably unbalanced garment. That’s why you should pay close attention to the collar when you first try something on. A bad collar can make a $200 shirt look sloppy, while a great one can make a $20 shirt look amazing.\n\nToo Tight: The collar is close enough to actually pinch the skin underneath. You’ll feel it right away, and it’s quite uncomfortable. It would be impossible to place a finger between the neck and collar without stretching or tugging.\n\nToo Loose: The collar doesn’t touch the neck, but rests on the whole area surrounding it, almost like the collar of a coat that was lazily hung up. There’s also a gap that’s large enough to squeeze in about four fingers.\n\nJust Right: The proper fit means that the collar touches the skin all the way around the neck, but doesn’t press against it. You’re able to slip two fingers comfortably in between your neck and the collar at any point.\n\nDress Shirt Shoulder Fit\n\nToo Tight: The shoulder points are shifted in from your shoulders and towards the neck. Part of the sleeves may also end up resting over the shoulders, causing wrinkles. \n\nToo Loose: The shoulder points slump off the shoulders and down onto your upper arms. The shirt is prone to ballooning and making your upper body look bigger. It’s hard to adjust these points, so don’t bother having it tailored.\n\nJust Right: This is where the shoulder points sit perfectly at the edge of your shoulders, where the plane of the shoulder meets the plane of the outer arm. The armscye (the hole where the sleeve joins the shirt body) is large enough that it doesn’t cause tugging or twisting of the shoulder seam, which allows you to move your arms freely and comfortably.\n\nDress Shirt Torso Fit\n\nToo Tight: You’ll notice that the buttons strain to close, which causes wrinkles to form around the buttonholes. The tightness may also cause some pulling on the sleeves, putting pressure on the shoulder seams.\n\nToo Loose: The excess fabric tends to billow around your waist or chest. This is the kind of shirt that causes “muffin-topping” from the waist area. The solution here is to have the torso brought in, to simply size down, or to try another brand with a better fit.\n\nJust Right: You’ll have no problem buttoning up this shirt. The underside of the placket (where the buttons and buttonholes meet) is supposed to rest lightly against the midpoint of your ribcage. The shirt can be tucked in without any billowing.\n\nDress Shirt Sleeve Fit\n\nToo Tight: Wearing the shirt with your arms hanging down, you’ll get a “pinching” feeling when your elbow or shoulder moves. The sleeves will limit your movement and show off way too many wrinkles.\n\nToo Loose: The sleeves have so much slack that they naturally create folds of cloth all over, especially around the cuff. It’s likely there are over 3 inches of excess fabric in the sleeves, so they should either be brought in or sized down.\n\nJust Right: The sleeve should be slightly wider at the upper arm than the cuff, with a smooth, even taper. There’s also some looseness (about 1-2 inches of fabric) when the arms are hanging down straight. This gives you sufficient freedom of movement.\n\nDress Shirt Sleeve Length\n\nToo Short: This is where either the wrist bones are left exposed, or the cuffs get hidden completely underneath the sleeves of your jacket. Neither situation makes the shirt look good, so you’ll need to find a different brand with longer sleeves.\n\nToo Long: The sleeves extend all the way to the heel of your hands. This leads to some fabric bunching up at the point where the cuffs end. When you wear a watch, it’s going to be covered by the sleeve every time.\n\nJust Right: The sleeves come all the way down to the hinge of your wrist and just cover the large wrist bone. When you’re wearing a jacket, about 1/2 inch of shirt cuff is seen beyond the end of the jacket sleeves. The cuff should also touch (and in some postures cover) your watch whenever you wear it.\n\nDress Shirt Sleeve Cuff Fit\n\nToo Tight: The shirt has sleeves that can’t be pulled off without unbuttoning the cuffs (or popping a button). The cuffs press against the skin all the way around the wrists – and you feel like they’re “strangling” your wrists. In terms of solutions, you may want to move the button or look for a larger size instead.\n\nToo Loose: The cuffs are not only wide enough to slide loosely over a watch, but also have enough room for some fingers to go in between the cloth and your skin. Folds or wrinkles form in the cuff fabric when your arms rest against a flat surface (like a table). This means you’ll have to either size down or tighten it up with the cuff button.\n\nJust Right: The cuffs should fit close to the skin while still allowing space between the fabric and your wrists. You can easily put the shirt on or take it off without unbuttoning the cuffs and hardly any wrinkles are formed. If you wear a watch often, it’s better to size the cuffs in accordance with your watch.\n\nDress Shirt Bottom Hem Length\n\nToo Short: When the shirt is untucked, it barely covers your belt line (or the waist of your trousers). When tucked in, some parts of the hem remain exposed and might pop out when your body moves or bends. You’ll need a different brand or larger size.\n\nToo Long: The shirt tails are long enough to cover the crotch (or extend beyond it). When tucked in, any excess fabric has to be shoved between the legs to prevent bunching up. But compared to other “oversized” areas, this one isn’t a serious problem. A tailor will be able to shorten this easily.\n\nJust Right: The proper dress shirt length ends a few inches below the belt line, allowing the shirt to stay tucked in when you raise your arms. When untucked, the hem falls just far enough to cover your belt.\n\n_____________________________\n\nWritten By Antonio Centeno\nFounder, Real Men Real Style\nClick here to grab my free ebooks on men’s style\n\nThe post How a Men’s Dress Shirt Should Fit appeared first on The Art of Manliness.\n",
      "Folder": "Feedly",
      "Timestamp": "1568347412",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.373648Z"
}