{
  "id": "acb76df673bb4c91a5209171a19de8be",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/18930-10-freezable-meals-that-might-as-well-be-superheroes",
      "Title": "10 Freezable Meals That Might As Well Be Superheroes Food52",
      "Selection": "I don’t always want to cook (cue shock, horror, and “but you work at a food site, that’s your thing\"). But I don’t. Just like, I’m sure, you don’t either.\n\nWhat We Cook When We Don't Want to Cook Anything\nby Leslie Stephens\n\nWhen this happens, sometimes egg tacos or avocado toast will suffice. And then, other times, you don’t want to cook but you do want a real, home-cooked dinner. I know, I know. You can’t have everything for nothing. But I’m also here to tell you can! You just need a little help from your freezer.\n\nThese 10 meals can be made-ahead, frozen, thawed, and reheated for when you just can’t in the kitchen. Below, I’ve suggested things to cooked and frozen at the same time so they can, you guessed it, be eaten at the same time. However, you can, of course, just make the main dish and leave the sides aside (ha!).\n\nAnd, if you’re new to freezer-friendly foods or just skeptical about what should and shouldn’t be frozen, check out this guide.\n\nMeal 1: Soup & Biscuits\n\nRed Lentil Soup with Beet Greens\nby Medha | Farm on Plate\nVegan Sweet Potato Biscuits\nby Gena Hamshaw\n\nWhat to do: For how to freeze and thaw soup see here and for how to freeze and cook biscuits see here.\n\nJust add: A dollop of yogurt for on top of the soup.\n\nMeal 2: Dumplings & XO Sauce\n\nTina's Delicious Chinese Dumplings\nby Anna Francese Gass\nXO Sauce\nby Leslie Stephens\n\nWhat to do: For how to freeze dumplings, see here and for how to cook said frozen dumplings see here. For freezing the XO Sauce, let it cool and portion it into ice cube trays, so you don’t end up with a big ol’ frozen block of un-portionable, un-scoopable sauce. After the cubes are frozen, transfer to a freezer bag. When you’re ready to cook, you can thaw the sauce in the fridge or just throw it right into the stir-fried vegetables (see below) to thaw and cook.\n\nJust add: Soy sauce for the dumplings and stir-fried vegetables (of any sort, to spoon the XO Sauce into).\n\nMeal 3: Meatballs & Sauce (for Subs!)\n\nExtra Tender Meatballs\nby Merrill Stubbs\nMarcella Hazan's Tomato Sauce with Onion and Butter\nby Genius Recipes\n\nWhat to do: Cook the sauce as the recipe states and let cool completely before portioning into freezer bags and placing in the freezer. To thaw, place the bags of sauce on a plate or bowl (no spillage!) and leave in the refrigerator for 4 to 5 hours. The sauce probably won’t be completely cooled by then, but that’s okay! Just put it into a pot, turn the heat on, and that’ll do the trick.\n\nFor the meatballs, cook as the recipe states. Let cool, then place, separated, on a parchment-covered sheet pan and into the freezer to freeze. Once frozen, put them in a freezer bag. To reheat the meatballs, place into your pot of thawed tomato sauce and simmer until warmed through.\n\nJust add: It’s meatball sub time. Grab a baguette (or, if you’re feeling ambitious make one and freeze that, too), fresh mozzarella, and pepperoncini—and the meatballs and tomato sauce, of course!—and get to layering your subs.\n\nMeal 4: Enchilada Casserole & Black Beans\n\nVegan Enchilada Casserole\nby Gena Hamshaw\nBlack Beans and Rum (for Poor Poets and Others)\nby Kate Kenderish\n\nWhat to do: Assemble the casserole and cover very well with aluminum foil and secure the foil’s edges with tape. To cook, you have two options: Thaw in the fridge overnight and bake as described in the recipe or place directly into the oven, without thawing, knowing you’ll need about 15 minutes or more of extra cooking time (if you see yourself doing the former, use an aluminum pan to avoid any glass shattering). To freeze and thaw beans, cook and follow the same instructions for the tomato sauce.\n\nJust add: Sliced avocado and chopped cilantro, for topping the casserole.\n\nMeal 5: Chicken Fingers & Sweet Potato Fries\n\nChicken Fingers\nby Merrill Stubbs\nSouthwestern Spiced Sweet Potato Fries with Chili-Cilantr...\nby TasteFood\n\nWhat to do: After breading the chicken fingers (but before baking), place onto a parchment-lined baking sheet and into the freezer. Freeze until frozen, then place into a freezer bag. When ready to cook, arrange on a baking rack set on a baking sheet, drizzle with oil, and bake at 425° F for about 25 minutes, or until cooked through.\n\nFor the sweet potato fries, cook the fries as directed and let cool completely. Place on a parchment-lined sheet pan and into the freezer. Once frozen, you can transfer them to a freezer bag. To cook, place onto a parchment-lined sheen pan and pop them into the oven (at 425° F, so the same as the chicken fingers) for about 10 minutes, or until they’re warmed through.\n\nJust add: Ketchup and/or ranch dressing for dipping the chicken fingers into and a salad to balance out the chicken fingers.\n\nMeal 6: Samosas & Dal\n\nFlaky Baked Samosas \nby Kendra Vaculin\nDal Makhani \nby Meera Sodha\n\nWhat to do: After filling and forming your samosas, place onto a parchment-lined sheet pan and pop into the freezer. Once frozen, transfer to a freezer bag. When ready to bake, place once again on a parchment-lined sheet pan and cook as directed in the recipe, adding on a few more minutes to account for the samosas being frozen.\n\nFor the dal, cook as the recipe states, let cool, and follow the same freezing and thawing instructions as the tomato sauce.\n\nJust add: Rice, for the dal, and some sort of vegetable (perhaps Steam-Roasted Carrots with Cumin?).\n\nMeal 7: Chili & Cornbread\n\nSheri's Shortcut Chili\nby Ali Slagle\nSuper-Easy Brown Butter Cornbread\nby drbabs\n\nWhat to do: Cook the chili as the recipe says to, let cool, and follow the same freezing and thawing instructions as the tomato sauce.\n\nFor the cornbread, cook as directed and follow the freezing and thawing instructions here.\n\nJust add: Whatever fixin’s you want for your chili, like diced red onions, sour cream, grated cheese, chopped cilantro, and pickled jalapeños.\n\nMeal 8: Chicken Stock & Leftover Roast Chicken (aka Future Soup)\n\nChicken Stock\nby Cara Nicoletti\nBarbara Kafka's Simplest Roast Chicken\nby Genius Recipes\n\nWhat to do: Make the chicken stock, let cool completely, portion into freezer bags, and freeze. Put the chicken stock in a pot and turn the heat on low, stirring occasionally to break up the stock. Heat until thawed and at a simmer.\n\nFor the chicken, once cool, shred some of that roasted bird and place into freezer bags and freeze. If you had the foresight to thaw your chicken in the fridge the night before, great! If not, add it right to the pot (that’s why you shredded it).\n\nJust add: Can you guess what this will be? If you guessed chicken noodle soup, you’d be wrong. Kidding! It’s chicken noodle soup. Grab some noodles, frozen peas, chopped celery, and peeled, thinly sliced carrots (on the bias, if you like). If you’re unsure of how to make chicken noodle soup, here’s a good guide. Right before serving, throw in some minced parsley and a smattering of freshly ground black pepper.\n\nMeal 9: Chicken Tamale Pie & Salsa\n\nChicken Tamale Pie\nby Kendra Vaculin\nCooked Green Salsa (Salsa Verde)\nby Pati Jinich\n\nWhat to do: Follow the casserole freezing, thawing, and cooking (following the time and temperature directions in the pie's recipes) instructions as described for the Vegan Enchilada Casserole.\n\nFor the salsa, cook and let cool. Then, portion it into freezer bags and freeze. Thaw overnight in the refrigerator or, in a pinch, in a bowl of cold water, refreshing the water several times until thawed.\n\nJust add: A side of guacamole and chips wouldn’t be remiss here. And perhaps a green salad, too, dressed with a spicy lime vinaigrette.\n\nMeal 10: Mac & Cheese\n\nMiso Mac and Cheese\nby Posie Harwood\n\nWhat to do: Cook as stated, let cool, and cover with aluminum foil, sealing the edges with tape. Place into the freezer. When ready to cook, thaw overnight in the refrigerator and reheat at 375° F until warmed through.\n\nJust add: Nothing! It’s just mac and cheese tonight. Sit back, relax, and wait for that cheese to start bubbling.\n\nDo you have a favorite freezer-friendly meal? Tell us about it in the comments.",
      "Folder": "Feedly",
      "Timestamp": "1485542316",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.645879Z"
}