{
  "id": "acb970b9b7144d2b82fa0257f78b962b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/937553/serial-comma-why-do-people-care-so-much-about-the-oxford-comma/",
      "Title": "The real reason we care so deeply about the Oxford comma Quartz",
      "Selection": "Last week, hundreds of thousands of people around the US were reading and sharing a story about punctuation.\n\nOn March 13, an appeals court in Maine said a state overtime law came down to a missing comma. In the case between truck drivers and their employer, Oakhurst Dairy, the judges’ decision seemed like a clear case for using the serial comma, which comes before the coordinating conjunction (like “and” or “or”) in a written list of more than two things. The serial comma draws a distinction between “I have a mandate, glitter, and septuplets” and “I have a mandate, glitter and septuplets,” and its day in court drew a line in the sand between two smug groups of people who are passionate about punctuation.\n\nIn the US, the serial comma is a long-contended piece of punctuation. Proponents say it provides clarity, and critics say it provides redundancy. It goes by “serial” and “Oxford,” for the Oxford University Press style guide, which advocates for the serial comma (even though it’s generally more common in American English usage than British English). A snooty few call it the “Harvard” comma. The Elements of Style, by William Strunk Jr. and E.B. White, is for the serial comma; the Associated Press is against.\n\nCommenters on Quartz’s article seemed mostly in favor, declaring “Validation!!” and “I feel vindicated.” One was a self-described “unwavering defender” of the serial comma.\n\nBut the rules that dictate whether to use the comma or not aren’t a matter of correctness, they’re a matter of style. That means it comes down to the preference of editors, before eventually reaching textbooks, teachers, and students. Once that preference takes hold in young Americans, it seems, it’s hard to shake.\n\nThink back to when you learned the basics of English language style. Were you told that the orange juice belonging to Julius should be Julius’ or Julius’s? Did you learn to type one space after a period at the end of the sentence, or two? And then, when you arrived at college only to have an editor or professor undo these doctrines, how much time did you waste fighting for your old habits, before reluctantly unlearning them?\n\n“When you invest the time to learn something that you think is important, and then see other people not observing it, disrespecting it, treating it like it’s not important—it hits a nerve with a lot of people,” says June Casagrande, a grammar columnist and author of 2014’s The Best Punctuation Book, Period.\n\nShe adds, “That’s the generous side. The less flattering thing going on here is people like to be right and correct others. … All of grammar and grammar snobbery seem to me rooted somewhat in this very fundamental desire to label things right or wrong.”\n\nIt’s not just English teachers and news editors who care about the comma. “Casual observers also tend to feel passionate about the serial comma issue,” says Casagrande, who has been writing about grammar since 2002. “Elite sticklers are a big part of the pro-serial comma contingency, but people who know about it are psyched about it.”\n\nFor her part, Casagrande disagrees with the ruling. The appeals case was about whether the drivers were exempt from overtime in Maine. The disputed passage of the law hinged on whether “packing” and “distribution” were separate activities not eligible for overtime, or both part of one activity. If “packing” was the final item in the list, then the drivers could be eligible for overtime; if “distribution” was the final item, they weren’t.\n\nThe canning, processing, preserving,\nfreezing, drying, marketing, storing,\npacking for shipment or distribution of:\n(1) Agricultural produce;\n(2) Meat and fish products; and\n(3) Perishable foods.\n\nThe appeals judges ruled that without the serial comma before “or distribution,” the law was ambiguous, and therefore the drivers could still be eligible for overtime. Many, including this reporter, read that as a firm “yes” for serial commas. But for Casagrande, the case is one about conjunctions.\n\nConsider this example. Read each of these sentences aloud without commas:\n\nAt this party we have water beer rum and coke.\n\nAt this party we have water beer and rum and coke.\n\nIf you read it the way I do, the first party has four kinds of drinks, and the second has three. It’s primarily the “and” before rum that shows the list is ending, argues Casagrande.\n\nIn the case of the Maine overtime law, there is no conjunction before “packing” but there is one before “distribution.” Therefore, according to Casagrande, the court should have looked at the conjunction for clarity instead of searching for a serial comma. “I think the judge blew it,” she says.\n\nCasagrande is personally indifferent on the rule of the serial comma, but she ultimately recommends using it since it’s more popular. She says, “It does seem to help more than it hurts—so it’s illogical, but I understand why people prefer it.”\n",
      "Folder": "Feedly",
      "Timestamp": "1490186383",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.698533Z"
}