{
  "id": "ad34bc62df504ceca9fa7a045ddfd994",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1208363/amazons-push-into-fashion-retail-should-scare-these-companies-the-most/",
      "Title": "Amazon’s push into fashion retail should scare these companies the most Quartz",
      "Selection": "Amazon’s size and reach—not to mention its willingness to sacrifice profits for market share—make it a company that every other business is scared to go up against. Among them are America’s fashion retailers, who have had to face off with Amazon ever since it started an aggressive push into selling clothes.\n\nCoresight Research, an independent firm focused on retail and technology (formerly Fung Global Retail & Technology), surveyed 1,699 demographically representative, internet-using Americans about what clothing they’re buying on Amazon, as well as the stores they’ve shifted away from. Nobody can yet say with certainty how much business Amazon is siphoning from other fashion retailers, and other than Amazon, nobody knows exactly what customers are buying on the site. But the results offer a hint about which companies should be most concerned about Amazon’s fashion ambitions, and in what areas they’re losing out.\n\nAmazon’s clothing business is getting bigger\n\nVarious sources estimate that Amazon is now the biggest clothing retailer in the country based on merchandise volume, thanks in large part to its massive third-party marketplace. In Coresight’s survey, of the 1,564 respondents who said they bought clothes or footwear in the last year, more had actually done their shopping at Walmart than at any other retailer. But Amazon came in second, just edging out Target and Kohl’s.\n\nThe companies losing clothing dollars to Amazon\n\nThat rapid growth comes at the expense of competitors. Coresight identified 446 people who said they spend more of their clothing and footwear budget at Amazon than they did about three years ago, and asked them which retailers they switched their spending away from. The top answers were Target and Walmart, two of America’s big-box giants.\n\nDepartment stores including Kohl’s, Macy’s, and JCPenney weren’t far behind. Further down the list were inexpensive and off-price retailers, from Old Navy and Gap to TJ Maxx and Nordstrom Rack.\n\nThe clothing categories Amazon shoppers are buying\n\nCoresight also asked the 719 people in the survey who said they had bought clothing or shoes from Amazon in the last year about what items they were buying. Contrary to the idea that people are just stocking up on socks and underwear, footwear was by far the top category. Women’s and men’s casual clothing took the next spots on the list. It’s still a safe bet that people tend to buy basics on Amazon more than trendy fashion, as other research has found. But the results show that Amazon is finding shoppers who aren’t just loading up on white tube socks.\n\nThe clothing and footwear brands people buy on Amazon\n\nCoresight asked people who had bought clothes or footwear on Amazon in the last year what brands they’d purchased. The results show that another Amazon strategy—private fashion labels—is working well. When combined, its own private labels, including Amazon Essentials, Lark+Ro, Goodthreads, Rebel Canyon, and more, came in ahead of well-known labels like Adidas and Calvin Klein. (The private labels wouldn’t have fared as well individually, of course.) Only Nike, Under Armour, and Hanes beat out Amazon’s private labels.\n\nThe takeaway\n\nOne other notable finding was that survey respondents who were Amazon Prime members were much more likely to have purchased clothing or footwear from Amazon than non-Prime members. In fact, among Prime members, Amazon was the clothing retailer most had shopped at, while among non-Prime members, Amazon was just the seventh most-popular retailer.\n\nFor Amazon, that’s an advantage, as opposed to a problem. Prime membership keeps growing rapidly; by one estimate, more than half of US households now have a Prime account. As Prime continues its spread, the indication is that more of those households will start buying their clothes on Amazon, likely to the detriment of stores such as Target and Walmart. Some companies, such as Nike and Hanes, might benefit. But the one that stands to gain most of all, of course, is Amazon itself.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1519276118",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.493631Z"
}