{
  "id": "ad5121e4c85a4af6b2a0280e7f82902d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/identities/2017/2/15/14625018/pew-survey-muslims-atheists-religion",
      "Title": "Survey American attitudes toward Muslims have improved Vox - All",
      "Selection": "The country is — slowly but surely — moving in a more inclusive direction.\n \nAmericans have warmed toward almost all major religious groups, including Muslims and atheists, over the past few years.\n\nThat was the conclusion of a new report by the Pew Research Center, which gauged Americans’ attitudes toward religious groups by asking nearly 4,000 US adults to rate different groups through a “feeling” thermometer. Pew did a similar survey in 2014, but this time it found much higher ratings for different religious groups almost across the board.\n\nFor example: In June 2014, Americans on average gave Muslims 40 degrees — a very chilly rating. But in January 2017, that jumped up to 48 degrees. That’s still far from welcoming — and atheists and Mormons don’t fare much better — but it’s a notable increase in just a few years.\n\nPersonal proximity to a religion seemed to play a big role in the findings. People who identified as the religion they were rating were, not surprisingly, more likely to rate it higher. And people who knew someone who practiced the religion they were rating were — also not surprisingly, given a lot of sociological research — also more likely to rate it higher.\n\nThe latter could explain why Americans rated Muslims more highly this time around. According to Pew, “Fewer than half of Americans say they personally know a Mormon (43%) or a Muslim (45%), though more Americans say they know a Muslim today than said this in June of 2014 (38%).”\n\nAnother factor seemed to be partisanship. While Pew found that both Republicans and Democrats reported warmer feelings toward various religious groups, Democrats were much more likely to demonstrate big increases compared to 2014. So while Republicans saw a 6-degree bump in feelings toward Muslims, Democrats saw a bigger 10-degree jump.\n\nThe only group to not see any sort of increase, including among both Democrats and Republicans, was evangelical Christians.\n\nAgain, feelings toward some groups, particularly Muslims and atheists, remain fairly chilly. And it remains to be seen whether the increases will have any effect on views toward specific policies, such as President Donald Trump’s executive order to restrict immigration from seven Muslim-majority countries.\n\nBut Pew’s survey shows a notable improvement, indicating that America is slowly but surely moving in a more inclusive direction.\n\nWatch: Why Mormons identify with Syrian refugees\n",
      "Folder": "Feedly",
      "Timestamp": "1487193854",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.712546Z"
}