{
  "id": "af4aa62bdd7c41b480431b310b454449",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/54133/Finally-the-Dieter-Rams-Documentary-Weve-Been-Waiting-For",
      "Title": "Finally, the Dieter Rams Documentary We've Been Waiting For Core77",
      "Selection": "Motivated to pass down what he's learned to the future generation of designers, Dieter Rams granted filmmaker Gary Hustwit unprecedented access to him and his archives for two weeks. Hustwit's research will culminate with Rams—the first documentary about the designer who, over the course of his influential career, has designed over 500 products, many of which you've probably owned. \n\nHaving already released a much-loved documentary design trilogy with Helvetica, Objectified and Urbanized, Hustwit is experienced in creating engrossing narratives that uncover design culture. This time around, Hustwit says: \"I'm also interested in exploring the role that manufactured objects play in our lives, and by extension the relationship we have with the people who design them.\" \n\nA select few of Dieter Rams's designs featured in the Kickstarter campaign\n\n\"We hope to dig deeper into Rams's untold story—to try and understand a man of contradictions by design,\" Hustwit says. Through candid conversations between Hustwit and Rams, the documentary will shed light on his philosophy, process, inspirations, and even his regrets.\n\n\"If I had something to do in this world again, I would not want to be a designer. Because I believe, in the future, it will be less important to have many things and more important to exercise care about where and how we live.\"\n\nPhotograph by Abisag Tüllmann \n\nThe documentary could not be more timely. In many ways, the ideas that form Rams's design philosophy—developed fifty years ago—resonate now more than ever before, especially when you factor in our current tensions over climate change. \"His design philosophy is actually about more than just design—it's about how you live. It's about getting rid of excess and visual clutter and just living with what you need,\" says Hustwit. It's no surprise then, that Rams's Ten Principles of Good Design remain at the center of today's industrial design education and are frequently cited by some of our most admired designers. In an interview with Hustwit for his 2009 documentary Objectified, Rams revealed:\n\n\"I didn't intend these 10 points to be set in stone forever. They were actually meant to mutate with time and to change. But apparently things have not changed greatly in the past 50 years.\" \n\nDieter Rams at work at Braun, circa 1970s. Photo by Abisag Tu¨llmann. \n\nWhen asked how design has changed, if at all, in the past half century, Rams noted that design today has become an inhumane industry marketed as a \"lifestyle asset.\" \n\n\"I'm bothered by the arbitrariness and the thoughtlessness with which many things are produced and brought to the market. There are so many unnecessary things we produce, not only in the sector of consumer goods, but also in architecture, in advertising. We have too many unnecessary things everywhere. And I would even go as far as to describe this as inhumane. That is the situation today. But actually, it has always been a problem.\"\n\nDieter at Vitsoe London working on a re-design of his 601 chair \n\nDieter Rams and Mark Adams of Vitsœ , London 2015. Photograph by Gary Hustwit. \n\nIt's not just the ideas that continue to strike a chord. The physical products Rams has developed are finding new audiences as he refines his work to be reissued by Vitsœ. Rams's work is also reported to be the inspiration for current Apple products. Jonathan Ive, Chief Design Officer, for Apple has said that \"Rams's ability to bring form to a product so that it clearly, concisely and immediately communicates its meaning is remarkable… He remains utterly alone in producing a body of work so consistently beautiful, so right and so accessible.\"\n\nLast week, Hustwit launched a Kickstarter campaign which he hopes will \"dig deeper into Dieter's untold story—to try and understand a man of contradictions by design.\" The money raised will go towards finishing the shooting and producing the film, as well as covering archival costs. At press time, the campaign has already exceeded half of its goal: $200,000. The film is expected to debut sometime in 2017.\n\nEnter a caption (optional)\n\n\n",
      "Folder": "Feedly",
      "Timestamp": "1467156988",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.740545Z"
}