{
  "id": "af518f337fac4a51a43446cfca0474b1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1087015/singapores-chinese-embassy-issues-27-page-pamphlet-with-etiquette-advice-for-mainland-tourists/",
      "Title": "Please don’t bribe the officials Singapore’s Chinese embassy has some etiquette rules for mainland tourists Quartz",
      "Selection": "Chinese tourists have the reputation they do for a reason.\n\nTheir antics and outlandish behavior—such as the case of a teenager defacing an Egyptian pyramid in 2013—have become well-documented in news and social media, and China knows such acts reflect poorly on the country. To preempt further damage, Chinese embassy officials in Singapore have published a 27-page pamphlet for mainland tourists with travel guidelines and etiquette. Among the advice it offers: “Don’t try to bribe custom officials when you are rejected entry with a valid visa.”\n\nNearly 6 million people from China are expected to travel abroad during the 68th National Day holiday, a week-long break known as Golden Week that kicks off Sunday (Oct. 1). In anticipation of this, the new booklet details accepted behavior and rules of conduct in the city-state, which received nearly 2 million Chinese tourists in the first seven months of 2017, according to Singapore’s tourism board.\n\nTop international travel destinations during the 2017 National Day Holiday, according to China’s travel agency Ctrip. (Quartz)\n\nThe first copies of the pamphlet, titled “Safe and Civilized Travel for Chinese Citizens in the Lion City,” were given to 20 Chinese tourists on Sept. 22 shortly after they arrived in Changi Airport, having agreed to partake in a press conference held by the embassy. The 10-chapter guide (link in Chinese) covers more than a hundred “dos and don’ts.”\n\nHere are some of the dos:\n\nReach out to the airline staff if you feel disturbed by other passengers. Don’t get into a fight.\n\nGive a proper tip—in cash—to the hotel porter who helps carry luggage to your room.\n\nGive precedence to others when taking photos at tourist sites. Don’t fight for spots or hinder others when they are taking pictures. Please say thank you when asking others for help taking a photo.\n\nDress clean and proper. Although the weather in Singapore is hot, don’t reveal the chest and bare arms.\n\nAsk for permission if you don’t have time and wish to jump the queue.\n\nAnd some of the don’ts:\n\nDon’t take the life vests and blankets off the plane.\n\nDon’t bring durian (a fruit known for its strong odor) on public transportation.\n\nDon’t take the ashtray or bath towels from guest rooms.\n\nDon’t use towels or bed sheets to wipe your shoes. Use the hotel’s facilities properly, and follow the rules for its swimming pool.\n\nDon’t evade bus fare.\n\nThese suggestions come following a series of uncouth Chinese visitor behavior in recent years. In 2014, for example, four mainland tourists threw hot water and noodles at a flight attendant because their group wasn’t seated together on a flight from Bangkok to Nanjing, China, forcing the plane to turn back. In 2013, a tour group of 30 lifted stainless-steel cutlery from a Singapore Airlines plane and refused to return them until the group’s tour guide said the act was “hurting the reputation of Chinese people.”\n\nThe latest pamphlet is in line with travel guidelines issued by Chinese officials. In 2013, China’s national tourism administration issued a 64-page booklet titled “Guidebook for Civilized Tourism,” following an earlier one-page version in 2006, which contained rules such as: Don’t sneeze at others, and don’t force foreigners to take group photos (link in Chinese).\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1506436463",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.625126Z"
}