{
  "id": "aff6362698f44964899b8d32321e7c3e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/15663-you-can-do-better-than-subway-tile",
      "Title": "You Can Do Better Than Subway Tile Food52",
      "Selection": "Too much of a good thing can ruin it for you, as anyone who lived off flavor packet ramen in their 20s can testify.\n\nSo it is for me with subway tile. The 3-inch by 6-inch glossy white ceramic tiles rose to popularity after they were used in turn-of-the-century subway station designs in New York City—and have become seemingly de facto in so many kitchen and bath wall coverings of current vogue.\n\nAll the kitchen trends (including subway tile) on the set of The Intern.\nPhoto by The Intern\n\nI'm not saying subway tile is awful—it's classic, and it's appealing for good reasons: It's easy to clean and shines like a smile. It's humble, yet rooted in history. Trendy but subtle, inexpensive, and with a report card that reads, \"Plays well with others.\"\n\nBut, from where I stand (sifting through every other Pinterest photo just to find one that's not subway tile porn), we've lost control. Just because something is classic and clean doesn't mean it's the only option! Also, they're white tiles laid like bricks... Let's collectively yawn.\n\nThere are so many incredible tiles and patterns to choose from in the world. As a call for change from the subway tile status quo, for an acceptance that tile can be expressive and exciting, for confidence in creative design, here are 5 clean, uncluttered alternatives to subway tile that can do everything it can do—and better.\n\nBeveled\n\nPhotos by Nemo, Yellow Trace\n\nWith six beveled sides, this Formae Diamond Cotton tile by Nemo (above, left) adds dimension and interest while still being regular, white, and glossy. A slightly less dramatic bevel, just around the edges of each tile, paired with an unexpected vertical pattern (above, right) is similarly shaken up while still relying on glossy rectangular unit.\n\nColor\n\nPhotos by Elizabeth Robert (via Design to Inspire), Justina Blakeney (via The Jungalow)\n\nWhether you go casual or splashy—as in these juicy green Moroccan Mosaic Tiles from Badia Design (above, right)—choosing tiles that are colorful doesn't mean you will miss having one more sliver of white wall space. In fact, especially on a backsplash or in a bathroom, a rich hue will help disguise grime in between cleanings. Either work with a range of related tones (above, left), or spring for a saturated color and lay the tiles horizontally (as in, don't go too crazy if your color is).\n\nMore: How to use tile even more unexpectedly in your home.\n\nPattern\n\nPhotos by Taliah Lowry (via Remodelista), Mandarin Stone\n\nA playful pattern—either in the way you lay the tile (above, right) or on the tile itself (above, left)—can change everything. The otherwise simple white marble tiles above (from Mandarin Stone) are statement-making when laid in a sideways herringbone pattern with a jagged uncut edge left exposed; and the patterned black and white bathroom section on the left is almost cozy, like a textile. Replace either with subway tile, and Pinterest would have cried.\n\nShape & Scale\n\nPhotos by Pinterest, Smart Tiles\n\nTiny hexagonal ceramic tiles(above, right) are a great way to go if you want to stay white (or gray, or marbled) and glossy but change up the shape. And you can even opt for stick-on sheets of them, like these genius little guys from Smart Tiles, which make it possible for renters to tile, too. On the flip side (above, left), oversized rectangles of tile can do even quicker work of covering large walls—and with less grout the clean over time.\n\nHandmade\n\nPhotos by Retrouvious (via Remodelista), Pinterest\n\nUsing handmade tile, especially if it's textural, can give a room a certain rugged warmth. Even square handmade tiles laid in the most basic pattern across a large wall (above, left) feel nuanced without being distracting from the overall design. And if you really can't part with everyday white subway tiles, choosing some with a clay-like surface and uneven edges (above, right) is at least one step out of the box.\n\nIt's true: We've got subway tile all over the Food52 office, it's found in droves of gorgeous homes, and I'm sure the next apartment I rent will be ~blessed~ with a whole mess of it across the backsplash. Subway tile is hard to hate, being so tidy and classy and all, but isn't that reason enough to wonder if it's time, this or in your next home, to do better?\n\nTell us: What design trends will you never ever get sick of?",
      "Folder": "Feedly",
      "Timestamp": "1453866529",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.841043Z"
}