{
  "id": "b01c515a00074da98aed7cdb0498dfe2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/guides/emirates-skywards-miles/",
      "Title": "Guide to Emirates Skywards — now with drastically reduced fuel surcharges Million Mile Secrets",
      "Selection": "Emirates is the lap of luxury. If you’ve ever flown their aircraft, it’s otherwordly compared to many other airlines.\n\nOn a recent hop around Africa and the Middle East, I flew a cramped Lufthansa coach from Frankfurt to Johannesburg. My following flight was eight hours in Emirates coach, which literally felt like Premium Economy after the 10-hour CAT scan on Lufthansa.\n\nEmirates is very Dubai — glamorous, golden, and garish. Everything’s fancy and over the top. The airline has objectively one of the best premium cabins among all airlines. First class passengers get to use one of the opulent on-board showers. Emirates even offers an onboard lounge with a bar for first and business class passengers.\n\nI’ll tell you what you need to know about Emirates — how to earn miles, how to reserve award flights, the best deals to book, and what to avoid.\n\nHang out at the onboard bar when you book Emirates first or business class flights with miles. (Photo by Leonard Zhukovsky/Shutterstock)\n\nHow to create an Emirates Skywards account\n\nCreating a frequent flyer account with Emirates is fast — and more importantly, it’s free. Below is all the information you need to open an account. After that, you’ll be sent a unique member number, which will help you to accrue Emirates miles and keep track of your elite status progress and benefits every time you fly.\n\nHow to earn Emirates Skywards miles\n\nEmirates miles are one of the easiest points currencies to earn. That’s because they’re transfer partners of all five flexible points programs! You can acquire Emirates miles by transferring the following points:\n\nChase Ultimate Rewards points – 1:1\n\nEarn Chase points with cards like the Chase Sapphire Preferred® Card or Chase Sapphire Reserve®\n\nAmex Membership Rewards points – 1:1\n\nEarn Amex points with cards like The Platinum Card® from American Express and American Express® Gold Card\n\nCiti ThankYou points – 1:1\n\nEarn Citi ThankYou points with cards like the Citi Premier℠ Card\n\nCapital One miles – 2:1\n\nEarn Capital One miles with cards like the Capital One® Venture® Rewards Credit Card and Capital One® Spark® Miles for Business\n\nMarriott points – 3:1\n\nEarn Marriott points with cards like the Marriott Bonvoy Boundless Credit Card and Marriott Bonvoy Brilliant American Express® Card\n\nThe information for the Capital One Venture, Capital One Spark Miles, and Citi Premier has been collected independently by Million Mile Secrets. The card details on this page have not been reviewed or provided by the card issuer.\n\nThere are a number of other ways to earn Emirates miles, including special promos, flying Emirates, transferring other hotel points, and crediting partner airline miles to Emirates. But credit card welcome bonuses are BY FAR the fastest and most efficient way to earn the Emirates miles you need for the amazing flights we’ll cover in this post.\n\nBest uses of Emirates miles\n\nEmirates doesn’t publish an award chart (which is unfortunately rapidly becoming the norm across all airlines), so you’ll have to use this Emirates miles calculator to figure out how many miles you’ll need for your particular trip. Below are the the absolute best deals.\n\nNewark to Athens or Milan\n\nThis is by far the sweetest spot with Emirates miles. You can pay 135,000 miles to fly round-trip between Newark and Athens or Milan in first class. Unbelievable!\n\nA round-trip flight from Newark to Athens covers nearly 10,000 miles. That’s 18+ hours in one of the most luxurious first class seats ever crafted by mankind.\n\nYou’ll get an enclosed suite when flying Emirates first class. (Photo by Agent Wolf/Shutterstock)\n\nThis ticket generally costs ~$7,500 if paid for with cash. That means you’ll see a fantastic value of more than 5.5 cents per point with this strategy.\n\nThe same route is also available for 90,000 miles round-trip in business class and 45,000 miles round-trip in coach. Both are still jaw-dropping prices.\n\nEurope to Dubai\n\nFlying between Europe and Dubai actually costs the same amount of Emirates miles as flying between the U.S. and Europe:\n\n45,000 miles round-trip in coach\n\n90,000 miles round-trip in business class\n\n135,000 miles round-trip in first class\n\nHowever, many flights are significantly shorter. You’ll get more value the farther west you book. For example, a flight between Zagreb and Dubai is just 2,600 miles (or 5.5 hours) each way. That’s 3.5 fewer hours each way than flying from New York to the European countries listed above.\n\nI’d recommend booking a round-trip business class flight for 90,000 miles — very competitively priced with other airlines, but you get Emirates’ incredible business class product, which is still one of the best seats in the world.\n\nShort-haul first class flights for only 45,000 miles round-trip\n\nIf Emirates first class is on your bucket list but you don’t want to burn six figures of your points, there are a couple slightly obscure cities from which you can book first class tickets for 45,000 Emirates miles round-trip:\n\nKuwait to Dubai\n\nRiyadh to Dubai\n\nYes, you can book these first class flights by earning just a single credit card welcome bonus — they’re that cheap. However, neither of these flights are more than 550 miles each way — similar to flying between Detroit and New York City.\n\nIf you’re willing to spend 45,000 miles for a total of 3.5 hours in Emirates’ first class suite, go for it! This ticket sells for around $2,400 had you paid with cash, giving you a value of 5.3 cents each — which is excellent.\n\nFuel surcharges on Emirates award flights\n\nUntil May 2020, fuel surcharges on premium Emirates flights were prohibitively high. Depending on where you were going, you’d find yourself paying $800+ on top of the hundreds of thousands of miles you’d spend on an award flight.\n\nEmirates has chilled out, and you can now book award flights for fewer fees than you’ll find on many other airlines. For example, a one-way flight between Newark to Athens will cost you just $41 in taxes and fees.\n\nCoach prices were never terribly affected by fuel surcharges — but who collects Emirates miles just for coach flights??\n\nEmirates partner awards\n\nBooking partners with Emirates miles\n\nEmirates miles are useful not just for their own airline, but for partners, too. Only a couple strike me as worthwhile.\n\nJetBlue: You can book JetBlue flights starting at 7,500 Emirates miles each way\n\nYou can hop around dozens of cities in Brazil for as little as 4,500 Emirates miles on partner airline Gol.\n\nGo swimming in desert lagoons at Lençóis Maranhenses National Park in Brazil. (Photo by JackViaggiante/Shutterstock)\n\nBooking Emirates with partner miles\n\nEven if you don’t have Emirates miles, you can still book Emirates flights if you have airline miles issued by one of their partners. They are generally BAD DEALS, however. For example, you can book:\n\nU.S. to the Middle East for 150,000 Alaska Airlines miles one-way (ouch)\n\nU.S. to Perth for 135,000 Japan Airlines miles (extremely high fuel surcharges)\n\nU.S to Asia for 180,000 Alaska Airlines miles (ouch)\n\nU.S. to Europe in first class for 100,000 Japan Airlines miles  round-trip (extremely high fuel surcharges)\n\nAs you can see, caveats never cease when booking via partner sites.\n\nBottom line\n\nEmirates miles are very easy to collect if you’ve got any cards that earn in the five major flexible points programs:\n\nChase Ultimate Rewards points\n\nAmex Membership Rewards points\n\nCiti ThankYou points\n\nCapital One miles\n\nMarriott points\n\nThese points transfer to Emirates at varying rates — and surprisingly enough, none are abysmal!\n\nEmirates is most famous for its over-the-top first class cabin. And now that the airline has sharply reduced its fuel surcharges, there are a handful of sweet spots that are hard to ignore, such as Newark to Milan for just 135,000 miles round-trip in first class!\n\nLet us know your favorite way to use Emirates miles. And subscribe to our newsletter for more info like this delivered to your inbox.\n",
      "Folder": "Feedly",
      "Timestamp": "1591164580",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.296613Z"
}