{
  "id": "b078ccd273e24e3ba0680c6f2afe1437",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://awealthofcommonsense.com/2016/12/the-hierarchy-of-investment-difficulty/",
      "Title": "The Hierarchy of Investment Difficulty A Wealth of Common Sense",
      "Selection": "The Hierarchy of Investment Difficulty\n\nPosted December 25, 2016 by Ben Carlson\n\nBeing the “investment guy” in the family means I’m often approached during the holidays or at parties with questions about the markets. My most recent question was about a sector fund investment and its prospects going forward.\n\nI’m sure you could come up with any number of intelligent-sounding narratives to describe which sectors will perform best or worst in the future, but there’s no one that really knows the answer to this question.\n\nWhen asked about the potential for the sector in question I was reminded this chart I created a couple years ago, which I have updated through last Friday:\n\nLike any asset quilt, there’s no rhyme or reason from one year to the next. I’m sure you could torture the data here using a momentum or value-based strategy to improve upon the results of the S&P 500, but unless you’re using a rules-based approach, you’re really just guessing when attempting to figure out which sectors will perform best over any given time frame.\n\nThis exercise got me thinking about some of the most difficult aspects of investing. Investing is hard but there are certain aspects of it that are harder to perform than others. Here’s my hierarchy of investment difficulty starting with the most difficult:\n\nPicking the best-performing individual stocks\n\nPicking the best-performing sectors\n\nPicking the best-performing strategies/styles/risk factors\n\nPicking the best-performing geographies\n\nPicking the best-performing asset classes\n\nPicking the best performing stocks has to be the hardest thing to do when investing. There are thousands and thousands of stocks to choose from and the probability that you can consistently pick the best performers is extremely low.\n\nPlus, there’s the fact that you could be an unbelievable stock-picker but if you’re picking stocks in the wrong sector, market cap, style or geography it won’t matter how good your stock picks are. Asset allocation trumps all so even the best stock picks in the worst segment of the market might not help your bottom line.\n\nLuckily, investors can diversify to all but eliminate unsystematic risk, which is the risk that comes from the uncertainty involved when investing in a single company or industry. Systematic risk is a fancy name for diversifiable risk, meaning you can own a wide range of companies, sectors and industries to avoid the specific risks involved with investing in the stock market.\n\nThere are larger gains to be had from picking the best stocks or sectors, but you’re also putting yourself at a much greater risk of blowing up your portfolio. There are investors out there who can successfully pick the right sectors but it’s a very short list and your name (or mine) is likely not on it.\n\nPicking the best anything when investing is hard. If it was easy everyone would do it. This is also why investors often create the most trouble for themselves by constantly trying to pick the best stocks, sectors, strategies, countries or asset classes.\n\nIt may feel like trying to be right all the time is an intelligent way to invest, but this line of thinking opens you up to a seemingly endless number of different ways to be wrong in the markets.\n\nThe solution to this problem will mean different things for different investors but my broad outline goes like this:\n\nAvoid any and all unnecessary or avoidable risks.\n\nUnderstand your edge or lack thereof when investing.\n\nGo into the investing process with a heavy dose of self-awareness and humility.\n\nFigure out how to make fewer decisions within your portfolio.\n\nAvoiding big mistakes is more important than locating big wins with your investments.\n\nIt’s much easier to be wrong than it is to be right. Very few investors are willing to admit this fact to themselves. This is where you can find your way as an investor.\n\nFurther Reading:The S&P 500 Sector Quilt\n\n \n\n \n\n\n\t\t\t\t\t\t\t\t\t",
      "Folder": "Feedly",
      "Timestamp": "1482718428",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.677242Z"
}