{
  "id": "b0865f5a700a4c969a193050858cfc9e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.seriouseats.com/roundups/gochujang-recipes",
      "Title": "16 Recipes That Get a Spicy-Sweet Kick From Gochujang Serious Eats",
      "Selection": "[Photographs: Vicky Wasik, Shao Z.]\n\nIf you’re familiar with Korean cuisine, then you’ve probably come across gochujang, a spicy-sweet chili paste that’s as versatile as it is delicious. The pungent paste is made from red chili pepper flakes, fermented soy beans, glutinous rice, and salt. It’s traditionally fermented for many months, and sometimes years, in which the starches from the rice are converted to sugars, helping create gochujang’s iconic yet subtle sweetness.\n\nBecause it's not just cooked, but fermented, Gochujang does much more than add spice to your favorite dishes. We love its complex layers of flavor that make it spicy, sweet, salty, and funky all at once. It also has a thick consistency and deep red color that adds texture and brightness when used, especially in sauces and marinades. You’ll often find gochujang in Korean dishes like bibimbap and bulgogi, as well as a number of stews and sauces.\n\nA little goes a long way with this umami-boosting ingredient. In the recipes below, only about a tablespoon or two of gochujang is called for, but you can always add more to suit your tastes. From barbecue sauces and ketchups to stir-fried anchovy banchan and crispy skillet rice, these are our favorite ways to incorporate the sweet heat of gochujang.\n\n[Photograph: Vicky Wasik]\n\nGochujang is the backbone of this Korean barbecue sauce. The paste is mixed with the savory flavors of doenjang (fermented Korean soybean paste), along with garlic, scallions, and toasted sesame oil and seeds. The result is a condiment with layers of complex flavor. The best way to enjoy ssamjang is by spreading it on lettuce before piling on grilled meat, seafood, and vegetables.\n\nSsamjang (Korean Barbecue Dipping Sauce) Recipe »\n\nBack to the full list\n\n[Video: Serious Eats Team]\n\nWith pickle-brined fried chicken being as popular as it is, we decided to use the same technique with a different kind of pickle: kimchi. The kimchi brine gives the chicken flavor and helps it stay juicy, while also lending some texture to the dry dredging mixture. After frying the chicken until it's crispy and golden brown, it gets slathered with a gochujang-based sauce that incorporates more heat from gochugaru and more sweetness from honey. We can’t think of a better way to serve this than on Stella’s flaky black sesame buttermilk biscuits.\n\nKimchi-Brined Fried Chicken Sandwich Recipe »\n\nBack to the full list\n\n[Photograph: Emily and Matt Clifton]\n\nThese burgers get much of their flavor from what’s on the outside, not the inside. While grilling, they’re brushed with flavorful bulgogi sauce that includes soy sauce, brown sugar, and gochujang. They get another coating of the sauce after grilling, and then are loaded with spicy kimchi mayo and pickled daikon radish before being sandwiched between toasted sesame buns.\n\nGrilled Korean Bulgogi Burgers With Kimchi Mayo and Pickled Daikon Recipe »\n\nBack to the full list\n\n[Photograph: Shao Z.]\n\nGochujang works best in sauces and marinades that get slathered over meats, like these grilled pork belly kebabs. We mix it with soy sauce and sake to round out the flavor and add complexity. You’ll want to toss the pork with the marinade and let it sit for about an hour before skewering. While the kebabs cook on the grill, baste them with extra marinade every few minutes until the pork is tender on the inside and browned on the outside.\n\nGrilled Pork Belly Kebabs With Sweet-and-Spicy Gochujang Marinade Recipe »\n\nBack to the full list\n\n[Photograph: Daniel Gritzer]\n\nA sauce that combines the funky Korean flavors of kimchi and gochujang with the sweet tang of a barbecue sauce? Say no more. We use a blender to create a puree out of the kimchi and its juices, along with onion, garlic, and ginger. Then, we move to the stove and combine this mixture with ketchup, rice vinegar, gochujang, Worcestershire sauce, and molasses, cooking until the sauce has thickened and all the flavors have combined. The result is a flavorful sauce that pairs well with grilled chicken, pork, and shellfish like shrimp.\n\nKorean Kimchi Barbecue Sauce Recipe »\n\nBack to the full list\n\n[Photograph: Joshua Bousel]\n\nA simple whisking of a few ingredients gives you this sweet and spicy Korean ketchup in no time. The mixture gets a kick from the gochujang, while brown sugar helps balance out the flavor and add a bit more sweetness. In addition, the ketchup gets its depth of flavor from soy sauce, garlic, ginger, and sesame oil. Once you get a taste of this, you might never go back to plain ketchup again.\n\nSweet and Spicy Korean Ketchup Recipe »\n\nBack to the full list\n\n[Photograph: Yvonne Ruperti]\n\nThough kimchi is often served as a compliment to most dishes, sometimes that’s just not enough. We went ahead and made it the star of the show in this stir-fry. It's sautéed with julienne-like strips of chicken so that the meat cooks quickly and absorbs all of the flavors. A handful of cabbage is added in to offset the strong flavors of the kimchi. To finish it off, stir in some gochujang and fish sauce, then serve over rice.\n\nKimchi Chicken and Cabbage Stir-Fry Recipe »\n\nBack to the full list\n\n[Photograph: Vicky Wasik]\n\nThe crisp crunch of Korean fried chicken combined with this sweet and spicy sauce is a match made in fried chicken heaven. Here, gochujang is whisked together with soy sauce, vinegar, sugar, garlic, ginger, and sesame oil. Since the thickness of gochujang can be inconsistent, you may need to add up to two tablespoons of water until the sauce is thin enough to spread easily, yet thick enough to cling to the crispy outer layer of the chicken.\n\nSweet and Spicy Chili Sauce For Korean Fried Chicken Recipe »\n\nBack to the full list\n\n[Photograph: Vicky Wasik]\n\nForget Buffalo wings—fire chicken is the ultimate game-day treat. To make the Korean bar food, start off by marinating chicken thighs in a spicy gochujang-spiked sauce. In addition to the gochujang, this sauce gets an added layer of depth from gochugaru (Korean chili powder), red chili peppers, and black pepper, along with a surprise addition of Sprite. In order to keep the chicken from drying out, we grill the thighs whole before cutting them into bite-size pieces. Finally, the chicken is covered in mozzarella cheese and broiled until bubbling. Game day or not, this is one delicious treat that’ll be gone in no time.\n\nKorean-Style Fire Chicken (Buldak) With Cheese Recipe »\n\nBack to the full list\n\n[Photograph: Aki Kamozawa and H. Alexander Talbot]\n\nThis flavored butter is perfect for sautéeing fish or dunking clams, but we won’t tell if you take a bite of it all on its own. Sesame seeds are toasted in the butter first, and then get mixed with a nice splash of bourbon. The mixture is finished off with the teriyaki-flavored nori sheets and gochujang, both of which add an extra layer of sweetness. The ghee keeps in the fridge for about two weeks, but you’re likely to use it up much sooner than that.\n\nGochujang-Infused Ghee With Toasted Sesame Seeds and Bourbon Recipe »\n\nBack to the full list\n\n[Photograph: Vicky Wasik]\n\nThe ideal midday snack should be sweet, savory, crunchy, and irresistible all at once, just like this stir-fried anchovy banchan. Baby anchovies are coated in a glaze made up of gochugaru, soy sauce, fish sauce, and gochujang. The recipe comes together in minutes, and keeps well in the fridge. So next time you’re craving a certain je ne sais quoi, you can count on myeolchi bokkeum to satisfy your every last craving.\n\nStir-Fried Anchovy Banchan (Myeolchi Bokkeum) Recipe »\n\nBack to the full list\n\n[Photograph: J. Kenji Lopez-Alt]\n\nGochujang can do more than serve as a base for sauces and marinades. Here, it finds its way into instant noodles by adding flavor to both the short ribs and the broth. If more spiciness is desired, you can always add more gochujang, especially after dividing the soup into individual bowls. We suggest topping your bowl off with mushrooms, scallions, kimchi, and a soft-boiled egg.\n\nHomemade Shin Cup-Style Spicy Korean Ramyun Beef Noodle Soup Recipe »\n\nBack to the full list\n\n[Photograph: Vicky Wasik]\n\nFried rice isn’t the only answer to your leftover rice problem. Loaded with an array of flavors and textures, there’s no question that this cheese- and kimchi-topped skillet rice should be added to your rotation. The rice gets mixed thoroughly with gochujang, soy sauce, and rice vinegar before moving to the skillet. Both mozzarella and Gruyère find their way into the dish in between layers of the rice, which is then cooked and broiled in the oven. Adding kimchi and cotija within the last two minutes of broiling helps the skillet rice char nicely. Before serving, you can finish the dish off with a generous amount of sliced scallions for an added crunch.\n\nCrispy Cheese- and Kimchi-Topped Skillet Rice Recipe »\n\nBack to the full list\n\n[Photograph: Morgan Eisenberg]\n\nThis Korean spin on quesadillas brings together flaky Chinese-style scallion pancakes with bulgogi-style steak and two types of cheese. Gochujang makes its way into the marinade, along with ingredients like soy sauce and brown sugar. After preparing both the meat and the scallion pancakes, the rest is all about assembly. Top two scallion pancakes with bulgogi meat, as well as shredded cheddar and Monterey Jack cheeses, then close it off with the remaining pancakes. Once the cheese is melted and the pancakes are browned, you can drizzle the quesadillas with additional gochujang and top with scallions and cilantro.\n\nBulgogi Scallion Pancake-adillas Recipe »\n\nBack to the full list\n\n[Photograph: Daniel Gritzer]\n\nThis easy stir-fry is perfect for a weeknight dinner. Strips of pork shoulder are marinated in a mixture that gets its subtle sweetness from gochujang and Asian pear, an ingredient that also helps tenderize the meat. After sitting in the marinade for at least two hours (but up to eight for maximum flavor), all that’s left to do is cook the meat with onions, green chili pepper, scallions, and kimchi. Serve with lettuce leaves and rice for a secretly easy, but supremely flavorful dinner.\n\nKorean Spicy Marinated Pork With Chilies and Kimchi (Jaeyook Kimchi Bokum) Recipe »\n\nBack to the full list\n\n[Photograph: Morgan Eisenberg]\n\nOne of the best things about nachos is that its flavors are so easy to change up. Our Korean take on the dish includes bulgogi-style steak, caramelized kimchi, and lime sour cream. Gochujang makes its way into our homemade cheese sauce, which gets drizzled on top of fried wonton chips and the other toppings. The result is a beautifully messy and flavorful plate of nachos unlike any you’ve had before.\n\nKorean Nachos Recipe »\n\nBack to the full list\n\nAll products linked here have been independently selected by our editors. We may earn a commission on purchases, as described in our affiliate policy.\n",
      "Folder": "Feedly",
      "Timestamp": "1592623903",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.292896Z"
}