{
  "id": "b0f2c002a25b4a178a58f739a9aa7038",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1174538/donald-trumps-morning-routine-includes-executive-time/",
      "Title": "How Donald Trump spends his three hours of “executive time” every morning Quartz",
      "Selection": "The morning routines of the most powerful and accomplished people are commonly scrutinized and emulated in the hope of replicating their productivity. For those who struggle to get started in the morning, studying their schedules tends to generate shame.\n\nSo it is particularly refreshing to learn that the world’s most powerful person, Donald Trump, doesn’t get to work till 11 am. Before his official schedule begins, according to Axios writer Jonathan Swan, the president takes at least three hours every morning for “executive time” in the Oval Office.\n\nSwan describes this as “time in his residence, watching TV, making phone calls and tweeting.” Indeed, the president is a known early riser and morning tweeter. He also rejects working out, doesn’t read much, and has few hobbies beyond golf, so catching up on cable news and social media chatter during that time seems entirely plausible.\n\nUnless he is traveling, the president’s schedule includes a solid chunk of “executive time” between 8 am and 11 am, and then more of it through the day. This doesn’t necessarily mean he’s not working, but in Swan’s words, he spends the hours “generally taking the same loose, improvisational approach to being president that he took to running the Trump Organization for so many years.”\n\nPress secretary Sarah Sanders notes that “the time in the morning is a mix of residence time and Oval Office time but he always has calls with staff, Hill members, cabinet members and foreign leaders during this time.”\n\nMost Popular\n\n\t\tRead full story\n",
      "Folder": "Feedly",
      "Timestamp": "1515462060",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.556174Z"
}