{
  "id": "b2051584dc4b4aa29abc88796233b89e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://sports.vice.com/en_us/article/7xxgq9/zach-lavine-can-either-be-the-next-james-harden-or-just-some-other-guy",
      "Title": "Zach LaVine Can Either Be the Next James Harden, Or Just Some other Guy VICE Sports",
      "Selection": "Intriguing lottery picks who are as young, explosive, and offensively compelling as Zach LaVine rarely switch teams before their second contract. But after he tore his ACL in February, the 22-year-old was traded a few months ago from the Minnesota Timberwolves to the Chicago Bulls. He now finds himself as the closest thing one of the NBA's marquee organizations has to a marketable star.\n\nHere's what we know: The trade that advanced LaVine from a gunslinging third option on one of the league's most exciting teams to the primary threat inside a dumpster fire will inevitably proliferate his responsibilities. What we don't yet know is whether it'll work out. Can he improve and evolve while taking on a larger role, and even eventually help make the Bulls a respectable outfit once again? Or are his current flaws too glaring to ever overcome?\n\nLaVine's former team was seemingly on track to become the blue-chip-studded stepchild of the Kevin Durant and Russell Westbrook-led Oklahoma City Thunder—with Karl-Anthony Towns and Andrew Wiggins projected to grow into what those two All-NBA studs became. As the interdependent variable whose production could either push that duo forward or hold it back, LaVine was the question mark. Now that he's gone, how does his outlook compare to two other third-wheel guards who charted their own path outside Durant and Westbrook's shadow: James Harden (for better) and Reggie Jackson (for worse).\n\nLast season, the sport's most electrifying cloud hopper assumed a part that was molded to his ability. Instead of setting the table, as he was asked to do when he entered the league, LaVine ate everything that was placed in front of him. According to Basketball-Reference, his minutes spent as a point guard completely evaporated—from 94 percent as a rookie, to zero—while his assist and turnover rates cut in half. Even though his overall field goal attempts didn't spike, LaVine migrated behind the three-point line and saw his minutes climb up to 37.2 per game as he became a full-time starter in the first year of Tom Thibodeau's regime.\n\nHe was and still is the rustiest link in any defensive scheme, but LaVine couldn't be ignored whenever Minnesota had the ball. He flew off screens, pulled up off hand offs, and dazzled in spurts with individual shot creation that wasn't forced.\n\nLife won't be so simple in Chicago. The aforementioned ACL injury—which occurred when LaVine came off a stagger screen, caught a pass skidding towards the rim, then landed awkwardly after a mid-air collision with Andre Drummond—will obviously steepen the incline of LaVine's development, and after he returns there will be no capitalizing off Ricky Rubio's brilliant vision, let alone the widening vacuum of attention that Towns and Wiggins demand.\n\nLaVine struggled, relatively, when any of those three didn't share the court with him last season. He was thrust into a familiar yet uncomfortable spot and struggled to balance his needs with decisions that would untangle complications for his teammates. For LaVine to enter another realm and justify any worthwhile comparisons to the most diversified players at his position, he must expand his repertoire enough to impact games when he, himself, isn't putting the ball through the net.\n\nThis is why any comparison, beyond their early-career situation, to Harden is unfair. The annual MVP candidate's True Shooting percentage was an ungodly 66.0 as Oklahoma City's Sixth Man in his third season (LaVine's was 57.6). A gifted passer who proved he could hold his own on a meaningful stage, Harden kept his True Shooting percentage above 60.0 in 20 playoff games while averaging 18 points, six rebounds, and five assists per 36 minutes.\n\nHarden lived at the free-throw line and created open shots for others. He possesses a natural crafty strength few before him have been able to harness. Signs of stardom were clear. LaVine is not that special. He's slippery, and single-handedly marks an asterisk beside the rules of gravity, but was one of eight players in the last 10 years to average at least 18 points with a free-throw rate below .200 last season.\n\nLaVine only averaged 4.3 drives per game last year—the same amount as Philadelphia 76ers backup point guard Sergio Rodriguez, who averaged 15 fewer minutes. Yikes. What the former 13th overall pick can do, though, is really shoot—a vital characteristic that should never be overlooked. According to Synergy Sports, he finished in the 87th percentile in spot-up situations last season. Of catch-and-shoot threes and threes launched when wide open, he knocked down 43.2 percent, an elite number that matches up nicely with Steph Curry and Klay Thompson.\n\nIf he can bump his accuracy off the dribble up and force defenders to take away those tough looks, there's a decent chance LaVine can evolve into the most valuable type of weapon NBA basketball currently knows. A modest leap of faith is required when counting on anyone not named Curry to get there at a high volume, but LaVine has the quick release and springy legs to do it. Levitating above perimeter defenders isn't an issue for him, and it's realistic to believe he can someday drill pull-up threes at a 40 percent clip.\n\nDoing so would widen driving lanes and allow him to become more of a threat at the rim, where he's actually not a bad finisher. LaVine is already terrific in the open floor, but he'll be diabolical if he can force help defenders to pinch in off the arc in half-court situations.\n\nThere are no guarantees LaVine will reach that level, though, and—assuming Dwyane Wade spends a majority of this season on a different team—his usage rate will soar in lineups that rely upon him to do most of the heavy lifting. It's more likely than not LaVine struggles badly in his first year as a go-to choice. Lauri Markkanen and (the still unsigned) Nikola Mirotic will create space as best they can, while Cristiano Felicio and Robin Lopez will roam as rim-rolling cinder blocks. But none of that's very inspiring.\n\nElsewhere, it's (even more) bleak. Kris Dunn and Denzel Valentine don't warrant significant minutes in an NBA game, and Paul Zipser might be the Bulls' third option whenever he's on the court.\n\nLaVine is currently eligible for a contract extension, but Chicago would be wise to sit negotiations out until he proves he's A) healthy and B) expanding his strengths. It would've been interesting to see LaVine's career play out underneath Towns and Wiggins, perhaps evolving into a necessary, and highly entertaining, spark off the bench.\n\nNow he's forced to provide more substance with a skill-set that's yet to indicate it can. LaVine has room to breathe and space to grow, but that probably isn't his calling.",
      "Folder": "Feedly",
      "Timestamp": "1504902476",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.555215Z"
}