{
  "id": "b2092339d0ce4c6f9002750510d31cef",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/policy-and-politics/2016/12/29/14105458/john-kerry-israel-speech-matthew-duss",
      "Title": "Kerry has finally decided to take no for an answer why he gave his big Israel speech Vox - All",
      "Selection": "The last week of 2016 has been unexpectedly momentous for US-Israeli — and US-Palestinian — relations. First, the Obama administration decided to abstain on a United Nations Security Council vote on a resolution condemning Israeli settlements in Palestinian territory. The international community has long considered the building of Israeli settlements on Palestinian land both illegal under international law and an impediment to the eventual creation of a Palestinian state. The US’s refusal to veto allowed the resolution to pass, rebuking right-wing Prime Minister Benjamin Netanyahu’s pro-settlement policies and infuriating him and his office.\n\nThen on Wednesday, outgoing Secretary of State John Kerry delivered a lengthy speech further castigating the Netanyahu government and warning that its policies threaten the future viability of a two-state solution.\n\nI spoke that afternoon with Matthew Duss, the president of the Foundation for Middle East Peace and a leading observer on issues relating to the Israel-Palestine conflict and US policy toward both actors. We talked about the strategic thinking behind the administration’s renewed push against Israeli settlements, what it means for the incoming Trump administration and for Israeli domestic politics, and more. The transcript has been lightly edited for length and clarity.\n\nDylan Matthews\n\nWhy is this happening now, with Obama headed out the door and a new administration that appears significantly more sympathetic to Netanyahu coming in? Why does the Obama administration think this is a good time to make this move?\n\nMatthew Duss\n\nI think there are couple reasons. One is a sincere sense of urgency about the possibility of a two-state solution being lost. In December 2015, at the Saban Forum, Kerry premiered a really detailed set of critiques of Israeli policies in the West Bank — home demolitions, expropriation of land, refusal of construction permits for Palestinians — a whole menu of things the Israelis were doing that showed they were actually consolidating and entrenching the occupation, rather than preparing to end it.\n\nKerry noted this raised serious questions about Israel’s commitment to a two-state solution. Over the following year, he and a whole number of other administration officials — UN Ambassador Samantha Power, Ambassador to Israel Daniel Shapiro — have made very similar critiques, making all of the same points, saying that the Israelis are doing things in the West Bank that are completely contradictory to what they say their goal is. There is no way to reconcile the goal of a two-state solution with these policies.\n\nIt was always framed as a question: “Explain to us how this is consistent with your stated goal.” I think it was clear they didn’t want to just come out and say, “You are no longer committed to a two-state solution.”\n\nBut I think what we saw today is that Kerry, after a year of raising these questions, has finally decided to take no for an answer, at least from this Israeli government, noting that this Israeli government is a very right-wing government; it’s a government that is completely committed to the settlement project. Prime Minister Netanyahu has bragged that his government is more committed to the settlements than any Israeli government in history.\n\nThat partly explains why the US felt it had to take these steps now. The other part of it is that you have this incoming administration that’s signaled in various ways — up to and including the choice of ambassador to Israel, David Friedman, who’s a very right-wing, pro-settlement, anti-two-state person, who has called the two-state solution an “illusion” — that they’re not going to be committed to this goal, and will just allow the Israelis to keep doing what they’re doing, undermining the possibility of a two-state solution. Kerry and the administration saw some real value in reaffirming the international consensus around what a final resolution of this conflict would look like, or should look like.\n\nMoshe Milner/GPO via Getty Images\nObama’s 2013 speech in Jerusalem.\nDylan Matthews\n\nWho was the main audience for this speech? Was it a last-minute pitch to Netanyahu? Other Israeli policymakers? Palestinian leadership?\n\nMatthew Duss\n\nAs in most cases, there were multiple audiences. First and foremost, there’s the American people. This is the secretary of state explaining to the American people why their government is devoting energy and attention to this issue in this way. I think they did a good job of that, reiterating that this is a consistent policy going back several administrations. Opposition to settlements has been the position of every single US government since the occupation began. The two-state solution has been a consensus solution in American politics for many years.\n\nThere’s the Israeli audience. President Obama has reached out to the Israeli people a number of times, including when he traveled to Israel and gave that famous speech where he envisioned a better future for Israelis and Palestinians, saying, “It’s up to you to work together and create this better future.”\n\nWhat we saw from Kerry today was slightly different, saying, “Your government is doing this. We, the United States, will continue to support you, and we remain committed to your security and your legitimacy. These things are not in question. But we do not and cannot and will not support the continued building of the settlements and undermining of the two-state solution.” \n\nThat distinction is one of the most important things to come out of the events of the past week, including the UN Security Council resolution, this making of a distinction between support for Israel’s security and legitimacy on the one hand, and opposition to Israel’s settlements and occupation on the other, and a refusal to conflate those two things.\n\nDylan Matthews\n\nOne of the more striking things about Kerry’s speech was his choice of language — referring to the expulsion of Palestinians following the 1948 war as the “Nakba,” the Arabic term for “catastrophe” or “disaster” that Palestinians use to describe the event — and characterizing the status of Palestinians under occupation as “separate but unequal.” How significant was that?\n\nMatthew Duss\n\nI think the reference to “separate but unequal” was very significant. This is something that resonates with American history. It was a clear reference to American segregation. When we’re talking about the various audiences, that is something Americans understand, and hearing a high American official describe the reality of the occupation that way I think is new, and entirely accurate.\n\nI don’t know that I’ve ever heard a high US official talk about the Nakba like that. Obama’s [2009] Cairo speech was important because he spoke about the Palestinian narrative and Israeli narrative together, as two peoples with claims to this land, but I don’t think we saw anything close to as explicit and forthright a recognition of the Palestinian narrative and the reality of Palestinian suffering that we saw from Secretary Kerry.\n\nAbir Sultan- Pool/Getty Images\nPalestinian President Mahmoud Abbas (center) attends Shimon Peres’s funeral.\nDylan Matthews\n\nOne critique of both the UN non-veto and the Kerry speech that I’ve seen from people sympathetic to the two-state solution and normally critical of Netanyahu is that while it is undoubtedly true that the settlement enterprise is unjust and the Netanyahu government is not at all committed to peace, it doesn’t accomplish a whole lot for the US to make that point in this way, and that it could backfire and strengthen Netanyahu and other hard-liners in Israel. What do you make of that argument?\n\nMatthew Duss\n\nI think it’s totally fair to ask what actual effect this has on the ground. The answer is probably very little. The Israelis were building settlements before, and they’ll most likely go ahead and continue building settlements now. What’s significant here — in both [Kerry’s speech] but also the resolution last week — is that we’ve seen an effort, a very aggressive effort over the past few years by Netanyahu, of normalizing the settlements, of just saying, “It’s not a big deal, we’re going to keep doing this, and eventually the world will give up, they’ll just accept it.”\n\nWhat we saw last week and we saw again [in Kerry’s speech] was that’s just not true. This is part of what has created such an outraged reaction from Netanyahu, in addition to the fact that he may be in some severe legal trouble very soon and wants to distract from it. Netanyahu had led this effort to normalize the settlements. If you listen to [Netanyahu and his allies], they seem to believe they had successfully chipped away at the international consensus that settlements are illegal. Last Friday was a wake-up call, and they’re not happy about it.\n\nThere is value in reaffirming that international consensus, and the message that that sends not only to Israelis but also to Palestinians. This is an important achievement for Palestinian diplomacy and Palestinian nonviolence. One of the things undermining the Palestinian Authority, the Palestine Liberation Organization [PLO], [President] Mahmoud Abbas, and the rest of the Palestinian leadership that has embraced nonviolence, is that they have very little to show for years of these efforts. To be able to go back to the Palestinian people and say, “Listen, we have a UN Security Council resolution that says what we have been saying and endorsed our position,” I think that’s very significant.\n\nDylan Matthews\n\nOn that point — I was struck that Mustafa Barghouti, one of the Palestinian politicians most firmly committed to nonviolence and the peace process, responded to the speech by praising the overall message but arguing that Kerry’s comments on the right of return (implying that Palestinians dislocated in 1948 wouldn’t be allowed to return to their ancestral homes in Israel), Jerusalem, and the status of Israel as a Jewish state were “unacceptable.” Obviously the reception from Netanyahu was going to be chilly, but does it worry you that moderate Palestinian leaders were critical?\n\nMatthew Duss\n\nI think the fact that both sides don’t like parts of it is a good sign. Both sides are going to have to make some tough concessions and tough choices. Neither side is going to get all of what they want.\n\nThis is often forgotten, and it should not be, but when the PLO recognized Israel in 1993 in an exchange of letters between [Israeli Prime Minister] Yitzhak Rabin and [PLO Chair] Yasser Arafat, and relinquished its claim on 78 percent of Palestine and accepted the idea of a Palestinian state on the remaining 22 percent, that was the biggest concession that either side has made, or will make, in this conflict. That’s kind of lost to history at this point, but it’s very important to remember that. That was an enormous concession that was made at the outset of the Oslo process.\n\nIn return for that concession, Israel didn’t recognize a Palestinian state; it only recognized the PLO’s right to negotiate on behalf of Palestinians. There was clear disparity there.\n\nWhat we saw today was Kerry was offering an American position that basically said the Palestinians will need to relinquish the full right of return. He didn’t offer specifics, he said it does need to be negotiated, but he did put the American government behind the idea that the vast majority of Palestinian refugees would have to return to the state of Palestine rather than the state of Israel. That is another enormous concession for the Palestinians. That would be the second biggest concession that either side has, or will have, to make in this conflict.\n\nSo yeah, that’s a tough one for the Palestinians to take. In my own conversations with Palestinian leaders, none of them downplays the importance of the right of return. That is a very central component of Palestinian identity and the Palestinian narrative, and it happens to be an internationally recognized right.\n\nBut I do think a big part of this is acknowledgment of the expulsion, acknowledgment of the Nakba, that this thing happened, that Palestinians were driven out of their homes; they did not simply decide to run away one day for no reason. This was a policy that was undertaken. I don’t claim to speak for Palestinians in any sense, but just from my own conversations, it’s clear that recognition of the creation of the refugee problem and the processes that went into that are nearly as important as the idea that these rights would be implemented.\n\nBrendan Smialowski/Getty Images\nTrump’s secretary of state nominee and Kerry’s likely successor, Rex Tillerson.\nDylan Matthews\n\nHow easy will the initiative, both in the UN and in Kerry’s speech, be to undo? You do have a wholly new administration coming in with very different views on Israel. How quickly can they do a 180?\n\nMatthew Duss\n\nIn the case of the UN Security Council resolution, unless Trump is going to produce a new resolution rescinding it and gets all of the members of the Security Council to vote for it, that is binding. That’s something he can’t change.\n\nTrump is going to create his own policy toward Israel, toward Palestine. One of the reasons for giving this speech now is to lay out this vision but also put it in the context of a rather overwhelming international consensus, and say, “This is the international consensus vision for how this conflict gets resolved,” to plant a flag here and make it clear that if and when Trump departs from this consensus, it is a departure. The speech today illustrated how the Israeli policy deviated from that consensus, and how that has exacerbated this challenge. I think the speech made it clear that efforts to move beyond that or outside that consensus are problematic.\n\nDylan Matthews\n\nWhat do you think the effect will be on centrist and left parties in Israel, ones that could conceivably lead a pro-peace government capable of a last-ditch push for a final deal in the future, after Netanyahu’s gone?\n\nMatthew Duss\n\nYou saw a tweet from Isaac Herzog, the leader of opposition, the leader of the Labor Party, praising Secretary Kerry as a friend of Israel. It was clearly meant as a rebuttal to Netanyahu and his gang’s attacks on the US and Kerry specifically over the past few days, which have been very ugly. \n\nAs for how they exploit this, I think we’ve seen in the past few days since the UN Security Council vote, they’ve gone after Netanyahu. He’s promoted himself as a master diplomat, saying, “Look at all the friends we’re making, we’re working on other stuff, the Palestinians aren’t a problem anymore, no one cares” — and you have this 14-0 UN Security Council vote last week that says, “No, that’s completely wrong.”\n\nSo they’ve been saying, “Netanyahu as the master diplomatic tactician, that was all incorrect.” But we haven’t seen a great deal of skill from the Israeli opposition over the past few years in terms of capitalizing on situations like this, so I’m not really optimistic.",
      "Folder": "Feedly",
      "Timestamp": "1483037985",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.731788Z"
}