{
  "id": "b32aef9de80949acb255deab066d5589",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/882525/the-balanced-scorecard-taught-at-harvard-business-school-can-help-you-improve-your-life-and-relationships/",
      "Title": "A famous scorecard taught at Harvard Business School can help you improve your life and relationships Quartz",
      "Selection": "I’ve always known that I’m addicted to achievement. But it’s only in the past few years that I’ve realized that can be a bad thing.\n\nEvery year, when New Year’s Eve rolled around, I used to set resolutions like “run 13 half-marathons in 2013” (because #medals). That particular year, I hit the goal. I even upped the ante and made the 13th race a full marathon, because my last race got canceled and I didn’t want to miss out.\n\nBut was I was healthier in 2013 than I was in 2012? Probably not. I didn’t necessarily train properly or eat better; I didn’t even particularly enjoy all the long-distance running. In truth, I had set the “13 in 2013” goal because my startup had just failed. I needed an over-the-top achievement to help me feel like a superhero again.\n\nThis mindset also got me to the top of Kilimanjaro in 2010 (to get over a soul-crushing breakup) and to Everest Base Camp in 2014 (to prove I was awesome, even if dating in New York City made me feel not so awesome most of the time).\n\nBut as I spent New Year’s Eve of 2014 shivering in my sleeping bag in a Nepalese tea house, deep in the Himalayas, it occurred to me that I wasn’t spending my time and energy on things that truly made me happy. I was setting goals for the sole purpose of achieving them—which was more about vanity than growth.\n\nAnd so when I landed back in Brooklyn, I dug up a management tool I had learned about in business school called the Balanced Scorecard. I decided to adapt it for my personal use.\n\nThe Balanced Scorecard\n\nThe original Balanced Scorecard was created in the early 1990s by Robert Kaplan, now a professor emeritus at Harvard Business School, and management consultant David Norton. The scorecard is basically a framework for evaluating and reporting on a company’s performance. What was so revolutionary about this tool was its focus on figuring out strategic priorities first—for example, “become an internationally recognized brand”—and deciding on the quantifiable activities necessary to achieve those goals second. Rather than simply relying on performance measures that are easy to track, such as financial targets, the scorecard forces you to look at the big picture first.\n\nThe same principles can be applied to evaluating our personal lives. Think about common resolutions like “lose weight” or “save money.” That’s the what—the outcome. But it doesn’t get to why you care about weighing less or having more money in a savings account.\n\nIf the reason you want to lose weight is to be healthier, you may actually find that it makes more sense to measure your progress via cholesterol levels, flexibility, and body mass index. Similarly, if you want to save more money in order to feel secure about your financial future, it may be a better idea to pay off higher interest debts, like credit cards or private student loans, rather than squirreling money away in low-yield savings accounts. In general, once you start with the “why,” it’s easier to determine the “how”—which actionable and measurable tactics you can set to achieve the “what.”\n\nPutting my scorecard to use\n\nTo create my own balanced scorecard, I identified four categories that I care about: personal finance, physical health, my career, and my emotional happiness. Within each category, I jotted down three to five strategic priorities. I picked things that I could act on, rather than things that require some measure of luck (“sell a book”) or that require other people to take action (“get my brother to pay back that loan from 10 years ago”).\n\nThen I decided upon concrete metrics that I could use to measure my progress. For example, I wouldn’t just write “work out more,” I’d write “do two strength workouts and two 30-minute cardiovascular workouts per week.” You can check out my 2016 scorecard here.\n\nFirst, I determined my financial priorities were to pay off all my debt, to plan for the future, to be responsible with my money, and to be generous. Then, for each of those priorities, I picked one or two quantifiable targets—like paying off student loans by a certain date based on a specific monthly payment, or achieving and maintaining a certain credit score. As I incorporated these changes into my monthly budget, I knew my fiscal choices would help me become the kind of person who is giving and prepared for the future.\n\nStarting with financial goals was easy, since they have clear numbers attached to them. But determining what I really meant by “physical health” was more difficult. Did I really need to lose weight? Or did I need to eat less sugar, be more active, and incur fewer injuries?\n\nInstead of using my weight as a proxy for my health, I dug up records from my last physical and researched what good health targets would be for my cholesterol, blood pressure, hemoglobin, and more. To achieve those targets, I decided that I would not only run in races, but also set a total mileage goal to encourage regular running. That way, I’d get used to sweating even when it didn’t come with a medal and a finish-line selfie.\n\nFor professional health, I knew which goals to include for my job. But I define my “work” more broadly than just my full-time job, so I also included goals for the podcast I co-host, my freelance writing, and my public speaking schedule. Putting them all in one place helped me prioritize what to focus on this year versus what could wait.\n\nLastly, I had to determine what I meant by personal (or emotional) health. This part of my life has always taken a backseat to things that can more easily be put on the calendar or checked off a to-do list. I wanted to make space for a life partner, to show up for my friends, to be there as my nephews grew from toddlers into curious little boys, and to keep music in my life.\n\nWhile I couldn’t control many of these outcomes, I could measure how much effort and time I put into them. So I pledged to make at least three trips home to see my family in a year, and to protect time in my calendar for my close friends and boyfriend at least four nights a week. I also vowed to learn the entire Hamilton soundtrack by heart.\n\nI’ve used my Personal Balanced Scorecard for two years now, and I feel more connected to my growth and happiness than before. I check in on my progress at least a few times a year. At the end of every year, I evaluate whether or not I achieved each goal—it’s a binary yes/no grade. Then I add up my total wins divided by the total goals I set for myself.\n\nI’m the first to admit that I don’t have a perfect score. In 2016, I averaged a B- overall. And I realized that some goals last year, such as “make personal creative projects a priority,” weren’t measurable. Others, like “practice cello four times a week,” weren’t realistic given the other constraints on my time.\n\nBut I have found that the process of setting strategic priorities, and whittling down all the things I could do into the short list of things that truly matter, helps me use my time and energy for the relationships, habits, and projects that I care about the most. And that’s more important to me than any medal.\n\nChristina Wallace is an entrepreneur and writer living in Brooklyn. She is also the co-host of The Limit Does Not Exist, a podcast on the Forbes network focused on the intersection of STEM and the arts. Follow her on Twitter at @cmwalla.\n\nLearn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1484165953",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.665574Z"
}