{
  "id": "b3499c71fbde42d49ae3482cf3631e94",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/850373/wi-fi-not-nightstand-bibles-is-the-new-religion-at-hotel-rooms-across-the-us/",
      "Title": "Hotels are ditching nightstand bibles. The new religion is Wi-Fi Quartz",
      "Selection": "Hotels guests are seeking a connection with something they cannot see. But no longer of the spiritual kind.\n\nReligious materials, particularly bibles, have been a nightstand staple at American hotels for decades. Yet innkeepers are now ditching holy books for more modern amenities.\n\nA survey conducted by the American Hotel and Lodging Association and hotel research firm STR found that just 46% of American hotel rooms included religious material in rooms, less than half of what it was a decade ago.\n\nBut hotels, faced with increased competition due to a building boom and competition from Airbnb, are trying to appease the modern traveler—a fickle customer and a noted workaholic. For many travelers these days, rooms with no Wi-Fi access would be unthinkable. Nearly all—98%–of the 8,000 respondents in the survey said their properties had in-room wireless internet, up from 82% a decade ago.\n\nOne hotel bucking the trend is president-elect Donald Trump’s new one in Washington, DC, right across from the White House, which includes bibles and a printed note that tells guests “if you want to continue your spiritual journey,” hotel staff will provide the Gita, Talmud, or Quran.\n\nThe least likely hotels to have religious materials in their rooms are those in airports—just where guests are most likely to be in need of prayer.\n\nImage by Riccardo Guerrini on Flickr, licensed under CC BY-NC-SA 2.0\n",
      "Folder": "Feedly",
      "Timestamp": "1480620617",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.688335Z"
}