{
  "id": "b3ee2bb8b63a47349e9ba54d7f23ee9d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1076348/a-shoplifting-solution-billed-as-enlightened-was-ruled-to-be-textbook-extortion/",
      "Title": "A shoplifting solution billed as enlightened was ruled to be “textbook extortion” Quartz",
      "Selection": "Big retailers, like Walmart, have a massive shoplifting problem. The company loses about $3 billion, or about 1% of its annual sales, every year to theft. Police across the country are overwhelmed by the volume of daily phone calls from local Walmart stores.\n\nIn 2016, the retailer came up with a solution. It hired two companies that would target the problem using education programs billed as “restorative justice,” a philosophy that addresses the community harm in a given crime, and avoids being unnecessarily punitive.\n\nThe practices of one of these providers, the Corrective Education Company (CEC), have raised questions in recent years. In August, a California state court ruled in a lawsuit that its operations are “textbook extortion.” The case also suggests that CEC’s operations have little to do with the concept and intentions of restorative justice, an expert says.\n\nHow the program works\n\nCEC and Walmart, which is not named in the lawsuit, have not responded to repeated Quartz requests for interviews. As recounted in court documents, media reports, and online accounts from self-professed shoplifters—here’s what the process typically looks like:\n\nA shoplifter is caught or accused of stealing from a store. If they are a first-time offender, not part of an organized-crime group, and not intoxicated, security officers will show them a video explaining that they can pay several hundred dollars (up to $500) to participate in a 6-8 hour online course.\n\nCEC’s founder, in an promotional video on the company’s website, says the program is meant to help people understand their behavior and its consequences, and includes an element that teaches “life skills,” such as how to build a resume or a nutrition plan. They can take the course at a later time, and the company says they have 48 hours to make up their minds.\n\nThe alternative is a phone call to local police—according to the company, about 90% of the accused shoplifters who watched the video in California chose the CEC route. The lawsuit alleges the company gets the bulk of the fee, and it also pays a chunk to the retailer and security contractors.\n\n CEC calls the program a win for all.  CEC, founded by two Harvard Business School graduates in 2010, calls the program a win for all. The store does not have to constantly interact with law-enforcement agencies. Police do not have to respond to hundreds of petty-theft cases. The accused offender avoids getting sucked into the criminal-justice system, and the community doesn’t have to pay the costs associated with the process. CEC, which has worked with other retailers such as Bloomingdale’s and Whole Foods Market across the country, says their recidivism rate is less than 2 percent—although the methodology they use to come up with this statistic is unclear. CEC also claims calls made to police have fallen as much as 40% in some locations.\n\nThe problem with private solutions\n\nThe suit in California, filed in 2015 by the San Francisco city attorney, Dennis Herrera, called the CEC process “extortion.” Detaining an accused shoplifter in order to show them the video should be considered false imprisonment, the suit alleged, something that big retailers have been accused of for years. A judge agreed in an Aug. 14 ruling, calling it a “textbook extortion,” and holding that the program indeed constituted illegal false imprisonment under California law—noting however, that he did not need to decide whether CEC’s program is beneficial or not to the public.\n\nThe ruling means that CEC will be prohibited from continuing its current practices; the judge has asked Herrera’s team and CEC to reach an agreement as to the exact scope of the prohibitions, which will eventually be entered as a court order. (CEC will have an opportunity to appeal the ruling.)\n\nThe Utah-based company said in a statement it was “shocked and dismayed” by the decision: “We believe this ruling goes against the values of Californians. We are disheartened for our partners and even more importantly for those Californians who face a lifelong scarlet letter because of one bad choice.”\n\nTo be sure, reducing the number of people who get arrested, jailed, and left with a conviction on their record—which often prevents them from getting jobs—is an important goal in a country that locks up more people than nearly any other place on Earth. And it should come as no surprise that most of the accused prefer to avoid interacting with law enforcement. They pony up the fee and log on to complete the course. (The company says it offers reduced fees but told Slate in 2015 that 85% of the offenders pay the full price, and only 2% have qualified for a full discount).\n\nHowever, involving the police in shoplifting cases does not mean automatically locking up and convicting suspects. David Karp, a professor of sociology at Skidmore College and expert on restorative justice, tells Quartz that first-time offenders might not end up with a serious charge, or any sort of jail time. Getting sucked into the criminal-justice system usually isn’t helpful to a defendant, Karp says, but it does offer legal protections that are not guaranteed when dealing with private companies.\n\nSlate interviewed several defense attorneys about the program, and they all expressed serious concerns about a private company acting as a judge, especially considering that retailers make mistakes when identifying shoplifters.\n\nWhat’s more, police, prosecutors, and courts have access to their own diversion programs for misdemeanor offenses (although these come with a hefty price tag as well). CEC could partner with police in programs in which officers could refer eligible shoplifters, Karp says: “That puts the power of the decision-making more in the hands of the defendant.”\n\nThe California suit also alleged the program creates incentives for retailers and security operators to push the CEC option, instead of ensuring alleged offenders get due process through the legal system.\n\nWhat is restorative justice?\n\nCEC says it operates according to the tenets of restorative justice, a concept outlined by American criminologist Howard Zehr in his seminal 1990 book Changing Lenses, A New Focus for Crime and Justice. The philosophy draws from the justice systems of indigenous groups in the United States and Canada, as well as New Zealand. It does not focus on “punishing a person by inflicting some kind of harm on them that’s similar to the harm that they caused others,” says Karp. Instead, it’s “about having the offender somehow address the harm that they caused,” whether it’s emotional, material, or it affects the broader community.\n\nKarp says that generally, the idea that the CEC program is meant to be educational rather than punitive falls in line with the philosophy’s precepts. But, although he hasn’t seen the program’s content, he is skeptical of its claim to be a restorative-justice solution.\n\n “The true impact from restorative justice comes from a face-to-face discussion of the impact of a person’s behavior on others.”  One big issue is the program’s online aspect (it’s also reportedly available on paper). “The true impact from restorative justice comes from a face-to-face discussion of the impact of a person’s behavior on others,” Karp says. “What we generally know about prevention-based programming is that online educational workshops are not effective in changing behavior.”\n\nThen there’s the question of the money paid by the alleged offender. Restitution, as traditionally understood, is payment for losses. “The person caught shoplifting never got the item out of the store, so there is no direct loss that the person is responsible for reimbursing,” he says.\n\n“There is a cost associated with loss prevention, but that cost is not specified and it is unclear what the obligation of one shoplifter is toward that overall cost,” he adds. With all of this uncertainty, he says, ” it is easy to see how other motives can appear,” such as financial gain for the retailers, and for CEC (The security company also receives a cut). Karp calls the CEC solution more of a fine combined with an “untested” rehabilitation program, rather than true restorative justice.\n\nA big retail store is not the best setting for restorative justice\n\nUsing restorative justice in a situation where the victim is a massive corporation is not ideal. “It works best when the harm is clear. When I steal your phone, punch you in the face, and that discussion is really impactful. When the harm is really unclear, like this two-dollar item at this two-billion-dollar company, it doesn’t really work quite as well,” Karp says. The mentality of shoplifting being a “victimless crime” is clear when you read Reddit posts from shoplifters who talk about the Walmart-owning Walton family as “silver-spooned assholes.”\n\nThere is a way for even large retailers to address shoplifting in ways that fall in line with restorative-justice principles, Karp says.\n\nThe Longmont Community Justice Partnership in Colorado, founded in 1992, works with large retailers, taking a much more involved approach. It primarily works with the local Kohl’s store, as well as Target and Home Depot, and had gotten referrals from Walmart before they introduced their own program.\n\nAn outside recidivism study of the Colorado program for 2007-2008 showed that fewer than 10% of those who completed the course were rearrested within a year. Offenders also have to pay for the program on a sliding scale, with a maximum $125 fee.\n\nIn the Longmont process, the retailer’s representative decides whether to offer the restorative-justice option. A police officer will give an offender the official referral, says Abby Whipple, Longmont program manager. This keeps law enforcement involved and, at least in theory, ensures a degree of due process.\n\nBecause the organization was getting so many referrals from the local Kohl’s, it recently introduced a group program in which offenders, community members, and store representatives speak in a series of meetings, along with facilitators. The offenders hear about the harm they had caused, and share their own stories.\n\n“Across the board I can hear them saying ’I just don’t see how [the shoplifting] would make a difference to anyone,’” Whipple says. Most are between the ages of 13 and 17.\n\nIn an intimate, personal setting, a huge company like Kohl’s offers a human face—the store’s loss-prevention representative. Whipple says he outlines all the ways the community is affected by shoplifting. Prices may rise since retailers have to recoup their losses; employee hours may be cut, and positions eliminated; lines at stores can get longer; there can be losses in tax revenue for the town, money which could have been used for parks and filling potholes. “On top of that,” Whipple says in recounting the rep’s approach, “you have employees in the store, who care about it and appreciate their jobs, and they feel both on edge and victimized by people attempting to shoplift from the store.”\n\nShe says the offenders primarily relate to the lost job opportunities, as well as longer lines and higher prices.\n\nAt the end of the process, the parties come up with a contract, according to what Whipple calls a “strength-based” approach. The loss-prevention representative asks the offenders write letters of reflection, and has a massive stack of them in his office. One person made a piece of graffiti art that spells out “Don’t Steal.” Another baked cheesecakes that were shared with all of the store’s employees. A police officer told a career-oriented 17-year-old girl to develop a business plan, which he saw as valuable to the community, as part of her contract.\n\n“We want everyone to see the humanness in the other people that have been involved in what happened—including the police, the loss-prevention rep. Making an ‘us’ out of everyone who has to respond to this incident.”\n\nA reflection of a broader debate\n\nThe contrast between the approaches of Corrective Education Company and the Longmont Community Justice Partnership is indicative of a larger rift in efforts to reform the US criminal-justice system.\n\nOn one side, you have methods that focus on old-school, face-to-face interaction, the “human” element. On the other, you have technology companies that offer to make the system more attuned to today’s world—making communication easier and processes more efficient, programs such as CEC’s, video-chatting services in prisons and jails, or providers of sentencing algorithm software.\n\nBut when profit enters the equation, things often turn against alleged offenders, especially those with fewer resources to defend themselves.",
      "Folder": "Feedly",
      "Timestamp": "1506338567",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.546200Z"
}