{
  "id": "b4cf1628cd9b4433b9ba022534ca767e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/968424/first-round-capitals-chris-fralic-a-venture-capitalist-explains-how-to-become-insanely-well-connected-and-networked/",
      "Title": "A venture capitalist explains how to become insanely well-connected Quartz",
      "Selection": "Fall 1996. A young Chris Fralic is selling software for Oracle. He’s not sure what he wants to do next, but he’s always been curious about venture capital. And then some unusual magic happens—a friend offers to introduce him to Kevin Compton, a vaunted name in VC. To his surprise, they talk on the phone for over an hour, and Fralic not only walks away with a comprehensive download on the industry, but a thesis on networking he’s adhered to ever since: The best way to be highly influential is to be human to everyone you meet.\n\nFast forward to today, Fralic is a successful VC himself, responsible for First Round’s investments in Warby Parker, Roblox, HotelTonight and Adaptly among others. When asked what’s made his career possible, he’ll tell you outright it’s the relationships—built deliberately over many years. This might sound like a common response, but among his peers, he’s acknowledged to be a world-class super-connector with rarefied expertise. Known for helping launch the famed TED Talks (this is his 24th year attending TED), and a landmark Forbes piece on nailing email introductions, Fralic still responds thoughtfully to over 10,000 emails every year.\n\nIn this piece, he unpacks the strategies that have earned him this reputation—including how to become a genuine and highly-connective networker, how to propel your career forward with each interaction (while doing the same for others), do’s and don’ts for getting responses from influencers in your industry, and how to regularly measure your performance in this area so it becomes a competitive advantage.\n\nFralic’s seven rules for making memorable connections\n\n‘Add value in conversations’ is typical advice. This means making sure people walk away with a new idea, referral, intro, etc. But Fralic has found imparting energy to be even more important than sharing new information. To do this, follow these seven rules:\n\n1. Convey genuine appreciation.\nActively project warmth and high energy. It’s been observed people like you when they feel liked by you. So, do you greet them in a way that sounds like you’re genuinely happy to see them? To make it clear you’re interested in the other person, think about what they know that you don’t. What do you actually want to learn in the interaction? Focus on that so that they can walk away knowing they added value too.\n\n2. Listen with intent.\nThe focus you bring to asking specific questions about what’s being said in real time makes others feel heard. This is a big one. Being a good listener is about two things: 1) Demonstrating that you’ve heard exactly what was said by the other person, and 2) encouraging them to continue. This breaks down into what’s called “backchanneling”—offering short, enthusiastic responses as the other person talks (i.e. “yeah” “mm-hmm” “totally” “I can see that”), and asking follow up questions that reference the information you were just given.\n\nYou’d be surprised how often people flub on listening, says Fralic. People’s minds wander, they’ll be nodding but thinking about what’s for dinner, they might look past the person speaking to see who else is in the room. All of this projects disinterest, a lack of value or prioritization for the person, and that can only hurt the relationship. If you’re talking on the phone, asking specific follow-ups becomes even more important with no body language or eye contact to read.\n\n3. Use humility markers.\nWhat you say and how you say it can put others at ease and replace nerves with positive energy—even in tough situations. “I have relationships that have lasted over a decade that started with me meeting a founding team and not investing,” says Fralic. “I’ll often start that conversation saying, ‘I’m wrong all the time and I very well may be here.’” Acknowledging your own fallibility and human imperfection can go a long way toward making yourself relatable. Especially if there’s a power dynamic where someone is asking for your advice, attention or help, you want to put the other person at ease.\n\nThere’s an unspoken distinction in the networking world between the Hunters and the Hunted.\n\nWhen Fralic reached out to Kevin Compton all those years ago. He was approaching one of the ‘hunted’—someone who had 1,000 other things to be thinking about. But he still took the time to engage and it was never forgotten.\n\nYou don’t need to build yourself up any more or explain why you’re important or going to be helpful. Your focus should be on building bridges between your experience and theirs so there are points of recognition, especially if you can organically work in shared struggles or challenges.\n\nTaking the time to call or meet in person also expresses humility—which is paramount if you’re about to reject someone. You want to emphasize that your time is no more important than theirs. “I like to call to explain opportunities I’ve passed on versus emailing. A rejection stands out among people’s interactions. When you take the time to be conscientious and human, people are often appreciative and will respect you more.”\n\n4. Offer unvarnished honesty.\nThere are a lot of reasons why people don’t share what they truly think in professional situations. They don’t want to tarnish relationships or endure an uncomfortable exchange or risk being disliked. Even if you’re one of the ‘Hunted,’ it’s human nature to avoid these experiences. You can differentiate yourself by being as honest as you can. Just remember to root your honesty in what will actually have utility for the other party. This will set a good tone for all future conversations.\n\n5. Blue-sky brainstorm.\nMaybe you can’t provide what someone is looking for. But, if you can change the angle or way they’re thinking about something by openly brainstorming with them, you make them feel like they got something special and unexpected. It’s key that you’re brainstorming with them, not for them. So, in the example of passing on an investment, Fralic makes a point of listing others who might invest, or he spends time thinking through how they might pitch or message their business differently.\n\nIt’s best when the conversation builds on itself. He’ll suggest a few names or changes, and then provide a sounding board for any concerns or questions the founders might have. This way, he can help them find a new, albeit slightly different path forward, and that’s what they’ll remember—not just the no.\n\nGive before thinking about what you get. Always offer something of value before expecting or asking for something in return. Key to this is not focusing on reciprocity.\n\n“If you find yourself keeping score in your professional relationships, you’re on the wrong track.”\n\nInstead make a list of everything you feel comfortable offering others (even if you get nothing back). Perhaps you provide connections or advice or office space or a next step in a process. That way, if you have to say no to one thing, there’s still energy you can contribute.\n\n6. End every meeting or conversation with the feeling and optimism you’d like to have at the start of your next conversation with the person.\n“Assume you’re going to run into everyone again—it usually happens either by plan or happenstance,” says Fralic. “There are no closed connections. The world is too small.” When you do meet again, you want the person to think, ‘Oh great, it’s so-and-so!’ not ‘I guess I’ll get through this somehow.’ If you envision running into this person again and how you want that to go, it’ll undoubtedly influence how you navigate a present conversation—usually for the better.\n\nFor example, Fralic is always impressed by founders who—when turned down—send some variation of, “Thanks for looking even if it’s not a fit. If you have other ideas for us or if anything changes, please let me know,” or, “Chris, when we met, you had a question/issue about X. I just wanted to show you what we’ve done about it—no need to respond.” “A person who says that shows she’s savvy enough to not take bad news personally, or create obligation or awkwardness, or continue to argue their point after you’ve said no. I’ll remember her for it,” he says.\n\nThere’s time beyond this fundraise and even this company. Relationships take years to build. Start now.\n\n7. Don’t fake it till you make it.\nIt may be common wisdom for finding confidence, but it has some negative byproducts. Namely, Fralic has seen it used to justify winging it in important meetings. Faking it in this context doesn’t mean bluffing your way through interactions that make you feel insecure or intimidated. That leads to bad decision making.\n\n“I’ve seen people overstate their credentials because they were put on the spot, or blindly target every executive in a room because they figured they should,” he says. “This rarely leads to long-lasting relationships.” If you want to connect with someone professionally to move your goals forward, you need to know exactly why you care about that person or their company. And you need to know how to articulate it succinctly. Everyone seems to have a story about a cold call miraculously turning into a career-making breakthrough. This doesn’t happen by magic. It happens because your sincerity is clearly powered by diligent preparation.\n\nIf you know you’re headed into a call or event and want to make a good impression on certain people, create mini dossiers for them. All it takes is a few bullet points:\n\nWhat are the key milestones in their career?\n\nWhat expertise do they seemingly love to provide? (Possible to suss out from any articles that quote them or talks they’ve given in the past.)\n\nAre there any recent news stories or announcements about them?\n\nWhat do you want to ask them or get out of the interaction if you get the chance?\n\nJust knowing this much will give you a leg up in the moment as long as you’re honest, straightforward, and have a clear objective.\n\n“People approach me through email with ‘faux familiarity’ all the time, saying, ‘Hey how have you been? It’s been awhile!’ Nope. It’s been never. Just say you don’t have a connection and make a compelling argument for why we should meet, i.e. ‘You don’t know me but you’ve done X and Y, would you be willing to tell me what you think of Z.’ It might not work but it has a far better chance.”\n\nBuild long-thriving (not just lasting) relationships—the do’s and don’ts\n\nOnce you’ve made a strong first impression, it’s up to you to turn that one touchpoint into a connection that has mutual purpose and positive impact. This is where a lot of people fumble: They get too busy, disorganized, nervous or pessimistic to follow up the right way. The result: too many high-potential relationships fizzle for no good reason. Here’s a sure-footed way to make sure this doesn’t happen to you.\n\nDO: Keep your ‘dream contact list’ at the ready\n\nWhen Fralic was in the computer reselling business, he kept stacks of trade journals that listed the names of top people in the industry. He would go through and mark those he wanted to learn more from—and, by hook or by crook (pre-LinkedIn), find a way to connect. Once he did, he’d ask if they could introduce him to the others on his list.\n\n“What do you want your network to look like, and what are you trying to achieve? For example, I tell our founders that there should always be a slide in their board decks that shows the five most likely acquirers of their business and what they’ve done to further those relationships since the last board meeting” Fralic says.\n\n“The same goes for relationships with individuals. If you know who your top 5 dream contacts are and what you want to talk to them about, you’ll be ready when you run into someone who knows them. Likewise, it’s good to have a forcing function for keeping those connections healthy—much like the board deck slide, consider creating a rolling reminder to get in touch. As a company, you want to have a relationship with potential acquirers before you call up asking, ‘Do you want to buy us?’ As a person, you want to have a relationship before you ask for a job, an intro, money.”\n\nDO: Craft low-lift requests\n\nMake sure your asks are reasonable for the busiest of people. First, keep your emails short, simple, and to the point. Second, “If you send an email asking for something, do the first three steps of thinking for them. Make it really easy for the other person to say yes or no without creating an imposition. For example if you’re asking for an intro, write a self-contained forwardable email,” Fralic says. A good SCFE (as he sometimes calls it) has a subject line customized for the end recipient and quickly explains who you are, what you want and why—it’s dead simple for your mutual contact to send along. Here’s a real-life example:\n\n———\n\nDate: February 21, 2017 at 8:55:26 AM ESTSubject: Introduction to HUNTED PERSON\n\nHi Chris,\nThanks again for our discussion on Friday.\n\nI appreciate your offer to introduce me to [HUNTED PERSON], to explore if there may be sales leadership roles within [COMPANY] where I can share the valuable experience I gained building [MY LAST COMPANY]’s saas business.\n\nMy CV is attached to this note. I’ll keep you advised with my progress.\n\nBest regards,\n[HUNTER]\n\n[FULL NAME\nEMAIL ADDRESS\nPHONE NUMBER]\n\n————\n\nAlways include your phone number in case the person you’re trying to get in touch with would find it easier to just call you directly. Few people do this. It’s uniquely self aware.\n\nBe really sure of the time commitment you ask from someone. Do you really need that much? “If your outreach is just, ‘Can I take you to lunch?’ that’s a big ask for a lot of people versus, ‘Hey, just thought I’d share with you this quick update about what I’m doing. No need to respond.’ The ‘no need to respond’ is a powerful tool. It sounds counterintuitive, but if you give people an out, it makes them more likely to act,” says Fralic. If you’re aware and respectful of how busy a person must be, they’ll assume positive data about your emotional intelligence and social skills, which could get you further than eating lunch with them in the long run.\n\nDO: Follow up and follow through\n\nIt sounds so easy—just follow up after meetings and complete any deliverables you promised. But a shocking number of people don’t, Fralic says.\n\nActually doing what you say you’re going to do will put you in the top quartile.\n\n“I recently met with Kenny Herman, who used to work for a First Round company and is one of the best business development people out there. In a meeting, he kept coming up with ideas for people to introduce me to and said he’d send over a list that I could choose from,” Fralic says. “Afterwards, he actually did send me an email with LinkedIn links to all of the people he’d brainstormed and one-line details on who they were. With it came a short note offering to make introductions. That’s the perfect follow up. Nine out of 10 people don’t do that. Instead, most people just drop off or forget. Not only does the relationship stop there, but I’ll never use the word reliable to describe them.”\n\nThese days, there’s tons of chatter about building one’s personal brand. Ironically, your brand actually comes from you doing great, consistent work on time—not from investing in social media or a website or marketing your work, says Fralic. You have tools at your disposal to surprise and delight: speed and polish. If you can follow up fast, that’ll get you noticed—even better if your content is perfectly proofread and detailed.\n\nDO: Make your own system for keeping in touch\n\nFralic uses Contactually to organize his contacts and gets regular reminders to email the people he’s marked as wanting to touch base with frequently. “A venture capitalist I admire used to recruit a friend of mine like clockwork—he would inevitably call every single year to see if he would join their firm. It worked. He eventually did. The takeaway: you’re only human, you can’t remember everyone, let a system do what you can’t.” Expensive software isn’t required to create a CRM for your life. All you need is a system that will:\n\nStore people’s names and relevant data like email address, birthday, company, title, relevant personal or business facts that won’t make you sound disingenuous. Don’t ask about someone’s kids if you don’t know them that well.\n\nPing you when X days, weeks, months or years have gone by to remind you to reconnect however appropriate, depending on the nature of the relationship.\n\nIt could be as simple a creating a Reminder for each contact on your Mac that will send you a push notification every 3, 6 or 12 months. This also allows you to put their email address and any short details in the ‘note’ section and access contacts across devices.\n\n“After a meeting, I’ll quickly save a one-minute audio note with takeaways and next steps,” says Fralic. “I then set aside an hour every Friday to go through these notes and write corresponding follow-ups if I haven’t already.” A good meeting recap email can inspire tremendous confidence. Consider sending along a few short bullets capturing the most important points discussed, along with a list of primary action items and who is responsible for them. This will make everyone feel more organized, clear-headed and certain progress is being made—essentially you’re adding energy to an interaction over email.\n\nOf course, while systems are important, don’t let them prevent you from being spontaneous. If you stumble on an article that’s highly relevant to something a valuable contact is doing or thinking about, send it along with a quick personalized note.\n\nIf you can add one ‘Incremental Thoughtful Personal’ email or call per day, do it. It can fundamentally impact your business and relationships in the long term.\n\nDO: Special Ops-level recon\n\nFralic is meticulous about using tools and elbow grease to ready himself for meetings. Every appointment on his daily agenda includes a link to a person’s LinkedIn, plus a few sentences on who made the introduction and the purpose of the meeting. On busy days, he’ll list out key questions and takeaways for each meeting. He’s also a fan of Clearbit, which makes a Gmail widget that surfaces context on people in your address book.\n\n“There’s so much information available, yet people don’t take advantage of it. When I get an email or have a sit-down, you’d be surprised at how few people can give evidence that they’ve done any real work in advance. There’s just no excuse for that,” Fralic says. “I’ll meet candidates who are interested in jobs at our startups and I’ll ask, ‘What companies are interesting to you?’ Half the time they’ll say, ‘I haven’t had a chance to look at your website yet.’”\n\nThis is a low bar. Set a higher standard. It’s worth doing a Google search for tools to discover, capture, and make information about people accessible. This is the bread of butter of services like Accompany, and many others that make investigative legwork easy. You can set Google Alerts for your top 5 contacts, for instance, so you catch every news story they or their company is mentioned in. There are even IFTTT recipes devoted to keeping tabs on your contacts. Don’t accept the standard tools. Go the extra mile to find out more, be better prepared, and keep in touch.\n\nDO: Get to the ‘Zone of Indifference’\n\nWhen you approach meaningful outreach, or a sales pitch, or fundraising, or a new job opportunity, make sure you prepare as much as you can. You’re aiming for the ‘Zone of Indifference.’ That’s where you can look yourself in the eye and know you did everything you could to make it happen. When you’re in the Zone, it’s great if you achieve your goal, but if you don’t, you spare yourself the regret, doubt or stress you might have otherwise.\n\nOn a related note, it’s always better to get a quick ‘no.’ Leave it all on the field, so you make a good impression. If and when things don’t go your way, learn from what happened. It’s better to get that ‘no’ upfront than to get strung along waiting for a yes that never comes.\n\nDON’T: Ambush people (always ask first)\n\nAs your network grows, you can start providing value in the form of introductions for others. But there’s no easier way to burn a bridge than to send an email connecting two people without getting their permission first. Double opt-in emails are a must. If a contact asks to meet someone, shoot that person a quick email explaining who the requester is and why you think it could be a valuable interaction for them. Don’t just paste their bio. If you do, you’ll miss out appearing like the thoughtful strategist who put two and two together. You want both recipients to know you’ve got their back and you’re on the lookout for opportunities to benefit them. And don’t forget to always give everyone involved an out. Don’t create an obligation.\n\nDON’T: Reach out only when you need something\n\nThis can happen by accident or if you feel like you have no other choice. This is why the tools Fralic mentioned earlier are so handy. But let’s say you need to make a decision on the fly. “Check your ”Sent folder to see when’s the last time you reached out to someone and in what context before you fire off that note asking for help,” he says. “It becomes obvious very quickly when someone just wants to use you. Don’t be one of those people. This is a quick way to suffer single-digit response rates—if you’re just asking people for things without thinking about what you’ve done for them recently, or without any context for why you’re asking, people will feel imposed upon. And they won’t respond. Your reputation takes a hit and everybody loses.”\n\nDON’T: Lose track of your response rate\n\nYou don’t want your response rate be at 100%, because then you’re not pushing far enough—you could probably ask for more assistance and still get it. “My goal is roughly an 80% hit rate for outreach,” says Fralic. “For others in different roles it might be lower (if you’re a sales development rep for instance) or maybe 50%. There’s no magic number, but your response rate should make sense based on the strength of connection and amount of personalization and thought you’ve put into the outreach.”\n\nVery few people even pay attention to this metric, so they don’t know where they stand. Learn from past emails to make future ones better. Let’s say you send 20 emails out to close connections asking for candidates for an open role. Tally your response rate. Think about who didn’t respond. Rephrase similar asks to them in the future that might appeal more to their specific interests or personalities. It’s worth your time given the value that can be gained.\n\nEmail response rates are signals of your reputation. Under 10%? You’ve got a problem.\n\n“You’re only as good as the people you know,” says Fralic. “That’s why it’s so worth it to make your reputation a priority. Your brand is what people think or say about you when you’re not around. When they see your name in their inbox, think about what you want their first reaction to be,” Fralic says. “If you follow these principles, your network will naturally widen into a solid foundation. It’s not just about having another high-caliber LinkedIn connection or the email address of a VIP. Those are nice to have, sure, but the real win is knowing those people will respond to you when you need it.”\n\nThis article was first published at First Round Review. Follow Chris at @chrisfralic. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1493161455",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.607651Z"
}