{
  "id": "b50a4b801e0745fda76fcb1358a1a6cf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1284878/the-difference-between-intelligence-and-wisdom-and-how-to-acquire-both/",
      "Title": "The difference between intelligence and wisdom—and how to acquire both Quartz",
      "Selection": "It’s often been said that wisdom is the art of knowing that you are not wise.\n\nThe great philosopher Socrates famously denied being wise more than two thousand years ago, and since then, we have taken him at his word.\n\nThere is a truth there, but that definition isn’t very helpful. I mean, I’m all for respecting uncertainty, doubting oneself, and realizing the limitations of my mind, but I think we can do better. Maybe even take a few steps forward.\n\nMore importantly, I think we can create our own definition that separates it from just mere intelligence and then use that definition to illustrate why the distinction matters and how we can practically engage it in everyday life.\n\nIntelligence is commonly associated with knowing something. Often, it also means that we can confidently apply what we know in a particular context.\n\nWisdom, to me, is different. It’s different because it has more dimensions. Wisdom not only knows, but it also understands. And the distinction between knowing and understanding is what makes things interesting.\n\nKnowing is generally factual. You have learned a particular kind of knowledge and you know its truth as it applies to a particular problem.\n\nUnderstanding, however, is more fluid. You have learned a particular kind of knowledge, but you don’t see it as a fact or a truth applied rigidly to one thing. Rather, you understand that knowledge’s essence and you can see how it relates to everything else, with nuances and contradictions included.\n\nThe difference is subtle but potent. While intelligence gives you specific utility, wisdom inspires flexible versatility. It provides a more textured lens for interacting with reality, very much changing how you think.\n\nBuilding relational knowledge\n\nEvery time you have a perspective shift, big or small, you gain knowledge.\n\nYou learn something new that you maybe didn’t know before, and as a result, your mind then changes itself regarding whatever that knowledge pertains to in the future. Next time, there is an added clarity.\n\nIf the acquired knowledge is understood, rather than just known, however, there is another step that occurs every time your mind shifts.\n\nIf you’re a student, for example, and you’re writing an exam, and it’s a difficult one, let’s say you decide to cheat. Now, unfortunately, when you cheat, you get caught. It leads to a failing grade in the course.\n\nThe thing to learn from this experience that would add to your intelligence would be the fact that cheating on an exam has consequences, and those consequences, while improbable, have a disproportionately negative impact on your life. It’s simply not worth it in the future.\n\nThe extra step that would translate the intelligence in that particular scenario into broadly applicable wisdom would be to realize that not only is it not worth cheating on an exam due to the harsh consequences, but that most things in the world that carry disproportionately costly risks should be approached cautiously, whether they be financial decisions or personal life choices.\n\nThis is, of course, a very simplified scenario, but the point is that knowledge is relational and the understanding of wisdom recognizes that rather than treating it simply as an isolated information point.\n\nInstead of the lesson being that cheating is bad, you combine the essence of the knowledge learned from that experience with your existing latticework of previous knowledge to really hammer home the underlying principle.\n\nThis way, you understand how taking shortcuts may harm your personal relationships, how your new understanding of risk may inform your business practices, and how what you say matters beyond why you say it.\n\nKnowledge is always best leveraged when it’s connected to other knowledge.\n\nCreating an information network\n\nIn network science, there is a now-famous effect called Metcalfe’s law.\n\nIt was first used to describe the growth of telecommunication networks, but over time, the application has been extended beyond that. It essentially states that the value of a network rises with the number of connected users.\n\nIn any network, each thing of interest is a node and the connection between such things is a link. The number of nodes themselves don’t necessarily reflect the value of a network, but the number of links between those nodes do.\n\nFor example, ten independent phones by themselves aren’t really all that useful. What makes them useful is the connection that they have to other phones. And the more they are connected to other phones, the more useful they are because the more access they have to each other.\n\nWell, the relationship between different kinds of knowledge in our mind works the same way. The more connected they are to each other, the more valuable the information network that we have in our brain is.\n\nEvery time you gain knowledge, you are either isolating it within a narrow context where it’s addressing a particular problem, or you are breaking it down a little further so that you can connect that knowledge to the already existing information you’ve accumulated so far.\n\nIn this scenario, intelligence is found within a pocket of information by itself. Wisdom, however, is accumulated in the process of creating new links.\n\nEach node of knowledge in your mind is a mental model of some aspect of reality, but that mental model isn’t fully complete until it’s been stripped down and re-contextualized in light of the information contained in the other mental models of knowledge around it.\n\nThe only way to acquire wisdom is to think in terms of the whole information network rather than the individual nodes that it contains.\n\nThat’s where nuance is considered; that’s where the respect for complexity comes in; and that’s how specialized information finds it flexibility.\n\nThe strength of your mind depends on the value of your information network.\n\nThe takeaway\n\nThe quest for wisdom is an age-old effort. It’s one many have recommended.\n\nIt’s been said to be as useful for finding inner contentment as it for fueling external successes. It’s a more prudent way of interacting with reality.\n\nWhile not everyone’s definition of wisdom is the same, it doesn’t seem too far-fetched to distinguish it by a mode of deeper understanding. One that goes beyond just the knowing we commonly associate with intelligence.\n\nWhen we think of the acquisition of intelligence, we think of new information inspired by a perspective-shift that tells us a truth about one aspect of reality.\n\nWisdom goes further than that. It strips that same information down to its essence so that it can relate the underlying principle of that knowledge to the existing information network that exists in the mind.\n\nIt’s the connectedness of this network that separates it from mere intelligence.\n\nThe more links between each pocket of information, the more valuable the whole network will be when tackling any other problem. It adds an extra dimension to each mental model contained in the mind.\n\nSimply knowing this doesn’t make a person more equipped to soak in wisdom, but with awareness and practice, new thinking patterns can be created.\n\nThe way you do this shapes everything else. It’s worth working on.\n\nWant to think and live smarter? Zat Rana publishes a free weekly newsletter for 30,000+ readers at Design Luck.\n\nThis post was originally published on Medium.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1527023738",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.502510Z"
}