{
  "id": "b54a77b680bc403faafa3c4b001404bb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1108123/millennials-love-classic-brands-because-theyre-desperate-for-security/",
      "Title": "Millennials love classic brands because they’re desperate for security Quartz",
      "Selection": "Walk down a block in Berlin or step into a coffee shop in San Francisco, and you’ll notice one thing immediately: These places are lousy with backpacks. And not just any backpack. Slung across the shoulders of millennials the world over is the trademark brightly-colored Kånken from Fjällräven, embellished with a logo of a curled-up fox. \n\nFjällräven, founded in 1960, originally designed the Kånken backpack for schoolchildren in Sweden. Today it’s ubiquitous among urban creatives in liberal enclaves across the globe, from Hackney to Brooklyn—alongside classics like Patagonia fleeces and Adidas Originals like Superstars and Stan Smiths. (Sales of Adidas Originals increased by 80% in the US in 2016, Bloomberg reports, while Patagonia’s sales rose to $800m in 2016, twice that of 2010, according to The Guardian.) At retailers in the artsy London neighborhood of Shoreditch, a wall of Fjällräven backpacks shares space with a display of iconic American southwest shirts from Pendleton, established in 1863, and the no-nonsense ruggedness of Filson, the 1897 Seattle producer of bags and outerwear with a lifetime guarantee.\n\nThe heritage brands experiencing a resurgence among hipsters tend to share several common traits. They’re classic in appearance, rich in history, and famously durable. In other words, Fjällräven and its ilk feel safe. For millennials, who came of age amidst the global financial crisis of 2008 only to graduate into today’s period of immense political and social turmoil, comfort and stability may seem like the ultimate luxuries. And they’re willing to pay good money for clothes that make them feel secure.\n\nArabella Greenhill, the fashion director of Stylist Magazine, notes that brands that today’s twenty- and thirty-somethings associate with their childhoods—or their parents’ childhoods—are especially appealing. “You had certain brands which made you feel safe,” she says. Greenhill points to how Vetements, the French clothing design collective that’s the hot brand of the moment, embraced fashion nostalgia full on in its Spring/Summer 2017 collection: “Vetements got all these cult and heritage brands, like Dr Martens, Mackintosh, Carhartt and Champion, and brought them to a whole new generation and made them cool.” \n\n “We look to the past as a way of either resisting what’s going on presently, or as a way of anchoring things in a more stable environment.” History shows that people tend to retreat toward classic fashions in times of austerity, war, and political unrest. “Economical or ideological climates definitely influence designers and consumers in the way they interact with fashion,” says Kate Nelson Best, an expert in fashion culture and author of the 2017 book The History of Fashion Journalism. “For example, after the relative freedom of style in the 1920s, the 1930s [during the Great Depression] saw a return to a more conservative style of dressing: long dresses for evening, and suits for daywear. There was a more inward-looking consciousness.”\n\nUrban creatives—typically considered to be edgy when it comes to fashion—are not immune to this effect. A brand like New Balance has always had broad appeal; it wouldn’t have stuck around since 1906 otherwise. What’s noteworthy is that hip millennials in particular are embracing the retro sneakers. This demographic’s love of heritage brands is the opposite of aesthetic innovation; instead, they’re embracing the same labels their parents and grandparents wore. The result of this quest for comfort and familiarity is that young liberals end up gushing over brands that, by virtue of their survival through the decades, are inherently conservative. \n\nWhile present-day fashions are more fragmented than in the past, Nelson Best says the current resurgence of century-old heritage brands like Hunter Boots, Burberry, and Harris Tweed fits the historical pattern of uncertainty triggering fashion nostalgia. This may provide an explanation for why even the most forward-looking seek out the tried and tested during difficult times: “[We] look to the past as a way of either resisting what’s going on presently, or as a way of anchoring things in a more stable environment.”\n\nIndeed, when the future looks uncertain, indulging in nostalgia makes people feel more optimistic, according to a 2013 study from the University of Southampton. Reminiscing about the past helps us feel more socially connected, which in turn increases our self-esteem—and that makes us more hopeful about what will happen to us in the future. If life was good once, after all, it may be good again. This emotional logic “allows individuals to form positive expectations, explore their environment confidently and energetically, and approach novel experiences,” the study’s authors write. \n\n Reminiscing about the past helps us feel more socially connected, which in turn increases our self-esteem. Consumers’ increasing interest in ethically-made, environmentally sustainable purchases has also led them to heritage brands. Birkenstock, which has been making supportive sandals that can last for decades since 1774, continues to produce all its shoes in its native Germany as it resists outsourcing. Levi’s has roots stretching back to 1853 and the gold rush, and is now a pioneer once again as a driving force in the Better Cotton initiative, which works to make global cotton production more sustainable. \n\nThese are the kind of brand stories that appeal to consumers, says Nelson Best. “There’s a sense of authenticity about these [heritage] brands,” she notes. “They’re often known for a specific product which they have been making for a long time, and they have a certain level of expertise. One senses that they have integrity.”\n\nFor the minimalist shopper, the fact that heritage products are so long-lasting is another major draw, as it frees up time and money to focus on matters that have nothing to do with clothes. “It’s done! I don’t need to shop for shoes anymore,” says Luke Abrams, who works in tech in London and is the proud owner of a pair of Iron Ranger boots from Red Wing, the Minnesota company founded in 1905. \n\nAbrams chose his boots-for-life after a year-long study of r/goodyearwelt, a Subreddit dedicated to the golden standard of shoe production that gives the group its name. (Goodyear welt construction means the welt–the strip running along the outer perimeter of the sole–is stitched to the shoe in a particular manner.) Abrams likes the fact that his shoes were standard issue for World War II paratroopers, and approves of their hardy features: Iron Rangers have double leather on the wear points and steel in the sole and toe. The best part, says Abrams, is that they will last decades, if not more: “They’re built so that every single part of the shoe can be replaced.” \n\nThe funny thing about nostalgia, of course, is that the past only seems like a simpler time in retrospect. Heritage brands came about in periods with their own inequalities and struggles. And yet they do offer young people a sense of solace. On the streets of Hackney, young professionals have developed an affection for Barbour jackets. Barbour, founded in 1894, still makes all its waxed classics in South Shields—where it also patches up customers’ coats as they wear and tear over the years. Life may be unpredictable, the urbanites of Hackney seem to be saying, but this coat is a constant.\n\nFollow Jessica on Twitter. Read more of the Quartz Ideas series on The Nostalgia Economy.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1508989777",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.534185Z"
}