{
  "id": "b569b0b1472045639c1330a703b39dbf",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.boardingarea.com/chase-ultimate-rewards-sweet-spots/",
      "Title": "Chase Ultimate Rewards sweet spots Frequent Miler",
      "Selection": "When I ask readers about their favorite award currency, Chase Ultimate Rewards is often a #1 pick. That’s true due to an abundance of excellent transfer partners. Shortly after we made major changes to our Reasonable Redemption Values (See: A big change to Frequent Miler’s point values.), we published a post on easy ways to get good value out of Citi ThankYou points. Today, we look at easy ways to get good value out of Chase Ultimate Rewards points. Note that this post does not cover all of Chase’s transfer partners, but rather the ones where you’ll find easy value. See also our Complete Guide to Chase Ultimate Rewards for everything you need to know about earning and burning these valuable points.\n\nThe Ritz-Carlton Abu Dhabi, a Marriott property (which is a Chase transfer partner)\n\nHotels\n\nThe area in which Chase truly shines over others is hotel partners. Citi has none; Amex has three (Choice Privileges, which has limited valuable uses; Hilton, which frequently sells points for much less than the value of Amex points; and Marriott, which it shares with Chase). Chase has three parters, two of which present a number of sweet spots: Hyatt and Marriott. While Hyatt presents plenty of opportunity to get incredible value, Marriott shouldn’t be counted out as a potentially valuable partner. Chase also partners with IHG, but since you can often buy IHG points for about half a cent each, you’re probably better off buying what you need than transferring more valuable Ultimate Rewards points most of the time.\n\nHyatt\n\nThe short story: Hyatt generally has nice hotels in most major cities and awards are very reasonable compared to the cash cost of most properties. Hyatt also has great benefits for top-tier elites.\n\nMiles required: Hyatt’s award chart has properties for 5K, 8K, 12K, 15K, 20K, 25K, 30K, or 40K points per night. Cash & points nights require half the points and approximately half the nightly room rate.\n\nHow to find awards: Search for availability at Hyatt.com by checking the box that says “Use points”.\n\nHow to book awards: Book online at Hyatt.com. To add elite upgrades like Globalist suite night upgrades or Explorist Club Access Awards, you will need to call or contact the Twitter team (which can also help book award rooms — see: New Hyatt properties: reminder of an old trick.)\n\nKey warnings: One great use of Hyatt points can be to first transfer Ultimate Rewards to your Hyatt account and then transfer those Hyatt points from your Hyatt account to the account of a Hyatt Globalist so that he or she can book a Guest of Honor stay for you. Just keep in mind that although you can transfer from Ultimate Rewards to Hyatt as many times as you wish, your Hyatt account can only be involved in one Hyatt-to-Hyatt transfer (in or out) every 30 days.\n\nMarriott\n\nThe short story: While transfers to Marriott aren’t always a good use of Ultimate Rewards points, you can certainly find many instances where they are nearly as good as Hyatt points.\n\nMiles required: Marriott’s award chart has properties for 7.5K, 12.5K, 17.5K, 25K, 35K, 50K, 60K, or 85K points per night at standard prices (each category will also have higher and lower prices when peak and off-peak pricing begins).\n\nHow to find awards: Search for availability at Marriott.com by checking the box that says “Use points”.\n\nHow to book awards: Book online at Marriott.com.\n\nKey warnings: Keep in mind that Ultimate Rewards points can be used to buy paid travel at a value of 1.5c per point through the Ultimate Rewards portal with the Chase Sapphire Reserve. Many properties at 50K points per night or higher could likely be booked for fewer points via the Chase portal and/or present less value than similar-caliber Hyatt properties. The true sweet spots here are likely to be at the 7.5K, 12.5K, 25K, and 35K levels in my experience, but you’ll want to compare against the cost of just booking through the portal instead.\n\nDomestic US flights\n\nWhile Chase partners with three US-based carriers (United, Southwest, and JetBlue), you can often get even better value for domestic flights from its foreign transfer partner programs. One reason to consider a transfer to Southwest is flexibility since you can cancel Southwest award flights for no fee.\n\nVirgin Atlantic\n\nThe short story: Virgin Atlantic often offers Delta flights for many fewer miles than Delta would charge for the same itineraries.\n\nMiles required: 12,500 miles each way plus $5.60 for direct domestic US flights on Delta\n\nHow to find awards: Search for available space at VirginAtlantic.com\n\nHow to book awards: Book online at VirginAtlantic.com.  See: How to book Delta flights with Virgin Atlantic miles.\n\nKey warnings: Virgin Atlantic charges each segment separately (i.e. an itinerary with a single connection will cost 25K miles), so they are not a good choice for connecting itineraries.\n\nUnited\n\nThe short story: United offers domestic one-way awards for as few as 10K miles each way and offers expanded availability to credit card holders and elite members.\n\nMiles required: 10K to 12.5K miles each way plus $5.60 for the cheapest saver-level domestic economy class awards.\n\nHow to find awards: Search for available space at United.com\n\nHow to book awards: Book online at United.com\n\nKey warnings: United has eliminated its award chart, so you may see many different prices for award tickets. The $75 close-in booking fee for flights departing within the next 21 days reduces the value of United miles for bookings near departure.\n\nBritish Airways Avios\n\nThe short story: British Airways offers a distance-based award chart that can be useful for short direct flights on American Airlines with no close-in booking fee and great flexibility due to an easy cancellation policy.\n\nMiles required: 7.5K miles each way plus $5.60 for economy-class segments covering up to 1,151 miles flown.\n\nHow to find awards: Search for available space at britishairways.com.\n\nHow to book awards: Book online at britishaiways.com\n\nKey warnings: British Airways charges for each segment separately, so multi-segment trips can get expensive quickly. Furthermore, the British Airways site sometimes shows phantom award space for AA (see: Phantom menace: an award search time suck). You may want to double-check Qantas.com for availability before transferring to British Aiways Executive Club.\n\nIberia Avios\n\nThe short story: Iberia Plus offers a distance-based award chart that can be useful for short itineraries on American Airlines (even those with connections) with no close-in booking fee. See: From 11K RT on American: A sweet spot for North American flight redemptions.\n\nMiles required: From 11K miles round trip plus $11.20 for economy-class itineraries. The best deals are itineraries of 2,000 miles flown or fewer since they cost 17,000 miles round trip at most when American has availability.\n\nHow to find awards: Search for available space at iberia.com.\n\nHow to book awards: Book online at iberia.com.\n\nKey warnings: Most Iberia partner bookings, including those on American Airlines, are completely nonrefundable and can not be changed. Only book AA flights with Iberia if plans are certain.\n\nSouthwest\n\nThe short story: Southwest points are typically only worth about 1.5c towards the cost of a flight, but award bookings are totally flexible since they can be changed or canceled with no fee up until shortly before departure.\n\nMiles required: Varies by route but can be as cheap as less than 2K miles each way.\n\nHow to find awards: Search for available space at Southwest.com\n\nHow to book awards: Book online at Southwest.com\n\nKey warnings: Keep in mind that if you pay for Early Bird Check In and then later cancel or change your flight, you will lose the benefit without a refund.\n\nHawaii\n\nWhile saver business class awards to Hawaii can be difficult to find (and even rarer in lie-flat seats), Chase has the right transfer partners to get the best values when available. Southwest is again an honorable mention since you might value the flexibility and/or find a good deal from the West Coast.\n\nSingapore KrisFlyer\n\nThe short story: Singapore KrisFlyer charges fewer miles for domestic flights to Hawaii than United does for the same flights\n\nMiles required: 17,500 miles each way in economy or 34,500 in business (as compared to 22.5K / 40K through United)\n\nHow to find awards: Search for available space at United.com (Note: Do not log in — logging in may show you expanded availability based on your credit card or elite status that is not available for partner bookings) or SingaporeAir.com (See: Book United flights online with Singapore miles – but note that business class prices have increased since that post was written)\n\nHow to book awards: Book online at SingaporeAir.com or over the phone with Singapore KrisFlyer\n\nKey warnings: Singapore allows a maximum connection time of 4 hours on a domestic itinerary and will not allow a stopover on a one-way award. Be aware that United.com will show availability for flights with longer/overnight connections that are not available with Singapore KrisFlyer miles, so be sure to double check availability at SingaporeAir.com before booking. Also note that transfers to Singapore KrisFlyer are not instant. Transfers typically take 12-24 hours (from all major transferable currencies) and Singapore does not hold award tickets.\n\nVirgin Atlantic\n\nThe short story: Virgin Atlantic often offers Delta flights to Hawaii for many fewer miles than Delta would charge for the same itineraries. This can be a particularly good value for Delta’s life-flat routes to Hawaii.\n\nMiles required: 20,000 miles each way in economy class or 37,500 miles each way in business class (for direct flights)\n\nHow to find awards: Search for available space at VirginAtlantic.com\n\nHow to book awards: Book online at VirginAtlantic.com.\n\nKey warnings: Virgin Atlantic charges each segment separately, so they are not a good choice for connecting itineraries.\n\nBritish Airways Avios\n\nThe short story: British Airways offers a distance-based award chart, so flights from the West Coast of the USA on Alaska Airlines or American Airlines can be a great value with Avios.\n\nMiles required: 12.5K miles each way plus $5.60 for economy-class segments between west coast cities and Hawaii.\n\nHow to find awards: Search for available space at britishairways.com for AA or aa.com for Alaska flights.\n\nHow to book awards: Book American flights online at britishaiways.com or Alaska flights over the phone at 1 800 452 1201.\n\nKey warnings: British Airways charges for each segment separately, so multi-segment trips can get expensive quickly. Furthermore, the British Airways site sometimes shows phantom award space for AA (see: Phantom menace: an award search time suck). You may want to double-check Qantas.com for availability before transferring to British Aiways Executive Club for American flights.\n\nSouthwest\n\nThe short story: Southwest points are typically only worth about 1.5c towards the cost of a flight, but award bookings are totally flexible since they can be changed or canceled with no fee up until shortly before departure.\n\nMiles required: Varies by route but can be less than other options when cash prices are low.\n\nHow to find awards: Search for available space at Southwest.com\n\nHow to book awards: Book online at Southwest.com\n\nKey warnings: Keep in mind that if you pay for Early Bird Check In and then later cancel or change your flight, you will lose the benefit without a refund.\n\nEurope\n\nChase has Virgin for Delta and Air France which can be good for promo awards. United may also be a good choice for Star Alliance awards as noted below.\n\nVirgin Atlantic\n\nThe short story: Virgin Atlantic often offers Delta flights for many fewer miles than Delta would charge for the same itineraries.This can be a particularly good value for Delta’s life-flat routes to Europe and availability is often surprisingly good.\n\nMiles required: 50K miles each way in business class (for direct flights)\n\nHow to find awards: Search for available space at VirginAtlantic.com. See: Book Delta with Virgin Atlantic miles online! (again).\n\nHow to book awards: Book online at VirginAtlantic.com.\n\nKey warnings: Virgin Atlantic charges each segment separately, so they are not a good choice for connecting itineraries. Note that taxes on flights originating in Europe can be high, but are only $5.60 when originating in the US. Some major European airports are not loaded into Virgin Atlantic’s website, so you may have to call to check availability / book.\n\nAir France / KLM Flying Blue\n\nThe short story: Monthly Flying Blue Promo Awards can sometimes offer excellent value between the US and Europe\n\nMiles required: Varies. Air France no longer has an award chart, but promo awards often offer good value, with business class awards often available in the 40K’s and sometimes as low as the 20K’s depending on destination.\n\nHow to find awards: Search for available space at AirFrance.us (you’ll need to create a free Flying Blue frequent flyer account to search)\n\nHow to book awards: Book online at AirFrance.com. Can also book via phone.\n\nKey warnings: Air France / KLM do add fuel surcharges, though they are often reasonable (about $150-$250 in taxes and fees each way)\n\nUnited\n\nThe short story: United charges a relatively large number of miles for business class flights between the US and Europe (70K), but the lack of fuel surcharges can be a major advantage for booking partners like Luthansa.\n\nMiles required: 70K one-way in business class between the US and Europe on partner airlines and potentially less on United.\n\nHow to find awards: Search for available space at United.com\n\nHow to book awards: Book online at United.com\n\nKey warnings: United has eliminated its award chart, so we may eventually see many different prices for award tickets.\n\nAsia\n\nWhile Virgin Atlantic stands out as the hands-down best value here, United also has a lot of partners in the region and Singapore gets a nod because of its expanded availability for KrisFlyer members.\n\nVirgin Atlantic\n\nThe short story: Virgin Atlantic offers incredible value for ANA first class between the US and Japan (and decent value for business class).\n\nMiles required: 110K / 120K round trip for first class between the US West Coast / US East Coast and Japan or 90K / 95K miles in business class\n\nHow to find awards: Search United.com to find ANA partner award space.\n\nHow to book awards: Call Virgin Atlantic Flying Club at 1 800 365 9500.\n\nKey warnings: Virgin Atlantic charges each segment separately, so this award is best for direct flights. They also add fuel surcharges for ANA flights, though total taxes and fees are still quite reasonable (about $270 round trip at the time of writing).\n\nUnited\n\nThe short story: United business class for 70K each way and allows the mixing of partners and cabins, which adds more possible awards given its number of partners in Asia.\n\nMiles required: 70K miles each way in business class.\n\nHow to find awards: Search for available space at United.com\n\nHow to book awards: Book online at United.com\n\nKey warnings: United has eliminated its award chart, so we may eventually see many different prices for award tickets. The $75 close-in booking fee for flights departing within the next 21 days reduces the value of United miles for bookings near departure.\n\nSingapore KrisFlyer\n\nThe short story: While award prices are high, Singapore KrisFlyer has much better availability in premium cabins for their own members. They also offer a stopover on a one-way award.\n\nMiles required: 95K / 99K from the West Coast / East Coast to Singapore in business class or 130K / 132K in first class (see the full award chart here).\n\nHow to find awards: Search for available space at United.com (Note: Do not log in — logging in may show you expanded availability based on your credit card or elite status that is not available for partner bookings) or SingaporeAir.com\n\nHow to book awards: Book online at SingaporeAir.com or over the phone with Singapore KrisFlyer. Can waitlist as many options as you’d like as long as you have enough miles to book the award being waitlisted.\n\nKey warnings: Note that transfers to Singapore KrisFlyer are not instant. Transfers typically take 12-24 hours (from all major transferable currencies) and Singapore does not hold award tickets. Waitlisted itineraries that do not clear by 14 days prior to departure will get canceled.\n\nCaribbean / Latin America\n\nSimilar to domestic US flights, Avios can offer good value for American Airlines flights — British Airways is better for direct flights and when you need flexibility; Iberia is better for connecting itineraries and when plans are locked in (since you can not change or cancel).\n\nBritish Airways Avios\n\nThe short story: British Airways offers a distance-based award chart, so flights from the southern part of the US to the Caribbean and Latin America can be a solid value.\n\nMiles required: Varies based on distance. From 7.5K one-way in economy class.\n\nHow to find awards: Search for available space at britishairways.com for AA or aa.com for Alaska flights.\n\nHow to book awards: Book American flights online at britishaiways.com or Alaska flights over the phone at 1 800 452 1201.\n\nKey warnings: British Airways charges for each segment separately, so multi-segment trips can get expensive quickly. Furthermore, the British Airways site sometimes shows phantom award space for AA (see: Phantom menace: an award search time suck). You may want to double-check Qantas.com for availability before transferring to British Aiways Executive Club for American flights.\n\nIberia Avios\n\nThe short story: Iberia Plus offers a distance-based award chart that can be useful for short itineraries on American Airlines (even those with connections) with no close-in booking fee. See: From 11K RT on American: A sweet spot for North American flight redemptions.\n\nMiles required: From 11K miles round trip plus $11.20 for economy-class itineraries. The best deals are itineraries of 2,000 miles flown or fewer since they cost 17,000 miles round trip at most when American has availability.\n\nHow to find awards: Search for available space at iberia.com.\n\nHow to book awards: Book online at iberia.com.\n\nKey warnings: Most Iberia partner bookings, including those on American Airlines, are completely nonrefundable and can not be changed. Only book AA flights with Iberia if plans are certain.\n\nSouthwest\n\nThe short story: Southwest points are typically only worth about 1.5c towards the cost of a flight, but certain taxes aren’t charged on award tickets which can make for a redemption value as high as 1.9 cents per point to some Latin American destinations.\n\nMiles required: Varies by route.\n\nHow to find awards: Search for available space at Southwest.com\n\nHow to book awards: Book online at Southwest.com\n\nKey warnings: Keep in mind that if you pay for Early Bird Check In and then later cancel or change your flight, you will lose the benefit without a refund.\n\nAfrica\n\nThe only real Chase Ultimate Rewards sweet spot in terms of flights from the US to Africa is United if you are able to take advantage of the Excursionist Perk (therefore picking up a free one-way within Africa). Speaking of one-ways in Africa, British Airways Avios can be useful for booking Comair to travel within southern Africa.\n\nUnited\n\nThe short story: United offers something called the “Excurionist Perk”, which gives you a free one-way within a single region when your travel begins and ends in the same region. See: Leveraging the United Excursionist Perk to save miles for some ideas. Since United partners with Egypt Air, South African, and Ethiopian, which should give you ample opportunity to take advantage of th Excusonist perk.\n\nMiles required: 70K miles each way in business class.\n\nHow to find awards: Search for available space at United.com\n\nHow to book awards: Book online at United.com\n\nKey warnings: United has eliminated its award chart, so we may eventually see many different prices for award tickets. The $75 close-in booking fee for flights departing within the next 21 days reduces the value of United miles for bookings near departure.\n\nChase Travel Portal\n\nOne final way to get decent value out of Chase points is to use them to book travel through the Chase Travel Portal, at least if you have the Chase Sapphire Reserve. That’s because the CSR offers you 1.5 cents per point when using your points to book travel. Advantages here include ease and selection (since you aren’t limited by award availability). The key disadvantage is that you won’t get beyond beyond the 1.5cpp mark, but if it saves you points and works that looks like a win.\n\nBottom line\n\nChase Ultimate Rewards are a great currency to collect because they offer a nice range of partners and sweet spots. In my opinion, the factor that makes their value stand out is the ability to get a good return for your points whether booking flights or hotels, which gives you the opportunity to cherry-pick the best values. Again, check out our Chase Ultimate Rewards Complete Guide for more detail on earning and burning Chase Ultimate Rewards.\n\nEarn Miles Without Flying: START HERE\t\n\nThe post Chase Ultimate Rewards sweet spots appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1558064726",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.371879Z"
}