{
  "id": "b7b8cb0509f2441a87b83679c7e29e36",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/mischiefs-of-faction/2016/12/19/14010172/trump-transformation-harrison",
      "Title": "Donald Trump will follow a failed political transformation, just like Benjamin Harrison Vox - All",
      "Selection": "In my last post, I argued that Donald Trump as president may end up being the most similar to Theodore Roosevelt. Here, I'd like to suggest something completely different, if close in time: Perhaps the most appropriate comparison is instead Benjamin Harrison.\n\nAs I discussed, according to Stephen Skowronek's theory of political time, articulator presidents are those who follow up on the legacy of a major political reconstruction but adapt those ideals for a new, changed era. Reconstructions involve breaking the old political order and putting into place a completely new way of understanding the role of government. There have only been five reconstructive presidents, according to the theory: Jefferson, Jackson, Lincoln, FDR, and Reagan (Washington and Adams are considered a separate category).\n\nFollowing that logic, we can trace all of the articulators, even if Skowronek himself didn't discuss each one. This chart lists all of the articulator presidents in American political history:\n\nReconstruction\n\nArticulation\n\nJefferson\n\nMadison, Monroe\n\nJackson\n\nVan Buren, Polk\n\nLincoln\n\nGrant, Hayes, Garfield, Arthur, Harrison, McKinley, TR, Taft, Harding, Coolidge\n\nFDR\n\nTruman, JFK, LBJ\n\nReagan\n\nBush I, Bush II\n\nThe obvious standout in this chart is all of the articulators who followed Lincoln's reconstruction. Normally we have only two or three cases of articulation before the regime ends, but from the late 19th century into the early 20th century we have a long series of articulations that take us all the way to the brink of the Great Depression.\n\nWhat's going on here? How could a regime started in 1861 last for nearly 70 years? Perhaps more importantly: To what degree can someone like Taft, Harding, or Coolidge really be considered a successor to the ideals of Abraham Lincoln, who lived in such a different historical era? And to push the analysis forward, is Herbert Hoover truly the end of the regime that started in 1861?\n\nOne possible response is to say, well, clearly the theory doesn't add up, so let's toss it out and start again! But I'm inclined to see the virtues of the theory even if it seems to lose some of its explanatory power over the late 19th/early 20th century period. After all, much of the rest of the analysis helps us understand presidential power across history.\n\nPeople who have followed up on Skowronek's work since he wrote his book in 1993 have made a variety of suggestions that may help us through this conundrum. Noticing this difficulty, for instance, Andrew Polsky has reframed Skowronek's argument and expanded it to include the entirety of political party competition. Polsky calls his reformulated position a theory of \"partisan regimes,\" which:\n\nmay be understood as a political coalition organized under a common party label that challenges core tenets of the established political order, secures effective national governing power, defines broadly the terms of political debate, and maintains sufficient power to thwart opposition efforts to undo its principal policy, institutional, and ideological achievements.\n\nAccording to Polsky, regimes work to secure control over the political system. In times of great political upheaval, they are able to do so, and establish a period of dominance. Even then, however, their control is never complete, and they continually battle the opposition to maintain power. The regime is a short-lived phenomenon, and then once its dominance ends, there follows an extended period of no one regime being in control — in other words, there's effectively no articulation after a while, just gradual regime decay until a new regime takes control.\n\nHow does this help us understand the late 19th/early 20th century period? If we follow this logic, most of the presidents following Abraham Lincoln aren't really articulators of his regime at all; rather, they are simply muddling through as best as they can while the regime's initial ideals slowly decay. At some point, perhaps, there's a new reconstruction. Curt Nichols and Adam Myers, following up on this logic, have argued that William McKinley's tremendous victory in 1896 is indeed the founding of a new regime, and we should see McKinley as another reconstructive president, in the mold of Jefferson, Jackson, and Lincoln.\n\nSkowronek notes, in his discussion of Grover Cleveland, that Cleveland was a president who (as part of the gradual corroding of the Lincoln regime) had the opportunity to reconstruct the political order but failed to do so. In much the same way, Barack Obama seemingly had the possibility of reconstruction after the 2008 financial crisis and a Democratic triumph in 2008, but it never came to fruition.\n\nWe may be at a similar moment in political history today: After a failed shot at the founding of a new regime, we remain in a time of close political competition, with a narrowly elected president (who wins the Electoral College even while losing the popular vote) clinging to tight majorities in Congress while presiding over a divided nation. Like the presidency of Benjamin Harrison, Trump's may be a prelude to the next major reconstruction of American politics.\n\nThis post is part of Mischiefs of Faction, an independent political science blog featuring reflections on the party system. See more Mischiefs of Faction posts here.",
      "Folder": "Feedly",
      "Timestamp": "1482193744",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.678714Z"
}