{
  "id": "b9a7bdb38bc64d59afe84d30986817f9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/991033/trump-meets-the-pope-what-the-veils-really-mean/",
      "Title": "Why Ivanka and Melania Trump covered up for the Vatican but not in Saudi Arabia Quartz",
      "Selection": "Today (May 24), during the quick Roman stop of his first trip abroad as president, Donald Trump met with Pope Francis. With him were his wife Melania, his daughter Ivanka, and her husband, Jared Kushner.\n\nAll four dressed according to traditional Vatican etiquette, which demands that men wear dark suits and women wear black clothing that covers the shoulders and arms, most of the legs, and the cleavage. Additionally, women should wear a veil, which can be combined with another form of head covering. (There’s an exception for queens of Catholic countries, who enjoy the privilège du blanc, the privilege of white.)\n\nUnder Pope Francis, however, this strict dress code has been somewhat relaxed (link in Italian), according to Il Mio Papa, an Italian site dedicated to papal news. Most female politicians and high-profile women meeting with him have forgone the strict black attire and veil.\n\nThis made Melania and Ivanka Trump’s decision to embrace traditional dress a powerful political sign—especially considering they made the opposite choice when visiting Saudi Arabia few days earlier, by not wearing the headscarves customary in Islamic tradition.\n\nFrom an etiquette standpoint their choice in Riyadh was in fact perfectly fine. Though Saudi women have to follow the legal imposition (paywall) of wearing an abaya—a long black dress—and a headscarf, non-Muslim women are allowed to leave their heads uncovered.\n\nBut the Trumps’ clothing choices in both Riyadh and the Vatican nonetheless sent clear messages about the attitude of the US towards Islamic and Catholic values and tradition. By deciding to stick with old-school requirements in the Vatican (wearing veils) but not in Saudi Arabia, Melania and Ivanka showed the US is only willing to honor one of the two religions beyond the diktats of etiquette. This isn’t new with the Trumps, for that matter; it’s the same stand that Michelle Obama, Laura Bush, and Hillary Clinton—who all covered their heads for the pope, but not for the Saudis—took before them.\n\nIt is a clear message for Americans watching from home, most of all: Their leaders will pay homage to backward Catholic traditions. Backward Muslim traditions, not so much.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1495669539",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.670419Z"
}