{
  "id": "b9e661ea0da44a91a29aa79cfb51b4fd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/06/man-flies-18-million-miles-united/",
      "Title": "Meet the Man Who’s Flown 18 Million Miles on United The Points Guy",
      "Selection": "If you’ve ever flown over 100,000 miles in a single year, you’re in elite company. Over 200,000 miles and you’re definitely a top-tier road warrior. But how many people have flown over one million miles in a single year?\n\nTom Stuker has. Twice. And he’s on pace to do it again in 2017.\n\nUnited’s number-one flyer recently passed a major milestone when he reached over 18 million total miles — all on United flights. That’s not 18 million redeemable miles; that’s 18 million flown miles. As in “butt in seat” miles.\n\nUnited celebrated Tom Stuker’s 18 million flown miles at the Polaris lounge in Chicago today with his family and United employees.\nStuker spoke to The Points Guy as the airline prepared to celebrate his accomplishment with a gathering of his family and United employees at the Polaris lounge in Chicago (ORD) held earlier today.\n\n“My first United flight was 1970 or ’71,” he said. “It was my first commercial flight ever, from Chicago to San Antonio. We dropped about 500 feet at one point — no one was hurt but for a first-time flyer I was scared a little bit.”\n\nIn fact, Stuker said he had a fear of flying for the first 10 years he spent in the air. Eventually, he realized if it’s your time to go, it’s your time to go. “I used to get antsy if I had to fly for two weeks,” said Stuker. “Now I get antsy if I’m on the ground for two weeks.”\n\nWhile he’s never had a serious issue in the air, he’s experienced a few on-board incidents. “I’ve never been on a flight where the masks came down, but I’ve been on an aborted takeoff and an aborted landing,” he said. “I’ve been on three different flights where someone died. One of the guys, I was talking to him, then he went to sleep and never woke up.”\n\nStucker with United Vice President Praveen Sharma celebrating 18 million flown miles.\nHow does one end up flying 18 million miles? Stuker is an auto-industry sales and management consultant based in New Jersey, and his work takes him to many individual car dealerships around the world. He’s flown to Hawaii over 100 times and to Australia over 300 times. “I’ve probably seen more of Australia than 95% of Australians,” he said with a laugh.\n\nAfter flying so many miles on United, Stuker is likely the world’s utmost authority when it comes to the airline’s planes and seats. “The three-class 767 is without a doubt my favorite aircraft,” he said, while acknowledging it will soon be phased out in favor of two-cabin Polaris business. His preferred seat on the 767 is 1K, because “typically on an international flight, the pilot [off-duty rest seat] is in 2K with the drapes around him, so 1K feels like a private plane,” he explained. “You’ve got five people in first class so the stewardess gives you plenty of attention.”\n\nWhat about the food? His favorite three dishes on United — in no particular order — are the lobster mac and cheese (“It’s unbelievable, I love it!”), the cinnamon rolls they serve outside the US and the garlic bread. “One food I’m not liking is the salad,” Stuker confided. “They’re getting too fancy with the salad. Apples and grapes and pears. They’ve got everything in it but lettuce and tomatoes. I’m actually thinking of bringing my own.”\n\nBut eating on board depends on the timing of his flight. “Going to Australia, you’re taking off and its 1:30am New York time and I think I’ve had enough meals by 1:30 in the morning,” he said.\n\nStuker and his wife, Darlene. She travels with him multiple times a year.\nWhen Stuker isn’t traveling for work, he likes using his stash of United MileagePlus miles to take leisure trips with others.\n\n“I’m able to use my miles to take my friends and family to places around the world. I’ve taken my son around the world twice,” he said. And those trips aren’t lacking in amenities. “What most people consider a honeymoon trip, I take six times a year with my wife.”\n\nSpeaking of frequent flyer miles, just how many does he have? Stuker would prefer not to disclose an exact number, but he doesn’t use them solely for flights.\n\n“Obviously the best value in using your miles is for flying, but sometimes I’ll redeem for gift cards because there’s only so much flying I have time for outside of work. I use miles for cruises, hotels, rental cars, auctions — United has great auctions.”\n\nStuker is also involved in a cancer charity called Bailey’s Day in Albert, Australia, and donates his miles for the charity’s auctions.\n\nAs a road warrior — perhaps the road warrior — Stuker doesn’t focus on one single hotel chain as he does with his airline. But he still has plenty of annual hotel nights to earn elite status in multiple hotel loyalty programs.\n\n“Right now I’m a lifetime Diamond at Hilton, a lifetime Platinum at Marriott and almost a lifetime Globalist at Hyatt,” he said good-naturedly. “Though I think my streak of being Globalist at Hyatt is going to end this year because they raised it to 60 nights. But when I travel with my wife, I try to raise the bar a little more and stay at a Ritz-Carlton. I love the in-and-out properties where you have a swimming pool villa. When people ask what I like to do on vacation, I say ‘as little as possible.'”\n\nStuker’s accomplishments have become legendary over the years. He’s been covered in the The New York Times, along with ABC News, NBC News and many others. An entire Flyertalk thread is dedicated just to him and is now approaching its eighth year of posts.\n\nStuker prepares to hit the road again, on United as always.\nBut when we asked Stuker if he has any tips on flying, his thoughts centered around being aware and respectful of others. “Try to be more conscious of your surroundings,” he suggested. “If you’re on the phone before you depart, the last three rows of the plane don’t have to hear it. If there’s someone older with a bag, why don’t you get up and help them put it up?”\n\nThe same advice goes for dealing with the airline’s employees: “I’ve always found if you really treat people nice, then the service is out of this world. Like all of us, they like to be appreciated in their job.”\n\nWhat about all of United’s recent bad publicity? “When people say ‘I had a bad experience on United,’ well, I had 9,000 great experiences,” Stuker said. “999 out of 1,000 people who I talk to at Global Services, I rate them a 10 out of 10. These people are like a second family to me. I really appreciate how hard they work.”\n\nWith 18 million miles officially in the rearview mirror, Stuker shows no signs of slowing down — even after more than 45 years of flying.\n\n“The latest I should make 20 million miles is 2020. In all likelihood though, probably sometime in late 2019,” he said. “I really enjoy flying. I really do.”\n\nPhotos courtesy of United Airlines.\n",
      "Folder": "Feedly",
      "Timestamp": "1498364144",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.658444Z"
}