{
  "id": "ba9d2ef520dc48d1bf24701cfb18b15f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/reluctant-trump-voters-swung-the-election-heres-how-they-think-hes-doing/",
      "Title": "‘Reluctant’ Trump Voters Swung The Election. Here’s How They Think He’s Doing. FiveThirtyEight",
      "Selection": "Over the past 14 months, no group has made America more alive to its rebellious streak than the Trump voter. The visual trope of this number is cling-wrapped to our brains: red hats, stadium crowds, rippling flags, chanting.\n\nBut not every Donald Trump voter was quite so enthusiastic. While we’ve always known his core base was a loyal one, Trump made it to the White House thanks in no small part to a group of voters who didn’t necessarily like him but were willing to give him a chance. Nearly 20 percent of voters in the 2016 presidential election had an unfavorable view of both Trump and Hillary Clinton, according to exit polls, and Trump won that group 47 percent to 30 percent. That made the difference.\n\nAs Trump’s first-100-days milestone nears, his presidency so far marked by unusually low approval ratings, a Supreme Court victory and a failed Republican health care bill — it seems useful to check in with these reluctant Trump voters. They’re a group to watch as the 2018 midterms loom, a barometer by which to monitor a newly unstable political climate. Their support might mean the difference between a successful Trump presidency or a failed one, between the GOP holding or losing the House.\n\nWe can’t go back and find the voters who cast an unenthusiastic ballot for Trump.1 But FiveThirtyEight partnered with SurveyMonkey to survey more than 7,000 American adults during the first week of April and asked Trump voters how enthusiastic their vote for the president had been. (We gave respondents five levels of excitement to choose, from “very excited” to “not excited at all”.)2 About 15 percent of Trump voters said they weren’t excited to cast a ballot for him. This group differs demographically and has different policy priorities from the rest of the Trump cohort.\n\nWho are the reluctant Trump voters? Like most Trump supporters, they are overwhelmingly white — 85 percent — and middle age and older. Forty-three percent of reluctant Trumpers were 55 or older, as were 49 percent of other Trump voters.\n\nThe biggest difference between the two groups is education level: 37 percent of reluctant Trumpers had at least a college degree, while only 25 percent of other Trump supporters had a college or postgraduate degree. This enthusiasm gap for Trump among better-educated Trump voters partly explains why Republicans — most prominently the president — are keeping an eye on the special election today in Georgia’s 6th Congressional District, Republican Tom Price’s old seat. Georgia’s 6th has one of the highest levels of educational attainment in the country, and the race is tight, with Democratic newcomer Jon Ossoff making a strong showing in polls and fundraising.\n\nReluctant Trumpers are also less loyal to the Republican Party brand; when it comes to party identification, 75 percent of them said they are Republican or Republican-leaning, while 91 percent of other Trump voters called themselves Republican or Republican-leaning.\n\nBut as of right now, reluctant Trump voters approve of Trump, and not even reluctantly, though at nowhere near the same levels of other Trump voters: 74 percent of reluctant Trumpers approved of the president, while a whopping 97 percent of more enthusiastic Trump voters approved of him.\n\nDespite this general approval rating harmony among Trump voters, reluctant Trumpers prioritized issues slightly differently than other Trump voters did; they seem more moved by traditional Republican Party issues than the president’s law-and-order/build-the-wall-focused campaign promises. While a plurality of all Trump voters said the economy was the most important issue to them, reluctant Trump voters rated health care as their second priority — standard Republican talking points during the Obama years hammered away on the need to “repeal and replace Obamacare.” But the other Trump voters did not consider health care to be quite so important; it came in fourth on their list of priorities, after terrorism and immigration.\n\nGiven their interest in health care, reluctant Trump voters’ reactions to the failed Republican health care bill are of particular interest, and they were far less happy with how Trump handled the process than the president’s other supporters. A slim majority, 54 percent, of the reluctant Trump voters approved of Trump’s role in the health care process, compared with 88 percent of more enthusiastic Trump voters.\n\nReluctant Trump voters are more in line with the rest of Trump’s base on other issues. One thing reluctant Trump voters seem unwaveringly pleased by is the placement of Neil Gorsuch on the Supreme Court; 86 percent of them approved of the nomination; 96 percent of other Trump voters approved as well. Three-fourths of the reluctant voters think the investigation into collusion between the Trump campaign and Russia is a distraction; 89 percent of other Trump voters do.\n\nBut there are danger signs for Trump and the GOP: Nearly 80 percent of Trump’s enthusiastic voters said they approved of his budget proposal, which essentially serves as an outline of the White House’s priorities. Only about half of reluctant Trump voters approved of the budget. That should worry the administration — a sign that the group that pushed him over the finish line in November 2016 isn’t on board with parts of Trump’s agenda.\n\nMore worrying still: 15 percent of reluctant Trump voters said they would vote for the Democratic candidate in their district if the November 2018 elections for U.S. Congress were held today. Just 4 percent of other Trump voters said the same. With about 19 months to go until the midterms, the Republicans and the president are painfully aware that there can be only so many missteps before they lose their reputation with the skeptics.\n",
      "Folder": "Feedly",
      "Timestamp": "1492574913",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.684698Z"
}