{
  "id": "bab8fcd6a62343fdbe6d6882232b08f6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/733345/nobody-in-the-us-wants-to-pay-full-price-for-clothes-anymore/",
      "Title": "Nobody in the US wants to pay full price for clothes anymore Quartz",
      "Selection": "Times are getting desperate for a number of American clothing retailers. Department stores such as Macy’s continue to struggle. Specialty apparel stores including J.Crew and Gap are withering. Many can only find customers by discounting. Meanwhile, they’re losing shoppers to off-price stores selling goods that are permanently on sale.\n\nA July 14 report by research firm NPD Group found that 75% of US apparel purchases across all retail channels come from shoppers who also shop for clothing at off-price stores, such as Marshalls, TJ Maxx, and Ross. Put another way, if 100 people walk into a Macy’s, 75 of them are also off-price clothing shoppers. That means Macy’s and other US clothing retailers are vying directly for most of their customers with competitors who only sell at a discount.\n\n“Off-price retailers are resonating with fashion and cost-conscious consumers alike, and are stealing department store business for good reason,” Marshal Cohen, NPD’s chief industry analyst, said in the report. “Off-price is second only to the online channel in terms of growth rate.”\n\nNPD also found that visits to off-price retailers increased 4% in the year through April 2016, compared to the same period last year. During that time, half of those visits led to a purchase.\n\nMany department stores have created their own discount channels to capture these customers, though results have been mixed. While Nordstrom’s offshoot, Nordstrom Rack, has performed well, Saks Fifth Avenue’s and Bloomingdale’s outlets have had a harder time.\n\nThis proliferation of off-price retailers, as well as fast fashion, has also contributed to downward pricing pressure (paywall) that’s making clothes on the low end of retail ever cheaper.\n\nWhile the data on visits comes from NPD’s Shopper Insights Service, most of NPD’s data comes its Checkout Tracking service. According to Andy Mantis, the EVP of Checkout Tracking, it is based on receipts from tens of thousands of actual consumer purchases, allowing NPD to create a holistic view of consumer habits and their behavior across categories.\n\nOther Checkout Tracking data not included in the report shows that US consumers of all sorts, including buyers of high-end luxury goods, are selective on price and willing to visit different types of stores in search of deals.\n\n“We took a look at luxury retail buyers: people who are buying Prada, Dior, Louis Vuitton, higher-end Ralph Lauren,” Mantis says. “We found 71% of them were also buying something at Marshalls, TJ Maxx, Ross.” He adds that 30% also shopped at fast-fashion chains, and 23% at luxury outlet stores.\n\nMantis says the luxury customer is one that all clothing retailers should pay attention to. “They just give more of their wallet to apparel than non-luxury shoppers,” he explains, “which says to me, if they’re not just contributing at luxury retailers—they’re contributing across luxury, fast fashion, outlet—if you’re a retailer you really have to think of this group.”\n\nNow is a good time to be on the high end and low end of retail. It’s brutal in between.\n",
      "Folder": "Feedly",
      "Timestamp": "1469075826",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.731214Z"
}