{
  "id": "bb1003812e2c4cc19a6c1fec87dbe4ec",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2018/1/23/16905844/media-landscape-verizon-amazon-comcast-disney-fox-relationships-chart",
      "Title": "Here’s who owns everything in Big Media today Vox - All",
      "Selection": "It probably won’t look like this for long. \n \nThe media landscape used to be straightforward: Content companies — studios — made stuff — TV shows and movies — and sold it to pay TV distributors, who sold it to consumers. \n\nNow things are up for grabs: Netflix buys stuff from the studios, but it’s making its own stuff, too, and it’s selling it directly to consumers. That’s one of the reasons older media companies are trying to compete by consolidating. Disney, for example, recently completed its purchase of 21st Century Fox. Distributors like AT&T, which bought Time Warner last year, are becoming media companies, too.\n\nMeanwhile, giant tech companies like Google, Amazon, and Apple that used to be on the sidelines are getting closer and closer to the action. Apple’s newest TV strategy positions the company as a TV guide, a TV storefront selling services like HBO, and a TV creator that employs the likes of Steven Spielberg and Jennifer Anniston to make exclusive shows for Apple users.\n\nTo help sort this all out, we’ve created a diagram that organizes distributors, content companies and internet video companies by market cap — the value investors assign to the companies — and their main lines of business. \n\nHere’s what the Big Media universe currently looks like. We will update it periodically:\n\nThis article originally appeared on Recode.net.",
      "Folder": "Feedly",
      "Timestamp": "1561011797",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.364680Z"
}