{
  "id": "bb882ea89124433ca4db0ece6dd4226c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/804417/donald-trumps-lewd-remarks-about-women-are-the-epitome-of-rape-culture/",
      "Title": "Donald Trump’s video is exactly what we mean when we talk about rape culture Quartz",
      "Selection": "The video surfaced by the Washington Post, in which Donald Trump and television host Billy Bush discuss women in the most vile way is both horrifying and completely unsurprising. Women and their bodies are treated like objects: “she’s now got the big phony tits and everything” […] “nice legs, huh?” “oh, that’s good legs.” We’ve heard this from Trump before, but what’s new is the outright predation: “I’ve gotta use some Tic Tacs, just in case I start kissing her.”\n\n“Grab them by the pussy. You can do anything,” says Trump. He explains: when you are “a star” anything is allowed. That is the description of a sexual assault, coming out of the mouth of a man who is one election away from becoming the world’s most powerful president.\n\nThe video is damning in many ways, but almost as disturbing as Trump himself is the reaction of Bush and another man, who hasn’t been identified, heard in the tape.\n\nWhen we talk about rape culture, this is what we mean.\n\nThe scene is all too familiar: these men are a proxy for all of the men who have ever listened to this type of talk without discouraging it.\n\nThis laissez-faire attitude is what leaves a culture of aggression unchecked and makes the world unsafe for women. Because it’s not just talking: it’s our life. Whenever a woman questions her safety walking alone on a dark street, or when she wonders whether her clothes are too revealing, or when she has the instinct of lowering her gaze, it’s because of men like Donald Trump, who think and say the kind of things he said in this video, and those that stand idly by.\n\nAnd then, to add insult to the injury, is Trump’s first reaction: “this was locker-room banter, a private conversation that took place many years ago,” is the official comment.\n\nOthers, such as investor Anthony Scaramucci, have echoed this idea:\n\nNo one can excuse the statements but they weren't public.Think for a moment of your worst private moment exposed, then start your judgment.\n\n— Anthony Scaramucci (@Scaramucci) October 8, 2016\n\nIt’s a shameful attempt at normalizing a behavior that is appalling and justifying it as something it’s not—regular male camaraderie. All men do this, Trump’s explanation suggests, trying to impose a view of the world where his behavior is acceptable.\n\nBut it is not: the world is full of fathers, brothers, sons, friends, husbands and lovers—men who wouldn’t ever dream of talking about women with such rapacious vulgarity, and who stand up to men when they do.\n\n“This is nothing more than a distraction from the important issues we are facing today,” said Trump in a video statement.\n\nIn fact, this “distraction,” as he call it, may well be the end of his run.\n\nTrump’s values (or lack of thereof) embody a problem that is so much larger than this election. Normalizing aggression toward his female opponent is something we’ve now seen countless times. At this point, supporting Trump is reinforcing rape culture, full stop.\n\nThis last video finally turns this vote into a referendum on what is an acceptable behavior to expect from a man in power. For women and their allies, for anyone hoping that one day women will feel safe—no matter how dark the alley, or how short their skirt—this election has an outcome that’s as binary as they come: we win or we lose.\n",
      "Folder": "Feedly",
      "Timestamp": "1475961533",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.707745Z"
}