{
  "id": "bce6deb045174e508815ed4bfad720ab",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/the-republican-party-has-changed-dramatically-since-george-h-w-bush-ran-it/",
      "Title": "The Republican Party Has Changed Dramatically Since George H.W. Bush Ran It FiveThirtyEight",
      "Selection": "George H.W. Bush, whose death at 94 was announced on Friday by his family, was a hugely influential figure in the Republican Party: chairman of the Republican National Committee, vice president, president and father of another GOP president. But the GOP has changed dramatically since it nominated Bush for the presidency in 1988 — a fact reflected in the ex-president’s strained relationship with the GOP’s new standard-bearer, President Trump.\n\nSo, I think Bush’s death is another moment to highlight what my colleague Clare Malone described in the summer of 2016 as “The End Of A Republican Party.” Let’s run through some of the big shifts that have occurred within the GOP:\n\nThe GOP was once a more moderate party \n\nIdeology is complicated to measure. By some standards, the Republican Party has moved to the left. In a poll conducted last year, 42 percent of Republicans backed same-sex unions; it’s safe to assume that number was far lower during George H.W. Bush’s presidency. In 1992, one of South Carolina’s senators was Republican Strom Thurmond, who ran a 1948 presidential campaign featuring his opposition to civil rights for blacks. Today, one of South Carolina’s senators is Republican Tim Scott, who is African-American.\n\nBut by most other measures, the GOP is far more conservative than it used to be. The General Social Survey, for example, shows self-identified Republicans moving far more toward the “extremely conservative” end of its scale (as opposed to “extremely liberal”) over the past several decades.1\n\nPolitical scientists, using DW-Nominate scores,2 have concluded that the Republicans now in Congress are much further to the right of congressional Republicans in the 1970s and 1980s. And even anecdotally, figures like former House Speaker John Boehner, Ohio Gov. John Kasich and the late Arizona Sen. John McCain — considered solid conservatives in the George H.W. Bush era — found themselves cast as insufficiently right-wing by the party’s base in recent years.\n\nIn Bush’s era, Fox News did not exist. Deeply conservative billionaires Charles and David Koch and their allies had not created a huge network of right-wing groups that constitute basically an alternative political party. There was no tea party or House Freedom Caucus. Trump may be personally more conservative than Bush, but even if he weren’t, the forces that push a Republican president to the ideological right are stronger now than they were in the 1980s.\n\nBush himself famously signed a tax increase to help reduce the federal budget deficit, a move that angered the party’s conservative base. His two GOP successors (George W. Bush and Trump) never even really considered tax hikes, aware of the power of the party’s conservative coalition.\n\nThe GOP used to be more in line with the nation demographically\n\nTrump’s rallies include lots of older white people, as the stereotype goes. But that is the Republican Party of today. The country has become older, more diverse and more educated. The GOP, meanwhile, has grown even more disproportionately old. And while its voters grew more diverse along with the country through the 1980s (though at a bit of a lag), that shift stalled in the party in the 1990s. Same with education: The share of non-Hispanic white voters without a college degree fell throughout the 1950s, ’60s, ’70s and ’80s — in the electorate overall and the GOP. But beginning in the 1990s, it stopped falling among Republicans.\n\nIn 1992, according to the Pew Research Center, about 38 percent of registered voters who identified as Republicans were 50 years or older. By 2016, that number had grown to 58 percent. In 1992, 61 percent of Republicans were under 50, compared with 41 percent today.3\n\nRepublicans were once competitive on the coasts but weak in the South \n\nThe ideological and demographic shifts described above have corresponded with big changes in the GOP’s geographic coalition. In 1988, Bush won California — the sixth straight election in which the Republican presidential candidate carried the Golden State. Bush also won Connecticut, Delaware, Illinois, New Jersey and Vermont. The Republican caucus in the U.S. Senate from that era included two members from New Hampshire, two from Oregon and one from both Delaware and New York. There were zero Senate Republicans from Alabama, Arkansas, Georgia, Louisiana and Tennessee.\n\nAll but one of the 16 Senate seats I just described are now held by the opposite party that controlled them in 1992, as the GOP gained ground in the South but lost power on the coasts. Trump, reflecting the growing weakness of Republicans in California, lost there in 2016 by 30 percentage points. Bush lost West Virginia in 1988 by 5 percentage points. Trump’s 42-point win in West Virginia in 2016 was his second-biggest margin in any state.4\n\nIn short, today’s Republican Party is centered in the South and almost completely out of power on the West Coast.\n\nLet me not overstate the changes in the Grand Old Party. It still loves to cut taxes, like it did in the George H.W. Bush era. It’s still overwhelmingly white. The majority of its voters are still whites without college degrees. White evangelical Protestants are still about a third of the party. It still deploys negative racial stereotypes about non-white Americans to appeal to white voters. (Remember the Willie Horton ad of the 1988 Bush campaign?)\n\nBut the changes highlighted here have dramatically altered the power dynamics in Washington. Presidents Nixon, Reagan and George H.W. Bush always had to share power with Democrats, who controlled the House from 1949 to 1994.5 But since the GOP won the House in 1994, the party has held the chamber for all but four years.6 (They won’t be in control in 2019, of course.)\n\nWhen George H.W. Bush won 53 percent of the national popular vote in 1988, it was not that remarkable. Richard Nixon had won more than 60 percent in 1972, and Ronald Reagan breached 50 percent in both 1980 and 1984. But 1988 was a watershed moment for the Republican Party — it was about to start a measurable decline in terms of its national standing. In the seven presidential elections since then (including Bush’s 1992 defeat), Republicans have won more votes nationally than Democrats just once (2004).\n\nThe tensions between Trump and the Bush family, and between Trump and McCain, speak to this broader narrative. Trump is a different kind of Republican — and he is changing the party in his image in ways they don’t like. But he is also the product of a different Republican Party than the one that the Bushes and McCain ascended in. Trump got the GOP nomination in some ways by embracing what the Republican Party had become, not what the Bushes wished it were.\n\nCORRECTION (Dec. 1, 2018, 1:30 p.m.): An earlier version of this article said President Trump’s largest margin of victory in any state in the 2016 election was in West Virginia. It was in Wyoming.\n",
      "Folder": "Feedly",
      "Timestamp": "1543691763",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.449002Z"
}