{
  "id": "beafbcc02421488cadda61fd85659419",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/polyarchy/2016/11/9/13576608/how-will-trump-govern",
      "Title": "How will Donald Trump govern Vox - All",
      "Selection": "Will Trump try to remake the Republican Party? Probably. Will he succeed without a fight? Unlikely.\n\nIn the Republican primaries, Donald Trump ran as a different kind of Republican. He went hard right on immigration, race, and crime issues. But he tacked to the left on economic issues, defending Social Security, and railing against trade deals. He also took a cowboy isolationist view of foreign policy far out of step with Republican wisdom.\n\nIn the general election, Trump kept some of his distinctiveness but seemed to morph more into a generic Republican, hammering on more traditional Republican themes and trying most of all to make it about how President Obama had been a disaster and Hillary Clinton would be a disaster.\n\nBut now he doesn't have anybody to run against. Now he's president. And now he has to decide what he wants to do. Does he want to remake the Republican Party, as he seemed to want to do in the primaries? Or does he want to make nice with the Republican Party, as he started to do in the general election?\n\nMy strong hunch is that he will do the first: try to remake the Republican Party. The man thrives on conflict. And he has a bunch of scores to settle now. But let's explore both possibilities.\n\nScenario 1: Trump tries to remake the Republican Party\n\nPerhaps now that Trump has won the presidency, he needs the thrill of conflict again. If so, the obvious place to turn is to exact revenge on all the Republicans who didn't support him. That includes not only the NeverTrump establishment figures but also, and perhaps especially, Paul Ryan, who has been his main Republican foil.\n\nHere, Trump's initial play of moving right on immigration, race, and crime issues while moving left on economic issues and going isolationist on foreign policy is perfectly designed to provoke a conflict with the Republican establishment. Trump has not run on traditional GOP themes of cutting spending and limiting government. Note, for example, that to the extent that he laid out an actual priority in his acceptance speech, it was this:\n\nWe are going to fix our inner cities and rebuild our highways, bridges, tunnels, airports, schools, hospitals. We're going to rebuild our infrastructure, which will become, by the way, second to none, and we will put millions of our people to work as we rebuild it.\n\nWhich actually sounds a helluva lot like the Obama stimulus plan, when you come to think of it. This would certainly not be Ryan's top priority.\n\nBut Trump now has the mandate. And if he moves first, it's hard to imagine Ryan announcing that now is not the time for a massive infrastructure spending bill if this is what Trump says he wants to do first.\n\nIf Trump's core motivating force is to win and settle grudges, the biggest grudges he wants to settle now are probably with the Republican Party establishment that tried to stop him. To the extent that this is what motivates him, his policy choices might be guided primarily by which policies could extract the maximum submissive discomfort from the party establishment. Trump may also see himself as a transformative figure, who wants to shake things up for the sake of shaking things up.\n\nAlso, from what he's shown, perhaps Trump's core policy orientation, to the extent that he has one, is some version of a New Deal Southern Democrat, willing to use government to do big things that help out the middle class but also sensitive to the white identity politics of his core constituents and willing to play the race card when necessary.\n\nUnder this approach, the big question is how Republicans in Congress would react.\n\nWould they go along with him because of his perceived popularity? Or would they oppose him because of his deviations from conservative principle? Just ask Jimmy Carter in '77 or Bill Clinton in '93 whether unified control of government means your congressional delegation rolls over and passes your agenda. Then think about Ben Sasse, Mike Lee, Jeff Flake, John McCain, Rob Portman. Are these folks really going to go along with a Trump agenda? They're all popular in their home states and appear care deeply about policy and principles.\n\nAs both Carter and Clinton quickly learned, members of Congress have ideas of their own. And a majority congressional party is very rarely a unified party. It doesn't take many defections within the party to stall a president's agenda.\n\nScenario 2: Trump doesn't try to remake the Republican Party\n\nAlternatively, Trump may decide he's just happy being president, and mostly happy to let the Republican caucus in Congress direct policy and give him bills to sign, as long as they pay him due respect and kiss the ring. He finds policy boring. In this case, he'll mostly sign whatever bills the Republican Congress produces, and content himself with foreign affairs.\n\nIf so, there's no executive-legislative conflict.\n\nBut even under this scenario, it's not clear what the Republican Congress agrees on. The House GOP caucus was divided enough last year to oust its speaker, and the divisions still run deep. When the Republican Party had Obama as the unifying villain, it was easy to keep everyone together. But now there is no more Obama in the White House. There is no Clinton in the White House. Now, if Republicans vote to repeal Obamacare, they might actually repeal Obamacare. And if they don't have a replacement for it, they're going to have a lot of mad-as-hell voters to deal with.\n\nThe problem is there's no agreement within the party on what to do about health care. And as Democrats learned repeatedly, putting together a health care reform bill is a very, very difficult thing to do. Once you open it up, everybody wants a piece of it. And everybody has different ideas.\n\nThis is the case with many issues. It's always easier to oppose than it is to propose.\n\nEither way, chaos lies ahead\n\nMy hunch is that the first scenario is more likely. From everything we know about Donald Trump's temperament, he is thin-skinned and wants to settle scores. He sees Paul Ryan especially as somebody to take down. Trump seems to care very little about policy specifics, but he has a general nationalist-populist orientation and seems to want to prove something.\n\nRemember how much time he spent going after fellow Republicans even after he won the nomination. He seems to relish confrontation.\n\nFrom the beginning, Trump has appeared to be a potential realigning political figure. He has never been a typical Republican, cutting against many, many party orthodoxies. In his mind, he is a transformative figure who triumphs in Lord of the Flies Washington, DC, and finally proves himself worthy. He loves making deals, and perhaps the more unexpected and creative, the better. Who knows — he might try to reach out to Bernie Sanders after all, just to keep everyone guessing.\n\nIf he rescrambles the party coalitions and moves us past the current gridlock into a new party system, some good might come out of his presidency yet. Both parties are long overdue for a crack-up.\n\nCertainly, there are many more dark scenarios, like the one my colleague Yascha Mounk laid out here, in which Trump abuses the powers of the executive branch and becomes a strongman autocrat who dares Congress to stop him as he dismantles democratic norms, and Congress rolls over out of fear.\n\nFor now, I'll hold out hope that there are enough institutionalists left in Congress who would use their powers to stop him should he trash American democratic norms. And that when faced with such an existential threat, the media would finally stand up for itself.\n\nMaybe this is a false hope. The 2016 election has been supremely discouraging on this front. Still, we were all operating on the assumption that Trump couldn't possibly win. Now that he is about to be president, we are closer to the long-feared precipice. To quote Samuel Johnson, \"Depend upon it, sir, when a man knows he is to be hanged in a fortnight, it concentrates his mind wonderfully.\"\n\nBut the really scary thing is we don't know. Trump the candidate has been such a cipher, changing his policies and his moods to keep everyone guessing. All this suggests that a Trump presidency will be full of many surprises, too.\n\nYet the one constant seems to be that he can't resist a fight. To think he'll be a generic Republican who gets along with a Republican leadership in Congress, which in turn gets along with itself, seems the most unlikely of scenarios. But then again, the man is full of surprises.\n\nThis post is part of Polyarchy, an independent blog produced by the political reform program at New America, a Washington think tank devoted to developing new ideas and new voices. See more Polyarchy posts here.",
      "Folder": "Feedly",
      "Timestamp": "1478743143",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.756489Z"
}