{
  "id": "bf07f5aaa1a64f088ea58d34f3c5fb4b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://frequentmiler.boardingarea.com/2017/09/14/anyone-want-40-amazon-fire-8-tablets/",
      "Title": "Can I interest you in 40 Amazon Fire tablets Frequent Miler",
      "Selection": "Over the past few days, many blogs have covered a fire sale of sorts on the Amazon Fire tablets. Through a combination of being an Amazon Prime member and using at least 1 Amex Membership Rewards point, you can get a solid deal: an Amazon Fire 7 Tablet for $15 each or the Amazon Fire 8 Tablet for $25 each. Since those tablets normally sell for $50 / $80 respectively, this is a solid deal — really, just about any Android device with a 12 hour battery life and a mircoSD slot would be a deal at that price. The deal is limited to 5 per account, but Mark Ostermann at Miles to Memories reported yesterday that it is 5 per color. With the Fire 7 and Fire 8 coming in 4 colors each, that means you can theoretically buy 20 of each tablet, or 40 total tablets for $800 plus tax. I wouldn’t go quite that wild, but if you’re interested in a couple as gifts and maybe to resell locally, here’s how to do it.\n\nStep 1: Start at JetBlue\n\nYou should be able to earn 3 JetBlue TrueBlue points per dollar at Amazon on these purchases. Click here to go to JetBlue and get your link. Alternatively, some have said that Ibotta may be offering 5% back. I haven’t used Ibotta in a long time, so you’ll have to check there on your own. You could see our guide to Extreme Stacking Amazon and maybe there are some other options. If neither JetBlue miles nor Ibotta appeal to you, feel free to use our affiliate links to these tablets below with our thanks.\n\nStep 2: Add Fire to your cart\n\nThe following are our affiliate links to each color:\n\nFire 7 BlackFire 7 YellowFire 7 BlueFire 7 Red\n\nFire 8 BlackFire 8 YellowFire 8 BlueFire 8 Red\n\nI don’t believe you can mix and match Fire 7 and Fire 8 in a single Amazon order, but you can definitely mix and match colors of the same model. See below for screen shots of an order mixing yellow and red Fire 8’s.\n\nStep 3: De-register the device from your account\n\nAfter adding the Fire to your cart, there is the in-between step before proceeding to checkout. You can check the box to mark the tablet(s) as a gift here (and you should).\n\nThat’s important because if you don’t do it, the tablets will be registered to your Amazon account. If you’re not planning to keep them, you don’t want that. When you click the link that says “Why is this important?”, it explains:\n\nNote that if you forget to do this, Jen J. in our Frequent Miler Insiders Facebook group reports that chat support can de-register them for you after the fact. I forgot to do this last night when I was ordering and I chatted with support, but since my order had not yet shipped they weren’t yet able to help me with this yet.\n\nStep 4: Change your payment method to use Membership Rewards points (before you add a promo code)\n\nYou must next choose a payment method that will allow you to pay in part with Membership Rewards points. If your default payment method is not a Membership Rewards card, change your payment method before you input any promo codes (some have reported errors when inputting the code before using any points). After changing the payment method, you can choose how much you want to pay in points. You can choose as little as $0.01 (1 Membership Rewards point) to get the full discount. Then, enter code FIRE7TAB for the Fire 7 or code FIRE8TAB for the Fire 8 and your total should come down to $15 each for Fire 7’s or $25 each for Fire 8’s.\n\nIn my case, the total for five Fire 8 tablets comes to $124.95 before tax or $134.94 with tax.\n\nCan you stack it with a gift card?\n\nYou sure can. I don’t know if there is a certain amount that must be paid with your credit card, but I do know that you can apply a gift card. I just bought a $25 Amazon gift card in the MileagePlus X app to test this. I added it as a payment method (still choosing a Membership Rewards card and at least 1 point for payment).\n\nAs you can see, the $25 gift card also applied to my payment.\n\nCan it stack with a snack?\n\nYou betcha. Doctor of Credit posted a few weeks ago about a free snack for Prime members with an order of $25 or more. I was only able to use the code once, but I got a free munchie. See his post for how you can, too. I grabbed the Happy Belly Yogurt trail mix. I’ll let ya know if it makes me happy. It was $8.80 when I got it and it cost me nothing.\n\nCan it stack with vitamins?\n\nThat’s affirmative. If you are healthier than I am, you might rather choose to get some free vitamins worth up to about $25 instead of $8.80 trail mix. See this Doctor of Credit post for details on that.\n\nBut what are you going to do with 40 Fire tablets?\n\nThe short answer is this: I didn’t buy 40 of them. However, I certainly did buy more than 5. I’m sure that a couple will become gifts — definitely a more generous-looking gift than the $15-$25 we spent on them. Many of them will probably be resold — mostly locally, via Craigslist/LetGo/Facebook/etc. I figure it shouldn’t be too hard to double on these (selling for $30/$50) as the holidays approach. I haven’t even looked at eBay these past few days — I’m sure the resale market is saturated beyond imagination at the moment. However, these are cheap enough that I don’t mind floating the money for a couple of months. As we get closer to the holidays, there will surely be some people who are happy to save a few bucks and pay a few more than I did. It’s a win-win. At these prices, they certainly wouldn’t be a bad donation to a local school / charitable organization / local fundraiser / etc, so even if I can’t sell them all, I’ll at least donate the yellow ones a couple of them. I have no doubt that each tablet I’ve ordered will find a home somewhere.\n\nThanks to Jen J for posting this deal in the Frequent Miler Insiders group yesterday and a hat tip to Mark Ostermann for noting that the limit is for each color.\n\n \n\nEarn Miles Without Flying: START HERE\t\n\nThe post Can I interest you in 40 Amazon Fire tablets? appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1505432186",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.632987Z"
}