{
  "id": "bfbaf709f73343fe8f2c48d7f3eec46f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1045315/a-busy-subway-booth-in-cairo-is-offering-free-islamic-advice-to-beat-extremism/",
      "Title": "A busy subway booth in Cairo is offering free Islamic advice to beat extremism Quartz",
      "Selection": "Are you in Cairo and concerned about what Islamic religious edict to follow in a given situation? Is making, wearing, and selling fake clothing brands acceptable in Islam (halal) or forbidden (haram)? Are you having a bad day and want someone to talk to? Well, worry no more.\n\nEgypt’s top Islamic authority has set up a booth in the capital’s busy al-Shohada subway station in a bid to offer commuters religious advice, or fatwas. Al-Azhar, Egypt’s oldest university and Sunni Islam’s most prestigious institution of higher learning, says the move is part of an effort to counter extremism, correct misinterpretations of Islam, and discuss daily challenges affecting Muslims.\n\nThe fatwa kiosk is open to the public between 9 am and 8 pm every day of the week, except during the Friday weekend. The sheikhs manning the booth say they have discussed issues relating to marriage, inheritance, and divorce, besides providing guidance on setting up businesses and the collection and payment of interest, or usury.\n\n“The best thing you can do for someone is lend them a willing ear when they are troubled,” Sheikh Ahmed Ramzy El Saber, told Cairo Scene. “People are extremely busy, they have places to be, things to do, and mouths to feed. Therefore, we thought that we should go to them, instead of have them spend their valuable time looking for us.”\n\nThe fatwa kiosk comes at a time when the north African nation is in a state of emergency following twin church attacks that killed at least 45 people in April while facing an insurgency in the restive Sinai Peninsula. Young people, disaffected by economic stagnation are increasingly turning to violence and volunteering with Islamic State and al-Qaeda.\n\nAl-Azhar clerics answers a womans’ question inside a Fatwa Kiosk, at the Al Shohada’a metro station, in Cairo.\n\nThe move towards extremism has worried both the government and the imams at Al-Azhar, especially as more young people turn online to connect with jihadists and get radicalized. Last year, while presiding over the security council, Egypt’s government invited Microsoft to help it and other governments confront violent extremism. Al-Azhar also created a portal (link in Arabic) to counter erroneous messages about Islam propagated by terrorist groups online.\n\nBut the institution has itself clashed with the government on how best to institute theological reforms within the Islamic religion. President Abdel Fattah el-Sisi has positioned himself as a secular leader, in contrast to the Muslim Brotherhood-backed leader Mohamed Morsi, whom he ousted in 2013.\n\nThe decision to erect the booths have also sparked criticism, with some saying that it encroaches on personal liberties and brings religion into public spaces. And in a country with a 10% Christian population, some have decried the idea while other have called for Coptic priests to be allowed to set up booths in subways too. “This is not its place at all,” said Beshoy Mikhail, a 24-year-old Coptic Christian, told the Associated Press. “I am completely against the idea.”\n\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.\n",
      "Folder": "Feedly",
      "Timestamp": "1501777068",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.564199Z"
}