{
  "id": "c012b997209a48febc0600c8b5289576",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://frequentmiler.boardingarea.com/2018/02/05/best-options-for-domestic-first-class-awards/",
      "Title": "Best options for domestic first class awards Frequent Miler",
      "Selection": "Domestic first class is nicer than coach, but, in most cases, it’s hardly something to write home about.  Usually you’ll simply get a bigger seat and a few snacks and drinks, or a meal if you’re lucky.  If you’re really lucky, you might find yourself on an internationally configured aircraft flying a domestic route.  On these you’ll generally find large business class seats with electronic controls to adjust the recline all the way to flat if you’d like.  Additionally, the big three airlines (AA, Delta, United) have rolled out premium business class seating on a number of their transcontinental routes (LAX to JFK, for example).  Of course, they have also rolled out higher award prices for those transcon business class seats.\n\nIf you’d like to fly first class (who wouldn’t?), it is often possible to pay fewer miles by booking with foreign carrier miles.  Below you’ll find domestic business/first class award prices for each of the big three, along with the best options for using foreign miles, and quick tips for how to get those miles.\n\nKeep in mind that in all cases you’ll have to find saver level award space on the airline you want to fly before you can book that flight with a partner airline’s miles.\n\nFly AA Domestic Business or First Class\n\nAA premium transcon\n\nAmerican Airlines charges 25K one-way for 2-cabin first class, or 32.5K one-way business class.  Here are the best alternatives:\n\nJAL (Japan Airlines Mileage Bank): 32K to 42K round-trip (or one-way) for flights totaling 4,000 miles or less.\n\nCathay Pacific Asia Miles: 30K to 50K round-trip depending upon the length of the flight (use this online calculator to find the price).\n\nEtihad Guest: 25K one-way for business / first class. 32.5K one-way for “Premium” (note: I’m not sure if premium in this case means transcon business class or 3 cabin first class. My guess is the latter). Etihad’s award chart for flying AA can be found here.\n\nBritish Airways Avios: 15K one-way for short (up to 1,150 miles) direct flights.\n\nMy take: For round trip travel, JAL and Cathay Pacific offer great award prices. JAL allows booking AA awards directly online. Cathay allows making an award request online, but the award is confirmed offline.  Overall, Cathay may be the best choice despite the more cumbersome award booking procedure because their miles are easy to get.\n\nHow to get the miles:\n\nAA: Sign up for Citi AA cards or Barclaycard AA cards; or transfer from SPG/Marriott.\n\nJAL: Transfer from SPG.\n\nCathay Pacific: Sign up for Cathay credit card; or transfer from Citi ThankYou Rewards, Amex Membership Rewards, or SPG.\n\nEtihad Guest: Transfer from Citi ThankYou Rewards, Amex Membership Rewards, or SPG.\n\nBritish Airways: Sign up for the Chase British Airways credit card; or transfer from Amex Membership Rewards, Chase Ultimate Rewards, or SPG/Marriott.\n\nSee also: Top 10 shortcuts to earning SPG points; Amassing Membership Rewards; Amassing Ultimate Rewards.\n\nBooking Tip for booking AA with JAL miles:\n\nJAL’s Mileage Bank program has a distance based award chart.  With most domestic flights, JAL requires only 32,000 to 42,000 miles to fly business class or two-cabin first class on American Airlines or Alaska Airlines.  Longer flights such as LAX to JFK roundtrip exceed the 4,000 mile sweetspot, but you could fly LAX to JFK then return as far as Dallas (for example) in first or business class for as few as 42,000 miles. You can search for award availability online through JAL’s site, but you must sign up for a free account first.\n\nFly Delta Domestic Business or First Class\n\nDelta premium transcon\n\nDelta no longer publishes an award chart, so the best you can do to find their award pricing is use Delta’s award calendar to try to find the best rates.   At the time of this writing I’ve found that Delta domestic first class and business class awards range from 17.5K to 53K one-way.  Here are the best alternatives:\n\nVirgin Atlantic: 25K one-way for direct flights (if a flight requires multiple segments, the award price is higher).  See this post for tips on booking Delta awards with Virgin Atlantic awards.\n\nKorean Air: 45K round-trip.  See this post for tips on booking Delta awards with Korean Air miles.\n\nMy take: For round trip travel Korean Air has terrific prices, but their online booking tool is a challenge to use.  They also have rules against booking awards for anyone but family members and you have to prove that they’re really in your family.  Virgin Atlantic’s website is a bit buggy, but it’s much easier to use than Korean’s and it includes a useful award calendar.  Plus, Virgin Atlantic miles are much easier to collect than Korean Air miles.  And, best of all, Virgin Atlantic sometimes finds award space on Delta that other Delta partners cannot see.  If you’re planning to fly direct, the slight premium Virgin Atlantic charges over Korean Air is, in my opinion, completely worth it.\n\nHow to get the miles:\n\nDelta: Sign up for Delta credit cards; or transfer from Amex Membership Rewards or SPG/Marriott.\n\nVirgin Atlantic: Sign up for the Virgin Atlantic card; or transfer from Amex Membership Rewards, Chase Ultimate Rewards, Citi ThankYou Rewards, or SPG/Marriott.\n\nKorean Air: Sign up for Korean Air credit cards; or transfer from Chase Ultimate Rewards, or SPG.\n\nSee also: Top 10 shortcuts to earning SPG points; Amassing Membership Rewards; Amassing Ultimate Rewards.\n\nTip for booking Delta awards with Virgin Atlantic miles:\n\nVirgin Atlantic’s website award booking tool auto-completes your typing in the leftmost box titled “I’m flying From”, but not the one on the right titled “To” except for select Virgin Atlantic airport destinations.  An easy workaround is to click the little map pin icon to search by country or alphabetically.  Another workaround is to type your destination into the “from” box and copy and paste the result into the “To” box.  Most, if not all, US airports can be found this way, but many international destinations that Delta serves are not available online.  For these, you have to call Virgin Atlantic to find and book awards.\n\nFly United Domestic Business or First Class\n\nUnited premium transcon\n\nUnited charges 25K one-way 2-cabin first class, or 35K one-way premium transcon business class.  Here are the best alternatives:\n\nLufthansa Miles & More: 17K one-way\n\nSingapore: 20K one-way\n\nAeroplan (Air Canada): 25K one-way\n\nMy take: Both Lufthansa and Singapore require calling to book award flights on United.  I’ve never booked with Lufthansa miles, but I’ve done so a number of times with Singapore.  For me, they’ve always answered quickly and were a pleasure to deal with.  Since Singapore miles are much easier to get than Lufthansa miles, I think that Singapore is worth the slight premium in award costs.\n\nHow to get the miles:\n\nUnited: Sign up for United credit cards; or transfer from Chase Ultimate Rewards or SPG/Marriott.\n\nLufthansa: Sign up for the Miles & More credit card; or transfer from SPG.\n\nSingapore: Transfer from Amex Membership Rewards, Chase Ultimate Rewards, Citi ThankYou Rewards, or SPG.\n\nAeroplan: Transfer from Amex Membership Rewards or SPG.\n\nSee also: Top 10 shortcuts to earning SPG points; Amassing Membership Rewards; Amassing Ultimate Rewards.\n\nUnited Booking Tip:\n\nBefore trying to book with a foreign carrier’s miles (especially when they don’t let you book United flights online), look for business/first class award space on United.com without logging in.  Look for First Saver Award space (or Business Saver Award space on a 3 cabin flight) that looks like this:\n\nFly Alaska First Class\n\nThis section is coming soon.  For now note that you can book Alaska flights with partners such as AA, Cathay Pacific, and Korean Air.\n\n \n\nEarn Miles Without Flying: START HERE\t\n\nThe post Best options for domestic first class awards appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1517857486",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.499652Z"
}