{
  "id": "c0b02da981ee428eb15da7c6bbe62a60",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://food52.com/blog/14550-simple-scallion-pancakes-made-at-home",
      "Title": "Simple Scallion Pancakes, Made at Home Food52",
      "Selection": "When I moved away to college, scallion pancakes were one of the first foods I learned to make. My parents used to always laugh when I ordered this dish in restaurants (in China, they’re eaten as street food but not at fine dining restaurants).\n\nTo them, it gave away the fact that I grew up in America, with a palate more American than Chinese, but I didn’t care: There was something about the fragrance and flakiness of simple scallion pancakes that had me craving them over and over again. \n\nThis classic dish is wildly popular (and not just in China!) and, like any traditional food, has many variations per region and family. \n\nI sometimes make it with a thin layer of egg and I occasionally whip up a dipping sauce. Most often, though, I make the simplest version: laminated dough with scallions and plenty of salt, no dipping sauce needed. \n\nScallions provide the main flavor, which the repeated lamination allows to permeate each pancake in each flaky layer. \n\nThere are so many ways to form this dough, but I find that the key to super flaky pancakes is the numerous repetitions of rolling and folding, which ensures that there is oil and scallions in every layer.\n\nIt’s going to get messy; once you brush on a layer of oil, twist the dough into a coiled shape, and roll it out flat again, the oil will ooze out. But that’s okay. Constantly adding a thin layer of oil and a scattering of scallions is what creates the signature flaky layers of the pancake. \n\n  \n\nI use a cast-iron pan, but you can also use a nonstick pan. I’ve tried cooking the pancakes at various heats, but the one that works best is, somewhat surprisingly, low.\n\nHeat a pan with a thin layer of oil until it starts to shimmer, then add the pancake and let it slowly heat up, until all the layers are crisped up. At higher heat, you will get a nice outer layer, but the inner layers may not be cooked as well. \n\nAll that being said, this recipe is very forgiving: Have fun with it and don’t forget to laminate repeatedly! \n\nSimple Scallion Pancakes\n\nMakes two 8-inch pancakes\n\n2 cups flour1 cup boiling water1/4 cup sesame oil (approximately)2 bunches scallions, green parts only, finely slicedSalt, for sprinkling\nVegetable oil, for frying\n\nSee the full recipe (and save and print it) here.\n\nPhotos by Betty Liu\n",
      "Folder": "Feedly",
      "Timestamp": "1446097590",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.860774Z"
}