{
  "id": "c0cbd2fee4f642399e2793772185988b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/news/capital-one-savor-postmates-perk/",
      "Title": "Why My Friend Immediately Applied for the Capital One Savor Card After Learning of This Valuable New Card Perk Million Mile Secrets",
      "Selection": "If you value convenience, now might be the perfect time to apply for the Capital One® Savor® Cash Rewards Credit Card.  Capital One recently added free unlimited membership with Postmates to the card from now until December 2019.  A Postmates Unlimited subscription typically costs ~$10 per month, so this new perk is worth $120 if you use it over the next year.\n\nMy friend loves Postmates and had already been paying for a monthly subscription to save on delivery fees.  When he learned the subscription perk was added to the Capital One Savor card, he applied immediately!  He’ll save money on something he was already paying for.  Besides the subscription savings, the card also has a valuable sign-up bonus and no annual fee for the first year!\n\nSave Money on Delivery Fees by Applying for the Capital One Savor Card to Get a Free Postmates Unlimited Subscription Through the End of 2019\n\nPostmates isn’t available everywhere, but the delivery service is in most major cities in the US, including Chicago, Denver, Los Angeles, New York City, San Francisco, and several others.\n\nYou can get just about anything delivered through Postmates, including alcohol, groceries, takeout, or even essential items from a convenience store.  And with a Postmates Unlimited subscription, delivery fees are waived on all orders above $15.  Plus, you don’t have to pay for surge pricing during peak delivery times.\n\nApply for the Capital One Savor Cash Rewards Card\n\nApply Here:    Capital One® Savor® Cash Rewards Credit Card\n\nOur Review of the Capital One Savor Cash Rewards Card\n\nWhen you apply for the Capital One Savor card, you’ll earn $500 cash back after spending $3,000 on purchases within the first 3 months of account opening.\n\nIn addition to the bonus, you’ll earn bonus points in certain categories:\n\n4% cash back on dining\n\n4% cash back on entertainment\n\n2% cash back at grocery stores\n\nYou’ll earn 1% cash back on all other purchases.  And there are NO caps on how much bonus cash back you can earn!  Plus, the card’s $95 annual fee is waived the first year.\n\nWhat do you think of the new Postmates perk?  Does it make the Capital One Savor a must-have for your wallet?  Let me know in the comments below!\n",
      "Folder": "Feedly",
      "Timestamp": "1545028041",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.442838Z"
}