{
  "id": "c16d4de8c97e4e45b7ae08cc53042579",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://quartzy.qz.com/1133083/basking-in-the-beethoven-like-genius-of-kanye-west/",
      "Title": "Basking in the Beethoven-like genius of Kanye West Quartz",
      "Selection": "Cole Cuchna thinks you should spend more time with the art you truly love. He is certainly doing just that.\n\nThis week, Cuchna will release the last episode of the second season of his brilliant podcast Dissect, a show in which he takes a deep dive into the musical and thematic content of his favorite albums. Each 30-45 minute episode is dedicated to one song on an album. This season took on Kanye West’s 2010 hip-hop classic My Beautiful Dark Twisted Fantasy.\n\nI asked Cuchna, who studied music composition, why he devotes so much time to just one piece of art, when there is so much variety out there to behold. In part, he’s resisting “falling victim to how we consume things now,” he says. “I found myself scrolling on my phone endlessly at night and feeling kind empty afterwards.” If an album or a piece of art resonates with you, Cuchna says, it’s worth taking the time to linger with it, exploring why it makes you feel that way. The podcast is a way for him to get back in the mindset of deep consideration.\n\nCuchna’s analysis of My Beautiful Dark Twisted Fantasy is revelatory. In his more than 10-hour analysis of the album, Cuchna reveals how much more there is to the album than initially meets the ear. The surprises begin in Twisted Fantasy’s very first words, recited by the then relatively unknown rapper Nikki Minaj:\n\nYou might think you’ve peeped the scene\nYou haven’t, the real one’s far too mean\nThe watered down one, the one you know\nWas made up centuries ago\nThey made it sound all wack and corny\nYes, it’s awful, blasted boring\nTwisted fictions, sick addictions\nWell, gather ’round children, zip it, listen\n\nAlthough I was a fan of the album, I never appreciated the depth of these particular lyrics. On Dissect, Cuchna explains they are a reference to the British children’s author Roahl Dahl’s scary version of the Cinderella story. Kanye is announcing that his album is not about the fairy-tale version of becoming rich and famous, but the “dark twisted” one.\n\nThe record, Cuchna says, is about Kanye’s life spiraling out of control after his mother’s death and the fallout from his jumping on stage to interrupt Taylor Swift’s acceptance speech at the 2009 MTV Video Music Awards. The album ends with the song “Lost in the World,” which reflects West’s state of mind at the time.\n\nA sense of resolve\n\nEach podcast episode is rife with examples of West’s compositional virtuosity that would be difficult to appreciate unless, like Cuchna, you’ve spent months repeatedly listening to the album. For example, he points out that the song “Devil in a New Dress” is tonally ambiguous, with alternating minor and major chords (E major and D sharp minor) that never resolve to the “home” chord of the song (G sharp minor). This musical instability reflects the erratic relationship West describes in the song. It is only at the beginning of the next song on the album, “Runaway,” that we hear a G sharp minor chord, and feel some resolution.\n\nCuchna is rapturous when he talks about “Runaway.” He calls it the greatest song on one of the greatest albums every made. We learn that West’s inspiration for the song was Hungarian composer Gyorgy Ligeti’s Musica Ricercata II, a piece highlighted in the movie Eyes Wide Shut. Listen to the first notes of each song and it is unmistakable.\n\nCuchna also highlights how the beginning of the song features a clever rhythmic trick. We assume the piano notes at the start are on the first and third beats of a traditional 4/4 time signature, but then the bass and drums come in and we realize the piano figure is centered on the 2nd and 4th notes. This may sound technical, but in his podcast Cuchna does a great job of showing how important details like this are to the listening experience. To that end, Dissect also discusses how “Runaway” includes exemplary uses of overtones and motivic development (pdf).\n\n“Runaway” ends with West’s greatest trick. The last note of the song is an E, and then the next song, “Hell of a Life,” starts on a B flat. The interval from a E to a B flat is what’s called a tritone. “The tritone is notorious in music history,” Cuchna explains. “It was banned by certain religions and in the 17th century, and called the ‘devil in music’ due to the way it sounds.” (You will hear this interval a lot in heavy metal music.) The tritone makes sense as a bridge from the cathartic and apologetic “Runaway” to the debauched “Hell of a Life,” in which West talks about his lust for a porn star.\n\nHow is Cuchna so sure this is intentional? He says there are just too many examples like it for them all to be coincidences. Plus, Kanye’s primary collaborator on the album, Mike Dean, is a classically trained composer who would be well aware of these musical references.\n\nHidden meanings\n\nThe first season of Dissect, dedicated to Kendrick Lamar’s To Pimp a Butterfly, is nearly as good as the second. Cuchna’s analysis highlights the narrative and lyrical complexity of Lamar’s album, revealing the double- and triple-meanings hidden throughout. After spending months with the To Pimp a Butterfly, Cuchna was blown away by Lamar’s ability to be “artful and meaningful, but remain appealing on a mass level.”\n\nThe first two seasons of Dissect were about hip-hop albums because Cuchna felt that the genre deserved more academic analysis. He is interested in exploring other types of music for future seasons. He says he’s interested in dissecting albums by Radiohead, Beyonce, Bon Iver, or maybe even a Beethoven symphony (he is partial to the 3rd, 5th, and 9th). The most common request from fans is that he do a Frank Ocean album.\n\nAfter speaking with Cuchna, I couldn’t help but feel jealous of the way he experiences life and art. Cuchna told me that before going to college to study music full-time in his mid 20s (he is now 34), he spent six years taking art and philosophy classes at community college in his hometown of Sacramento, while working for a coffee roaster. “I just took classes because I liked learning,” he says. “I didn’t have a degree in mind.”\n\nAfter school, he would listen to Great Courses lectures, which are audio recordings of college-level classes. He particularly loved the music composition professor Robert Greenberg’s class on Dimitri Shostakovich, Cuchna’s favorite composer. It served as a model for Dissect.\n\n“People should follow the art they are attracted to,” Cuchna says. “There is a reason that album or painting is resonating with you. I know from experience that if you don’t give it your full attention, you won’t get everything you could get out of it. I hope Dissect can provide the structure for someone to take that time, or inspire them to create that structure in their own life.”\n",
      "Folder": "Feedly",
      "Timestamp": "1512431641",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.521765Z"
}