{
  "id": "c1c2bd3f1c40467cb685604863ee4a7c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/grandfathered-marriott-lifetime-premier-platinum/",
      "Title": "Who’s Being Grandfathered into Marriott’s Lifetime Premier Platinum Status The Points Guy",
      "Selection": "“Reader Questions” are answered twice a week by TPG Associate Editor Brendan Dorsey.\n\nThe Marriott and SPG programs are now officially combined, but many customers still have a number of questions, especially regarding how lifetime elites will be treated in the new system. TPG reader Roger wrote in asking how his lifetime Marriott Platinum elite will be grandfathered into the new program…\n\nHas anyone been grandfathered into Lifetime Premier Platinum status from your Marriott Lifetime Platinum elite status?\n\nTPG Reader Roger\n\nWhen Marriott originally announced the status levels in the new program, there were a lot of concerns about how SPG Lifetime Platinums would be integrated into those levels. However, Marriott has since made a few viable paths for those looking to get top-tier lifetime elite status.\n\nTo understand how this will all work, you first have to realize that the merger is effectively broken into two parts, with some changes not taking effect until 2019. Through the end of this year, you can book top-tier hotels at reduced rates and rebook hotels using new Marriott points, but other parts of the programs are still in flux.\n\nPeople who are transferring lifetime status to the new program are impacted by this two-part rollout method. When you combine your Marriott and SPG accounts, lifetime elite members from either program will have one of three lifetime status levels for the rest of 2018 — Silver, Gold or Platinum. For those who want to make sure they’re grandfathered into the new Lifetime Premier Platinum status in 2019, you’ll need to fall into one of these four groups:\n\nCurrent Marriott Rewards Lifetime Platinum members.\n\nLifetime SPG Platinum members with 750 or more nights by December 31, 2018.\n\nMarriott members who reached 750 nights + 2 million base points at legacy Marriott properties by December 31, 2018.\n\nAny Marriott/SPG/Ritz member who reached 750 nights + 10 years of Platinum status across the combined portfolio by December 31, 2018 (meaning someone with 250 nights and 5 years of SPG Platinum and 500 nights and 5 years of Platinum with Marriott would end up as a Lifetime Platinum Premier).\n\nIn Roger’s case, since he’s already a Marriott Lifetime Platinum, he’ll get Lifetime Premier Platinum status automatically, but he won’t receive his new lifetime status until next year. For any Lifetime Platinums who might not currently meet one of the above criteria, you still have until December 31 to get there. And if you’re not sure how your specific lifetime status will translate into the new program, you can read TPG Editor-at-Large Nick Ewen’s guide to “Lifetime Status With the New Marriott: The Good, the Bad and the Ugly.”\n\nThanks for the question, Roger, and if you’re a TPG reader who’d like us to answer a question of your own, tweet us at @thepointsguy, message us on Facebook or email us at info@thepointsguy.com. And for more info on the Marriott and SPG merger, check out our additional stories below and a special episode of “To The Point”:\n\nYour Checklist for the Just-Launched Marriott Program\n\nHow to Combine Your Marriott and SPG Accounts\n\nCrunching the Numbers on the New Marriott Award Rates\n\n6 Lessons I Learned From the Marriott/SPG Merger\n\nShould I Hold on to Both the SPG and Marriott Cards After August?\n\nFeatured image by The Points Guy staff.\n",
      "Folder": "Feedly",
      "Timestamp": "1535523023",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.443375Z"
}