{
  "id": "c22c37c725564edcbf63ed07aac2e27d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/flying-blue-sweet-spot-hawaii/",
      "Title": "Sweet Spot Sunday How to fly to Hawaii for just 35,000 miles round-trip The Points Guy",
      "Selection": "TPG senior news editor Clint Henderson recently described his third pandemic-era trip to Hawaii as “easy, breezy, beautiful.” If you’ve also got Hawaii on your mind — and just about any transferrable currency in your pocket — you can use today’s domestic award sweet spot to fly to Hawaii on Delta-operated flights.\n\nIn this guide, I’ll describe how to leverage the Air France/KLM Flying Blue program to fly round-trip between the mainland U.S. and Hawaii for just 35,000 Flying Blue miles plus minimal taxes and fees. Don’t worry if you don’t have any Flying Blue miles yet, though. Flying Blue is a transfer partner of multiple transferrable currencies, including American Express Membership Rewards, Capital One Rewards, Chase Ultimate Rewards and Citi ThankYou Rewards.\n\nGet the latest points, miles and travel news by signing up for TPG’s free daily newsletter.\n\nIn This Post\n\nWhy it’s special\n\n(Photo by Clint Henderson/The Points Guy)\n\nFrankly, there are many ways to get to Hawaii using points and miles. For example, I recently wrote about how you can fly to Hawaii from 13,000 Avios each way. And you can also fly to Hawaii for just 15,000 Turkish miles round-trip. So, redeeming 35,000 Flying Blue miles for an economy-class round trip isn’t the lowest cost award you’ll find to Hawaii. And if you can find a non-stop Delta award of fewer than 3,000 miles, redeeming Virgin Atlantic Flying Club miles may provide better value.\n\nBut, if you want to fly a longer Delta non-stop flight or Delta-operated connecting flights to Hawaii, you should consider the Air France/KLM Flying Blue program. After all, if you can find award space, you can frequently book Delta-operated awards from mainland U.S. to Hawaii with the Flying Blue program for far less than with Delta Skymiles. And unlike many of the Hawaii award flight sweet spots, you’re not limited to west-coast gateways. Instead, assuming you can find award availability, you can fly from anywhere in the mainland U.S. that’s served by Delta.\n\nRelated: You may not need a test for Hawaii anymore: Everything you need to know about visiting the islands now\n\nHow to book this award\n\nYou can book Flying Blue awards via Air France or KLM. Both sites can be frustrating to use, but let’s walk through how to book this award on the KLM site.\n\nStart here and click on “Book via KLM.” Once you do so, you’ll need to log in to your Flying Blue account. So, create an account if you don’t already have one.\n\n(Screenshot courtesy of klm.nl)\n\nAfter logging in, you can enter your desired flight details. I recommend searching for a one-way award for one passenger unless you must travel in a larger group.\n\n(Screenshot courtesy of klm.nl)\n\nAfter clicking the “Search flights” button, you may get a message stating, “Sorry, there are no fares available for this date. Please try again.” If you get this message, you may need to go back to the start to search for availability on a different date since this page often acts buggy. But, if you happened to search for a route and date with availability, you’ll see some award options on the next page.\n\n(Screenshot courtesy of klm.nl)\n\nIf you found an award option that works for your trip, click the green box that shows the rate. Doing so will take you to a page where you can see the details of your award ticket.\n\n(Screenshot courtesy of klm.nl)\n\nIf these details are acceptable, click on “Select” and then on “Continue to trip summary.” Doing so will show a final trip summary.\n\n(Screenshot courtesy of klm.nl)\n\nIf this summary is correct and you want to continue with your booking, click “Continue to passenger details.” If you have enough miles in your account, you can enter the passenger details for your award and complete the booking. But, if you don’t have enough miles in your account, you’ll see the following error: “Unfortunately, you do not have enough Miles for this booking. Please select a different flight.” I don’t have enough miles in my account, so this is as far as I can guide you through the booking process.\n\n Related: The best websites for searching SkyTeam award availability\n\nHow to earn miles for this award\n\n(Photo by Clint Henderson/The Points Guy)\n\nDon’t worry if you don’t have enough miles in your Flying Blue account to book your award. One of the highlights of Flying Blue is that it’s a transfer partner of multiple transferrable currencies, including:\n\nAmerican Express Membership Rewards: 1:1 transfer ratio (transfers are instant)\n\nCapital One Rewards: 2:1.5 transfer ratio (transfers are instant)\n\nChase Ultimate Rewards: 1:1 transfer ratio (transfers are instant)\n\nCiti ThankYou Rewards: 1:1 transfer ratio (transfers are instant)\n\nMarriott Bonvoy: 3:1 transfer ratio (transfers take about three days)\n\nIf you have transferrable points and miles, it’s easy to get enough miles to redeem for Flying Blue awards. However, if you want to replenish your stash of transferrable points and miles, consider adding one of the following travel rewards cards to your wallet and spending to earn its bonus:\n\nThe Platinum Card® from American Express: Earn 100,000 Membership Rewards points after you spend $6,000 on purchases on your new card in your first six months of card membership. Plus, earn 10x points on eligible purchases on your new card at restaurants worldwide and when you Shop Small in the U.S. (on up to $25,000 in combined purchases) during your first six months of card membership.\n\nChase Sapphire Preferred Card: Earn 100,000 bonus points after you spend $4,000 on purchases in the first three months from account opening.\n\nCiti Premier® Card: Earn 80,000 ThankYou points after you spend $4,000 on purchases in the first three months of account opening.\n\nAmerican Express® Gold Card: Earn 60,000 Membership Rewards points after you spend $4,000 on purchases on your new card in your first six months of card membership.\n\nThe Business Platinum Card® from American Express: Earn 125,000 Membership Rewards points after you spend $15,000 on eligible purchases with your card in the first three months of card membership.\n\nAlternatively, you could add the Air France KLM World Elite Mastercard® to your wallet. This $89 annual fee card currently offers a sign-up bonus of a $100 statement credit and 50,000 bonus miles after you make $2,000 or more in purchases within the first 90 days of your account opening. Plus, you’ll earn 3x miles on purchases with SkyTeam member airlines and 1.5x miles on all other purchases.\n\nRelated: Sweet Spot Sunday: Fly from the US to Europe, North Africa from 21,500 miles each way\n\nBottom line\n\nThere are many ways to use points and miles to fly to Hawaii. Today I discussed one method: redeeming Air France/KLM Flying Blue miles for Delta-operated flights. This method isn’t best for everyone, but it can provide excellent value for central and east coast U.S. residents. And, since there’s no benefit to booking this award as a round trip, you could book an open-jaw itinerary and visit two (or more) Hawaiian islands. Then, you could book your inter-island Hawaii travel separately.\n\nFinally, before transferring points to Flying Blue, check cash rates for your award. We’ve recently seen some excellent deals, including Hawaii flights from $81 each way. If you’re looking to transfer Chase Ultimate Rewards points, you may get a better deal booking travel through the Chase Ultimate Rewards portal when paid rates are low. And you can redeem Capital One miles at a fixed rate toward new or existing travel purchases. So, although you can often get excellent value by transferring points, it’s always worth checking cash rates too.\n\nFeatured image of a cove near Hyatt’s Hana-Maui Resort by Zach Honig/The Points Guy.\n",
      "Folder": "Feedly",
      "Timestamp": "1627279318",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.139938Z"
}