{
  "id": "c2850b36672d4e06bcc36b21e05078a6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/best-uses-60k-amex-points/",
      "Title": "5 Best Ways to Use 60,000 Membership Rewards Points The Points Guy",
      "Selection": "There are many ways to boost your account balances in this hobby, like making purchases through online shopping portals or using the right card for different bonus categories. However, one of the quickest ways to rack up points and miles is through sign-up bonuses on top travel rewards credit cards. Last month, we shared a new offer on The Platinum Card from American Express, allowing you to earn 60,000 Membership Rewards points after you use your new card to make $5,000 in purchases in your first three months. Today I want to go through some great ways to use these points for your next trip.\n\nAs you’ll see from the options that follow, each one involves transferring your Membership Rewards points to an airline partner and then redeeming the miles through that program. While the program does allow for many direct redemptions (including Amazon.com and Uber rides), you tend to get maximum value through partner programs. This valuable flexibility is one of the main reasons why every traveler should earn transferable points in at least one of the major programs.\n\nKeep in mind too that this list is just a sample of different options that may appeal to a wide swath of readers. Every traveler has his or her own way of determining what makes a “valuable” redemption, so be sure to explore additional rewards if the list below doesn’t appeal to you.\n\nSo, that being said, what are some of the best ways to redeem 60,000 Membership Rewards points? In no particular order:\n\n1. Two round-trip economy tickets from the US to Hawaii on Delta\n\nIf you’re looking to get to the Hawaiian Islands for (almost) free, consider transferring your Membership Rewards points to Flying Blue, the loyalty program of Air France, KLM and several other other carriers. The program only charges you 15,000 miles per person each way, regardless of your US departure gateway. As a result, you could fly from New York-JFK to Honolulu and back with your boyfriend/girlfriend/spouse/family member for just 60,000 points. Availability is decent, especially if you’re flexible with departure and return dates, and you can get some tremendous value out of this type of redemption.\n\nHere’s a sample of round-trip flights with award availability at the time of writing:\n\nThese same flights could be yours for just 60,000 miles plus minimal taxes and fees, giving you a value of over 3 cents per mile.\n\n2. One-way business-class flight to Europe or Asia on American Airlines\n\nAnother great program to which you can transfer your Membership Rewards points is Etihad Guest, one that was just added as a partner back in 2016. The program has a number of redemption sweet spots, but one of my favorite is on American. This is due to the fact that, as of the time of writing, Etihad is still using a pre-devaluation award chart for flights on American. That means the following:\n\nOne-way business-class tickets to Europe are just 50,000 miles (57,500 if booked through American)\n\nOne-way business-class tickets to Asia 1 (Japan and Korea) are just 50,000 miles (60,000 if booked through American)\n\nOne-way business-class tickets to Asia 2 (Hong Kong and China) are just 55,000 miles (70,000 if booked through American)\n\nOf course, the big trick is finding award availability on these flights, as I’ve noticed that American has become much stingier with award space over the last several months, especially in premium classes. I’m a big fan of ExpertFlyer to help with this search, as it will allow you to set alerts for award seats on specific flights.\n\n3. One-way business-class flight to Europe on any Star Alliance carrier\n\nYou could enjoy a one-way business-class flight to Europe on a Star Alliance carrier like Lufthansa with this sign-up bonus.\nIf you’d rather have more flexibility when it comes to choosing your carrier and/or routing to Europe, consider transferring your Membership Rewards points to Aeroplan, the loyalty program of Air Canada. You’ll be able to redeem either 55,000 or 57,500 miles for a one-way business-class ticket to or from Europe (depending on exactly where in Europe you’re arriving into or departing from). Most importantly, there are several airlines with flights from the US to Europe, including Austrian (check out JT Genter’s review from last month), Brussels Airlines, Lufthansa, Swiss and United. You’ll need to pay some fuel surcharges on these flights, but the comfort of crossing the Atlantic in business class can make this more than worthwhile.\n\n4. At least 10 one-way flights of 650 miles or less on Oneworld carriers outside North America\n\nA fourth great target for your Membership Rewards points is British Airways. While the transfer ratio was devalued back in 2015 (now 250 points = 200 Avios), the carrier’s Executive Club program offers some very attractive redemption options thanks to its distance-based award chart. For example, a one-way flight covering 650 miles or less is just 4,500 Avios (or 4,000 if you’re traveling off-peak). This is a fantastic option for traveling into or out of Oneworld hub airport like London-Heathrow or Tokyo-Narita. Just remember that as of February of last year, you can’t redeem 4,500 Avios on flights in North America.\n\nEven though 60,000 Membership Rewards points will only get you 48,000 Avios, that’s still enough for 10 one-way flights at 4,500 Avios apiece or 12 one-way flights at the lower off-peak rate.\n\n5. One-way business-class flight from Singapore to Australia or New Zealand\n\nThis sign-up bonus could get you a flight in Singapore Airlines business class.\nIf you’ve been wanting to try out one of Singapore Airlines’ renowned premium classes, consider transferring your Membership Rewards points to the KrisFlyer program and booking a one-way flight in business class between Singapore and Australia or New Zealand. The carrier flies into numerous airports, including Sydney, Melbourne and Auckland. Each of these flights will set you back just 58,000 miles for several hours of bliss aboard the one of the airline’s long-haul aircraft. If there’s no availability on your preferred date, you can always waitlist for the award, though keep in mind that the carrier did increase redemption rates and remove the online booking discount last month. Nevertheless, there’s still some solid value to be had from the program!\n\nOther Considerations\n\nKeep in mind that all of the above options are just a sampling of what you can do with American Express Membership Rewards points given the new sign-up bonus on the Amex Platinum. Your balance can be even higher if you utilize the card’s newly increased bonus categories, like 5x points on airfare. You also may already have a stash of points from other cards like the Premier Rewards Gold Card from American Express or the Amex EveryDay Preferred Credit Card from American Express.\n\nThe newly enhanced Platinum Card carries a number of nice perks beyond the increased sign-up bonus.\nIn addition, the card provides many additional benefits beyond the sign-up bonus that make it worthwhile beyond just the first year. You’ll be able to access luxurious American Express Centurion lounges and enjoy Priority Pass Select membership, and you can also visit Delta Sky Clubs when you’re traveling on a Delta-operated flight. The card also comes with a $200 annual airline fee credit that is automatically applied toward incidental purchases with a carrier you designate. The newest sets of perks include a new metal design and $200 in ride credits with Uber, though these enhancements did come along with an annual fee increase from $450 to $550.\n\nBottom Line\n\nThe battle among the premium travel rewards credit cards is heating up, with the Platinum Card delivering the latest salvo by Amex enhancing the card’s suite of benefits and announcing a new sign-up bonus of 60,000 Membership Rewards points after you use your new card to make $5,000 in purchases in your first three months. There are many ways to make the most of these points for your next trip, and hopefully this post has given you some inspiration for how to put them to good use!\n\nHow would you redeem 60,000 Membership Rewards points?\n",
      "Folder": "Feedly",
      "Timestamp": "1491915220",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.689616Z"
}