{
  "id": "c3e39ef6438246ef84446343ec6cb39c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/778697/in-praise-of-short-engagements-and-cheap-modest-weddings/",
      "Title": "“Happy marriages often follow from humble beginnings” In praise of short engagements and cheap weddings Quartz",
      "Selection": "I met my husband at a TGI Friday’s. You might not think that novelty license plates and mozzarella cheese sticks are the stuff romantic dreams are made of. But within a few days, I was wearing an engagement ring.\n\nI thought to myself, This is completely nuts. Three months later, as I took my dad’s arm and walked down the aisle, I was still thinking the same thing.\n\nYet now, after 10 years of marriage, I’m convinced our short engagement and modest wedding were eminently reasonable. Or at least as sensible as it’s possible to be when you’re deliciously in love.\n\nThere’s a lot to be said for a slapdash wedding. The average engagement lasts 14 months, according to a 2014 survey published in The Knot. That’s a lot of time to devote to wedding planning—time that some people might prefer to spend focusing on getting a master’s degree or writing a book.\n\nAmong my 20- and 30-something peers, explicitly lavish weddings aren’t on trend. Instead, couples go in for celebrations that feel rustic and homey. But the homespun aesthetic belies the hours of effort that go into potting your own succulent centerpieces and tying gingham ribbons around all those mason-jar lanterns. And so many couples wind up drinking bespoke cocktails of anxiety and stress for a year or more, all in the service of a party that lasts a total of five hours.\n\nSpending a lot of money on a wedding doesn’t augur a lasting union, either. In fact, spending more than $20,000 is correlated with higher divorce rates. As The Atlantic says, “A strong marriage … is an intentional one” but “expensive rings and ceremonies don’t yield happier unions.”\n\n In truth, every time a couple ties the knot, they should be telling themselves, “This thing is so crazy it just might work.” In this light, what is arguably completely nuts is the huge expense and tedious attention to detail that American culture encourages people to put into celebrating a union with a 40-50% percent likelihood of failure. In truth, every time a couple ties the knot, they should be telling themselves, “This thing is so crazy it just might work.”\n\nDon’t get me wrong: I love weddings, fancy, homey and everything in between. I have been to a rehearsal dinner held on the family yacht, and to a laid-back reception at a state park that involved little more than shelter and potato salad. Few other celebrations in our lives match a wedding’s joyful diversity. When else do you get to share a dance floor with toddlers, grandmas, college classmates and burgeoning, ill-advised hookups? At a wedding, you get to embrace every stage of human life.\n\nWhat I deplore is the pressure surrounding weddings—brought on in no small part by the wedding-industrial complex. While reliable numbers are hard to find, survey data from TheKnot.com suggests the average wedding cost now clocks in at $32,641, just about the average down payment on a house in the US. XO Group, which owns TheKnot.com, estimates that the “spend associated with weddings… totals over $70 billion annually.”\n\nBut it’s not just wedding magazines, caterers and J. Crew catalogues convincing us that we need to pour at least a year’s worth of energy and resources into planning a single day’s celebrations. We’re living through a Cambrian explosion of wedding imagery. Between Facebook and Instagram, we witness every one of our friends and acquaintances’ weddings, complete with exquisitely garlanded barns and video shot by drones, whether we attend or not.\n\n I adore the brides and grooms who, in the face of all that pressure, display what is known as chill. Turn on the TV and there’s Say Yes to the Dress and Bridezillas, which normalize the idea that weddings are necessarily high-stress affairs that would be incomplete without shouting matches in the dressing room and fistfights in the parking lot. Check out the news, and the New York Times’ Vows column suggests that a great wedding involves a 16-page illustrated pamphlet, 15 different musical pieces and a family lodge complete with a “wedding meadow.”\n\nIt all adds up to a ridiculous amount of pressure on a couple. So I adore the brides and grooms who, in the face of it all, display what is known as chill.\n\nI think of my friend Jen. When I asked her how she met her husband Mark, she said, “We both worked part time for an events company and ended up being assigned to the same hole at a charity golf tournament. We had a few hours to kill, so we fell in love.” Engaged for just a few months, they reserved a tiny-house chapel and found a field in which to park it. She bought a $120 dress online. Total spend? Less than $1,000.\n\nGranted, Jen had been married before, but I’ve heard plenty of similar stories from first-timers. My friend Mary got married at her summer camp. “Because it wasn’t a traditional venue, they made an exception for us and it didn’t cost anything,” she said. She and her husband made playlists for the wedding on Spotify, got flowers from Costco, and brought their own booze. “The big-ticket item was catering,” she said. “My lace dress was full of twigs by the end of the day.”\n\nAnother friend, Danny, and his then-girlfriend Yuka (who is Japanese) made a spur-of-the-moment decision to get hitched in the face of a $5,000 legal bill for work on her immigration to the US. “I realized I didn’t want to waste money on lawyers,” Danny told me. “I just want to get married or whatever. I wanted to have a kid and buy an apartment.”\n\nSix days later, they were wed at the city clerk’s office in Manhattan—an especially festive place at the time because it was the week gay marriage was legalized in New York. Afterward, they went to brunch at Les Halles, and a coworker picked up the check. Then they went for a bike ride and ended up at the movies. (“The only movie available at the time we wanted was Horrible Bosses,” Danny adds. “It was supposed to be a comedy but it was not great.”)\n\nThey put the money they saved on legal fees toward a down payment on a co-op. Now they’ve got the apartment and the kid—their daughter, Chiara, is almost four years old—they hoped for.\n\nWhat I love about these stories is each couple’s refreshing lack of rigidity and pretension, their joyful practicality. There can be real sense of freedom in bypassing all the red tape and hassle.\n\nOf course, if a couple wants to put some serious planning into a bash for friends and family, that’s absolutely their prerogative. But I do wish more people felt like they had the option of starting off their marriage in whatever way they want. Perhaps the best way to combat the pressure to plan a traditional wedding is to encourage people to share tales of their scrappy, haphazard paths to marriage–an antidote to the world of expensive tulle gowns, elaborate hand-crafted centerpieces, and other features that supposedly signal the weighty import of the wedding day.\n\n The next morning, I wasn’t sure whether I was really engaged or not. My mind screeched: How can that be something you don’t know? In my own experience, at least, happy marriages often follow from humble beginnings. The fateful night I went to the TGI Friday’s, I did not have great expectations for the evening. (Who would?) I was there on an awkward, nearly silent Craigslist date. I’d recently been dumped by my college boyfriend and was so heartbroken I’d moved back in with my parents in my hometown. As far as I was concerned, life couldn’t get much worse.\n\nThen my old high-school boyfriend, Chris, walked in. I nearly ducked under the table. He and I hadn’t spoken in at least four years. But two nights later, he called to say that we should hang out. We got a drink, and afterward, he showed me around the little house he’d just bought. We were sitting on his couch, nursing another beer, when he asked me, “What do you think?”\n\nI said the first thing that came to mind. “I think we should get married.” He said that he thought so too, pulled me onto his lap, and we kissed for about a million years.\n\nThen I drove home to my parents’ house. The next morning, I woke up and I wasn’t sure whether I was really engaged or not. My mind screeched: How can that be something you don’t know?\n\nSo I sent him a text: “I still love you this morning.”\n\nA second later, he texted back: “I still love you every morning.”\n\nI walked downstairs, told my parents, and my mom started ordering the invitations. Three months and about $13,000 later, I was hitched. We had a lovely day, sure. But it was just a wedding.\n\nWe welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1473722053",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.715002Z"
}