{
  "id": "c405796df31a4df2b93e33114425b108",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1080044/bis-says-central-bank-cryptocurrencies-could-be-a-good-idea/",
      "Title": "The best explainer on how blockchains will upend banking comes from an unexpected source Quartz",
      "Selection": "The Bank for International Settlements (BIS) isn’t given to analyzing financial fads. Based in Basel, Switzerland, it’s a “bank for central banks,” so it’s usually concerned about things like the stability of the global financial system.\n\nIn its latest quarterly review, though, it reached out to an area of technology that has so far been reserved for financial technologists and speculators pushing libertarian philosophies. The bank’s paper on cryptocurrencies is a great explainer on how cryptocurrencies intersect with central banks, a topic that’s gaining currency as institutions from the Bank of England to the Monetary Authority of Singapore try to digitize cash using blockchain technology.\n\nThe BIS paper lays out the two main uses for a central bank-issued cryptocurrency: It could be a type of decentralized digital cash for consumers; or a tool to streamline settlements of transactions between financial institutions. The authors, Morten Linnemann Bech, from the bank’s committee on payments and market infrastructures, and Rodney Garratt, a professor of economics at the University of California, Santa Barbara, use a “money flower” schematic to disentangle the myriad terms that people throw around when they talk about digital currencies and payments.\n\nThe past, present, and future of money. (Bank for International Settlements)\n\nThe BIS paper shows that a central bank-issued cryptocurrency could well be a way to digitize cash, while crucially preserving the privacy of users, which cash already does. If central banks issue digital cash this way, it would cut out commercial banks, who are currently intermediaries for consumers to obtain central bank-issued money.\n\nThis “retail” use of a central bank digital currency is particularly pressing in countries with rapidly falling cash usage, such as Sweden, the authors say. Central banks also have good reason to use a digital currency in the wonkier, “wholesale” context, where it’s used exclusively by other banks. This upgrade payment systems that will soon be obsolete, and which depend on database designs that are “no longer fit for purpose,” the authors write.\n\nIn any case, central banks must reckon with digital currencies: “All central banks may eventually have to decide whether issuing retail or wholesale [digital currencies] makes sense in their own context,” the authors write.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1505767054",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.550726Z"
}