{
  "id": "c553c5976a714a0c93e86d51eeea6b3b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/872909/netflix-nflx-has-algorithms-that-determine-what-it-pays-for-shows-and-movies-like-stranger-things-and-the-crown/",
      "Title": "Netflix has algorithms to determine how much to pay for shows and movies Quartz",
      "Selection": "Netflix, acting every bit like the Silicon Valley tech company it is, reportedly has an algorithm that determines how much it should pay for shows and movies.\n\nDocumentary filmmaker Craig Atkinson told Business Insider that the company relies on artificial intelligence to value content. Atkinson was negotiating with Netflix to sell his documentary on the militarization of US law enforcement when his lawyer told him that the company had already determined what the film was worth and wouldn’t budge on its bid.\n\n“During the course of the conversation our lawyer had with the Netflix lawyer, he got a lecture, as he described it, from the Netflix lawyer about the fee because he was pushing back about how it seemed incredibly low for an all-rights deal,” Atkinson told the publication. “The Netflix lawyer lectured him on how it was their algorithm that determined the price of the film and that there’s really no discussion to be had because this algorithm determined how much the film should be worth and that basically was the end of discussion.”\n\nUltimately, his lawyer, Jody Simon, was able to negotiate an additional $100,000 more than the mid-six figure fee Netflix originally offered, Business Insider said. Atkinson didn’t take the deal because he wanted to retain creative control over the film.\n\nNetflix’s pricing algorithm could explain why the platform stopped bidding on shows like British car series, The Grand Tour (which ultimately landed at Amazon), but was willing to pay $13 million an episode to produce The Crown, a series about the early days of Queen Elizabeth’s reign in the United Kingdom. With Netflix producing and spending more on originals, the algorithm must help the company determine what shows to buy and which to skip.\n\n“We knew what it was worth,” Ted Sarandos, Netflix’s chief content officer, told The Telegraph about The Grand Tour. The platform also had streaming rights to BBC’s Top Gear that helped it value to the auto show, which features the same presenters.\n\nNetflix did not immediately return a request for comment.",
      "Folder": "Feedly",
      "Timestamp": "1482865882",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.733144Z"
}