{
  "id": "c5da184e7cf948058becbd16d6aaae1f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://millionmilesecrets.com/2017/01/03/chase-sapphire-reserve-100000-point-bonus-ending-soon/",
      "Title": "Chase Sapphire Reserve 100,000 Point Bonus Ending Soon Million Mile Secrets",
      "Selection": "If you’ve been thinking about applying online for the 100,000 point sign-up bonus on the Chase Sapphire Reserve, you’ll want to do so very soon.\n\nVia The Points Guy, the Chase Sapphire Reserve online sign-up bonus will be reduced by half on January 12, 2017, to 50,000 Chase Ultimate Rewards points, after meeting the same minimum spending requirement.\n\n50,000 Chase Ultimate Rewards points from this card are worth at least $625 in paid travel through the Chase Ultimate Rewards travel portal.  And potentially much more if you transfer them to airline and hotel partners.\n\nEmily and I don’t earn a commission from the Chase Sapphire Reserve, but we’ll always share the best deals with our readers!\n\nYou Have Until January 11, 2017, to Apply for the 100,000 Point Chase Sapphire Reserve Bonus!\n\nTo earn the better bonus, you must apply online by January 11, 2017. \n\nChase Sapphire Reserve 100,000 Point Bonus Ending\n\nLink:   Chase Sapphire Reserve\n\nLink:   My Review of the Chase Sapphire Reserve\n\nI’ve written the Chase Sapphire Reserve has been such a popular card, Chase lost ~$300 million on the card so far.\n\nSo it makes sense the huge 100,000 Chase Ultimate Rewards point bonus would eventually come to an end.  And now we know your last day to apply is January 11, 2017.\n\nThere’s Just Over a Week Left, Then the Chase Sapphire Reserve Bonus Will Be Cut in Half!\n\nCurrently, when you open the Chase Sapphire Reserve card, you’ll earn 100,000 Chase Ultimate Rewards points after you spend $4,000 on purchases in the first 3 months from account opening.  \n\nYou’ll also get:\n\n3X Chase Ultimate Rewards points on travel & dining\n\n1X Chase Ultimate Rewards points on all other purchases\n\n$300 annual credit for travel purchases such as airfare and hotels\n\n$100 statement credit for Global Entry\n\nPriority Pass Select for access to airport lounges\n\nNo foreign transaction fees\n\nVisa Infinite benefits like $25 food and beverage credit at the Luxury Hotel Collection and complimentary car rental elite status with Silvercar\n\nStarting January 12, 2017, the sign-up bonus will be reduced to 50,000 Chase Ultimate Rewards points after meeting the same minimum spending requirement.\n\nHowever, according to The Points Guy, you’ll still be able to earn the higher bonus if you apply in-branch before March 12, 2017.\n\nWhat If You’re Not Eligible?\n\nLink:   What to Do If You’re Not Eligible for the Chase Sapphire Reserve Bonus\n\nBecause the Chase Sapphire Reserve falls under the Chase “5/24” rule, many folks who’ve been in the miles and points hobby for a while aren’t eligible for the card.\n\nThat means if you’ve opened ~5+ cards from any bank (except certain business cards) in the past 24 months, it’s unlikely you’ll be approved for most Chase cards.\n\nThat said, some folks have had luck being pre-approved for the card in-branch, even if they’re above 5/24.\n\nSome Folks Have Been Pre-Approved for the Chase Sapphire Reserve In-Branch\n\nEven if you’re not eligible, there are plenty of other cards with big sign-up bonuses, like The Enhanced Business Platinum® Card from American Express OPEN.  With this card, you can earn up to AMEX 100,000 Membership Rewards points after meeting tiered minimum spending requirements.\n\nKeep in mind, the 100,000 point bonus for the The Enhanced Business Platinum® Card from American Express OPEN also expires this month, on January 25, 2017.\n\nBottom Line\n\nThe 100,000 point sign-up bonus on the Chase Sapphire Reserve will end January 11, 2017, for online applications.\n\nIt will be cut in half, to 50,000 Chase Ultimate Rewards points, after meeting the same minimum spending requirement.\n\nIf you’ve had your eye on the card, you’ve got just over a week to apply online and earn the higher bonus.  However, The Points Guy reports the better bonus will still be available in-branch until March 12, 2017.\n\nWe don’t earn anything if you sign-up, but we’ll always tell you about the best deals!\n\nI’m sad to see the bonus go, but I’m glad Chase gave us advance warning of the change!\n\n       \n\nRelated Stories\n\nChase Sapphire Reserve $300 Travel Credit, Everything to Know\n\nChase Sapphire Reserve Increases Value of Your Ultimate Rewards Points\n\nTop 7 Travel Cards for January 2017\n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1483486110",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.729935Z"
}