{
  "id": "c7814e750a7040bf8fab55904ad7bc38",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1506178/japan-keeps-inventing-ways-to-stop-babies-from-crying-in-public/",
      "Title": "Japan keeps inventing ways to stop babies from crying in public Quartz",
      "Selection": "In a country where public displeasure at crying babies is the norm, Japanese companies keep coming up with new ways to keep them quiet.\n\nCarmaker Honda is the newest company to have a go at that, inventing a plush toy car called a Sound Sitter that allegedly mimics the sound that babies hear in the womb, which is apparently at a similar frequency to a car engine. The company tested over 30 different of its car models, and found that the NSX model, launched in 2016, was the most soothing for babies. Honda said that 11 out of 12 babies were soothed by the sound of the engine, which can be activated via a smartphone.\n\nCrying babies are a particular source of embarrassment and concern for Japanese mothers, who bear the brunt of others’ disapproval if they are unable to keep their babies quiet in public. That led a group of women in 2016 to start a grassroots campaign, the “We Love Babies Project,” which encouraged Japanese people to wear stickers bearing the words Naitemo iiyo! (“It’s OK to cry!”) to address the stigma of babies crying in public. Even politicians have waded into the discussion, with a group of 13 male governors this year coming together to pledge their support for the campaign, which also calls on restaurants and other establishments to proclaim themselves baby-friendly zones with the sticker.\n\nAnother company that has tried to tackle the problem of crying babies is All Nippon Airways, which last year conducted research to figure out how to stop babies from crying during takeoff and landing. The carrier said that its research found that some parents with small children avoided flying out of concerns that their babies would disturb other passengers.\n\nSome people have put Japan’s intolerance of crying children down to the country’s ultra-low birthrate, which means many Japanese people simply aren’t used to the sound. The phenomenon also takes place against a backdrop of a society which is often seen as unsupportive of new mothers—something the country of 127 million desperately needs to change as it tries to combat its dwindling population.\n\nA lawmaker was kicked out of a regional parliament last year for bringing her baby to the chamber, while another received blame (paywall) for getting pregnant at all, with politicians—who are almost always middle-aged or elderly men—espousing views in support of outdated gender roles. The prevalence of “maternity harassment” (mata-hara) also means that many women simply choose to drop out of the work force once they become pregnant, in order avoid mistreatment at work by bosses disgruntled at their employees’ pregnant state.\n\nGiven that Honda’s Sound Sitter was an in-house experimentthat won’t be made commercially available immediately—parents trying to soothe their agitated kids in public might be better off joining the campaign to fight the stigma of crying babies instead.\n",
      "Folder": "Feedly",
      "Timestamp": "1545631331",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.412608Z"
}