{
  "id": "c7da5126124a470e8ed5531edf905f5f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/09/how-flight-tracking-sites-work/",
      "Title": "This Is How Flight Tracking Sites Work The Points Guy",
      "Selection": "As Hurricane Irma slowly churned through the Caribbean leaving a trail of destruction, a large swath of the region was utterly devoid of any and all aircraft. Well, except for one aircraft. People from around the world were fascinated by images of a Delta 737 flying to San Juan, Puerto Rico as Irma approached. They weren’t actual images or video of an aircraft, though. It was merely an icon on an map from flight tracking site Flightradar24.\n\nFlightradar24 is the largest of several aircraft tracking services available to the public. Flightradar and other similar services let users zoom into any part of the world and see aircraft movement in real time, even while planes are still on the ground at many airports.\n\nThese services rely primarily on a technology known as Automatic Dependent Surveillance – Broadcast, or ADS-B for short. ADS-B collects vital position and movement data from an aircraft’s transponder, such as altitude, speed, heading, and dozens of other attributes, and transmits it at a frequency of 1090 MHz to anyone listening.\n\nAs air traffic control slowly shifts from a 20th-century technology, radar-based tracking of aircraft, to ADS-B, Flightradar has been constructing its own network of receivers worldwide. Each receiver consists of a small computer, a GPS antenna and an ADS-B frequency antenna. Flightradar distributes the receivers to local hosts anywhere in the world it may need to boost coverage in exchange for premium site subscriptions. Alternatively, local hosts may have their own equipment and choose to upload data to multiple sites.\n\nSome of the places volunteers have placed receivers are nothing short of amazing. From the Troll Research Station in Antarctica to Chernobyl, Ukraine, these receivers are capable of providing detailed flight information in areas where traditional radar coverage has never existed, and will never exist.\n\nThe new Flightradar24 ADS-B receiver approximately 1.5 km from the Chernobyl nuclear plant, visible in the background. Image by Flightradar24.\n“Flightradar24 now has over 16,000 ADS-B receivers around world helping track flights on all seven continents,” said Ian Petchenik, Director of Communications for Flightradar24. “We track an average of 175,000 flights per month and that number continues to rise as we add new receivers.”\n\nWhile Flightradar covers thousands of flights per day, the airline industry is still far from equipping all aircraft with ADS-B technology. In the United States, approximately 52% of aircraft transmit ADS-B signals, a number that hasn’t significantly risen in recent years, even has a 2020 mandate to equip all airplanes looms. Globally, the number jumps to 65%, but still a far cry from every aircraft.\n\nIn order to track aircraft that aren’t transmitting ADS-B location data, a technology called Multilateration (MLAT) is used. MLAT uses multiple ADS-B receivers to triangulate the approximate location of an aircraft to an accuracy of about 10-20 meters with coverage nearly down to ground level and a delay of a few seconds. MLAT tracking isn’t perfect, but it’s far better than the radar data provided by the FAA when all else fails. In the case where an aircraft operates far outside of the coverage area, Flightradar will estimate its flight path along the shortest path to its destination. Once it re-enters coverage, the actual position is then displayed.\n\nA flight being tracked with MLAT compared to the GPS location from on board the tracked aircraft.\nAs we all learned in third grade science class, most of the planet is water, not land. This fact presents a bit of a problem for a company that relies on ground-based receivers. In an attempt to cover the remaining 71% of the planet’s surface, Flightradar has been experimenting with tiny satellites equipped with ADS-B receives. During a trial in 2016, Flightradar was able to receive terrestrial-bound signals from aircraft over the middle of the Atlantic Ocean. A separate waterborne trial was conducted by equipping a small autonomous boat with ADS-B receivers and a satellite uplink. The aptly nicknamed “floatradar” boat can be remotely positioned to boost coverage in critical areas.\n\nWhile Flightradar has nearly global coverage at this point, some aircraft will never be shown on the map. This isn’t due to any particular technical reason or issue, but rather because they are military or specific private aircraft. To protect operational security of military operations, as well as the privacy or certain private jet operators, these aircraft either have their details censored or are removed from the database entirely. Removal of private aircraft is conducted per request, and not proactively. Sorry, but you will never see Air Force One on Flightradar.\n\nTo some hardcore planespotters and aviation geeks, hiding certain aircraft is a bit of a problem. Just like how Flightradar has built out a network of crowdsourced ADS-B receivers, a website named ADS-B Exchange has attempted to do the same, but without hiding any aircraft information. While its worldwide coverage is nowhere near as robust as Flightradar, all aircraft, including military aircraft, are displayed.\n\nTracking military aircraft over New York City during the UN General Assembly on ADS-B Exchange. On the left is a US Air Force tanker circling the city to refuel patrolling fighter jets; on the right a French Air Force VIP jet.\nADS-B Exchange says its site displays all data unfiltered because the ADS-B signals emitted from aircraft are unencrypted and over-the-air, much like an ordinary radio signal, and anyone with $100 and an Amazon account can build their own receiver. Leaving the data unfiltered is valuable to plane spotters looking to snap shots of unusual or special aircraft.\n\nIn a few short years, flight tracking has gone from proprietary government and airline data to freely accessible and available nearly anywhere on the planet. As space-based receivers become cheaper, there will not be a single place left uncovered by the various tracking services in operation today.\n",
      "Folder": "Feedly",
      "Timestamp": "1506193749",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.626166Z"
}