{
  "id": "c946084d71124b2787617fd5c87cf128",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/the-goods/2019/4/11/18300880/asos-return-policy-amazon-everlane-sephora",
      "Title": "Returning online purchases is getting harder. That’s a good thing. Vox - All",
      "Selection": "Rising return rates are terrible for the environment, and for workers. But that’s not why brands are making it more difficult.\n \nCustomers of the online fast-fashion brand Asos were informed last week that the site would be changing its notoriously lax return policy. “We need to make sure our free returns remain sustainable for us and for the environment,” the email read, “so if we notice an unusual pattern, we might investigate and take action.”\n\nIt’s a company that has long made returning items far more convenient than others — every shipment includes a free return label, the bags are easy to repackage, and refunds are quickly made in full. That’s part of the reason why Asos is one of the most successful and fastest-growing brands in fashion: Because clothes are extremely cheap and sizing and quality vary widely, buying multiple items with the assumption that some or most of it will be returned is a typical strategy for customers. \n\nBut the move was a crackdown on such serial returners, and it’s just one example of a shift among businesses to make returning the stuff you buy — but don’t want — a little harder. \n\nReturns are a growing environmental and labor issue\n\nIt’s actually a good thing that the return backlash has arrived. Returns, particularly those made online, are terrible for the environment: They typically require transport by medium- and heavy-duty trucks, vehicles that make up nearly a quarter of the carbon footprint caused by transportation, which in 2016 overtook power plants as the biggest producer of carbon dioxide emissions. \n\nReturned items often don’t even get restocked — instead, many end up in landfills. As Mashable notes, returns and excess inventory cost the environment 4 billion pounds of landfill waste every year. \n\nThese effects are exacerbated by the fact that people are buying and returning items online more than ever. During the 2015 holiday season, customers returned $69 billion worth of goods; over the 2018 holiday season, that number had jumped to $94 billion. And since return rates are higher on online purchases versus those made in stores, that number will doubtlessly continue to grow as more people shop online. \n\nThe negative effects of returns aren’t limited to the environment: More returns means more stress on the employees who then must process them. CNBC reported that returns contributed to a huge boom in the warehouse industry since 2012, so much so that “reverse logistics” — corporate jargon for “dealing with returns” — is the top new user of warehouse space in the US, accounting for 700 million square feet nationally. \n\nKerem Yucel / AFP\n\nDemonstrators held a protest at the Amazon fulfillment center in Shakopee, Minnesota on December 14, 2018 to demand better working conditions.\n\nThis puts an extra strain on people employed in those warehouses, where working conditions are already reportedly grueling. One Amazon worker spoke to Vox’s Chavie Lieber about their experience with brutal hours, dystopian surveillance systems, and inhumane policies. Meanwhile, attempts to unionize at Amazon have been consistently thwarted by the company, which was recently valued at more than a trillion dollars. \n\nWhile the human cost is far greater, of course, returns are also bad for business: Aside from lost profit, they also increase labor costs for companies, and according to Appriss, a retail tracking database, they cause markdowns and out-of-stocks to increase. \n\nWhy companies are making returns more difficult\n\nIt’s that last bit that provides the most insight into why so many companies are discouraging customers from returning items. Revenue loss, combined with fears about return fraud, which is estimated to cost the US retail industry about $18.4 billion per year, is what Asos is targeting with its new policy. \n\nThe London-based e-tailer, which carries more than 850 brands, states in its new rules that the changes will only affect a shopper if they are “actually wearing their purchases and then returning them or ordering and returning loads — way, waaay more than even the most loyal ASOS customer would order.” If they do, it explains, it might deactivate that customer’s account.\n\nBut for many Asos shoppers, the ability to buy and then return the mostly cheap, often confusingly sized items is the main draw. The BBC spoke to some of these serial returners last year, who tend to return most of what they buy online, whether they get a high from it or because of the nature of online shopping. “You see models wearing things and it looks fantastic on them,” one said, laughing, and added that they don’t look the same on her. \n\nWhen you buy an ASOS jumpsuit thinking you'll look like this, but you end up looking like this. pic.twitter.com/wZDOxvCeQi\n— Christina McDermott-McGarrigle (@ChristinaMcMc) June 8, 2016\n\nNaturally, Asos customers were quick to complain. “Maybe if ur clothes actually arrived fitting like they’re supposed to I wouldn’t return so much god damn crap,” one woman wrote on Twitter. “Did anyone else feel more than a little threatened by the recent email from @ASOS regarding returns?” asked another. “Especially as a fat person, they’re practically my only clothes retailer option and I STILL have to order and return multiple items!”\n\nDespite the brand’s assurances that it would only affect the most extreme returners, many on Twitter have claimed within the past few days that they’ve been banned for sending back just a couple items. \n\nThis isn’t the only tactic used by clothing brands to curb the volume of returns. Everlane employs a “restocking fee” of $6 when customers make online returns to cover the cost of shipping and restocking, while Anthropologie also charges a flat $5.95 for shipping on online returns. \n\nBecause newer and smaller businesses don’t always have the resources of bigger ones, they’re disproportionally affected by rising return rates — yet lots of companies do this: Verizon, for instance. The online thrift store ThredUp, which charges a $1.99 fee with every return, explains that a return must go through the same process of inspection and quality assurance as when it arrived for it to be relisted on the site, which costs the company more money. \n\nSephora also made headlines last year when the Wall Street Journal discovered that the makeup behemoth was giving stores the ability to ban certain customers from returning items, confirming years of suspicions on beauty message boards. It, along with more than 34,000 other stores from Best Buy to Home Depot, had been using a service called the Retail Equation, which tracks customers’ returning habits via their driver’s licenses. \n\nEven L.L. Bean, the Maine-based outdoor gear brand generally considered to be on the greener and more sustainable end of the spectrum, changed its famous no-receipt needed lifetime return policy, not to save the polar bears but to save itself from being scammed. \n\nWhile making returns more difficult for customers may actually do a bit of good for warehouse workers and the environment, it’s important to note that that’s likely not the reason these companies don’t want you to return their stuff. It’s because returns add an entirely new, expensive layer to the online shopping process, and it’s bad for bottom lines. \n\nHugely popular online retailers like Amazon, meanwhile, probably aren’t going to change their generous return policies and lightning-fast shipping any time soon. For a trillion-dollar company, the priority is always going to be on keeping you — at the expense of its employees and the earth — happy. \n\nWant more stories from The Goods by Vox? Sign up for our newsletter here.",
      "Folder": "Feedly",
      "Timestamp": "1555380219",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.383272Z"
}