{
  "id": "c9c35a7535b545deaf84dbaa37d57390",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2017/5/25/11851766/what-is-ramadan-2017-muslim-islam-about",
      "Title": "Ramadan 2017 9 questions about the Muslim holy month you were too embarrassed to ask Vox - All",
      "Selection": "The Muslim holy month of Ramadan starts Friday evening, and most of the world's 1.6 billion Muslims will be observing. This means there's a good chance you might encounter someone — a friend, a co-worker, the barista making your latte at Starbucks, your child's teacher — who is celebrating Ramadan.\n\nBut what is Ramadan, exactly? And how can I make sure I don't accidentally offend my Muslim friends and acquaintances during Ramadan?\n\nWe've got you covered: Here are the most basic answers to the most basic questions about Ramadan.\n\n1) What is Ramadan actually about?\n\nRamadan is the most sacred month of the year for Muslims — the Prophet Mohammed reportedly said, \"When the month of Ramadan starts, the gates of heaven are opened and the gates of Hell are closed and the devils are chained.\"\n\nMuslims believe it was during this month that God revealed the first verses of the Quran, Islam's sacred text, to Mohammed, on a night known as \"The Night of Power\" (or Laylat al-Qadr in Arabic).\n\nDuring the entire month of Ramadan, Muslims fast every day from sunrise to sunset. It is meant to be a time of spiritual discipline — of deep contemplation of one's relationship with God, extra prayer, increased charity and generosity, and intense study of the Quran.\n\nBut if that makes it sound super serious and boring, it's really not. It's a time of celebration and joy, to be spent with loved ones. At the end of Ramadan there is a big three-day celebration called Eid al-Fitr, or \"the Festival of the Breaking of the Fast.\" It's kind of like the Muslim version of Christmas, in the sense that it's a religious holiday where everyone comes together for big meals with family and friends, exchanges presents, and generally has a lovely time.\n\n Eid presents!!! Cem Ozdel/Anadolu Agency/Getty Images\n\nDespite the hardship of fasting for a whole month, most Muslims (myself included) actually look forward to Ramadan and are a little sad when it's over. There's just something really special about knowing that tens of millions of your fellow Muslims around the world are experiencing the same hunger pangs, dry mouth, and dizzy spells that you are, and that we're all in it together.\n\n2) How does fasting work?\n\nFasting during Ramadan is one of the five pillars — or duties — of Islam, along with the testimony of faith, prayer, charitable giving, and making pilgrimage to Mecca. All Muslims are required to take part every year, though there are special dispensations for those who are ill, pregnant or nursing, menstruating, or traveling, and for young children and the elderly.\n\nThe practice of fasting serves several spiritual and social purposes: to remind you of your human frailty and your dependence on God for sustenance, to show you what it feels like to be hungry and thirsty so you feel compassion for (and a duty to help) the poor and needy, and to reduce the distractions in life so you can more clearly focus on your relationship with God.\n\nDuring Ramadan, Muslims abstain from eating any food, drinking any liquids, smoking cigarettes, and engaging in any sexual activity, from sunrise to sunset. That includes taking medication (even if you swallow a pill dry, without drinking any water). Chewing gum is also prohibited (though I didn't find that one out until about halfway through my first Ramadan after converting — oops).\n\nDoing any of those things \"invalidates\" your fast for the day, and you just start over the next day. To make up for days you didn't fast, you can either fast later in the year (either all at once or a day here and there) or provide a meal to a needy person for each day you missed.\n\nMuslims are also supposed to try to curb negative thoughts and emotions like jealousy and anger, and even lesser things like swearing, complaining, and gossiping, during the month. Some people may also choose to give up or limit activities like listening to music and watching television, often in favor of listening to recitations of the Quran.\n\n3) What is a typical day like during Ramadan?\n\nDuring Ramadan, Muslims wake up well before dawn to eat the first meal of the day, which has to last until sunset. This means eating lots of high-protein foods and drinking as much water as possible right up until dawn, after which you can't eat or drink anything. At dawn, we perform the morning prayer. Since it's usually still pretty early, many go back to sleep for a bit before waking up again to get ready for the day (I certainly do).\n\nMuslims are not supposed to avoid work or school or any other normal duties during the day just because we are fasting. In many Muslim countries, however, businesses and schools may reduce their hours during the day or close entirely. For the most part, though, Muslims go about their daily business as we normally would, despite not being able to eat or drink anything the whole day.\n\nWhen the evening call to prayer is finally made (or when the alarm on your phone's Muslim prayer app goes off), we break the day's fast with a light meal — really more of a snack — called an iftar (literally \"breakfast\"), before performing the evening prayer. Many also go to the mosque for the evening prayer, followed by a special prayer that is only recited during Ramadan.\n\nThis is usually followed by a larger meal a bit later in the evening, which is often shared with family and friends in one another's homes throughout the month. Then it's off to bed for a few hours of sleep before it's time to wake up and start all over again.\n\n(Note: There are good reasons for only having a small snack to break your fast before performing the evening prayer and then eating a bigger meal later. Muslim prayers involve a lot of movement — bending over, prostrating on the ground, standing up, etc. Doing all that physical activity on a full stomach after not having eaten for 15 hours is a recipe for disaster. Just trust me on this one.)\n\n4) So do you lose weight during Ramadan?\n\nSome of you may be thinking, \"Wow, that sounds like a great way to lose weight! I'm going to try it!\" But in fact, Ramadan is actually notorious for often causing weight gain. That's because eating large meals super early in the morning and late at night with a long period of low activity bordering on lethargy in between can wreak havoc on your metabolism.\n\nBut if you're careful, you can avoid putting on weight, and you may actually lose a few pounds. One meta-analysis of scientific studies on the effects of Ramadan fasting on body weight found that \"[w]eight changes during Ramadan were relatively small and mostly reversed after Ramadan, gradually returning to pre-Ramadan status. Ramadan provides an opportunity to lose weight, but structured and consistent lifestyle modifications are necessary to achieve lasting weight loss.\" [Italics mine.]\n\nSo just like with any other extreme diet plan, you may lose a few pounds, but unless you actually make \"structured and consistent lifestyle modifications,\" you're probably not going to see major, lasting results.\n\n5) Why do the dates of Ramadan change every year?\n\nFor religious matters, Muslims follow a lunar calendar — that is, one based on the phases of the moon — whose 12 months add up to approximately 354 days. That's 11 days shorter than the 365 days of the standard Gregorian calendar. Therefore, the Islamic lunar calendar moves backward approximately 11 days each year in relation to the regular Gregorian calendar.\n\nSo that means that the first day of the month of Ramadan, which is the ninth month of the Islamic lunar calendar, moves backward by about 11 days each year.\n\nThis has a large impact on how people experience Ramadan from year to year. When Ramadan falls in the winter, it's much easier to fast: the days are shorter, which means you don't have to fast as long, and it's colder out, so not being able to drink water all day isn't as big of a deal, because you're not sweating as much.\n\nConversely, when Ramadan falls in the summer (as it has every year since I converted, because of course), fasting can be brutal. In many Muslim countries in the Middle East and Africa, summer temperatures can reach levels usually reserved for the deepest bowels of hell.\n\nAnd in some northern European countries such as Iceland, Norway, and Sweden (where, yes, there are Muslims), fasting can last an average of 20 hours or more in the summer. (And in a few places above the Arctic Circle, the sun never actually sets in the summer. In these cases, Muslim religious authorities have decreed that Muslims can either fast along with the closest Muslim country or fast along with Mecca, Saudi Arabia.)\n\n6) Okay, but why is there always confusion every year about exactly what day Ramadan starts on?\n\nThere's a reason \"Ramadan start date\" is one of the most-searched phrases right now. That's because Muslims around the world do not know when exactly Ramadan is actually supposed to start. If you Google it, you'll see there's a little disclaimer under Google's answer that says \"Dates may vary\":\n\n \"Dates may vary.\" Thanks, that's super helpful.\n\nThat also has to do with the moon — as well as disagreements about science, history, and tradition, plus a bit of geopolitical rivalry.\n\nThe beginning of each new month in the Islamic calendar starts on the new moon. Which means the month of Ramadan starts on the new moon. Simple enough, right?\n\nWrong.\n\nIf it's been a while since your high school astronomy class, here's a reminder of what the phases of the moon look like:\n\n Pictured: the source of much consternation and hilarity every single Ramadan. Griffith Observatory\n\nBack in Mohammed's day, in sixth-century Arabia, astronomical calculations weren't as precise as they are today, so people went by what they could see with the naked eye.\n\nSince the new moon isn't actually super visible in the night sky (as you can see above), Muslims traditionally waited to start fasting until the small sliver of crescent moon became visible. There's even a saying attributed to the Prophet Mohammed about waiting to start the fast until you see the crescent. (Some people think this is why the star and crescent is the symbol of Islam, but the crescent was used as a symbol long before Islam.)\n\nThis method was a bit messy, though, since things like clouds or just the difficulty of spotting the moon in some locations often led to different groups starting their fast on separate days, even within the same country. Each community, village, or even mosque within the village might send its own guy out to look for the crescent, with rival groups arguing over whether the other guy really saw it or not.\n\nToday, however, we have precise scientific calculations that tell us exactly when the new moon begins, and we don't need to wait until someone spots a tiny crescent in the sky. (In fact, according to the Oxford Dictionary of Islam, \"The need to determine the precise appearance of the hilal [crescent moon] was one of the inducements for Muslim scholars to study astronomy.\")\n\nSo, problem solved! Except that some Muslim scholars believe we should still wait until the slight crescent moon is visible in the night sky, because that's what Mohammed said to do and that's the way we've always done it.\n\nOthers argue that Islam has a strong tradition of reason, knowledge, and science, and that if Mohammed were around today he'd choose the more precise scientific calculations over sending the guy at the mosque with the best eyesight outside to squint at the night sky.\n\nTo make things even more fun, some argue that the whole world should just follow the official moon-sighting decrees of Saudi Arabia, the birthplace of Islam and the location of its holiest sites. But not everyone thinks that's such a swell idea — especially rival countries like Pakistan and Iran, which balk at the idea of treating Saudi Arabia as the ultimate authority on anything having to do with Islam.\n\nAll this means that each year Muslims around the world get to experience the delightful lunacy of \"moon-sighting fighting.\" Indeed, it's such a familiar feature of Ramadan that there are memes about it:\n\n Yes, Muslims use this meme too. There's really no escaping it.\n\n7) Are there differences between how Sunni Muslims and Shia Muslims observe Ramadan?\n\nFor the most part, no. Both Sunni and Shia Muslims fast during Ramadan. But there are some minor differences — for instance, Sunnis break their daily fast at sunset, when the sun is no longer visible on the horizon (but there's still light in the sky), whereas Shia wait until the redness of the setting sun has completely vanished and the sky is totally dark.\n\nShia also celebrate an additional holiday within the month of Ramadan that Sunnis do not. For three days — the 19th, 20th, and 21st days of Ramadan — Shia commemorate the martyrdom of Ali ibn Abi Talib, the cousin and son-in-law of the Prophet Mohammed who was both the revered fourth caliph of Sunni Islam and the first \"legitimate\" imam (leader) of Shia Islam.\n\nAli was assassinated in the fierce civil wars that erupted following the death of Mohammed over who should lead the Muslim community in his stead. On the 19th day of the month of Ramadan, while Ali was worshipping at a mosque in Kufa, Iraq, an assassin from a group of rebels who opposed his leadership fatally struck him with a poisoned sword. Ali died two days later.\n\nAli is a hugely important figure in Shia Islam. His tomb in nearby Najaf, Iraq, is the third-holiest site in Shia Islam, and millions of Shia make pilgrimage there every year. Although Sunnis revere Ali as one of the four \"rightly guided\" caliphs who ruled after Mohammed's death, they do not commemorate his death or make pilgrimage to his tomb.\n\n The tomb of Ali ibn Abi Talib in Najaf, Iraq. Toushiro, public domain\n\n8) What can I do to be respectful of my Muslim friends during Ramadan?\n\nIn some Muslim countries, it is a crime to eat and drink in public during the day in the month of Ramadan, even if you're not Muslim.\n\nOf course, this is not the case in the United States, where we enjoy freedom of (and freedom from) religion. And most American Muslims, myself included, don't expect the non-Muslims around us to radically change their behavior to accommodate our religious fast during Ramadan.\n\nI've had friends and co-workers who have chosen to fast along with me out of solidarity (or just because it seems \"fun\"), and that was sweet of them, but it's not something I ever expected people to do. (Plus, they usually last about four days before they decide solidarity is overrated and being thirsty for 15 hours is not even remotely \"fun.\")\n\nAll that said, there are things you can do — and not do — to make things a little easier for friends or colleagues who happen to be fasting for Ramadan. If you share an office with someone fasting, maybe eat your delicious, juicy cheeseburger in the office break room rather than at your desk, where your poor, suffering Muslim co-workers will have to smell it and salivate (if they even have enough moisture left in their bodies to salivate at that point).\n\nTry to remember not to offer them a bite or a sip of what you're eating, because it's sometimes hard for us to remember that we're fasting and easy to absentmindedly accept and eat that Lay's potato chip you just offered us. But if you do, it's okay. We're not going to get mad or be offended (unless you're doing it on purpose, in which case, what is wrong with you?).\n\nIf you're having a dinner party and you want to invite your Muslim friends, try to schedule it after sunset so they can eat. Muslims don't drink alcohol or eat pork, but we usually don't mind being around it. (Contrary to popular belief, we are not scared of or allergic to pork; we just don't eat it. It's not like we're vampires and pork is garlic.) But do let us know if there's alcohol or pork in something so we don't accidentally eat it.\n\nIf you want to wish your Muslim friends or acquaintances a happy Ramadan, you're welcome to just say, \"Happy Ramadan!\" That's not offensive or anything. But if you want to show them you made an effort to learn more about their religion, the standard Ramadan greetings are \"Ramadan kareem\" (which means \"have a generous Ramadan\") or \"Ramadan mubarak\" (which means \"have a blessed Ramadan\").\n\nEven something as simple as learning one of those expressions and saying it with a smile to your Muslim friends will go a long way toward making them feel comfortable and welcome.\n\n9) So if you're not supposed to get angry or complain or gossip during Ramadan, how come terrorist attacks by groups like ISIS and al-Qaeda always seem to spike during Ramadan?\n\nBecause terrorists are assholes.\n\nWatch: Muhammad Ali's biggest fights were outside the ring\n",
      "Folder": "Feedly",
      "Timestamp": "1495686589",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.669637Z"
}