{
  "id": "ca74f126f5c1481584fda246ee23bb5f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2019/11/12/20961089/disney-plus-free-year-verizon-unlimited-how-to-get",
      "Title": "How to get a year of free Disney+ from Verizon The Verge",
      "Selection": "Disney+ promises to be popular among viewers, especially children, Star Wars fans, animation enthusiasts, and Marvel lovers. The streaming service went live today, and while the normal cost is $6.99 per month or $69.99 per year (there are several bundled services also available), a subset of Verizon customers can save quite a bit of money by getting a year of Disney+ for free.\n\nAll you have to do is go to Verizon’s Disney+ page (you can’t get it through the Disney+ site) and sign up. However, as you can imagine, there are some requirements if you want to take advantage of this offer.\n\nFirst, you have to subscribe to one of Verizon’s Unlimited plans, including Go Unlimited, Beyond Unlimited, Above Unlimited, Get More Unlimited, Do More Unlimited, Play More Unlimited, or Start Unlimited. This offer is available for existing Unlimited customers, current Verizon customers who want to switch to Unlimited, and people who are willing to switch from other carriers. There are separate links on the Verizon page for each category.\n\nIf you’re an Unlimited customer and you’ve already signed up for Disney+, you can still get the free 12 months. Basically, the subscription you pre-purchased will be paused, and it will automatically resume after the free year is up. According to Verizon, you will get an email with instructions on how to manage things.\n\nFinally, you can also redeem a free year of Disney+ if you sign up for a new Fios or 5G Home internet plan. Unfortunately, in this case, only new customers are eligible; existing customers are out of luck.\n\nVox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy.\n",
      "Folder": "Feedly",
      "Timestamp": "1573585141",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.327769Z"
}