{
  "id": "ca8ba31347cc4e508c921d28e704bd68",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.artofmanliness.com/2018/03/21/fall-asleep-fast/",
      "Title": "How to Fall Asleep in 2 Minutes or Less The Art of Manliness",
      "Selection": "Have you ever unexpectedly found yourself with a snatch of time in which to steal a nap? You tried to settle into the chair or nook in which you found yourself, closed your eyes, and then . . . you just sat there, drowsy but awake. Despite feeling quite tired, you couldn’t fall asleep, and soon the time was up before you had gotten in so much as a wink. Talk about frustrating! Not only did you not get to nap, you didn’t do anything else either; if you weren’t going to fall asleep, you could have done something productive instead!\n\nIt’s quite a knack to be able to fall asleep at the drop of a hat, regardless of where you are and what’s going on around you. To steal some shuteye at airports and on flights, on break times and car rides, in public places and private spaces — in all the interstices of life. Not to mention how grand it is to be able to go out like a light as soon as your head hits the pillow each night.\n\nIt probably seems, however, that this is simply a knack that some folks have and others don’t, with the latter group being much larger than the former.\n\nYet the ability to fall asleep in two minutes or less, anywhere, anytime, is actually a skill like any other, and one anyone can learn. The technique for how to do so was in fact developed for Naval aviators during World War II, and today we’ll share it with you.\n\nHow to Fall Asleep in 2 Minutes or Less\n\nA couple years into WWII, the U.S. military realized it had a problem on its hands. Due to the enormous pressures of aerial combat, many of its pilots were accumulating levels of stress so debilitating that they were cracking under it. The tension caused them to lock up in flight and make fatal mistakes — accidentally shooting down friendly planes, or becoming an avoidable casualty themselves.\n\nIn an effort to stem the loss of pilots and planes, the military brought in Naval Ensign Bud Winter to research, develop, and test a scientific method for teaching relaxation. Before the war, Winter had been a successful college football and track coach, who had also worked with a professor of psychology on techniques to help athletes relax and perform better under the stress of competition. Stationed at the Del Monte Naval Pre-Flight School in California, his mission now was to coordinate with other coaches and professors to create a course that would similarly instruct cadets on how to stay calm and loose under the pressures of combat.\n\nThe end goal of the program was to teach the Naval aviators how to relax, so that they could learn more quickly, speed up their reaction time, sharpen their focus, and diminish their fear. The course also aimed to teach “combat aviators to be able to go to sleep in two minutes any time, day or night, under any and all conditions”; instruction in this skill was included to ensure that pilots got adequate sleep, and could sneak in extra shuteye whenever possible.\n\nTo accomplish the first goal, Winter taught the men how to physically relax. To accomplish the second, he taught them how to mentally relax. In fact, he essentially defined sleep as the state of being both physically and mentally relaxed.\n\nTo fall asleep at the drop of a hat, first you work on the former, and then the latter.\n\nHow to Physically Relax\n\nIn Relax and Win, the book Winter wrote about the program he developed for combat aviators and then used with athletes after the war, he lays out the exact instructions he gave to cadets to teach them how to relax their bodies; here we give them slightly condensed:\n\n“Sit back in your chairs and put your feet flat on the deck. Knees apart, your hands limp on the inside of your lap. Now, close your eyes and drop your chin until it rests on your chest.\n\nLet’s breathe slowly, deeply, and regularly. Take all the wrinkles out of your forehead. Relax your scalp. Just let go. Now let your jaw sag-g-g. Let it drop open. Now relax the rest of your face muscles. Get the brook trout look on your face. Even relax your tongue and lips. Just let them go loose. Breathe slowly.\n\nNow, let’s go after the eight muscles that control your eyes. Let them go limp in their sockets. No focus, just let them go limp. Breathe slowly.\n\nNow drop your shoulders as low as they will go. You think that they are low, but let them go more.  Did you feel the muscles in the back of your neck go limp? When you think you are really relaxed, let them go even more.\n\nNow, let’s relax your chest. Take a deep breath. Hold it. Exhale and blow out all your tensions. Just let your chest collapse. Let it sag-g-g. Imagine you are a big, heavy blob on the chair, a jellyfish. Breathe slowly. When you exhale, release more and more of your tensions.\n\nLet’s go after your arms. Talk directly to your arm muscles. First, talk to your right bicep. Tell it to relax, go limp. Do the same to your right forearm. Now to the right hand and fingers. Your arm should feel like a dead weight on your leg. Repeat the relaxation process with your left arm. Breathe slowly.\n\nYour entire upper body has been exposed to relaxation and a warm, pleasant feeling comes over you. You feel good. A sense of well-being invades your body.\n\nNow for your lower body. Talk to your right thigh muscles. Let them go to a dead weight on the chair. Let the meat hang on the bones. Go through the same routine for the right calf muscles. Then all the muscles of your right ankle and foot. Tell yourself that your right leg has no bones in it. It is just a flabby, heavy weight on the deck. Repeat the process with your left thigh, calf, ankle, and foot.\n\nAt present you are all relaxed physically, or think you are. For a little insurance, let’s take three deep breaths and when you let them out, blow out all the remaining tensions, one . . . whoosh, two . . . whoosh, three . . . whoosh.”\n\nIf you have trouble getting any of your body parts to feel sufficiently relaxed and jellyfish-like, try tensing them up first, and then letting them go loose.\n\nBy following the above protocol, you can achieve a nice general level of relaxation. Winter taught the cadets to cultivate this state in any pressure-filled situation, as it would loosen them up, dial down their nerves, enhance their concentration, and allow them to make better decisions.\n\nFrom this physically calm condition, Winter then taught the cadets how to “slip over the threshold into a deep, relaxed sleep” by becoming completely mentally relaxed.\n\nHow to Mentally Relax\n\nWinter argues that once you’re physically relaxed, if you get “your mind clear of any active thoughts for just ten seconds, you will be asleep.” The key to falling asleep quick is thus to stop the train of thoughts that is usually rumbling through your head. You have to stop ruminating on the regrets, worries, and problems of the day.\n\nWinter particularly warns against having any thoughts in which you are in motion; studies done by placing electrodes on the cadets’ bodies showed that even when you simply think of performing an activity, the muscles involved in that activity actually contract. Modern studies have in fact confirmed this observation, showing that simply imagining yourself exercising activates the same parts of the brain that come online when you’re physically in motion, and actually strengthens the muscles you imagine yourself using. While there might be some benefit to using your mind to “sit and be fit,” thinking about being active while trying to go to sleep can create muscular tension and inhibit its onset.\n\nSo, when you’re looking to nod off, you just want to fill your head with the stillest, calmest of contemplations. Winter suggests three good ones to use, though you don’t have to use all three; just pick one, and if it doesn’t work, try another:\n\n“First, we want you to fantasize that it is a warm spring day and you are lying in the bottom of a canoe on a very serene lake. You are looking up at a blue sky with lazy, floating clouds. Do not allow any other thought to creep in. Just concentrate on this picture and keep foreign thoughts out, particularly thoughts with any movement or motion involved. Hold this picture and enjoy it for ten seconds.\n\nIn the second sleep-producing fantasy, imagine that you are in a big, black, velvet hammock and everywhere you look is black. You must also hold this picture for ten seconds.\n\nThe third trick is to say the words ‘don’t think . . . don’t think . . . don’t think,’ etc. Hold this, blanking out other thoughts for at least ten seconds.”\n\nThe cadets at the pre-flight school had been broken into two groups: one which took the relaxation course, and the other a control group. The former outperformed the latter in every mentally-taxing class, discipline-requiring drill, and physically-intensive test. And after six weeks of practice, 96% of the aviators were able to fall asleep in 2 minutes or less — anywhere and anytime. Not only that, they could do it even when they drank coffee (though having caffeine in your system does make it harder), and even while the simulated noise of machine gunfire and cannon blasts played in the background!\n\nAfter the war, Winter taught the track athletes he coached the same relaxation techniques, and became one of the greatest sprint coaches of all time, producing 102 All-Americans and 27 Olympians; at one time, his runners held all 10 world records for sprinting events.\n\nWinter strongly believed that the wartime program for relaxation he helped develop to fight combat stress, and which athletes subsequently used to deal with the pressures of competition, was just as applicable to the tensions and fatigue civilians faced in their everyday lives.\n\nYou can use this general relaxation method to get physically relaxed whenever you’re feeling stressed out, and then tack on the mental relaxation exercise when you want to fall asleep fast. It’s handy for when you find yourself with a short window of time for a snooze; Winter thought even a 5-minute nap was incredibly refreshing. You could also use it to take a “hypnagogic nap” — a micro nap that artists like Salvador Dali used, in which you allow yourself to doze off for just a second in order to glean the creative insights that can arise on the threshold between sleep and wakefulness.\n\nOr, of course, you can simply use this technique when you go to bed, to more quickly and contentedly enter your nightly block of sleep.\n\nKeep in mind that being able to relax physically and mentally, and thus being able to fall asleep at the drop of a hat, is a skill, and like all skills, you shouldn’t expect to get the hang of it and have it work the first few times you try. You have to practice over and over again, until you get better and better at loosening up and calming down. That doesn’t mean you should work hard at trying to relax; that will just backfire and create tension. But you do have to practice this routine consistently.\n\nThe post How to Fall Asleep in 2 Minutes or Less appeared first on The Art of Manliness.\n",
      "Folder": "Feedly",
      "Timestamp": "1522204623",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.486351Z"
}