{
  "id": "cb2f1de40872407a89f82cdbf839793c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2016/9/1/12758606/cooks-science-americas-test-kitchen-recipes-why",
      "Title": "Cook’s Science demystifies the magic of good cooking The Verge",
      "Selection": "Cook’s Science, a new website from America’s Test Kitchen, launched at the end of July, and has rapidly become excellent lunch-break material. Like all brands under the America’s Test Kitchen umbrella, this new website is grounded in exploring the science of good food and using the scientific method to develop recipes. Unlike other products or brands out of America’s Test Kitchen, everything on the Cook’s Science website is free.\n\nThe publication mixes reported stories, videos, and recipes on favorite foods, like a deep dive into the history and science of ice cream, and recent trends, like making runny egg-yolk sauce. Birnbaum and Souza hope that through the stories they report and the “good, foolproof recipes” they create, more home cooks will be inspired to look into the science of what’s on their plate, and the people and cultures behind each dish.\n\n”We leave the test kitchen to report on the people, places and technology inspiring the world of food and science,” Cook’s Science executive editor Molly Birnbaum writes in an email. Birnbaum has a background in narrative journalism, and she and Souza had collaborated for years, including on the cookbooks The Science of Good Cooking and Cook’s Science, set to publish in October.\n\nThe website blends food science with food stories\n“We wanted to push how we cover science at ATK a little bit further,” Birnbaum says. “We wanted to combine my experience in narrative journalism with Dan’s experience developing recipes using the scientific method.”\n\nFor example, have you ever wondered about the origins of your favorite salsa-soaked happy-hour foods? According to a feature in Cook’s Science, tacos and corn chips wouldn’t exist were it not for a fascinating technique called nixtamalization, invented by the Maya, a Mesoamerican civilization that lived from approximately 2000 BC to 1700 AD. \n\nAlthough many hundreds of years have passed since the Maya discovered nixtamalization, there really isn’t a substitute for the process, Souza says. But, luckily, it isn’t contained simply to tortilla factories or hip restaurants, like Empellón Al Pastor in New York City, featured in the Cook’s Science article. Adventurous home cooks can try their hand at nixtamalizing corn and making fresh tortillas with a recipe created by Tim Chin, test cook at Cook’s Science. The feature goes details each step of the process. As a bonus, they created a recipe for nixtamalized corn bread.\n",
      "Folder": "Feedly",
      "Timestamp": "1472778833",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.780901Z"
}