{
  "id": "cb4ddc48a09247f8b9998419113eef85",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/932354/the-stupid-reason-that-larger-clothes-fit-so-badly/",
      "Title": "The stupid reason that larger clothes fit so badly Quartz",
      "Selection": "A common complaint among women who wear sizes 16 and up is that if they can find items in their size at all, it’s even harder to find clothes that fit well. More than just an annoyance, the problem can be dispiriting and humiliating, and leave women feeling excluded from fashion. What’s especially absurd about this situation is that the average American woman is now a size 16 to 18, according to the most recent research—suggesting that most women in America are struggling to find clothes that fit right.\n\nOf course it’s just the natural fact that not all bodies share the same shape, even at the same size. But part of the blame for the problem, according to industry insiders, lies with the fashion brands themselves.\n\nThe issue is the way many clothing companies create their range of sizes—by using a single fit model and mathematically scaling up and down based on that one person’s measurements. At larger sizes in particular, the result could be tops that are too small in the bust or overly boxy; bottoms that fit in the rear but not at the waist; seams and pockets hitting at all the wrong places.\n\nThere is a solution: All brands need to do is fit their clothes on larger models. The trouble is that doing this for every garment costs time and money, and many brands aren’t willing to invest that—either because they don’t care to or they don’t realize they need to.\n\nThat can create a self-reinforcing cycle, where brands aren’t able to sell their ill-fitting, larger-sized garments, so they conclude that they don’t have many larger-size customers. In turn, they don’t design their new products with those customers in mind—ensuring they won’t win them over. The upshot? Brands are probably missing out on sales they could make if they just fit their clothes better, and customers who wear larger sizes are left with few options that work for them.\n\nHow fit problems start\n\nThe fit models brands use to calibrate their sizing aren’t like the runway or editorial models most people associate with fashion, but they’re equally important, if not more so. Unlike runway models, who are preternaturally tall and thin, fit models represent something like the platonic ideal of a brand’s real-life customers. Their bodies are the perfect proportions for, say, the standard women’s size 6—one of the most popular sizes brands hire. And unlike mannequins (paywall), they allow you to see how clothes move, and can offer feedback if something doesn’t feel right.\n\nHere’s how it generally works: A women’s clothing brand will find the fit model it likes and create its size 6 based on her measurements. Then, in a process called grading, it will use software to mathematically scale the dimensions up or down for its other sizes. For each increase in tagged size, a brand might add one inch to the bust of a shirt, room in the shoulders, and length in the sleeves. Each company has its own rules for how its clothes change from size to size.\n\n A single fit model could be the basis for one label’s entire range of sizes \n\nA single fit model could be the basis for the entire range of sizes at one label—or at several. Some fit models become industry favorites and the template for the fit of numerous lines.\n\nThe method works well enough for sizes close to the fit model’s, but potentially less so as the sizes move away. “When you’re four or five sizes away from a fit model size, you’re talking about something that’s kind of been stretched and distorted, and you’re hoping it fits somebody,” explains Abe Burmeister, founder of clothing brand Outlier, which sells only men’s clothing now but for years had a women’s line as well. “They work to a pretty decent extent. But at the same time it’s nothing like when something is tailored to you, or somebody very similar to you.”\n\nHuman bodies generally don’t scale up uniformly with each increase in size. There can be much more of a difference between a size 8 and a size 12 than there is between a size 8 and a size 4.\n\nThis issue is at the heart of the poorly fitting clothes many brands offer their customers in bigger sizes, according to Mark-Evan Blackman, a professor at the Fashion Institute of Technology in New York who teaches fitting and formerly had his own large-sized brand. “When certain size ranges are chronically not fitting well,” he says, “it’s because they’re not being fit and are being mathematically graded up.” If you evenly grade the bust on a size 6 up to a size 12, for instance, it’s likely to turn out too small.\n\nBrands need to design for all sizes, starting with their fit models. (Joel Ryan/Invision/AP)\nHow brands can create clothes that fit\n\nThe problem is fixable, though, and the solution isn’t complicated.\n\n“Fit regularly on a professional fit model who is a size 18 or the size most sold by the brand, and conduct wear tests and/or size sets,” says Dale Noelle, the founder and president of True Model Management, a modeling agency that works with a large number of fit models.\n\nWear tests refer to when brands give models or employees sample items to wear and wash over time before producing them for the market. Size sets are when a brand fits a garment on fit models in multiple sizes (the ideal practice). Noelle, who was a fit model herself for many years, says they allow a company to confirm that the grading rules they’ve applied fit all their sizes well—so that pockets are hitting in the right place, for instance, and the dimensions look right on most customers.\n\nThere’s a bit potential benefit for brands taking these steps: Customers who wear larger sizes tend to be loyal shoppers once they find a brand that fits them—as the success of the millennial-favorite ModCloth has found, marketing its quirky, hip, vintage-inspired style to a wide range of sizes. The Walmart-owned e-commerce company Jet recently purchased the company.\n\nMarshall Cohen, chief retail analyst for research firm NPD Group, estimates that sales of what are generally called plus-size clothes, most often meaning size 16 and up, are about half what they could be if the fashion industry made more options available.\n\nAnd why they don’t\n\nBrands don’t generally share their fitting practices outside the company, but Blackman calls it “industry knowledge” that most do not use multiple fit models for sizing.\n\nNoelle’s experience backs his statement. She says most companies use one fit model for each of their lines. The typical model used for missy sizing—the industry name for the common run of sizes—is a 6. Brands with plus lines often will hire a size 18 model for fittings and grade its other sizes based on her measurements. But many brands still don’t have dedicated lines for their larger customers, and if they offer sizes above 16, they may still be basing the measurements on that size 6 model.\n\nOne reason many brands don’t hire fit models in different sizes is the cost. Depending on the city and model, they can command rates (paywall) of more than $100 an hour, or upwards of twice that. Multiply the figure by several models trying on a range of garments—since the cut of a garment can also affect how it should be sized up—and the cost can add up, especially for small brands.\n\nBut Burmeister believes there may be another underlying factor at play. “Our stuff forms a pretty clean bell curve around the fit model size, and that’s how we plan and how we order and everything,” he says. “I realized it’s a self-fulfilling prophecy.”\n\n Brands interpret those low sales as meaning they don’t have an audience of larger-size customers \n\nWhat he means is that the sizes closest to the fit model sell the best, since they usually offer customers the best fit and look good in the dressing room. The further away from the fit model’s size that you get, the worse the fit becomes and less likely customers are to buy the garment. Brands interpret those low sales as meaning they don’t have an audience of larger-size customers, which convinces them it’s not worth investing the resources in appealing to that audience—such as by also hiring a larger-sized fit model. That’s why the fit problems in larger sizes continue.\n\nIt’s similar to the way brick-and-mortar stores may come to believe customers who wear larger sizes don’t shop there, when what’s keeping the customers at bay is actually a poor shopping experience for them.\n\nSolutions require investment\n\nBurmeister admits his brand suffered from this issue when it had a women’s line, and understands what a challenge it is to overcome. “Every time I read articles and people are pointing out that plus-size women are under-represented, especially given how large the market is, well you know the sales data probably at all these brands is telling them that they have no sales there,” he says. “Even if you wanted to combat that, if your sales data is telling you ‘don’t bother,’ it takes a real commitment in order to get there.”\n\nTo complicate matters further, many brands consider just one body shape, when Blackman says women generally fall into one of four different shapes, which can be more pronounced in larger sizes: A woman’s figure might run straight from top to bottom; she might have an hourglass figure; and then there are women who are larger on top than on the bottom, and vice versa.\n\nThese challenges aren’t insurmountable, however. “It’s tough to go after four [shapes], but it’s fine to go after two,” says Blackman. “If you go after two and do it well, you’re hitting 50% of the market.”\n\nTo solve such problems will require real investment from fashion brands in both time and money as they make larger sizes a priority and not just an afterthought. But if they’re serious about serving the many American customers dissatisfied with the fit of their products, it’s an investment that can pay off.\n\n“She will buy,” Blackman says, “if it fits her.”\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1493062643",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.683773Z"
}