{
  "id": "cb5dd3a9ca6f4a99b7dfff487ecc638e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/the-goods/2018/9/21/17886902/womens-clothing-with-pockets",
      "Title": "Pockets are important to women, and high-fashion designers are recognizing that Vox - All",
      "Selection": "Ah, fall! It’s the time of year when a horde of fashion editors, store buyers, and social media influencers travel to New York, London, Milan, and Paris for each city’s fashion week. This time around, pockets are big on the runways. Literally, they are very big.\n\nOn the runway at Fendi, models wore leather coats that bulged with pockets of all sizes, which looked like they could easily fit a phone, an iPad, and a few packs of Rolos, or tampons. At Alberta Ferretti, there were outsize cargo pockets ballooning off of miniskirts and vertically stacked on denim jackets.\n\nDesigners have played with the proportion of pockets before; Ferretti’s cargo skirts, for example, resemble ones that Marc Jacobs showed in September 2014. But it’s a micro-trend that’s worth paying attention to, because pockets are the site of a centuries-old gender divide in fashion — one that has deep political implications. \n\n        A model walks the Alberta Ferretti runway at Milan Fashion Week.\n\n        Victor Virgile/Getty Images\n\n        A model walks the Alberta Ferretti runway at Milan Fashion Week.\n\n        Victor Virgile/Getty Images\n\nDespite most women’s insistence that they do want pockets, a lot of clothing is entirely lacking this feature. And sometimes clothes do have pockets, but they’re tiny and therefore useless, save for storing a few individual sticks of gum. \n\nexec: So what do we think women want in fashion?women: Pocke--exec: Cold shoulder tops in pastels. Got it.women: Pock--exec: Clothes with pre-made holes in delicate fabrics.women: Po--exec: Cut-outs in flabby areas. Good.women: POCKET--exec: Shapes that require new bras!\n— Delilah S. Dawson (@DelilahSDawson) June 20, 2018\n\nThis is something women have railed against for a long time. As Chelsea G. Summers reported for Racked, the Rational Dress Society, which was founded in 1891 with the aim to ditch corsets and get women into more movement-friendly clothing, was all about pockets. Suffragette suits had pockets in spades.\n\nWomen and men used to wear pockets equally, Summers writes: Everyone wore belts with satchels hanging from them in medieval times. But in the late 17th century, sewn pockets migrated into men’s trousers and coats, while women kept wearing external pouches concealed under a slit in their skirts. When in the late 18th century full gowns gave way to slimmer empire waist dresses — popularized in the west by Joséphine de Beauharnais, the first wife of Napoleon — those pouches had nowhere to go. So women started carrying small purses called reticules.\n\nThis, writes Summers, had the effect of limiting women’s freedom. “Take away pockets happily hidden under garments, and you limit women’s ability to navigate public spaces, to carry seditious (or merely amorous) writing, or to travel unaccompanied,” she writes.\n\nThus, when women started wearing visible pockets in the early 20th century, women reignited the fear that their pockets “could carry something secret, something private, or something deadly.”\n\n        Fendi’s runway show on September 20, 2018, featured some huge pockets.\n\n        Victor Virgile/Getty Images\n\n        Fendi’s runway show on September 20, 2018, featured huge pockets, seen here on Bella Hadid.\n\n        Victor Virigle/Getty Images\n\nAt Fendi’s runway show in Milan on Thursday, designer Karl Lagerfeld did a tidy job mashing up historical pocket trends. While walking the runway, model Bella Hadid wore black bicycle shorts, a creamy button-down shirt with pockets hanging to her hips, and a belt with a number of dangling pouches (an accessory that, like the fanny pack, has been trending elsewhere, too).\n\nHadid’s belt looks like a modern-day utility belt, but it also mimics the look of a medieval belt strapped with pouches. Her shirt’s big, swaggy pockets, however, looked totally modern. Lagerfeld could have stopped there, but he also gave Hadid a leather purse to carry. That makes perfect business sense — luxury brands rely on handbag sales — and perhaps it only bolsters the look of a woman on the go. But it also complicates the historical narrative told by the rest of Hadid’s outfit.\n\nThough, it should be noted, even Hadid’s purse had extra pockets sewn on the side.\n\nWant more stories from The Goods by Vox? Sign up for our newsletter here.\n",
      "Folder": "Feedly",
      "Timestamp": "1537682039",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.438738Z"
}