{
  "id": "cb97e3b3265f4a0cbcb2e8d751eddb78",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2019/05/bloat-does-not-explain-the-rising-cost-of-education.html",
      "Title": "Bloat Does Not Explain the Rising Cost of Education Marginal Revolution",
      "Selection": "In Why Are The Prices So D*mn High? Helland and I examine lower education, higher education and health care in-depth and we do a broader statistical analysis of 139 industries. Today, I will make a few points about education. First, costs in both lower and higher education are rising faster than inflation and have been doing so for a very long time. In 1950 the U.S. spent $2,311 per elementary and secondary public school student compared with $12,673 in 2013, over five times more (both figures in $2015). Note also from Figure 2 that the rate of increase was fastest in the 1950s and 1960s–a point to which I will return later in this series.\n\nCollege costs have also increased dramatically over time. For this book, we are interested in costs more than tuition because we want to know what society is giving up to produce education rather than who, in the first instance, is paying for it. Costs are considerably higher than tuition even today, although in recent years tuition has been catching up. Essentially students and their parents have been paying an increasing share of the increasing cost of higher education. Moreover, as with lower education, costs have been rising for a very long period of time.\n\nI will take it as given that the explanation for higher costs isn’t higher quality. The evidence on tests scores is discussed in the book:\n\nIt is sometimes argued that how we teach has not changed but that what we teach has improved in quality. It is questionable whether studies of Shakespeare have improved, but there have been advances in biology, computer science, and physics that are taught today but were not in the past. However, these kinds of improvements cannot explain increases in cost. It is no more expensive to teach new theories than old. In a few fields, one might argue that lab equipment has improved, which it certainly has, but we know from figure 1 that goods in general have decreased in price. It is much cheaper today, for example, to equip a classroom with a computer than it was in the past.\n\nThe most popular explanation why the cost of education has increased is bloat. Elizabeth Warren and Chris Christie, for example, have both blamed climbing walls and lazy rivers for higher tuition costs. Paul Campos argues that the real reason college costs are growing is “the constant expansion of university administration.” Redundant administrators are also commonly blamed for rising public school costs.\n\nThe bloat theory is superficially plausible. The lazy rivers do exist! But the bloat theory requires longer and lazier rivers every year, which is less plausible. It’s also peculiar that the cost of education is rising in both lower and higher education and in public and private colleges despite very different competitive structures. Indeed, it’s suspicious that in higher education bloat is often blamed on competition–the “amenities arms race“–while in lower education bloat is often blamed on lack of competition! An all-purpose theory doesn’t explain much.\n\nMore importantly, the data reject the bloat theory. Figure 8 shows spending shares in higher education. Contrary to the bloat theory, the administrative share of spending has not increased much in over thirty years. The research share, where you might expect to find higher lab costs, has fluctuated a little but also hasn’t risen much. The plant share which is where you might expect to find lazy rivers has even gone down a little, at least compared to the early 1980s.\n\nNor is it true that administrators are taking over the public schools, see Figure 10.\n\nCompared with teachers and other staff, the number of principals and administrators is vanishingly small, only 0.4 per 100 students over the 1950–2015 period. It is true, if one looks closely, that the number of principals and administrators doubled be-tween 1970 and 1980. It is unclear whether this is a real increase or a data artifact (we only have data for 1970 and 1980, not the years in between during this period). But because the base numbers are small, even a doubling cannot explain much. A bloated little toe cannot explain a 20-pound weight gain. Moreover, the increase in administrators was over by 1980, but expenditures kept growing.\n\nIf bloat doesn’t work, what is the explanation for higher costs in education? The explanation turns out to be simple: we are paying teachers (and faculty) more in real terms and we have hired more of them. It’s hard to get costs to fall when input prices and quantities are both rising and teachers are doing more or less the same job as in 1950.\n\nWe are not arguing, however, that teachers are overpaid!\n\nIndeed, it is part of our theory that teachers are earning a normal wage for their level of skill and education. The evidence that teachers earn substantially above-market wages is slim. Teachers’ unions in public schools, for example, cannot explain decade-by-decade increases in teacher compensation. In fact, most estimates find that teachers’ unions raise the wage level by only approximately 5 percent. In other words, teachers’ unions can explain why teachers earn 5 percent more than similar workers in the private sector, but unions cannot explain why teachers’ wages increase over time.\n\nIf the case for unions as a cause of rising teacher compensation in public schools is weak, it is nonexistent for increased compensation for college faculty, for whom wage bargaining is done worker by worker with essentially no collective bargaining whatsoever.\n\nA signal to where we are heading is this:\n\nIf increasing labor costs explain the increasing price of education but teachers are not overpaid relative to similar workers in other industries, then increasing labor costs must lead to higher prices in the education industry more than in other industries.\n\nRead the whole thing. Next up, health care.\n\nThe post Bloat Does Not Explain the Rising Cost of Education appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1558978544",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.401402Z"
}