{
  "id": "cb9b1e8cde7f42c6a6c9d8876840369b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1042312/foursquare-founder-dennis-crowley-shares-six-essential-lessons-on-tenacity/",
      "Title": "The founder of one of the most successful startups in America says one personality trait is the key to success Quartz",
      "Selection": "In 2013, Foursquare co-founder Dennis Crowley walked into a bakery and bought a cake. Almond, with meringue on top. It was sweet—but the milestone was sweeter.\n\nFor more than a decade—since his grad school days—he’d been pursuing one big idea: a product that understands how users move through the world so well, it can deliver timely, personalized tips. That idea had evolved through several iterations, from a startup called Dodgeball to the founding of Foursquare.\n\nWhen he bought the cake, the company best known for “checking in” was several years into something bigger, developing mobile software that would recognize users’ locations and automatically push tailored recommendations.\n\nOne of the developers gave Crowley a phone with a new build and told him to go for a walk with it. The Foursquare founder went down the street towards Little Cupcake Bakeshop. The phone lit up and pinged him to let him know he was near the bakery and what people like to get there. On the list? The dreaming princess cake.\n\nIt had worked: the phone knew where Crowley was and offered useful information, without any input from him. Needless to say, there was dreaming princess cake for everyone in the office that afternoon.\n\nThat game-changing moment would be followed by a thousand mini-breakthroughs: cutting the time it took for the phone to ping, for example, or better distinguishing between two neighboring stores. “Those changes are harder to notice,” says Crowley. “The moment it goes from not working to working is the big moment.”\n\nIn this exclusive interview, he urges founders to think audaciously, and to push toward their own big moments. Crowley examines six facets to tenacity and how each can drive a company forward differently. He shares advice for how to pursue an idea for the long haul—and, as importantly, how to inspire and mobilize the rest of your team to care about it, too.\n\nTenacity as identity\n\nThe germ of tenacity can be as much about a great idea as one’s self-identification with it. “Sometimes you just have to build it to prove to yourself that it works or doesn’t. It’s as much about if and why it works, as your agency in it,” says Crowley.\n\nTake his first experiment, Dodgeball. The initial version was essentially just a city guide, wherein users could write reviews of places they’d been. This was around 2000; the guide wasn’t mobile, and crowdsourced content was still relatively unheard of. In fact, everyone in the space told him it couldn’t work—editors were necessary for a reason. “People said it’s a bad idea,” says Crowley. “I lulled myself into thinking the same. It’s not going to work. So we didn’t build it.”\n\nSo what changed? Quite simply, this product was something Crowley himself wanted to use. The idea stuck in his mind, needling him, and he had to see if it could work. “To build it was almost like fulfilling a need to express myself. So that was the project I learned how to code for. I taught myself out of one of those big ‘Learn to Code in 30 Days’ books,” he says, “Personally, it was fulfilling. Externally, it wasn’t a huge success. A couple of thousand people used it.”\n\nBut it laid the groundwork for Dodgeball Version 2.0, the prevailing version when Crowley founded a company by the same name in 2004. “I was on the product and engineering team of Vindigo at the time, and we would say, wouldn’t it be crazy if you could see where all of your friends had been? You wouldn’t have to read the reviews—you could just go to the places they’d been.”\n\nAgain there were naysayers, and again Crowley knew he needed to see if it could be done the way he would do it—and if anyone else wanted to use it. “I wanted this thing to exist. I thought, It doesn’t seem like anyone else is going to build this, so I’ll go build it.”\n\nAround that time, as fate would have it, Crowley and several of his friends were laid off. “We were trying to find each other around the city,” he said. They had a need, and the time and skill-set to meet it. “We wanted a way that you could just check in at an East Village bar and that’s how you would know to go find someone. Looking back the idea was there, we just needed a community to form around it.”\n\n If, after several turns in your career and life, you return to the same idea, pursue it. Your creation is as much an act of self-expression at that point.  \n\nDodgeball introduced the world to the concept of “checking in,” and it turned out, lots of other people wanted it. “I thought, ‘If only ten of my friends use this, it’s fine because it helped us.’ We found that if you can build something that you’re interested in and your ten friends are really into, there’s a good chance that their ten friends will be into it, and their friends as well,” says Crowley. “My lesson is that you’ll need more than yourself eventually, but not much more. Don’t give up until you can go after it with at least ten friends.”\n\nSoon, more than ten friends became interested. Crowley teamed up with Alex Rainert at NYU, where he started to refine the idea. Dodgeball went from a side project to a full-blown thesis. Google took note, too, and bought Dodgeball in 2005. A couple of years later, though, Crowley was itching to take his idea further.\n\nTenacity as confidence (tempered with humility)\n\nEven after achieving success—Dodgeball’s sale to Google, Foursquare’s buzzed-about debut at 2009’s SXSW—Crowley encountered resistance.\n\nBut one key ingredient of tenacity? Persistence. “When we pitched Foursquare to investors, the feedback universally was ‘You already made this and you already sold it. Google ultimately didn’t want it and it didn’t work. Why would I ever invest in you doing the same thing again?’” recounts Crowley.\n\nOf course, it wasn’t the same thing. In just a few years, phones had changed dramatically, as had the ways people engaged online and with their social networks. But just as you need to believe in your idea enough to build it, you need to believe enough to sell it—even if you yourself aren’t sure where you’re going to end up.\n\n“We knew from Dodgeball that if we got a bunch of people checking in, there was really interesting trends at work in that data. We didn’t know the full extent of what Foursquare would become years later, but we knew there was something buried in the data,” says Crowley. “And we know the idea of checking in, especially when combined with game mechanics, would get people to give us the data.”\n\nDon’t confuse confidence in your mission with hubris, though. There will still be expert outside voices who can see things you don’t. When you find trustworthy counsel, listen to what they have to say.\n\nFor Crowley, that came in the form of venture capitalist Charlie O’Donnell, who was able to see the winning pitch for Foursquare before its founders could. “We were out there describing how we would build a personalized guide to the world from all our data. As we were pitching, Charlie wrote a blog post called ‘Why Yelp — and every single retail establishment—should support Foursquare.’” With a little distance, O’Donnell could see the story that investors and merchants would respond to. “His was a very clear articulation of what Foursquare offers. It’s this force that drives people to places. They check in. Merchants see that, and offer specials to encourage more check-ins. There’s an ecosystem there.”\n\nCrowley and his team understood that ecosystem, of course, but couldn’t take their eyes off the endgame. “We were like, ‘No! Personalized guide! Personalized guide!’ It took conversations with investors before we really realized what the story could be at that point. There was money to be made with merchants and with the data that helped them understand where consumers were going and what they liked. Once we started to understand the storyline that investors found compelling, we combined it with the narrative that we had crafted on our own. That’s when it turned into something real.”\n\nTenacity as focus\n\nIn the commotion of launching a company, though, it can be hard to distinguish between wise voices and noise, between the ideas that move you forward and the ones that sidetrack you.\n\nCrowley’s advice to founders is to articulate—and then frequently check-in with—their North Star. How to do that? “Keep asking: ‘what’s this supposed to be when it grows up?’” he says. “We’ve always had an orienting grand vision, sometimes to a fault: build products that generate information about where people are going and use that data to create products that make it easier for them to navigate the real world.”\n\nBut there was a moment, Crowley now recalls, when he and his cofounders thought they should perhaps pivot to being “the check-in-to-everything company.” It was 2010, and new imitators were cropping up every day, applying Foursquare’s concept to anything from events to meals. “There was this whole movement: you’ll check into TV shows and check into articles. We laugh at it now, but we thought, Should we do that?”\n\nCrowley and his team kept their eye on their North Star and avoided deviating down that and any number of other distracting paths. “You have to ask yourself, is what we’re supposed to be in ten years? Are these the products that we’re destined to create ten years from now? You have to have a clear opinion of what you’re doing or what you’re not doing. You have to trust your gut sometimes and say, ‘This keeps us on the path more than this would.’”\n\nStaying on the right path is not simply about making major decisions thoughtfully; it’s not a once-a-year agenda item for the company offsite. “It’s a series of decisions that get made every day,” says Crowley. “That’s because new factors in the form of data, market shifts, competitors, advisors—you name it—change the set of information you use to make decisions at any one point in time. The only way to keep focus is to continue to ask yourself: what’s this supposed to be when it grows up? You’ll either explain or rationalize your answer. That’ll help guide you.”\n\nUp until 2013, for example, Foursquare gave its API away for free, even to the Fortune 500 companies who were using it—then an investor pointed out that that was crazy. “We thought people would switch to something else if we charged for it. It turns out when we started calling up the companies that were using the API most aggressively, they said, ‘Of course we’re going to pay for this. We’re actually wondering why you didn’t call us six months ago asking to be paid.’”\n\nThe team put together the requisite pricing plans and sales strategies and began selling their API. And in so doing, their eyes were opened to a world of new data products they could develop. In fact, in recent years, Foursquare has dedicated growing resources to enterprise sales of those products.\n\nBut how can you tell the difference between a distraction from your mission and a pivot that will enhance it? It all comes back to the crucial guidance of that North Star. “We always said, ‘Build the stuff that makes the real world easier to use,’” says Crowley. “If you’ve chosen the right mission—if, crucially, it’s something that excites you—your own reaction to new ideas will be telling.”\n\nAdmittedly, these were tough decisions for Crowley back then. The signals in the industry told him Foursquare should be big and be competitive. Almost weekly, he had conversations like this:\n\nCrowley: “I’m the founder and I don’t want to do that.”\n\nSomeone else: “But, that’s what everyone else is doing.”\n\nCrowley: “I don’t care. I don’t want to do that.”\n\nIn hindsight, Crowley can laugh about it and say it was such an easy decision. But it wasn’t. It was taxing.\n\nThere will always be distractions, big and small. As a founder, your responsibility is to stay mission-focused. “I think about those early Facebook stories. They had so much success, and so many distractions—Yahoo! trying to buy them for a billion dollars. The response from Mark Zuckerberg from that time is something like, ‘I don’t think I’m ever going to have an idea this good again.’ That, I think, sums it up.”\n\nTenacity as grit\n\nIt’s unlikely that bringing your big idea to the world will happen overnight, and having a mission you believe in will only become more important when you hit the inevitable slogs. Reflecting on his own decade-long journey, Crowley identified a few key principles that will help founders endure for the long haul:\n\nDon’t wait for someone else to build it. A lot of startups begin with a good idea that no one else has run with yet. That kind of initiative should remain a part of your company’s DNA, long after your seed round recedes into company history. And don’t be afraid to punch above your weight.\n\nFor years, Crowley had imagined technology that would know where a user had been without being told. Once someone delivered that, he thought, he’d make even better, smarter services. Until that day, Foursquare’s app would just use manual check-ins as a workaround.\n\n“In 2011, we were waiting for other companies, Google and Apple, to build that technology. It would be able to tell you, the developer, or tell your app where it was, which store or restaurant it was in. I thought that was going to be baked into the iPhone 4S with iOS 5. Those were the signals that we were getting from Apple with all the geo-fencing that they were launching,” says Crowley. “I remember we watched the keynote. We got the phone and we played with it. And we said, ‘this doesn’t do what it’s supposed to do.’”\n\nThat moment was an epiphany for Crowley: You can’t wait for another company to make the technology you need to build what you’re destined to build. You must develop it yourself.\n\nFrom that day, Crowley and his team set about learning how to develop the platform they needed to move forward on their revenue-generating plans. It took years. “There were moments when our board would say, ‘this thing doesn’t work. Is it ever going to work? We invested a lot of money into getting this thing working. When will it work?’ And the answer was: ‘I don’t know.’ It was a harder problem than anyone thought it was. It required more engineers and data scientists, which we didn’t have before. There was nothing for us to copy. We were building it from scratch.”\n\nWhat he didn’t tell the board was that he wasn’t always sure it was ever going to work. “You know what the end goal is. You know the stakes are high, and that there’s good reward for doing it,” says Crowley. “That’s the thing that keeps you doing it.”\n\n But that’s the thing about tenacity: sometimes you have to make the big bet, say it out loud, then throw yourself in so there’s no going back.  \n\nFoursquare’s technology embodies tenacity, even down to the name. The company called its location technology Pilgrim, to represent how important—nearly sacred—this mission was for the company, and how persistent it must be in its journey toward it. “When we announced Pilgrim, I took a look back at all we accomplished. Personally it had been eight years working on Foursquare and more than a dozen immersed in location-based or contextual-aware services,” says Crowley. “That’s even before you get to the efforts of hundreds of people at Foursquare. But that’s what it takes to build something—like our Places API or Pilgrim SDK—that can help thousands of developers or marketers. Tenacity over time has an exponential—not a linear—impact. But it takes dedication.”\n\nTenacity as a culture\n\nAt the end of the day, tenacity needs to transcend the founder and become a core company value. Big ideas aren’t brought to fruition single-handedly. Just as you’ll devote your time to scaling operations, you need to scale tenacity, too.\n\nTalk about setbacks openly and honestly. Make it a habit to share the good and the bad. “It’s really hard, but you can create a cadence. At an All Hands or weekly check-in, show two slides every week. One slide is about what’s good, one slide is about what’s bad. Build this into your process,” says Crowley. “Whatever the format, the goal is simply to ensure that the people building and selling your products understand what’s going on with the company. Overemphasizing the positive becomes problematic. Some companies are just drinking their own Kool-Aid all the time. That’s not helpful for anyone. You have to have a regular dosage of good news and bad news for self-awareness.”\n\nSeed a culture of ingenuity. You developed your foundational idea with grit and focus. As you grow, you’ll need to elevate lofty thinking as a company value and reward those who practice it, and you’ll increase tenacity exponentially.\n\n“We have infused the company with that same shoot-for-the-moon spirit that started it. Now, a lot of the things that generate revenue for the company aren’t my ideas. Someone pitched an advertising product that was loosely tied to Pilgrim, something that would help advertisers measure ad effectiveness. Another said we could predict the number of iPhone 6s that’d be sold based on foot traffic data,” says Crowley. “Those were not my ideas. They’re crazy. ‘Has anyone ever done that?’ No. ‘Why don’t you go do it?’ All right. ‘What do you need?’ We’ll get a couple of people to go work on it. ‘Go do that and let me know how it works out.’ That turns into a huge part of what we’re doing.”\n\nHow, though, can you stay focused when lots of fresh minds are generating lots of fresh ideas? Ask yourself whether any new idea leverages your core idea. If it does, trust in it, even if it seems outlandish. That’s how you honor the spirit of risk-taking that got you to where you are, without getting distracted.\n\n If your core idea is your North Star, go ahead and build a constellation around it. Just avoid adding stars that’ll shine alone in another galaxy—they rarely get as bright. \n\nTenacity as a private truth\n\nCasual observers probably don’t know that the Foursquare team has been defining itself as a location intelligence company; indeed, many have kept judging the company by its consumer apps’ usage metrics. “These days, we all know that we are creating a location tech company, built on the amazing work we do on the consumer side. But plenty of people on the outside world are like, ‘I don’t use your app anymore, therefore your company must be failing,’” says Crowley. “Sometimes people tell me they don’t use the Foursquare app anymore and to that I say, ‘Hey not a problem—we have more than 50 million people around the world who do!’ I think there’s also a lot of people who touch Foursquare data everyday—through our partnerships with Snapchat, Uber, Twitter, or Apple Maps—without even knowing it. The company is performing well these days because of all the technology we’ve built on top of all the data we have.”\n\nAs a founder, you will likely find yourself, from time to time, sitting on business data or strategy that you can’t yet share. That’s not to say you shouldn’t speak up when you can. Foursquare, for example, has been engaged in a significant campaign to educate people outside the company about its current priorities. “In the first three or four years of a company, though, you’re not doing that,” says Crowley. “The press is telling your story, the users are telling your story. Maybe you get on stage at a conference occasionally and talk about the great stuff that you’re building.”\n\nThen there are the even more frustrating middle years. That’s when you’re likely to be building the bigger, better things that will allow you to scale. And if you’re like most companies, there are sure to be stretches when your killer new technology isn’t working the way you wanted—or is still just a glimmer in your eye.\n\nThat’s the moment, Crowley says, to double down and stay true to your big idea. You might not be sending out press releases, but there’s one audience you can and should be talking to: your team. “Answer every question that they might have about your product. Repeat what you’re doing every week at the company meeting. Remind each other. Explain how you define success, and reinforce that internally. The world might not need to understand what you’re up to yet, but they sure do.”\n\nTying it together\n\nTenacity has many manifestations for founders and their startups. At the beginning, it’s often deeply tied to identity. Giving up one’s idea feels like giving up on oneself. After hitting early milestones, tenacity is confidence. But it’s best tempered with humility, so as to avoid flying too high on early wins. As a company scales, tenacity is focus. There will be accompanying growing pains as customers sign up, headcount grows, and the market responds. Anchor and orient yourself by asking: what is this supposed to be when it grows up? When the going gets tough, tenacity is grit. Don’t look externally to others to build what you need—you’ll be waiting longer than you want. Do it yourself. Lastly, tenacity is culture and a private truth. Tenacity at scale will both involve and elude people. What guides the team isn’t always accurately reflected in the public’s perception. An informed, committed team around you is the best way to drown out the noise and to march toward achieving your biggest goals.\n\n“These different facets of tenacity are important insofar as invoking them keeps your legs moving and charging forward. Growing a company is an impossibly hard endeavor—many wouldn’t start if they knew just how difficult it is,” Crowley says. “But the early stories of most successful companies are often those in which no one thought it could be done. In fact, if you asked them, those founders probably didn’t know if they could do it either. But if you can get there—if you stick to what you set out to do—it can put you in an amazingly powerful and defensible position.”\n\nThis article was originally published on First Round Review, read the original article.",
      "Folder": "Feedly",
      "Timestamp": "1501559367",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.644486Z"
}