{
  "id": "cbaf8d87d1e740fcbc2d3432bd19761e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2017/12/13/16771638/doug-jones-roy-moore-alabama-black-voters",
      "Title": "Doug Jones’s secret weapon with black voters in Alabama Roy Moore Vox - All",
      "Selection": "Between pro-slavery comments and birtherism, Moore made Jones’s victory with black voters easy.\n\nA Democrat will be the newest senator for one of the reddest states in the country.\n\nA key explanation for the shocking upset on Tuesday night in Alabama’s special election: Black voters turned out — and strongly backed Democrat Doug Jones over Republican Roy Moore.\n\nThe Washington Post reported the results by race, based on preliminary exit polls:\n\nDoug Jones has won Alabama. Preliminary exit polls from @PostPolls point to black voters as the force behind the upset victory. https://t.co/q9ucxlS0er http://pic.twitter.com/HXC3OsYa0u\n\n— Post Graphics (@PostGraphics) December 13, 2017\n\nThere is also data that suggests Jones simply got much more of his base out to the polls than Moore did. Jones got about 92 percent of the raw vote total that Hillary Clinton did in 2016 in Alabama’s general election, while Moore got about 49 percent of the raw vote total that Donald Trump did in the state.\n\nAnd this happened despite concerns about voter suppression efforts due to Alabama’s strict voter ID law and voting restrictions for people with felony records, both of which disproportionately impact black voters.\n\nIt’s too early to say decisively how Jones pulled this off over Moore. For example, did depressed white turnout play the defining role, or was it increased black turnout? Exit polls are simply not reliable enough to make these kinds of sweeping judgments. With more and better data, statisticians and researchers will wonk this out over the next few days, weeks, and months.\n\nBut one thing we do know for certain is that unique aspects of Jones and Moore as candidates, as well as the national political climate, made an outcome in which Jones triumphs with black voters fairly likely all along.\n\nMoore’s slavery-friendly remarks resurfaced in the last few days\n\nBlack voters have, in general, heavily favored Democrats for decades now. But Moore was also a uniquely bad candidate for black voters.\n\nFor one, Moore was mired by bizarre comments over the last few days of the campaign in which he seemed to endorse or at least tolerate slavery.\n\nFirst, comments resurfaced in which Moore appeared to say that the US should be more like it was during slavery. Asked by a black man at a September campaign rally what Trump means when he says “make America great again,” Moore at first acknowledged the US’s history of racial tensions. Then he said, “I think it was great at the time when families were united — even though we had slavery. They cared for one another. People were strong in the families. Our families were strong. Our country had a direction.” He later added that he was focused on culture, not policy, in his remarks.\n\nThen Andrew Kaczynski at CNN uncovered 2011 remarks in which Moore responded positively to a radio host’s comment that all constitutional amendments after the 10th should be abolished. Moore said, “That would eliminate many problems. You know, people don’t understand how some of these amendments have completely tried to wreck the form of government that our forefathers intended.”\n\nAmong those amendments: the 13th abolished slavery, the 14th guarantees equal protection under the law (and was central to US Supreme Court cases that supported racial integration in public education and ended states’ bans on interracial marriage), the 15th protects black voting rights, and the 19th gave women the right to vote.\n\nSo you had two newly resurfaced comments that could be interpreted, at least in part, as fondly recalling the days of slavery.\n\nMoore’s campaign of course strenuously denied this, telling me at one point that such an interpretation of his comments was “recklessly malicious.”\n\nBut when your candidate’s comments can be interpreted as anything remotely close to pro-slavery or slavery-tolerant, you have a big problem on your hands.\n\nThat’s especially true since Moore already had a history of racially insensitive and bigoted remarks, previously invoking the racist birther conspiracy theory by questioning if President Barack Obama was born in the US and comparing the US Supreme Court decision legalizing same-sex marriage to the 1857 decision that effectively denied black people citizenship.\n\nIn contrast, Jones had made a name for himself in the early 2000s by successfully prosecuting two Ku Klux Klan members for the 1963 bombing of the predominantly black 16th Street Baptist Church in Birmingham, which was one of the most high-profile white supremacist crimes — not just in Alabama, but nationally — of the era.\n\nCombined, this gave black voters a very clear choice: On one hand, you have a guy who seems okay with slavery. On the other hand, you have a guy who prosecuted the KKK.\n\nThe national political climate probably helped Jones too\n\nThe broader context here matters as well. While the Senate campaign went on, we were in the middle of a national political climate that has taken a frighteningly racist turn.\n\nPresident Donald Trump himself has a long history of racist remarks. He launched his modern political career by promoting the racist birther conspiracy theory — an idea that he is still reportedly promoting in private. As a candidate for president, Trump also made all sorts of racist comments — suggesting that Mexican immigrants are criminals and rapists, proposing a ban on all Muslims entering the US, saying a US judge should recuse himself from a case simply because of his Mexican heritage, and deploying dog whistles about “law and order.”\n\nHis administration has also pursued policies that will disproportionately hurt minority groups, including his travel ban, immigration restrictions, “tough on crime” policies, and potential voting restrictions.\n\nAll of this boiled over in August, when white nationalists, neo-Nazis, and KKK members descended on Charlottesville, Virginia, to protest the city taking down Confederate statutes. The protests quickly turned violent as the white supremacists faced off with counterprotesters who showed up to demonstrate against racism. That day, a Nazi sympathizer rammed his car into a crowd of counterprotesters — injuring dozens and killing 32-year-old Heather Heyer.\n\nTrump’s response to all of this? He blamed both sides. “I think there is blame … on both sides,” he told reporters days after the protests. “I have no doubt about it. You don’t have a doubt about it either. If you reported it accurately, you would say that.”\n\nAs the head of the Republican Party, Trump was morally equivocating between literal white supremacists and anti-racism protesters.\n\nThis is the broader context in which Jones won and Moore lost. On top of Jones’s and Moore’s own unique qualities, the Republican Party as a whole has, due to Trump, been tied to outright racism. It is no wonder black voters would turn out against Moore and for Jones in this political climate.\n\nCouple that motivation for higher black turnout with the allegations against Moore that he sexually abused teenagers, which almost certainly depressed turnout among Republicans in Alabama while pushing Democrats to get out to vote.\n\nThat’s how you get a situation in which the newest of two senators representing one of the most conservative states in the country will be a Democrat.\n",
      "Folder": "Feedly",
      "Timestamp": "1513347181",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.561440Z"
}