{
  "id": "cbf6eceaca9a4f29a2c32ffda9cff57d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/identities/2018/5/29/17405704/white-evangelicals-attitudes-refugees",
      "Title": "68% of white evangelicals think America shouldn’t house refugees Vox - All",
      "Selection": "A recent Pew poll reveals increasing American polarization on attitudes to refugees.\n\nWhite evangelical Protestants are the most likely religious group to say that the United States has no responsibility to open its borders to refugees, according to a recent poll.\n\nThe study, which was conducted by Pew, found that 68 percent of white evangelicals believed that the United States “does not have a responsibility” to house refugees, while just 25 percent believes that it does. This is higher than the American national average: 51 percent of Americans overall believe the United States does have a responsibility to allow in refugees, while just 43 percent believe it does not.\n\nThe perspective of white evangelical Protestants on the refugee crisis is particularly striking because it’s relatively unusual among Christian religious groups. For example, 43 percent of white mainline Protestants believe that America has a responsibility to house refugees, as do 50 percent of Catholics and 63 percent of black Protestants. The highest level of support from any group cited in the study was from those who identified as religiously unaffiliated, of whom a full 65 percent support American housing of refugees.\n\nThe numbers are also remarkable because they reflect a more general trend on the part of white evangelical Christians to depart from the national average when it comes to social issues. White evangelicals are increasingly echoing the GOP party platform even as other groups, including Christian groups, diverge from it.\n\nSuch a conflation means that white evangelical Christians, already historically a major part of President Trump’s base (let’s not forget that 81 percent of them voted for him in 2016), are now becoming all but synonymous with it. As Trump’s policies become increasingly designed to appeal to that base (as, for example, with his recent move of the American Embassy to Jerusalem), it’s likewise increasingly clear that the relationship between the two is symbiotic.\n\nAnd the line between white evangelical theology and GOP party platform is all but disappearing.\n",
      "Folder": "Feedly",
      "Timestamp": "1527656377",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.465361Z"
}