{
  "id": "cc36bd65002d438388338dbf0afbc0f3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2020/02/how-has-my-thinking-of-prizes-vs-grants-evolved.html",
      "Title": "How has my thinking on prizes vs. grants evolved Marginal Revolution",
      "Selection": "Chris, a loyal MR reader, writes to me:\n\nI’ve been turning to your insights on prizes vs. grants over the years. Your Google talk from 2007 is without question the best discussion I’ve found of their respective merits…I was wondering if your thinking on prizes vs. grants has evolved, and in particular [TC has added the numbers here]:\n\n1. In the Google talk, you talked about an equilibrium in which there would be a growing ecosystem of big prizes complementing one another. I’m not sure it has turned out this way. Do you agree, and what happened? Did the “failure” of some high profile prizes (e.g. the Google Lunar XPrize) dampen down the enthusiasm?\n\n2. More generally, there seemed to be an expectation in the 2000s and early 2010s that prizes would take off and become a more significant feature of the R&D funding landscape. Again, I don’t think that has really happened. What explains that?\n\n3. Looking specifically at government funding of R&D, do you think there is an equilibrium in which grants can coexist with prizes? Or do grants squeeze out prizes through some form of adverse selection (the best researchers opting for grants over prizes)?\n\n4. How important do you think public choice reasons are for us being in a grant-dominated equilibrium? It seems that the science sector has done a great job of positioning itself as something other than an interest group, with its interests squarely aligned with the public good. (Even suggesting that the science sector is also an interest group seems slightly heretical. It’s interesting that Dominic Cummings, for all his radicalism, seems to see little need for any reform of the science/research ecosystem beyond ARPA).\n\nFirst a general remark: I now see the current scientific (and cultural) establishment as having more implicit prizes than I used to realize.  In fact, getting a grant is one of the biggest prizes you can receive, if the grant is sufficiently prestigious.  By an “implicit prizes,” I mean a prize where the target achievement is not quite spelled out, but if “we” (however defined) judge you to have achieved enough, we will pour grants, status, and high quality social networks into your lap.  For instance, Alex and I have received significant “prizes” for writing MR, although none of those prizes have names or bring explicit public recognition, as opposed to general recognition.  We have in contrast never received a grant to write MR, so are prizes really so under-provided?\n\nSo my current thinking is a bit less “grants vs. prizes,” and somewhat more “implicit prizes vs. explicit prizes, each combined with grants to varying degrees.”  Implicit prizes are more flexible, but they also are easier to cheat with, since the standard of achievement is never quite clear.  Implicit prizes also are much more valuable to people who can use, build, and exploit their social networks, and of course that is not everyone (but shouldn’t we be giving more prizes to those people?).  Implicit prizes also can be revoked through subsequent loss of status.  Implicit prizes are more likely “granted” by the hands of social networks rather than judging panels, all of those features being both cost and benefit.\n\nNow to the specific points:\n\n1. As the venture capital ecosystem grows, and as the value of publicity rises (it is easier to monetize scientific and other sources of fame), and there are more “influencers in the broad sense,” there are more implicit prizes to be had.  And did the Lunar XPrize fail?  If an end is not worth accomplishing, a prize is one way to find that out.\n\n2. In addition to my point about the proliferation of implicit prizes, the scientific, academic, and political communities are far too conservative in the literal sense of that word.  How many top schools experiment with different tenure procedures?  Different ways of running a department?  It is sad how difficult it is to experiment with changes in academia and science, whether the topic be prizes or not.\n\n3. The best researchers get both grants and prizes (one hopes).\n\nBy the way, here is a recent piece on the empirics of prizes, mostly positive results.\n\nThe post How has my thinking on prizes vs. grants evolved? appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1582924322",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.338246Z"
}