{
  "id": "cd1bf804f473455e8657d35c2d360bb5",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://coolinfographics.com/blog/2019/7/1/sales-vs-marketing",
      "Title": "Sales vs. Marketing Cool Infographics",
      "Selection": "The marketing team for Salesforce Pardot has been doing a great job of playing off the Game of Thrones theme with a number of different content pieces. Fight for the Throne: Sales vs. Marketing is a fun, engaging infographic that plays to fans of the HBO series now that the series os over.\n\nLet’s face it: you don’t need to be watching HBO’s acclaimed series Game of Thrones to see a rivalry like the Starks and Lannisters. A similar struggle for power and recognition is happening in the modern office everyday — between sales and marketing.\n\nWith different goals, motivations, and tools, aligning your company’s sales and marketing departments can be a daily challenge. With each team staking their claim to different areas of the business process, it can be hard to find any common ground with which to bring them together. However, when sales and marketing work together to generate leads, nurture relationships, and close deals, a company can thrive. There’s a lot at stake in this struggle!\n\nTo help you identify the pain points, mindsets, and opportunities for peace between these two departments, we have put together the fun and informative infographic below.\n\nSometimes the messages you want to convey in an infographic aren’t based on numeric data, but concepts and business processes. This design does a good job of identifying different corporate departments as rival houses with competing interests.\n\nI also like that the ideas presented here have a long Online Lifespan. This infographic is actually an update to an earlier one they released in 2013: Sales vs. Marketing: The Original Game of Thrones. The rivalry between Sales and Marketing isn’t new in corporate culture, and won’t be going away anytime soon.\n\nFound on the American Marketing Association blog\n",
      "Folder": "Feedly",
      "Timestamp": "1562012479",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.362383Z"
}