{
  "id": "cd8ff79cb12640db8319fdfbe2ede4a2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://skillet.lifehacker.com/the-first-5-things-you-should-sous-vide-with-your-new-i-1795736766",
      "Title": "The First 5 Things You Should Sous Vide With Your New Immersion Circulator Skillet",
      "Selection": "Photos by Claire Lower unless otherwise noted.\n\nIf you have recently purchased an immersion circulator—or are looking to—deciding what to cook first with your new toy can be a little overwhelming. Luckily, we do a fair amount of sous vide-ing around these parts and have a pretty good handle on what will sous vide and what won’t.\n\nDry turkey and overcooked steaks don't have to be a staple of your holiday dinners or homemade …\n\nRead more\n\nIf you’re completely new to the cooking method, I suggest checking out our primer on the subject, which will explain how it all works, as well as the pros and cons of this increasingly popular culinary hot tub. Once you have a grasp on what sous-vide cooking is all about, you’re ready to cook, and we have many delicious suggestions.\n\nMeats That Dry Out or Overcook Easily\n\nSous-vide cooking lets you control the final temperature of your food exactly, making overcooked food virtually extinct. Unlike cooking food in the oven or grill—which heats foods much higher than their target temperatures—leaving your steak in a sous-vide bath an extra 1o minutes or so isn’t going to take it from medium-rare to well-done. It’s also an extremely moist cooking environment, as nothing is going to evaporate from a vacuum-sealed bag—meaning dry, drab pork chops are a thing of yesteryear.\n\nBest of all, it’s super easy. Just pick your target temperature, seal your meat in a bag, and set it in the bath. Set a timer and, once your meat is cooked to your desired “doneness,” pull it out, pat it off with paper towels, and give it a hot sear. ChefSteps has an extensive time and temperature chart that includes almost any protein you could imagine, but these are a few of my favorites.\n\nSteak: Season a rib eye with salt and then sous vide at 130℉ for an hour. Give it a sear in a scorching hot pan to get a crust. (I like duck fat, but butter will give you more browned bits more quickly.)\n\nDuck breasts: Season duck breasts with salt, seal them up in their bags, and put them in the bath for two hours at 130℉. Carefully remove the skin from the breast, then fry it on both sides, pressing it down with a metal spatula to keep it as flat as possible. Slice the breast meat and top with the super crispy skin.\n\nPork Chops: I had these just last night, and they are a fave for sure. One hour at 140℉, followed by a quick sear in butter, will result in the juiciest pork chop of your life.\n\nTurkey and Chicken Breasts: I like 140℉ for an hour and a half for chicken, 149℉ for 3 hours for turkey. (Season the meat well, and throw in some extra fat and aromatics for the most flavorful white-meat poultry of your life.)\n\nSeafood: Anova has a whole bunch of great recipes for all sorts of sous-vide sea creatures, but you’ll probably want to start with either lobster or tuna.\n\nThere are a lot of options, as you can plainly see.\n\nMeats With Lots of Connective Tissue\n\nAnything with a lot of collagen benefits from being cooked low and slow in a very moist cooking environment, and you immersion circulator is the perfect tool for executing this. Just make sure to use special sous-vide or vacuum bags—Ziploc bags can fall apart at temperatures over 150℉—and cover your tub with either a lid, a bit of plastic wrap, or some packing bubbles to prevent evaporation. Some of my succulent favorites from this category include:\n\nChicken feet: Give the feet a brutal pedicure (cut off the toenails) and then toss them in a bag with your favorite marinade. Let everyone hang out for 24 hours at 180℉, then take ‘em out, dry ‘em off, and deep-fry them.\n\nOxtail: Give it a sear, smother it in seasonings, then let it hang out for 24 hours in a 185-degree bath for the juiciest, most mouth-coating meat ever.\n\nBeef tongue: You could season it before submerging it the bath, but you don’t really have to. I’ve cooked a whole tongue, still in its original vacuum-sealed packaging, with much success. All it really needs is 24 hours at 170℉. Peel off the membrane, shred the meat, fill tacos.\n\nOf course other, more traditional meats benefit from an extended stay in our culinary hot tub, as well. For most tough cuts of beef, 24 hours at 149℉ will treat you just fine, while six hours at 140℉ will give you a perfectly cooked medium-rare roast with little to no trouble at all.\n\nEggs\n\nWith the exception of fried, you can use your immersion circulator to prepare almost any type of egg. Not all applications are totally worth dragging out the water bath, but these are:\n\nScrambled: These aren’t your normal scrambled eggs. Not only do they have much, much smaller curds than those scrambled in a pan, they’re creamier—almost like a custard—and are best served in a bowl. You can also cook a whole bunch at once. When placed in a 167-degree bath, a three-egg batch takes 15 minutes, a six-egg batch takes 30, a dozen eggs will take 40, and two-dozen will be done in 50 minutes.\n\nPasteurized: Want to make perfectly safe raw cookie dough? Or perhaps you have young children who are prone to experiment with raw eggs? Either way, you probably want to pasteurize them (without cooking)—and this is very easy to do. Just put the eggs (no plastic bag needed) in a 135-degree bath for 75 minutes, take them out, and use them however you see fit.\n\nPoached: Last Easter, I prepared perfect eggs Benedict for a crowd of 15—a feat that would not have been possible without my Anova. This recipe from ChefSteps can tell you how to pull off the entire dish, but all you’ll need to do with the eggs is set your circulator at 147℉, then let them hang out in the bath for about an hour.\n\nTrust me, this cooking method really is all it’s cracked up to be.\n\nCertain Vegetables\n\nOkay, there are honestly only two vegetables I bother cooking sous-vide, but they’re really, really good.\n\nCarrots: I was skeptical at first, but Kenji over at Serious Eats convinced me to try these intensely carrot-y carrots (cooked at 183°F for an hour) and I must admit I was wowed.\n\nAsparagus: Cooking these tasty spears at 185°F for 12 minutes results in perfectly tender-crisp asparagus every single time.\n\nOkay cool, let’s talk about desserts now.\n\nCustardy Desserts\n\nAnything that does well in a bain-marie is going to do well when cooked sous-vide, because they’re basically the same thing (and that thing is a water bath). This means that any type of custard-based treat is a good idea here, and these are some especially great ones.\n\nPumpkin pie: Set your circulator to 176°F, and divide your spicy pie filling among little jars. Set them down in the bath, and let them cook for an hour and a half. Take them out of the bath, removing the lids so condensation doesn’t form as they’re cooling, then transfer to the fridge to chill for at least four hours. Top with whipped cream before devouring.\n\nCheesecake: I honestly refuse to cook cheesecake any other way. These rich little pots of wonder are cooked exactly the same as the pumpkin pies, only for two hours instead of one and a half, and they are amazing. Not only is sous-vide cheesecake the silkiest, creamiest cheesecake you’ll ever put in your mouth, but it also comes in little single-serving jars, which is fun.\n\nCreme Brulee: I’ve thought about coming up with my own method for this, but there’s no point. The boys at ChefSteps have perfected the sous-vide creme brulee, and you should just make theirs.\n\nHopefully all of that will keep you occupied (and well-fed) for a bit. If not, you can always sous vide a Hot Pocket. It will honestly be the best Hot Pocket you’ve ever had.\n",
      "Folder": "Feedly",
      "Timestamp": "1496411934",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.666918Z"
}