{
  "id": "ce11440dab534b7c82729479c08c15eb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/2017/10/review-acer-chromebook-15-2017/",
      "Title": "Review Acer Chromebook 15 CB515-1HT-P39B Feed All Latest",
      "Selection": "Four years ago, I tried to live my entire work life on a Chromebook, and it was a disaster. I couldn’t open Word documents, make Skype calls, message colleagues, or pull off a host of other daily tasks without jumping through hoops and pulling off miracles. This week, I hardly noticed that I hadn’t turned my MacBook Pro on in days while relying on a Chromebook. Times certainly have changed.\n\nChromebooks are unambitious computers, and that’s what makes them genius. Using a laptop that’s just a browser sounds strange, but seeing how most of us spend the vast majority of our PC time in web browsers it’s totally doable. And in the last few years, Google has figured out how to make non-browser tasks lot more manageable on Chromebooks.\n\nI really wanted to enjoy my time with Acer’s latest Chromebook 15 but our relationship became strained. Things were a little laggy at first, but we had a thing going for a while. Then, it suddenly shut down on me. We’ve had trust issues ever since.\n\nA Very Big Book\n\nFor a lot of people, Acer’s Chromebook 15 will seem ludicrously large. To me, the Chromebook 15 feels like coming home. After years on cramped 11- to 13-inch screens, the Chromebook’s wide frame and spacious 1,920 x 1,080-pixel 15.6-inch touch-sensitive display reminds me of my giant old Sony VAIO laptop. It’s wide enough to place two full-size browser windows side by side—a big productivity boon, and watching media is just more fun. And while it’s not the best touchscreen I’ve ever used, it’s just so pleasant to exit an app with my finger.\n\nAcer\n\nAcer has tried to class up the Chromebook 15 with aluminum on the palm rest and top outer shell. Just don’t expect MacBook-level elegance. The specs may say it’s covered in aluminum, but much of the laptop is actually plastic with a fancy, sparkly coating. The half-aluminum/half-plastic look is kind of like wearing a tie with a t-shirt—it doesn’t fool anyone.\n\nAcer Chromebook 15 (2017)\n\n5/10\n\nWired\n\nBiggest Chromebook yet with a sharp 15.6-inch HD screen. Chrome OS has gotten a lot more useful in the last few years. The keyboard is comfy and there are plenty of ports. Battery life can reach 10 hours. It has a touchscreen!\n\nTired\n\nHalf-aluminum body doesn’t feel as nice as you'd think. Pentium processor is underpowered. Android apps are fun, but still limited and buggy. The touchpad rattles and has a stiff click. It completely crashed twice without warning.\n\nHow We Rate\n\n1/10A complete failure in every way\n\n2/10Sad, really\n\n3/10Serious flaws; proceed with caution\n\n4/10Downsides outweigh upsides\n\n5/10Recommended with reservations\n\n6/10Solid with some issues\n\n7/10Very good, but not quite great\n\n8/10Excellent, with room to kvetch\n\n9/10Nearly flawless\n\n10/10Metaphysical perfection\n\nOn the Chromebook 15, the keyboard keys rise up from the chassis, like islands in a placid ocean of aluminum. The keys have good travel to them, and bottom out with a nice satisfying click. The white LED backlight isn’t blindingly bright, but provides enough visibility to type at night without issue. Flanking the keyboard are large, relatively clear-sounding stereo speakers.\n\nThis big Chromebook is also big on ports. It comes with a USB-C and USB 3 port on each side, along with a MicroSD slot and headphone jack.\n\nThis brings me to what I hate most about the design: the trackpad. This cheap-feeling touchpad has already developed a small rattle after only a week of use. I tend to use tap-to-click a lot, and I never got used to hearing the touchpad ever-so-slightly shake around. This is the kind of detail that separates this affordable model from classier competitors like the Samsung Chromebook Pro or HP Chromebook 13.\n\nAndroid Apps are Fun but Frustrating\n\nThe Chromebook 15 runs on an Intel processor so weak that Acer doesn’t advertise its model (it’s a Pentium N4200), packs modest storage (32GB), and just enough RAM (4GB). Yet despite the tepid spec sheet, it has one of Chrome OS’s fanciest new features: Google Play Android app support. That means you can install phone and tablet apps on this laptop, in theory adding a plethora of productive possibilities.\n\nIn reality, Google’s got work to do before this ability becomes really usable. I got excited to install the Slack chat app, for example, but was disappointed when I realized it wasn’t resizable—some apps can only be used in a tiny, phone-sized window or don’t display properly in full screen mode. Other apps didn’t have features you’d expect in a typical desktop program—for instance, pasting a Microsoft Excel chart into Outlook proved impossible. Many of the apps lagged and crashed, but it’s still nice to have them.\n\nThere’s a lot of promise in a Chromebook running Android apps, but the “beta” disclaimer on this feature is very important to note. I can’t be totally sure, but I’m pretty convinced that my extensive Android app use was to blame for problems I had while using the Chromebook 15.\n\nNot Ready for Prime Time?\n\nOn a low-power machine like this Acer, momentary freezes and hiccups aren’t uncommon, but on one day that I opened too many tabs, the Chromebook 15 locked up. The screen froze completely, cut to black, and then the machine completely shut off.\n\nI tried everything to turn it back on, but no luck. Five minutes later, it magically sprung back to life. Thinking it was a fluke, I resumed my normal routine like it hadn’t happened. A half hour later, off it went again for ten minutes, before it again came back to life like nothing had happened. I noticed black flickers for the rest of the day.\n\nAcer told me to try eliminating browser extensions and try guest mode. So I did, and stopped using Android apps and it hasn’t happened since. Did I just get unlucky? I don’t know, but I’m hitting the “save draft” button a lot more often now.\n\nCrashes aside, this Chromebook offers a lot for your $400. You get a good 8-10 hours of battery life, a spacious 15.6-inch HD touchscreen, and a comfortable keyboard. But there’s also a lot to be desired, as I found when encountering the rattling trackpad and undercooked Google Play support. With a little more power under the hood and a software update or two, it could turn some heads. But right now, like its half-aluminum case, the Chromebook 15 is more about appearances than performance.\n\nWhen you buy something using the retail links in our product reviews, we earn a small affiliate commission. Read more about how this works.\n\nGo Back to Top. Skip To: Start of Article.",
      "Folder": "Feedly",
      "Timestamp": "1508549707",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.536548Z"
}