{
  "id": "ce81f9fe78e948f6a533968bdf681721",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/772129/islam-has-become-americas-favorite-metaphor-for-really-bad/",
      "Title": "Islam has become America’s favorite metaphor for “really bad” Quartz",
      "Selection": "Sunni and Shi’a Muslims are two incredibly diverse, complicated, contested, even frequently overlapping religious identities, numbering in the hundreds of millions across dozens of countries and over a millennium of history. Republicans and Democrats are members of the two dominant American political parties. How are these two categories comparable? The short answer is: They’re not.\n\nAnd yet Thomas Friedman seems to disagree. In his latest New York Times op-ed, “Win, Lose, But No Compromise,” the paper’s longtime columnist casually conflates the two. In response to the Republicans and Democrats who put party loyalties ahead of their country’s welfare, as he sees it, he asks, “Are we all just Sunnis and Shiites now?”\n\nThe shorter answer is: No.\n\nThe global Sunni and Shia Muslim population is far more diverse, ancient and complicated than the American electorate. The seeds for the great division in Islam were planted in the hours after the Prophet Muhammad’s death in 632 AD, when his community divided over who should lead. Would it be Muhammad’s best friend and father-in-law, Abu Bakr, or his cousin and son-in-law, Ali? The forerunners of Shia Muslims preferred Ali, while the forerunners of Sunni Muslims preferred Abu Bakr. But they had enough in common that when Ali eventually become caliph, that caliphate was supported by a significant number of proto-Sunnis. Today there are Sunni and Shia Muslims of all ideological persuasions, ethnic backgrounds, and national origins.\n\nIt’s certainly true that American politics deserves better than what they’ve been given this election cycle, especially from Republicans. It seems ludicrous that GOP leaders can decry Trump’s rhetoric yet continue to endorse him. Is blind party loyalty really more important than America’s best interests?\n\n Islam has become the default comparison when people want to say something is really, really bad in this country.  It’s also definitely true that the Muslim world deserves a lot better than the Baghdadis and Khameneis. But what worries me is that Islam has become the default comparison that people turn to when they want to say that something is really, really bad in this country. It’s almost as if there’s a political thesaurus out there that suggests “Muslims” whenever a political operative or pundit is searching for a new way to describe a worst-case scenario.\n\nPutting aside the tortured and inaccurate logic of this strategy, the trend of associating Islam with anything and everything negative has had terrible consequences for the civil rights, liberties, and security of Muslims both in the US and abroad. Want a symbol of female “oppression”? Just call up an image of Muslim women wearing veils—who cares how they feel about it. Indeed, the next time you watch a news segment on Islam, for example, pay close attention. Why do stories about ISIL, or about other Islamic radical movements for that matter, so often seem be preceded by shots of Muslims worshipping, or a woman walking around in hijab?\n\nThese images have nothing in common with each other, and yet they create a mental link in the minds of Americans: Islam equals extremism. To understand just how pernicious this psychological associations have become, try this thought experiment. The next time there’s a segment on the Ku Klux Klan, imagine the camera cutting to ordinary Christians at worship, or to a woman with a visible cross necklace at the grocery store, or to church bells tolling. Imagine if the next time there was a story about the siege of Gaza, or the occupation of the West Bank, stock footage of ordinary Jewish life was played.\n\nTo compare Republicans and Democrats to Sunnis and Shias suggests that the intractability that currently afflicts our body politic is foreign to us—and native to them. It suggests that while we may have problems, we aren’t the cause of them. It could always be worse, Friedman implies. We could be Muslims.\n\nFollow Haroon on Twitter at @hsmoghul. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1472778833",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.781107Z"
}