{
  "id": "cf7daf8d657d465e84580bd404f56aeb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://fivethirtyeight.com/features/politicians-write-lots-of-books-heres-how-far-into-them-people-read/",
      "Title": "Politicians Write Lots Of Books. Here’s How Far Into Them People Read. FiveThirtyEight",
      "Selection": "Sep. 12, 2017 at 9:53 AM\n\nPoliticians Write Lots Of Books. Here’s How Far Into Them People Read.\n\nHillary Clinton’s new book, “What Happened,” comes out Tuesday and features her reflections on the 2016 election. Whether it’ll enter the pantheon of great campaign memoirs or turn out to be just another post-politics potboiler, “What Happened” is by all appearances the first hot political book of the fall.\n\nIt also apparently offers some compelling content, including relitigating internecine fights in the Democratic Party, openly assailing the character of a sitting president and recounting the inside story of one of the most stunning campaign failures in U.S. history. And that, by itself, might distinguish it from the political memoir genre in general. Political books written around a presidential election are usually a mixture of ghostwritten policy proposals slammed together with a series of mediocre pseudo-biographical stories that often backfire on a contender mid-race.These paperweights are defined by long subtitles and the struggle of making a politician a likable protagonist.\n\nBut people still read them. Well, sort of. I was curious how far readers typically make it through these books. I couldn’t get any reading data, but I reached out to Audiobooks.com for listening data on political memoirs by presidential candidates going back to the 2000 election. We focused on books by every “serious” candidate published before or shortly after each presidential election — “serious” as defined by my colleague Harry Enten back before the 2016 election. (Basically, any candidate who held a major political office before running or got at least a bit of the vote in Iowa or New Hampshire.) Audiobooks.com was able to find the books with more than 10 downloads and sent over the average percentage of the book that listeners sat through.\n\nBefore we get to the data, there are some caveats! If you don’t see a book on here, remember that not all books have an audio version widely available. Moreover, sales for some of these books peaked long before Audiobooks.com began collecting data. Second, if a completion rate number seems low, keep in mind that most people don’t finish reading most things. Most likely, less than half of the people who started this article made it to this sentence. It’s the nature of the game.\n\nWhich political books did listeners stick with?\n\nBy presidential candidates on Audiobooks.com since the 2000 election\n\nAVERAGE\n\nPUB.▲▼\n\nAUTHOR▲▼\n\nTITLE▲▼\n\nLENGTH (HRS)▲▼\n\nSHARE OF BOOK READ▲▼\n\nTIME SPENT LISTENING (HRS)▲▼\n\n2010\n\nGeorge W. Bush\n\nDecision Points\n\n20.2\n\n59.7%\n\n12.0\n\n2014\n\nHillary Clinton\n\nHard Choices\n\n27.0\n\n31.0\n\n8.4\n\n2015\n\nTed Cruz\n\nA Time for Truth\n\n12.9\n\n55.8\n\n7.2\n\n2016\n\nBernie Sanders\n\nOur Revolution\n\n18.6\n\n36.1\n\n6.7\n\n2015\n\nRand Paul\n\nTaking a Stand\n\n19.8\n\n30.5\n\n6.0\n\n2015\n\nMike Huckabee\n\nGod, Guns, Grits, and Gravy\n\n8.1\n\n65.5\n\n5.3\n\n2013\n\nScott Walker, Marc A. Thiessen\n\nUnintimidated\n\n7.2\n\n69.5\n\n5.0\n\n2014\n\nGeorge W. Bush\n\n41\n\n7.8\n\n63.0\n\n4.9\n\n2017\n\nNewt Gingrich\n\nUnderstanding Trump\n\n11.8\n\n41.5\n\n4.9\n\n2010\n\nNewt Gingrich\n\nTo Save America\n\n9.7\n\n49.2\n\n4.8\n\n2011\n\nLiz Cheney and Dick Cheney\n\nIn My Time\n\n7.7\n\n60.8\n\n4.7\n\n2015\n\nMarco Rubio\n\nAmerican Dreams\n\n6.3\n\n69.9\n\n4.4\n\n2008\n\nBen Carson M.D., Cecil Murphey\n\nThink Big\n\n8.0\n\n52.8\n\n4.2\n\n2005\n\nBarack Obama\n\nDreams From My Father\n\n7.2\n\n57.0\n\n4.1\n\n2011\n\nRon Paul\n\nLiberty Defined\n\n9.0\n\n42.5\n\n3.8\n\n2003\n\nHillary Clinton\n\nLiving History (abridged)\n\n7.0\n\n51.8\n\n3.6\n\n2008\n\nJohn McCain\n\nFaith of My Fathers\n\n4.8\n\n74.7\n\n3.6\n\n2009\n\nRon Paul\n\nEnd the Fed\n\n6.1\n\n51.4\n\n3.1\n\n2013\n\nRon Paul\n\nThe School Revolution\n\n5.5\n\n53.3\n\n3.0\n\n2009\n\nSarah Palin\n\nGoing Rogue\n\n7.2\n\n39.7\n\n2.9\n\n2006\n\nBarack Obama\n\nThe Audacity of Hope\n\n6.2\n\n45.3\n\n2.8\n\n2011\n\nVince Haley, Newt Gingrich\n\nA Nation Like No Other\n\n8.0\n\n33.5\n\n2.7\n\n2016\n\nDonald J. Trump\n\nGreat Again\n\n4.5\n\n48.8\n\n2.2\n\n2006\n\nHillary Clinton\n\nIt Takes a Village\n\n2.8\n\n48.2\n\n1.3\n\nAmong books available on Audiobooks.com with at least 10 downloads. “Great Again” originally published as “Crippled America.”\n\nSource: Audiobooks.com\n\nThere are two ways to slice this data.\n\nFirst, you can look at the percentage of the book the average listener played (the second column from the right). The average reader made it through three-quarters of “Faith of My Fathers” by John McCain. That’s ridiculously high. Marco Rubio, Scott Walker and Mike Huckabee all had average completion percentages, between 65 and 70 percent, for “American Dreams,” “Unintimidated,” and “God, Guns, Grits, and Gravy,” respectively. The books that don’t do so well by this measure come from both sides of the aisle, but they do have one thing in common: They’re looooong.\n\nSo the other way to gauge who’s written the most engaging political books is to look at how much time listeners are spending with them. (The right-most column.) We can use the average amount of time spent listening to a book — completion percentage multiplied by book length — which doesn’t penalize books for being lengthier. In this case, “Decision Points,” the presidential memoir by President George W. Bush, “Hard Choices,” the 2014 memoir by Hillary Clinton, and “A Time for Truth” by Ted Cruz come out looking very good. It turns out that people are willing to listen to Bush, Clinton and Cruz speak uninterrupted for many more hours than I expected. Seriously, the fact that George W. Bush is not only an accomplished author but perhaps the most successful author in his field (at least by one metric) is not a notion I would have even entertained before I started digging into this. Well done, Dubs.\n\nWhat about the books that listeners barely made a dent in? Second from the bottom is “Great Again: How to Fix Our Crippled America” by President Trump, and in last place is “It Takes a Village,” a slimmed-down version of a 1996 Hillary Clinton volume that was later turned into a picture book.\n",
      "Folder": "Feedly",
      "Timestamp": "1505299478",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.554746Z"
}