{
  "id": "cfeb32c430b44a4a823a9d74223dd1d7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/first-person/2018/11/13/18072654/maternity-leave-pregnancy-work",
      "Title": "I got my dream job and had my baby the same week. So I brought my baby to work. Vox - All",
      "Selection": "In the span of a single week this past April, two of my dreams were realized: My third child Pippa was born, and I was nominated to serve on the Federal Trade Commission, one of the five Senate-confirmed appointees who lead the government’s competition and consumer protection agency. I suddenly faced an acute version of a question with which almost all women regularly grapple: how best to balance my professional and personal priorities without sacrificing either.\n\nThis was not my first time contemplating how to balance work and family: My first two children were born when I held a demanding job as counsel in the United States Senate. Luckily, I had a boss who provided 12 weeks of paid maternity leave, which I took. But as an FTC commissioner, it would be different; I would be legally expected to fulfill my responsibilities whether or not I was physically in the office. That meant that while no one could technically prevent me from taking an extended time away for maternity leave, the responsibilities of my office would be left unfilled if I did so. And because I would be the highest-ranking person in my new office, how to handle this would be my choice alone.  \n\nHelp our reporting on pregnancy\n\nAre you pregnant? Have you ever been pregnant? Or do you work with pregnant women? We’re reporting on pregnancy for a series here at Vox and we’d love to hear from you. Please check out this survey for Vox.\n\nI explored what other commissioners had done, but I could find no record of any at my agency over its 100-year history who had given birth during their terms in office. I weighed my options. I could ask for my confirmation to be delayed, an extremely high-risk gamble in unpredictable Washington, or I could find care for Pippa starting at just a few weeks old, which felt like something I wanted to avoid at all costs.  \n\nAfter careful consideration, I decided to try another route: to care for the baby and do the job at once. I would power through the confirmation process and begin the new job, and I would do so with Pippa at my side — or, more accurately, strapped to my chest — until I felt she was ready for day care.  \n\nFor four months, I took a BYOB approach to my new job: bring your own baby. It was the imperfect solution to a confluence of events that made more conventional options even more unworkable for me than they are for most American mothers. Every mother I know has felt squeezed by the challenge of adapting her career to and finding care for a new baby; I am exceptionally lucky that I was able to carve a new path for myself.     \n\n        Rebecca Slaughter, FTC commissioner, with her newborn daughter Pippa, 7 weeks, in her office at work at the Federal Trade Commission in Washington, DC, on May 23, 2018. \n\n        Gabriella Demczuk\n\nThe day-to-day of BYOB\n\nTo prepare for my BYOB experiment, I stocked up on supplies to bring to my office and warned prospective staff that if they hated babies, they probably would not want to work for me. I made a plan to come into the office three days a week with Pippa; the other two days, I would work as needed from home. Instead of embarking on the foreign travel and public speaking that my fellow commissioners started immediately, I would spend my first few months focused on internal meetings with agency staff. And I would reevaluate regularly to make sure that both Pippa and I were happy and healthy in this arrangement. I knew my plan was unorthodox, but so was my situation.\n\nMy confirmation hearing went ahead just nine days after Pippa was born — I was running purely on adrenaline and don’t remember much of it, though there is video evidence that it happened, in which you can sneak a peek of Pippa tucked snugly against my supportive husband’s chest. Over the two weeks that followed, I returned to a quasi-maternity leave, with the continual nursing and rocking cycle of infancy interrupted occasionally to draft responses to senators or venturing out for an occasional follow-up meeting.\n\nI was sworn in the day Pippa turned 1 month old, and that day, I began to implement my BYOB plan. I set up a changing table on my window sill, stocked my filing cabinet with diapers, toys, and swaddles, and borrowed a travel crib from a colleague. In the early days, Pippa mostly slept through my meetings. The first time she woke up to eat, I was hosting a meeting about a competition case with mostly male attorneys. I panicked briefly before pulling on my nursing cover and latching her on. The conversation continued without anyone missing a beat, and I never again hesitated to feed her as needed.  \n\nAs Pippa grew, she spent more time awake. Since most of my time at the office was occupied by meetings, her alertness meant she would frequently sit on my lap and babble at my colleagues — she clearly did not like to be excluded from the conversations. I kept a burp cloth at my conference table for the too-frequent moments when she chose to punctuate a point with a little geyser of spit-up. To manage the times when she got fussy, I became expert at bouncing her while I was talking. Occasionally, I had to pause a discussion to change her quickly, but I learned how to slap on a new diaper in record speed.    \n\n        On the left, Pippa with Commissioner Noah Phillips. In the middle and right, Pippa stays in Commissioner Slaughter’s office.\n\n        Courtesy of Rebecca Slaughter\n\nI was nervous about how my new colleagues would react to Pippa’s presence. I wanted to make a good impression at my new job, and I knew from experience that I was not likely to be my best and most professional self when I was newly postpartum and potentially covered in spit-up. But the reaction I got from colleagues was overwhelmingly positive and supportive; they seemed genuinely fond of Pippa, and it turns out even heated discussions can be more pleasant with a cooing newborn to bring some perspective. I also heard from many staffers that they appreciated having a commissioner send the unambiguous message that parenthood is as much a priority as the job.\n\nBringing my baby to the office worked for me, but it was not easy. I was achingly tired. I had to take copious notes to make sure I could retain the things I was learning. And I often felt guilty about neither parenting nor working as well as I knew I would if I were focused on one task at a time. When the guilt or exhaustion threatened to get the better of me, I considered whether I wanted to make a change, and the answer was consistently no.\n\nMy imperfect strategy was better than either alternative; I was not comfortable leaving Pippa in someone else’s care yet, and I would not have been happy sitting on the sidelines as a new commission got up and running. So I kept our unconventional arrangement until, when Pippa was exactly 5 months old, a spot opened up for her in day care. She was bigger, stronger, and more active; we were both ready for her to start. The BYOB experiment was over.\n\nMy story highlights how hard it is to be a working mom in America\n\nI share my story not to suggest that my experience with Pippa either could or should be replicated universally; it was a compromise that would not even have been right for me with my previous pregnancies. Bringing Pippa to work was only possible because of several unusual circumstances. She was my third baby, and the delivery was not medically complicated for either Pippa or me. I have a deep bench of support, starting with my husband, who picked up slack wherever needed. And I have the seniority at my job to make decisions without asking anyone’s permission.  \n\nRather than providing a template for women to replicate, my story illustrates many of the challenges faced by American mothers, most of whom either cannot make the choice I could or would not want to do so. America stands out among industrialized nations for its lack of support for working parents. Among the things I would change, if I were given a magic wand, would be to provide universal paid parental leave. Europe gives a year; that seems reasonable. That leave should apply to mothers and fathers, because only when men take professional pauses to care for their families will women doing so not create a career crater.  \n\nChild care is obscenely expensive, making working cost-prohibitive for many women; there should be more affordable early child care available. And finally, working should not be an all-or-nothing proposition. As important as parental leave is, it is also critical that workplaces have plans in place to reintegrate new parents into the workforce and accommodate the scheduling challenges of young children.\n\nSimply put, women need and deserve meaningful choice. We should be able to choose whether to take a long leave, or go back to work, or even to come up with unconventional arrangements as appropriate. I hope, by sharing the benefits of the flexibility my privilege has allowed me, I can create space for more women to make the choices that work for them.\n\n        Rebecca Slaughter, FTC commissioner, with her newborn daughter Pippa, 7 weeks, in her office at work at the Federal Trade Commission in Washington, DC, on May 23, 2018. \n\n        Gabriella Demczuk\n\nRebecca Kelly Slaughter was sworn in as an FTC commissioner on May 2, 2018. Prior to joining the commission, she served as chief counsel to Sen. Charles Schumer of New York, the Democratic leader. She lives just outside Washington, DC, with her husband, their 6-year-old son, 4-year-old daughter, two dogs, and, of course, baby Pippa.\n\nFirst Person is Vox’s home for compelling, provocative narrative essays. Do you have a story to share? Read our submission guidelines, and pitch us at firstperson@vox.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1542314301",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.454585Z"
}