{
  "id": "d1ce8bf510c944509e6a12da41d43135",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://skillet.lifehacker.com/how-to-stock-a-spice-cabinet-1798314958",
      "Title": "How to Stock a Spice Cabinet Skillet",
      "Selection": "Stocking a spice cabinet can be a little overwhelming, simply for the reason that there are so many spices out there. It may be tempting to stock up on every exciting seasoning in sight, but these things do have an expiration date, and you can end up with a cabinet full of flavorless, expensive powders that need to be replaced.\n\nThis is part of The Grown Up Kitchen, Skillet’s series designed to answer your most basic culinary questions and fill in any gaps that may be missing in your home chef education.\n\nChicken breasts are not very exciting, but they are a versatile protein with a pretty healthy…\n\nRead more\n\nBut nobody likes bland food, and there are a few spices that I recommend everyone have on hand. Once you have these basics, you can supplement with the other spices that routinely come up in your favorite recipes.\n\nSalt: Salt makes other flavors pop. Get a box of Kosher salt for cooking and a box of Maldon for finishing.\n\nPepper: Skip the pre-ground stuff and get a grinder with whole black or rainbow peppercorns. (Extra credit: Get another one with white peppercorns for times when you need to increase the funk.)\n\nCinnamon: You’ll need whole sticks for infusions and teas, and ground for baking and sprinkling into savory dishes. It may sound weird, but adding a pinch of cinnamon to my beef stew changed my life.\n\nWhole nutmeg: Freshly ground nutmeg is my “secret ingredient” in a whole slew of recipes. Yes, it’s great in baked goods, but it’s also fantastic in any sort of cheesy dish and pairs well with hearty meats and starchy vegetables. I also love it grated directly onto a rum cocktail.\n\nGround cayenne: Cayenne pepper is a versatile heat-bringer used in a variety of cuisines, and just a pinch can add a nice kick to a vat of beans or take your spice rub up a notch.\n\nPaprika: Paprika is the bright red pugent powder you may have seen on top of deviled eggs. Paprika can be mild, sweet, or hot, but it should always be Hungarian. Beyond deviled eggs, you can use it to finish any dish that needs a bit of pungency, or use it in spice rubs, marinades, and dressings.\n\nCumin: I am obsessed with cumin and it’s sweet, earthy, warm flavor. It makes meaty dishes taste “complete,” and absolutely sings in both Tex-Mex and curries alike. When I taste a dish and think it needs “an extra something,” that something is usually cumin.\n\nDried thyme: Fresh herbs are great when you can get them, but you should enjoy thyme’s woodsy flavor all year round. It’s a staple in Mediterranean and Italian cooking, and adds subtle flavor to a whole slew of savory dishes.\n\nDried oregano: Like thyme, oregano has year-round applications, and my spaghetti sauce wouldn’t be the same with out it.\n\nBay leaves: Bay leaves are like the perfect back up singer, and provide harmony without being distracting. Their subtle, savory and vaguely medicinal flavor makes rice, soups, and stews taste better without making them taste like much at all.\n\nCrushed red pepper flakes: Made from a blend of dried, crushed chilies, these spicy little guys add a slightly fruity spiciness to anything you sprinkle them on, such as pizza, pizza, or pizza. (I also use them in my marinated mushrooms, but c’mon, we all know crushed red pepper is made for pizza.)\n\nOf course, spice cabinets will vary from person to person, depending on the type of cuisines one cooks, and that’s a beautiful thing. What spices can you absolutely not live without, and what have you found to be skippable?\n",
      "Folder": "Feedly",
      "Timestamp": "1503431419",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.559802Z"
}