{
  "id": "d257cf9eb4df485d9e74750c33407e1e",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2020/06/police-union-privileges-revisited.html",
      "Title": "Police Union Privileges Revisited Marginal Revolution",
      "Selection": "The post below, Police Union Privileges, from 2018 is worth revisiting. As I wrote in a follow-up, police union privileges are only one part of a system and reform requires system-thinking. Nevertheless, getting rid of these special privileges, including so-called qualified immunity and restoring the equal rule of law are good places to start. Need I also mention that police should not keep fines and forfeitures–the negative consequences of which I documented in To Serve and Collect, my paper with Makowsky and Stratmann.\n\n——————\n\nEarlier I wrote about how police unions around the country give to every officer dozens of “get out of jail” cards to give to friends, family, politicians, lawyers, judges and other connected people. The cards let police on the street know that the subject is to be given “professional courtesy” and they can be used to get out of speeding tickets and other infractions. Today, drawing on the Police Union Contracting Project, I discuss how union contracts and Law Officer “Bill of Rights” give police legal privileges that regular people don’t get.\n\nIn 50 cities and 13 states, for example, union contracts “restrict interrogations by limiting how long an officer can be interrogated, who can interrogate them, the types of questions that can be asked, and when an interrogation can take place.” In Virginia police officers have a right to at least a five-day delay before being interrogated. In Louisiana police officers have up to 30 days during which no questioning is allowed and they cannot be questioned for sustained periods of time or without breaks. In some cities, police officers can only be interrogated during work hours. Regular people do not get these privileges.\n\nThe key to a good interrogation is that the suspect doesn’t know what the interrogator knows so the suspect can be caught in a lie which unravels their story. Thus, the Florida Police Bill of Rights is stunning in what it allows police officers:\n\nThe law enforcement officer or correctional officer under investigation must be informed of the nature of the investigation before any interrogation begins, and he or she must be informed of the names of all complainants. All identifiable witnesses shall be interviewed, whenever possible, prior to the beginning of the investigative interview of the accused officer. The complaint, all witness statements, including all other existing subject officer statements, and all other existing evidence, including, but not limited to, incident reports, GPS locator information, and audio or video recordings relating to the incident under investigation, must be provided to each officer who is the subject of the complaint before the beginning of any investigative interview of that officer.\n\nBy knowing what the interrogators know, the suspect can craft a story that fits the known facts–and the time privilege gives them the opportunity to do so.\n\nMoreover, how do you think complainants feel knowing that the police officer they are complaining about “must be informed of the names of all complainants.” I respect and admire police officers but frankly I think this rule is dangerous. Would you come forward?\n\nHow effective would criminal interrogations be if the following rules held for ordinary citizens?\n\nThe law enforcement officer or correctional officer under interrogation may not be subjected to offensive language or be threatened with transfer, dismissal, or disciplinary action. A promise or reward may not be made as an inducement to answer any questions.\n\nWhat does it say about our justice system that the police don’t want their own tactics used against them?\n\nIn the United States if you are arrested–even for a misdemeanor or minor crime, even if the charges are dropped, even if you are found not guilty–you will likely be burdened with an arrest record that can increase the difficulty of getting a job, an occupational license, or housing. But even in the unlikely event that a police officer is officially reprimanded many states and cities require that such information is automatically erased after a year or two. The automatic erasure of complaints makes it difficult to identify problem officers or a pattern of abuse.\n\nLouisiana’s Police Officer Bill of Rights is one of the most extreme. It states that police have the right to expunge any violation of criminal battery and assault and any violation of criminal laws involving an “obvious domestic abuse.” Truly this is hard to believe but here is the law (note that sections (2)(a) and (b) do not appear, as I read it, to be limited to anonymous or unsubstantiated complaints).\n\nA law enforcement officer, upon written request, shall have any record of a formal complaint made against the officer for any violation of a municipal or parish ordinance or state criminal statute listed in Paragraph (2) of this Subsection involving domestic violence expunged from his personnel file, if the complaint was made anonymously to the police department and the charges are not substantiated within twelve months of the lodging of the complaint. (2)(a) Any violation of a municipal or parish ordinance or state statute defining criminal battery and assault. (b) Any violation of other municipal or parish ordinances or state statutes including criminal trespass, criminal damage to property, or disturbing the peace if the incident occurred at either the home of the victim or the officer or the violation was the result of an obvious domestic dispute.\n\nIn an excellent post on get out of free jail cards, Julian Sanchez writes:\n\n…beyond being an affront to the ideal of the rule of law in the abstract, it seems plausible that these “get out of jail free” cards help to reinforce the sort of us-against-them mentality that alienates so many communities from their police forces. Police departments that want to demonstrate they’re serious about the principle of equality under the law shouldn’t be debating how many of these cards an average cop gets to hand out; they should be scrapping them entirely.\n\nEquality under the law also requires that privileges and immunities extend to all citizens equally.\n\nThe post Police Union Privileges Revisited appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1591115428",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.297319Z"
}