{
  "id": "d27ccb5e350f4130b16255fff30843de",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://kottke.org/17/04/these-websites-could-change-your-life",
      "Title": "These websites could change your life kottke.org",
      "Selection": "I asked Kottke.org readers if they had ever seen, heard, or read something on the web that literally changed their lives.\n\nFourteen people said no. Sixteen said maybe. Thirty-eight people said yes. These are some of their answers. Everyone is anonymous. Some said more than others.\n\nFour different people listed pages from Metafilter:\n\nAsk MetaFilter\n\n;Where’s My Cut? —: On Unpaid Emotional Labor\n\nFor the person who’s got everything: “I read this post, applied, and had a play made for me.”\n\n[creepy filter] Is it normal to become this distracted from seeing an attractive person in public?: This reader pointed to a comment in this thread “that describes the grinding reality of daily low-grade sexual harassment.”\n\nFive readers listed works of journalism.\n\nThe Lilly Suicides by Richard DeGrandpre.\n\nThe Overprotected Kid by Hanna Rosin “persuaded me to be a far less uptight parent.”\n\nIs This Working? on discipline and punishment in the school system.\n\nThe Blissfully Slow World of Internet Newsletters. (I hope this person now does something with newsletters.)\n\nDon’t report sexual harassment (in most cases) by Penelope Trunk.\n\nFive listed personal essays or advice.\n\nTen Things I Have Learned by Milton Glaser [PDF]\n\nMindfulness in Plain English by Ven. Henepola Gunaratana.\n\nEncountering the Gifted Self Again, For the First Time “made me realise that I’m not just a weirdo, but all of my “quirks” actually fit together under a label, and that has made me understand myself about 10000x better.”\n\nPixel Poppers: Awesome By Proxy: Addicted to Fake Achievement: “an essay on performance orientation vs. mastery orientation, as applied to videogame genres.”\n\nDEAR SUGAR, The Rumpus Advice Column #77: The Truth That Lives There.\n\nFive listed videos or video series.\n\n“Almost any woodworking video by Matthias Wandel.”\n\nVsauce.\n\nThe School of Life\n\nThe power of vulnerability by Brené Brown.\n\nKid President’s Letter To A Person On Their First Day Here:\n\nAnd ten listed entire websites.\n\n“Josh Davis’s www.dreamless.org message board, now defunct.”\n\n”Violet Blue’s writing, which lead to me realizing sex is a much deeper and more interesting topic than mainstream news coverage would have me believe.”\n\n“The website MathPuzzle. It was the first time a website caught my attention and I corresponded with the owner/webmaster, and it opened me up to the online and offline community of puzzlers around the world. Working as a puzzle author got me through college and helped me establish a name for myself.”\n\nBullet Journal.\n\nYearCompass.\n\n“Jeph Jacques’s Questionable Content, particularly how he dealt with suicide, depression, and the concept of people from different backgrounds so elegantly. I like to think it increased (and continues to increase) my empathy in the world.”\n\nNational Novel Writing Month\n\n”Radiolab made me want to be a journalist.”\n\nUniversité du Québec à Chicoutimi: “In 2005 I was trying to get information on how to study abroad for a year. Everything I read was on the Internet, and I then spent 9 months between 2006 and 2007 in Chicoutimi, Quebec.”\n\nPixel Envy. “Not pandering. Started reading Kottke, DF, and Metafilter, and realized that I could try doing the same thing. I’ve had a modicum of success since, and met a bunch of really cool people as a result.”\n\nNow pick up your instruments, and go start a band.\n\nTags: best of the web",
      "Folder": "Feedly",
      "Timestamp": "1493063724",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.682764Z"
}