{
  "id": "d2a09b2f19574cda964e790b9c3be8d7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/2017/11/27/amex-virgin-atlantic-transfer-bonus/",
      "Title": "6 Clever and Cheap Ways to Make the Most of This AMEX Transfer Bonus Million Mile Secrets",
      "Selection": "Ready to save big on your next award flight?  You can use your AMEX Membership Rewards points to fly to Europe in Delta’s Business Class.  And I’ll show you how to get it even cheaper using the Virgin Atlantic 30% transfer bonus that runs through November 30, 2017.\n\nYou’ll also see how to fly to New Zealand, Hawaii, and Asia!\n\nThe Best Use of Virgin Atlantic Miles Isn’t Usually on Virgin Atlantic! I’ll Share the Best Partner Award Flights\nI’ll show you some of the best ways to use Virgin Atlantic miles to take advantage of that transfer bonus!\n\n1.   ANA First Class and Business Class Flights to Japan\n\nLink:   Virgin Atlantic Award Chart for ANA Flights\n\nANA (All Nippon Airways) is an award-winning Japanese airline with excellent Business Class and First Class cabins.  And they’re partners with Virgin Atlantic!\n\nEnjoy Terrific Food and Service in ANA First Class for Far Fewer Miles Than You’d Pay With Other Airlines\nRound-trip ANA award flights between Japan and the West Coast cost:\n\n 90,000 Virgin Atlantic miles in Business Class\n\n110,000 Virgin Atlantic miles in First Class\n\nFrom the Midwest and the East Coast you’ll pay slightly more:\n\n95,000 Virgin Atlantic miles in Business Class\n\n120,000 Virgin Atlantic miles in First Class\n\nWith the 30% transfer bonus from AMEX Membership Rewards to Virgin Atlantic, you’ll only need:\n\n70,000 to 74,000 AMEX Membership Rewards points in Business Class\n\n85,000 to 93,000 AMEX Membership Rewards points in First Class\n\nNote:   The actual amounts are slightly lower, but you have to transfer AMEX Membership Rewards points to Virgin Atlantic in 1,000-point increments.\n\nThis is an incredible deal, especially because taxes, fees, and fuel surcharges are relatively low.  To compare, with other airlines between the US and Japan, you’ll pay:\n\n120,000 American Airlines miles round-trip in Business Class\n\n160,000 American Airlines miles round-trip in First Class\n\n140,000 United Airlines miles round-trip in Business Class (160,000 miles on partners)\n\n180,000 United Airlines miles round-trip in First Class (220,000 miles on partners)\n\nIf you want to go somewhere in Asia besides Japan, you’ll need to book a separate ticket (I recommend using British Airways Avios points to fly on Japan Airlines, Cathay Pacific, or Malaysia Airlines for as little as 4,500 British Airways Avios points one-way).\n\nUS ANA Destinations From Tokyo Narita and Haneda Airports\nTo book these awards, you’ll need to search for available award seats on United.com, because you can NOT search for ANA award flights on the Virgin Atlantic website.  Then call Virgin Atlantic at 800-365-9500 to book.\n\n2.   Delta Business Class to Europe (Except UK)\n\nLink:   Virgin Atlantic Award Chart for Delta Flights\n\nDelta is also a Virgin Atlantic partner airline.  And Delta’s flagship Business Class, called Delta One, is a comfortable way to get from the US to Europe.  With this transfer bonus, you can get a great deal on those flights!\n\nA non-stop, one-way flight from the US to Europe (except the UK) in Business Class costs 50,000 Virgin Atlantic miles.  So you’d pay just 39,000 AMEX Membership Rewards points with the current transfer bonus.\n\nFor comparison, these same flights would cost you at least 70,000 Delta miles.  Better yet, a one-way ticket starting in the US only has ~$6 in taxes, as long as you’re not flying to the UK.\n\nFly to Destinations Like Amsterdam, Paris, and Rome, in Comfortable Delta One Business Class for Just 50,000 Virgin Atlantic Miles One-Way\nIf you’re trying to get to the UK, pricing is completely different, because Delta and Virgin Atlantic have aligned their award charts between the US and the UK.  Those routes have variable pricing depending on what part of the US you’re coming from, and whether you’re flying during peak season.  For a one-way flight, you’ll pay 47,500 to 77,500 Virgin Atlantic miles, plus a whopping $500 surcharge.  So using Virgin Atlantic miles is NOT a good deal to or from the UK.\n\nNote:  Flights coming back from Europe to the US do have fuel surcharges, which can cost several hundred dollars.  So you might want to use your Virgin Atlantic miles to book your flight to Europe, and use other miles for your return flight.\n\nYou can search for Delta award flights and book them online at virginatlantic.com.\n\n3.   Hawaiian Airlines to Hawaii\n\nLink:   Virgin Atlantic Award Chart for Hawaiian Airlines Flights\n\nVirgin Atlantic’s partner Hawaiian Airlines has been rolling out lie-flat seats in Business Class, which makes them a great option to get from the US mainland to Hawaii.\n\nRound-trip Hawaiian Airlines award flights from the West Coast cost:\n\n40,000 Virgin Atlantic miles in coach\n\n80,000 Virgin Atlantic miles in Business Class\n\nWith the 30% transfer bonus from AMEX Membership Rewards to Virgin Atlantic, you’ll only need:\n\n31,000 AMEX Membership Rewards points in coach\n\n62,000 AMEX Membership Rewards points in Business Class\n\nHawaiian Airlines Has Been Upgrading Their Long-Haul Business Class Seats Which Makes for a Much More Restful Flight Between the Mainland and Hawaii\nThat said, if you’re flying from the East Coast, it’s NOT a good deal (even with the transfer bonus).  You’ll pay (round-trip):\n\n80,000 Virgin Atlantic miles in coach\n\n130,000 Virgin Atlantic miles in Business Class\n\nWith the transfer bonus, this works out to:\n\n62,000 AMEX Membership Rewards points in coach\n\n100,000 AMEX Membership Rewards points in Business Class\n\nTo compare, if you booked the same round-trip Hawaiian Airlines award flights (from anywhere in the US mainland) using Hawaiian Airlines miles, you’d pay 40,000 Hawaiian Airlines miles in coach, and 80,000 Hawaiian Airlines miles in Business Class.  And you can transfer AMEX Membership Rewards points to Hawaiian Airlines at a 1:1 ratio.\n\nBut from the West Coast, using Virgin Atlantic miles with the 30% AMEX transfer bonus is a nice deal!  And you’ll just pay a few dollars in taxes.\n\n4.   Hawaiian Airlines from Hawaii to Asia, Australia, and New Zealand\n\nLink:   Virgin Atlantic Award Chart for Hawaiian Airlines Flights\n\nIf you want to start your vacation in Hawaii (or live there!), you can redeem Virgin Atlantic miles for Hawaiian Airlines award flights to destinations in China, Japan, South Korea, Australia, and New Zealand, as well as Papeete and Pago Pago in the South Pacific.\n\nVisit Japan Like Emily Did! Flights From Hawaii to Tokyo Are a Good Deal With Virgin Atlantic Miles and the 30% AMEX Transfer Bonus\nRound-trip Hawaiian Airlines award flights to Asia, Australia, and New Zealand from Hawaii cost:\n\n80,000 Virgin Atlantic miles in coach\n\n130,000 Virgin Atlantic miles in Business Class\n\nWith the 30% AMEX transfer bonus to Virgin Atlantic, you’d pay:\n\n62,000 AMEX Membership Rewards points in coach\n\n100,000 AMEX Membership Rewards points in Business Class\n\nThis is a better deal than using Hawaiian Airlines miles for the same flights, which cost 80,000 Hawaiian Airlines miles in coach, and 130,000 Hawaiian Airlines miles in Business Class.\n\nFly Between Hawaii and These Destinations in Asia, Australia, New Zealand and the South Pacific on Hawaiian Airlines\nTo the South Pacific (Pago Pago, American Samoa, and Papeete, Tahiti) you’ll pay even fewer miles:\n\n55,000 Virgin Atlantic miles in coach\n\n95,000 Virgin Atlantic miles in Business Class\n\nSo with the 30% AMEX transfer bonus, these cost:\n\n43,000 AMEX Membership Rewards points in coach\n\n74,000 AMEX Membership Rewards points in Business Class\n\nTo compare, Hawaiian Airlines charges the same as Virgin Atlantic for these flights.  So you’ll do better with the 30% transfer bonus!\n\nHawaiian Airlines does NOT have fuel surcharges, so you’ll only have to pay for taxes and fees.\n\n5.   Air New Zealand Business Class From the US to New Zealand\n\nLink:   Virgin Atlantic Award Chart for Air New Zealand Flights\n\nVirgin Atlantic partner Air New Zealand Business Class is a terrific experience!  They even have memory foam mattresses and full size pillows, plus great food!  You’ll want all of these things on such a long flight.\n\nNew Zealand Is on Many Folks’ Bucket Lists – and You Could Use Virgin Atlantic Miles to Fly There on Air New Zealand\nYou can book a round-trip Air New Zealand Business Class award ticket from the mainland US to New Zealand for:\n\n80,000 Virgin Atlantic miles in coach\n\n125,000 Virgin Atlantic miles in Business Class\n\nAfter the 30% AMEX transfer bonus, this equals:\n\n62,000 AMEX Membership Rewards points in coach\n\n97,000 AMEX Membership Rewards points in Business Class\n\nFly Air New Zealand Between Auckland and Houston, Los Angeles, or San Francisco\nTo compare, if you booked the same flights with United Airlines miles (a Star Alliance partner with Air New Zealand), you’d pay (round-trip):\n\n80,000 United Airlines miles in coach\n\n180,000 United Airlines miles in Business Class\n\nSo you’ll certainly save by using Virgin Atlantic miles with the 30% AMEX transfer bonus!\n\nAir New Zealand also flies to Honolulu, and those flights are a bit cheaper than their mainland US counterparts.  You’ll pay 60,000 Virgin Atlantic miles in coach or 90,000 Virgin Atlantic miles in Business Class (47,000 or 70,000 AMEX Membership Rewards points).  Watch out for fuel surcharges though!\n\n6.   Non-Stop Delta Flights Within the Continental US and Canada\n\nLink:   Virgin Atlantic Award Chart for Delta Flights\n\nYou can redeem 25,000 Virgin Atlantic miles to book a non-stop, round-trip flight in coach on partner Delta within the Continental US, Alaska, and Canada.  Or 45,000 Virgin Atlantic miles in Business Class.\n\nWhile that’s equivalent to the prices American Airlines, Delta, and United Airlines charge for many domestic round-trip flights, you’ll end up doing better with Virgin Atlantic because of the transfer bonus.\n\nWith the 30% transfer bonus, for a round-trip non-stop Delta award flight, you’ll need:\n\n20,000 AMEX Membership Rewards points in coach\n\n35,000 AMEX Membership Rewards points in Business Class\n\nFly Between Atlanta and Beautiful Vancouver, British Columbia, on Delta for Less When You Transfer AMEX Membership Rewards Points to Virgin Atlantic\nYou can fly from Minneapolis or Salt Lake City to Anchorage, Alaska, New York City to Los Angeles or San Francisco, or Atlanta to Vancouver, British Columbia, or anywhere else Delta flies within the US!\n\nIf you want to fly in style, check out Delta’s flagship transcontinental service between certain cities on the West and East Coasts.  For 35,000 AMEX Membership Rewards points round-trip, you can fly in lie-flat Business Class on those routes.\n\nNote:   According to commenters at The Points Guy, Virgin Atlantic appears to have removed the option to book Delta lie-flat transcontinental seats.  I don’t know if this is a temporary glitch or permanent.\n\nIf you need a connection, Virgin Atlantic will charge you the full 25,000 miles for each flight, so this isn’t a good deal if you would have to take more than one flight to get to your destination.\n\nEarn More AMEX Membership Rewards Points\n\nThe following cards earn AMEX Membership Rewards points you can transfer to Virgin Atlantic and other airline and hotel partners:\n\nPersonal Cards\n\nBusiness Cards\n\nPremier Rewards Gold Card From American Express\n\nThe Business Gold Rewards Card from American Express OPEN\n\nThe Platinum Card® from American Express Exclusively for Mercedes-Benz\n\nThe Blue Business℠ Plus Credit Card from American Express\n\nThe Platinum Card® from American Express\n\nThe Business Platinum® Card from American Express OPEN\n\nAMEX EveryDay® Credit Card from American Express\n\nBusiness Green Rewards Card from American Express OPEN\n\nAMEX EveryDay® Preferred Credit Card from American Express \n\nAmerican Express® Gold Card\n\nAmerican Express® Green Card\n\nBlue from American Express®  Note: These are the ONLY AMEX cards that earn Membership Rewards points that can NOT be transferred to airline & hotel programs. But you can use these points on the Membership Rewards website for other redemptions. Includes personal AND small business versions of the card.\n\nIf you prefer earning Virgin Atlantic miles directly, the 90,000-mile sign-up bonus on the Bank of America Virgin Atlantic card has returned!  But you’ll have to spend a lot to unlock the full sign-up bonus.\n\nKeep in mind, Virgin Atlantic miles expire after 3 years with no activity, so I do NOT recommend transferring miles if you don’t have a redemption in mind.\n\nBottom Line\n\nSpeculatively transferring miles due to a transfer bonus is rarely a good idea.  But the 30% transfer bonus from American Express Membership Rewards to Virgin Atlantic through November 30, 2017, opens up some great award flight opportunities.\n\nFor example, you can save by using Virgin Atlantic miles to book award flights like:\n\nUS to Asia in First or Business Class on ANA\n\nUS to Europe (except the UK) in Business Class on Delta\n\nWest Coast to Hawaii or Hawaii to Asia, Australia, New Zealand, and the South Pacific in coach and Business Class on Hawaiian Airlines\n\nUS to New Zealand in coach or Business Class on Air New Zealand\n\nDomestic non-stop flights in coach or Business Class on Delta\n\nIf you are planning an upcoming trip and haven’t booked flights yet, take a close look at Virgin Atlantic’s partner award charts (especially the ones outlined here!) to see if one is a good fit for your plans.\n",
      "Folder": "Feedly",
      "Timestamp": "1511934133",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.523746Z"
}