{
  "id": "d2f1ad38d79f4d9fa9bbcdf52e29244c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1519575/will-a-texas-county-gops-effort-to-oust-a-muslim-official-backfire/",
      "Title": "Why ousting a Muslim party official would probably backfire on the Texas GOP Quartz",
      "Selection": "Tarrant County, home to two million residents in the sprawling Dallas-Fort Worth metro area, is the last urban enclave in Texas still in GOP hands—just barely. Republicans’ shrinking lead has local party officials quarreling over how to avoid losing it altogether.\n\nOpposing factions will face off tonight (Jan. 10) during a vote to decide whether there’s room in Tarrant’s GOP leadership ranks for a Muslim medical doctor.\n\nSeveral precinct chairs want Shahid Shafi, the party’s vice chairman, to step down, because they see his faith as incompatible with American values and laws. Texas Republicans, including governor Greg Abbott, say efforts to oust Shafi go against the freedom of religion outlined under the US Constitution and call them immoral.\n\nThis kind of internal strife is indicative of the Lone Star State’s shifting politics. After dominating the state for more than two decades, Republicans are now facing some real competition from Democrats profiting from the backlash against Donald Trump and the state’s dramatic demographic changes.\n\nThe question now before Texas Republicans is whether throwing red meat to their staunchest supporters will hurt more than help. At least in Tarrant, the data suggest that strategy would backfire, if not in the next election, probably over the long run.\n\nThe limits of Trump’s xenophobic pitch\n\nThe president has not gone as far as barring Muslim members from his party but has tried to stop Muslim immigrants from coming into the US, and demonized Islam in his speeches.\n\nStoking fears about Muslims has been an effective strategy to rally voters for Trump. Research shows that message resonates deeply with whites who resent ethnic minorities.\n\nTarrant, considerably less white than the country as a whole, is in the process of becoming less so. From 2000 to 2017, the share of people who identified as white only—meaning not Hispanic or mixed race—shrank from 62% to 48%, according to US Census data. (Nationwide, more than 60% of the population checked “white only.”)\n\nAnd the Republicans’ base didn’t prevent candidates in key Texas races for the US House and the state legislature from losing during the 2018 midterms. Victorious Republicans won by unusually thin margins, particularly those who adhere to Trump’s far-right brand of conservatism.\n\nChange in Texas’s growing cities\n\nVoting trends also show that the Republican message is not resonating with urban Texans. Here’s the voting record for the last two presidential and US Senate elections in Texas’s five most populous counties, which anchor the state’s biggest metro areas:\n\nFor now, Tarrant can be considered a swing county at best. That will likely change as its urban areas continue to grow. In 2017, Tarrant was the fifth-fastest growing county in the country, based on number of residents added, and Fort Worth ranked fourth on the list of fastest-growing US cities.\n\nThe winning Republican\n\nTarrant Country is also becoming more diverse. Latinos now make up nearly 30% of the population, up from less than 20% in 2000. Meanwhile, the number of Asians doubled to 120,000, now 6% of the population. Muslims remain an even smaller minority, but their numbers are swelling. Between 2000 and 2010, the county’s practicing Muslim population grew by 180% to about 40,000, according to the Association of Religion Data Archives at Penn State University, which tracks religion membership.\n\nA group of Tarrant County Republicans wants to oust party vice chair Shahid Shafi.\n\nGiven those trends, it’s hard to imagine Texas Republicans holding on to power without attracting non-white leaders—and voters—like Shafi. He was born in India and raised in Pakistan, and later became a surgeon in the US. He’s been a US citizen since 2009. He joined the Republican party because of its small-government mantra, he has told several outlets. Since 2014, he’s been a city councilman in Southlake, a conservative bedroom community outside Fort Worth.\n\n“I believe in this country it matters not where you come from. It only matters where you are going,” he wrote in a 2015 op-ed in the Forth Worth Star Telegram. He declined to speak with Quartz for this story, saying he will address the media after the vote.\n\nDorrie O’Brien, one of the precinct chairs leading the drive to oust Shafi, has essentially argued that he’s not fit for the vice-chairman position based on his religion alone. To her, Islam is a political ideology, she told attendees to a November meeting about the dispute, the newspaper reported. “We do care very much about political Islam with its global jihad to conquer nations and make them islamic and ruled by Shari’a law,” she said. She did not respond to Quartz’s request for comment.\n\nThe fight has dragged on for months, despite numerous attempts to tamp it down by prominent state politicians, including senator Ted Cruz.\n\nDiscrimination against Dr. Shafi b/c he’s Muslim is wrong. The Constitution prohibits any religious test for public office & the First Amendment protects religious liberty for every faith. The Party of Lincoln should welcome everybody & celebrate Liberty. https://t.co/Z16lst3SJN\n\n— Ted Cruz (@tedcruz) December 7, 2018\n\nCruz, who barely beat Democratic contender Beto O’Rourke in November, must be especially keen of the danger of putting off urban voters. He was the first statewide GOP candidate to lose Tarrant in more than two decades.\n",
      "Folder": "Feedly",
      "Timestamp": "1547240508",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.408991Z"
}