{
  "id": "d331a3dd8a1541e4a71887db207b000d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/925312/the-key-factor-that-determines-academic-success/",
      "Title": "Whether or not you’ll be successful in school comes down to one surprising factor Quartz",
      "Selection": "In order to be successful, many people believe, one must be passionate. Passion makes challenges enjoyable. It bestows the stamina necessary to excel. However, there are telling counterexamples where passion doesn’t seem to be a necessary ingredient for success. One such case is academic success. You might think that successful students should be passionate about their schooling, and that this passion for school would account, at least partly, for why some students succeed and why some don’t. But this isn’t right. My research has found that there is in fact no relationship between how well students do academically and what their attitude toward schooling actually is. A student doesn’t need to be passionate about school to be academically successful.\n\nMy research findings derive from the analysis of a large-scale international database called the Programme for International Student Assessment (PISA). The Organization for Economic Co-operation and Development (OECD) makes the dataset available every three years. It’s a treasure trove that gives researches like myself an unparalleled view into what students across the world think about their education. In the most recent 2015 PISA assessment, 72 countries and economies contributed. Reading, mathematics and science tests, along with a questionnaire about attitudes, beliefs, learning habits and the like, are administered to nationally representative samples of 15-years-olds around the world. In previous surveys, four simple options were used to measure students’ attitude toward school:\n\n(a) school has done little to prepare me for adult life when I leave school\n\n(b) school has been a waste of time\n\n(c) school helped give me confidence to make decisions\n\n(d) school has taught me things that could be useful in a job\n\nAs it turned out, simple and direct correlations between students’ academic achievement and their attitudes toward school were near zero. This was far from an anomaly. The near-zero result was replicated in the PISA 2003, 2009, and 2012. There were no differences with respect to students’ socio-economic backgrounds. Gender did not affect the finding, and it holds for both developing and developed countries. Only about 2% of the PISA mathematics performance was explained by students’ attitudes toward school in 62 countries. This means that in most countries, academically able students do not hold their schooling in high regard. Similarly, academically less able students do not necessarily have low opinions about their schooling. There’s simply no connection. This raises the intriguing question of motivation. If there is no real relationship between academic achievement and attitude, then what motivates bright students to achieve academic success? It certainly isn’t from an abundant passion for school.\n\nThe answer is that it comes from within. Other PISA-based research has suggested that what sets academically able and less able students apart is self-belief about their own strengths and weaknesses. Individual psychological variables such as self-efficacy, anxiety and enjoyment of learning in itself explain between 15% and 25% of the variation in students’ academic achievement. Collectively, research shows that students’ self-belief in their own problem-solving abilities is far more important than their perception of school itself.\n\nThis is a problem. Students’ attitude to school should matter for a number of reasons. If students find it difficult to see the direct benefits of their schooling, if they think that their school has failed to meet their expectations, and if they perceive that their academic skills are learned outside of school, it is possible that this will affect their views of formal institutions later in life. And indeed, many people have a pessimistic view of the role that formal institutions play – a view that very well could have stemmed from school experiences during formative years. Formal institutions shape the lives of a citizenry. They need to be upheld, bettered and strengthened – not discarded out of hand. So students should be taught to invest themselves in formal institutions, rather than to tear them down or fail to take part in them.\n\nWhat can be done? Adults responsible for making decisions about schooling need to be more cognizant about the long-term influences that the school experience can exert on students’ attitudes and beliefs. A stronger emphasis must also be given to the inclusion of hands-on group activities that emulate what they may do in life once they graduate. Whether students are able to see the link between their present and future may have critical consequences for society.\n\nThis article was originally published at Aeon and has been republished under Creative Commons. Learn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1488827957",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.706531Z"
}