{
  "id": "d36def592d334294893c0fb73666c678",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/18772-the-top-10-genius-recipes-of-2016",
      "Title": "The Top 10 Genius Recipes of 2016 Food52",
      "Selection": "With 2016 coming to an end, one of the more gratifying ways to take stock is to look back on all that we've cooked—and the recipes we'll pocket to keep feeding each other and ourselves on repeat.\n\nThe ten recipes below are the Food52 community's very favorite Genius Recipes of the year. Like every year, comfort foods abound—but this year, they're particularly nourishing, simple, smart ones. The one possible exception is the absurd grilled cheese—and if I were you, I'd make that one first.\n\nGenius, 5-Ingredient Fried Chicken—Without the Frying\nby Kristen Miglore\nMake Genius, Creamy, Scoopable Frozen Yogurt in 3 Ingredients (and 20 Minutes) Flat\nby Kristen Miglore\nZahav's Hummus Recipe is Genius—for Even More Reasons Than Everyone Says\nby Kristen Miglore\nRuth Reichl’s Grilled Cheese is Genius, and Completely Out of Control\nby Kristen Miglore\nA Genius Technique for the Best Vodka Pasta (And Better Marinara, Too) \nby Kristen Miglore\nA Genius One-Pan Lasagna—for the Hurried and the Lazy \nby Kristen Miglore\nThe Magic of the 3-Ingredient Chocolate Oblivion Truffle Torte, As Told By Rose Levy Beranbaum \nby Kristen Miglore\nBe a Genius, Do This One Thing, Have Better Soups All Winter\nby Kristen Miglore\nA Genius Trick for Fluffier Buttermilk Pancakes (No Whipping Egg Whites!)\nby Kristen Miglore\nA Genius Way to Upgrade Your Fried Eggs\nby Kristen Miglore\n\nGot a genius recipe to share—from a classic cookbook, an online source, or anywhere, really? Perhaps a genius dessert? Please send it my way (and tell me what's so smart about it) at kristen@food52.com.",
      "Folder": "Feedly",
      "Timestamp": "1482943856",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.676439Z"
}