{
  "id": "d38c0f4deffc43d2badb3ac1711808bb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/quartzy/1521267/some-good-news-about-parental-burnout-its-curable/",
      "Title": "Some good news about parental burnout It’s curable Quartz",
      "Selection": "Having kids sometimes feels like running a race you can’t win against a clock you didn’t set. Parenting today is often characterized by feeling overwhelmed and dissatisfied, two feelings that are exacerbated by headlines like “How Having Children Robs Parents of Happiness” and books with titles like All Joy and No Fun. Yes, you love your children, but you’re not alone if you sometimes hate being their parent.\n\nBut for some parents, that feeling is more than a passing mood. Instead, it’s a part of full-on parental burnout, a state that shares many of the same traits as professional burnout: high levels of exhaustion, feelings of inadequacy, and emotional detachment. Unlike a job that’s causing burnout, though, parenting isn’t something that can be quit.\n\nAlso unlike job-related burnout, parental burnout has relatively little to do with external situational pressures on parents and much more to do with the characteristics of parents themselves. And perhaps surprisingly, that’s good news.\n\nIn the study first identifying the concept of parental burnout, published last year, “we expected burnout to be mainly explained by socio-demographic factors,” like a parent’s economic resources, the number of kids, and the presence or lack of a partner, says psychology researcher Moïra Mikolajczak, a professor at the Université Catholique de Louvain in Belgium and one of the study’s co-authors.\n\nWhile those situational elements did contribute to a parent’s chances of developing burnout, Mikolajczak and her colleagues found that personal traits accounted for more of the risk. In an irony it might take a parent to fully appreciate, parents “who looked forward to parenthood the most, who give it their all,” were significantly more at risk of burning out, she says. Other traits linked to burnout included an inconsistent parenting style, a history of attachment difficulties with their own parents, a high level of family disorganization, and a hard time asking for help.\n\nYes, you love your children, but you’re not alone if you sometimes hate being their parent.\n\nOverall, that discovery delighted the researchers. “We nearly jumped out of our chairs with joy at these results, because this meant we could really help these parents,” Mikolajczak says. “External factors are more difficult to change. These we could improve.”\n\nParents who feel on the edge of burnout can use the findings to help themselves. If the flames seem to be getting particularly close, consider these strategies for giving yourself a mental and emotional refresh.\n\nBreak down what’s consuming your time\n\nMikolajczak and her colleagues were surprised to find that burnout was more strongly associated with highly educated parents, who may be more likely to have extraordinarily high expectations of themselves and their children. “So many parents really want to raise their child perfectly,” Mikolajczak says. “They want their children to eat organic food and to have two to three extracurricular activities, and it just becomes too much, and they lose sight of what’s important.”\n\nMikolajczak recommends that parents who are feeling that pressure to be perfect instead step back and look at what a week is really composed of. How much driving are you doing? How much time do you spend preparing complex meals? How much time doing things you think are “good for” your child but that you do not enjoy? “Try to remove some things to allow you and your child time to just be happy together,” she says. “Be aware that such a demanding schedule”—not to mention such a demanding parent—“may be putting your child at greater risk for burnout as well.”\n\nFigure out where you could most use help\n\n“Parental burnout happens when your perceived burden exceeds your personal resources to cope with it,” says clinical psychologist Laura Markham, author of the book Peaceful Parents, Happy Kids. Before you reach that point, try to find your personal “last straw.” It might be driving at one particular time of day, or meal prep, or bath time. Whatever it is, the effort of that activity exceeds what you have to give, and it’s time to ask for help if you can’t omit it entirely.\n\nIf you find yourself resisting, recognize your avoidance as a symptom of burnout. Parents dealing with burnout often struggle to identify problem areas or delegate the tasks that have become too much, says Isabelle Roskam, one of Mikolajczak’s co-authors and a fellow psychology researcher at the Université Catholique. “There’s often a fear that anything someone else does won’t be done as well.”\n\nParents may also ask for help around an area “in ways that are counterproductive,” Mikolajczak says. They accuse (“You’re never there when I need you.” “You always dump this on me.”) or they hint without asking. Make sure you’re being clear and straightforward about what you need.\n\nPay attention to how you handle conflict\n\nA common academic measure of parental happiness or satisfaction is efficacy—in layman’s terms, feeling like you’re pretty good at this parenting thing. Conversely, parents who feel ineffective in their roles are more likely to burn out. Mikolajczak and Roskam found three elements of less effective parenting in the parents they studied: inconsistency, coercion, and escalation.\n\n“In positive parenting, the parent has a consistent role, and the child knows what the limits are across various contexts,” Roskam explains. When a parent is inconsistent, the child learns to repeat requests, whine, and constantly push against the rules. Parents practicing coercion shout, punish, and threaten, and the conflicts escalate as both parent and child try to have the last victory in a game neither can win.\n\n“There’s often a fear that anything someone else does won’t be done as well.”\n\nParents who feel effective in their parenting, by contrast, tend to prioritize connection over control and see discipline not as the moment of punishing a child for wrongdoing, but as a continuum of teaching a child how to be a contributing member of the larger world. They know that there isn’t one universal way to raise a kid and are comfortable responding in the moment, even if they don’t get it exactly right every time.\n\nRecognize your choices\n\nYou are not the powerless victim of your child’s schedule. “We see these images of other people’s lives that are not accurate or sustainable,” Markham says, and then we make decisions in response to those images—which are often of families on the go rather than, say, parents at home watching Netflix while their children learn to entertain themselves (and complain of boredom or squabble with their siblings while doing it).\n\nIf your weekend is stuffed with children’s activities and wraps up with a family holiday party and a long drive home with overstimulated kids, you have made choices that landed you there. You have two paths forward: Either reduce the demands you’ve placed on yourself, or welcome them as things you want to be doing, not things you were forced to do.\n\nShift your focus away from outcomes\n\nWhen it comes to parenting-related stress, Markham says, “our perception matters.” When we require a particular result from our day, our child’s performance, or even our family’s response to a meal, our stress levels increase—and worse, we’ve let our own happiness become dependent on something we don’t control.\n\n“Burnout is an imbalance between demands and rewards,” Markham says. “You can reduce demands, but you can also increase rewards” by choosing to find them in daily connections with your child, rather than in academic or activity successes. Treasure the drive to soccer over the game itself, or “take a few minutes to lie down in the dark with a child at night and listen,” she suggests. “Don’t react to what they say or jump in to fix it. Just visit.”\n\nThis story was originally published on Medium.\n",
      "Folder": "Feedly",
      "Timestamp": "1547312037",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.408436Z"
}