{
  "id": "d486ace59c094bf4b387f8344834da37",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/996448/walmart-wmt-is-turning-its-1-5-million-employees-into-delivery-drivers-to-compete-with-amazon-amzn/",
      "Title": "Walmart is turning its employees into delivery drivers to compete with Amazon Quartz",
      "Selection": "Walmart, which is aggressively investing in e-commerce to better compete with Amazon, is unveiling a new strategy: turning its army of 1.5 million US employees into delivery drivers.\n\nThe tactic is being tested at three stores in New Jersey and Arkansas, and designed to shave costs out of the “last mile” of distribution, the most expensive part of getting goods to customers. The initiative was announced today (June 1) at Walmart’s headquarters in Bentonville, Arkansas, and in a blog post by Marc Lore, who heads e-commerce operations for Walmart. Lore is the former CEO of e-commerce startup Jet.com, which was acquired last year by Walmart for $3.5 billion to take on Amazon.\n\nUnder the initiative, store employees will be given the option to deliver packages on their way home after work, in exchange for extra pay. They’ll be given an app that allows them to input their routes, and an algorithm will plot the most efficient path. To take part, the employees will have to pass a background and vehicle check. In the pilot, most merchandise was delivered the day after the order was placed, beating Walmart’s pledge of second-day delivery.\n\nWalmart’s digital strategy relies on leveraging its enormous investments in infrastructure and employees. The company has 4,700 US stores and 6,100 trucks, and it hopes to be able to use those assets to narrow the gap with Amazon. Walmart is rolling out a grocery pick-up service, where online orders are delivered to customers’ cars, and is testing other ways of combining online shopping with its physical stores.\n\nWalmart’s online deliveries are now shipped from its warehouses to online fulfillment centers, then taken to customers by couriers like UPS and FedEx, sometimes hundreds of miles. Under the new plan, e-commerce goods would be shipped by Walmart’s fleet of trucks to stores, then the last mile by employees. If there aren’t enough employees available, Walmart will use normal couriers.\n\nBy deputizing its associates as delivery drivers, Walmart may be signaling the end of its experiment of using Lyft and Uber drivers as couriers. “This is very different from crowd-sourced delivery,” Lore said in Bentonville. “It pulls out a tremendous amount of time from that last mile, which pulls out a tremendous amount of cost.”\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1496357004",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.594474Z"
}