{
  "id": "d4a0596652a547fabcd2639b378e6549",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2017/7/29/16060614/trump-john-kelly-immigration-dhs",
      "Title": "This is the Trump administration’s dark reboot Vox - All",
      "Selection": "With a new chief of staff, Trump's refocusing on his top priority: making America afraid again.\n \nAs a businessman, Donald Trump didn’t really get rich because he was good at making deals. He got rich because he was good at branding himself.\n\nSo it shouldn’t be a surprise that after a rocky first six months in office, he’s jettisoning Reince Priebus, the chief of staff he initially accepted as the condition of a deal — his pact with the Republican Party, after winning the presidency, to work with the establishment rather than against it — and replacing him with a retired general who’s currently carrying out Trump’s immigration agenda.\n\nDepartment of Homeland Security Secretary John Kelly, who Trump announced in a Friday tweet would be his new chief of staff, is perfectly in line with the brand that first brought Trump to campaign success: the idea that the world is a terrifying place full of people (mostly foreigners) who want to undermine social order and the American way of life, and that the tough American men who stand up to them shouldn’t be too closely questioned about how they keep those threats at bay.\n\nThat brand has succeeded for Trump — it’s made the right people happy (his base and the cable news networks that generate endless debate over inflammatory remarks), it’s made the right people angry (Democrats and people who go on cable news networks), and if it’s terrified certain groups, they’ve been people who don’t seem to matter to Trump (immigrants and black Americans who vote for Democrats). \n\nThe appointment of Kelly — along with a speech Trump gave in Long Island on Friday afternoon that harkened back to the most chilling rhetoric of his campaign — is a sign that the Trump administration is rededicating itself to placing those ideas front and center. And it’s rhetoric that, even beyond the policy agenda it represents, invites violence into the crevices of American life. \n\nKelly represents Trumpism as its most authentic\n\nReince Priebus was doomed from the beginning. He was hired as the White House’s resident Republican insider — which is to say, from the perspective of Trumpworld, its resident outsider.\n\nPriebus’s notion of the White House was alien to Trump’s — he had quaint ideas about managing Trump’s time and working with factions of Congress to pass bills. But just as importantly, when he did the things Trump expected his top staffers to do — namely, go on television and defend the president’s agenda — he wasn’t a credible messenger. It was too obvious that he was the kind of person who thought that life had been basically okay before 2017, that Washington hadn’t abandoned Americans to the rampages of criminal gangs. \n\nTechnically, Priebus was fired after the project he’d been assigned — getting Congress to repeal the Affordable Care Act — failed in the Senate. But really, he was fired because, whether he succeeded or not, he didn’t perform in a way Trump understood or respected.\n\nWhile Trump’s health care agenda has foundered — as has much of the rest of his platform — his immigration agenda has not. As he promised, federal immigration agents are “unshackled.” As he promised, immigrants are being treated more harshly upon being apprehended at the border. The wall is happening slowly (and really, everyone involved agrees it’s more of a fence) but it’s moving along.\n\nBut while it’s true that Trump is simply elevating the man who’s overseen the administration’s biggest substantive success so far — Kelly — the reality is substantially more complicated.\n\nKelly wasn’t the brains behind the Trump immigration agenda. Most of it was designed by then-Sen. Jeff Sessions (before he became Attorney General and got shut out of Trump’s inner circle) and former Sessions staffers now highly placed in the White House, Department of Justice, and Department of Homeland Security.\n\nBut over the course of Kelly’s six months at the head of DHS, he became the face of the Trump immigration agenda. And to Trump, that’s even more important.\n\nIt’s not just that Kelly looked the part, or that his appearances on Sunday shows gave off the air of an upstanding military man who was a little uncomfortable doing a media appearance when there were wars to be fought. It’s the fact that Kelly spoke — and to all appearances believed — as if the Trump administration was a constant war against the forces of lawlessness and disorder. \n\nTo Chuck Todd, he called intelligence leaks “darn close to treason.” He warned Martha Raddatz that “you just have to be vigilant” about terrorism because “this is nonstop. They are out there trying to hurt us every day.” He told John Dickerson that he was kept awake at night and distracted four to five times a day by the threat of a terrorist attack “to knock down an airplane in flight.” \n\nTo Chris Wallace of Fox News, he justified the Trump administration’s travel ban by saying, “We have to figure out a way to determine who they are and why they come into the United States. Otherwise, we’re guessing. And this president and John Kelly doesn't want to guess when it comes to national security and protection of the US population.”\n\nTrump, easily distracted, hadn’t often returned as president to the apocalyptic rhetoric of an America under siege that he used at the most important moments on the campaign trail. Kelly did.\n\nIn a speech at George Washington University in May — a mission statement about Kelly’s priorities as secretary, delivered to an audience of Washington elites — Kelly was shockingly martial. “Make no mistake — we are a nation under attack. We are under attack from criminals who think their greed justifies raping young girls at knifepoint, dealing poison to our youth, or killing just for fun.”\n\nIt wasn’t the Kelly that many had expected when he was nominated — the regional Latin America expert who hated politics and would think a wall was total bunk. It sounded, well, a lot like Donald Trump, at a time when Trump wasn’t spending much time sounding like his old self.\n\nNow, though, that passage from Kelly’s speech might sound familiar. It’s awfully close to the rhetoric Trump used on Friday, during a speech in Long Island that was ostensibly about MS-13 but really about how important it was for ICE to be rough on immigrant “criminals.” \n\nThe Long Island speech came on the heels of Trump’s defeat on health care in the Senate. It wasn’t the first time his administration had pivoted back to immigration in an attempt to move on from an embarrassing setback on something else. But it was notable in its total lack of restraint — its insistence on turning subtext into text. President Trump (and even, for the most part, candidate Trump during the general election) hadn’t explicitly endorsed physical violence. On Friday, he called on police officers to shove suspects into cars without protecting the suspects’ heads from the impact. \n\nIt was, at once, absolutely bone-chilling and inevitable. It was a return to form. But it was a return to a form that many hoped Trump would have retired, for good, once assuming office.\n\nTrumpism isn’t just an ideology, but the belief that talking about something makes it so\n\nTrump may like the idea of having “a general” in charge of his White House staff, but Trump isn’t handing the reins to Kelly any more than he handed them to Priebus. The loosest cannon in the administration, newly hired White House communications director Anthony Scaramucci, will report directly to Trump, not to the chief of staff.\n\nManaging isn’t how Trump believes things get done. He believes things get done by talking about them. Now that he’s president, his rhetoric of America under siege has a counterpart: that under Trump, as he said on Friday, America is being “liberated.”\n\nTo a certain extent, this requires exaggerating his accomplishments, ignoring his setbacks. Sometimes it means that an extremely moderate policy is treated as a huge repudiation of progressivism or Obama; the administration has happily trumpeted a few dozen miles of border fencing in a House bill as “money for the wall.” When that happens, Trumpism’s bark really is worse than its bite.\n\nBut here’s the thing. Trump isn’t entirely wrong that using the bully pulpit to broadcast his worldview makes it real. It creates a space for other people to enact Trumpism on Trump’s behalf, outside the diktats of policy — either for people to use it as an excuse for violence against others, or as something to avoid by changing their own behavior.\n\nIt is true that if you tell immigration officers that the handcuffs are off, and then let them do what they want, they’ll be more assertive and aggressive. It’s true that if you tell police officers that protesters are a threat to social order and you don’t care whether people get beaten up while being loaded into cars, some of those police officers will rough people up while loading them into cars.\n\nIt’s true that you can, at least temporarily, deter people from coming to the United States without papers if you make it clear they’ll be put in prison even if they seek asylum, or that parents might be tracked down and deported for sending for their children to join them. It’s true that you can stop people from asking for food stamps or taking their children to school if they’re afraid of deportation — or if they’re afraid of violence at the hands of your supporters.\n\nJohn Kelly is very good at telling people to be afraid — either of the government, or of the people the government is fighting. That’s not just Trump’s brand. It’s his theory of governance.",
      "Folder": "Feedly",
      "Timestamp": "1501339745",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.565796Z"
}