{
  "id": "d5c52024185347a3ad768e6020154cc9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2017/4/7/15226400/uber-italy-ban-court-ruling",
      "Title": "Italy issues a nationwide Uber ban The Verge",
      "Selection": "Uber’s latest regulatory roadblock happens to be the entire country of Italy. In a court ruling issued today, all of Uber’s services were banned in the European country after a Rome judge ruled in favor of Italy’s major taxi associations that the ride-hailing service amounted to unfair competition, according to a report from Reuters. That means Uber’s Black, Lux, Suv, X , XL, Select, and Van services are all blocked from operating in Italy and Uber cannot advertise at all in the country. \n\nUber says it’s “shocked” by the ruling\n\n“We’re shocked,” Uber’s lawyers said in a statement obtained by Italian newspaper Corriere della Sera. “We will appeal this ruling that is based on a 25-year-old law. Now the government can’t waste more time and needs to decide whether it wants to remain anchored to the past, protecting privileged profits, or whether it wants to allow Italian to benefit from new technologies.” \n\nThe lawyers for Italy’s top taxi associations were a bit more celebratory. ““This is the fourth ruling by an Italian judge that ascertains Uber’s unfair competition, the latest battle in a legal war that began in 2015 to stop the most striking form of unfair competition ever registered on the Italian local public transportation market,” the lawyers told Corriere della Sera. \n\nUber plans to appeal the ruling. It has 10 days to do either that or cease operating its service in Italy. If it does neither, it faces fines up to $10,600 for every day it continues operating illegally. The news ends another rather rough week for Uber, as the company continues sustaining bad press over its treatment of drivers and female employees and remains stuck in a high-profile legal battle over trade secret theft with Alphabet’s Waymo division. \n",
      "Folder": "Feedly",
      "Timestamp": "1491657619",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.690081Z"
}