{
  "id": "d60d7037ed0b468a8ab41d2e4c1087d6",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/726006/craigslist-confessional-i-feel-like-i-never-had-a-childhood-i-had-so-many-people-depending-on-me/",
      "Title": "Craigslist Confessional “I feel like I never had a childhood; I had so many people depending on me.” Quartz",
      "Selection": "This story is part of a series called Craigslist Confessional. Writer Helena Bala has been meeting people via Craigslist and documenting their stories for nearly two years. Each story is written as it was told to her. Bala says that by listening to their stories, she hopes to bear witness to her subjects’ lives, providing them with an outlet, a judgment-free ear, and a sense of catharsis. By sharing them, she hopes to facilitate acceptance and understanding of issues that are seldom publicly discussed, at the risk of fear, stigma, and ostracism. Read more here. Names and locations have been changed to protect her subjects’ anonymity.\n\nFederico, 20s, Northeast US\n\nI was ten years old when we moved to the States. My mom and dad came with me, and we left my brother and sister with my aunt back in Bolivia. The plan was that we would try to bring them here once we got things in order. Eight years passed in a heartbeat. We left my siblings behind when they were seven and eight, respectively.\n\nThe next time my mother saw them, they were teenagers. My aunt passed away from cancer and my mom had to go back to Bolivia. She’s there now, taking care of my siblings and my aunt’s children, too. I haven’t seen her in three years. This has torn our family apart, and the only solace I feel is in knowing that it’s for a greater good.\n\nI played soccer in high school and I was very good. I had opportunities to play overseas, but I couldn’t because I’m not a citizen. We came here with a visa that we overstayed, so we’ve been illegal with no road to citizenship. There aren’t very many job opportunities for people like me, so my dad told me that I had to work construction with him. I started when I was 18, right after I graduated high school.\n\nWhen I got my first paycheck, I felt rich. I saved my money and sent it back to my family. When my mother moved back to Bolivia, my father, uncle, and I all moved in together in a studio apartment. Shortly thereafter, my dad and I both got laid off. I remember how horrible those months were. My uncle was working in events and planning for a University, so he would bring us leftover food from their events. That’s how we survived.\n\nWhen we found work again, it taught me the value of money. For my dad, it was a bittersweet experience. I noticed that he was working hard—much harder than before—and he would often cover my work, too. He said that it hurt him to see me doing such hard physical labor. He felt bad for me, and I understand. I would want a better life for my son, too.\n\nHe had an accident at work one day: he fell off of an eight-foot ladder. He was unconscious on the floor, and I called the ambulance in a panic. When we got to the hospital, I could tell that he was in a lot of pain, but the doctors kept telling us that he was fine. We didn’t have insurance, so they didn’t want to treat him.\n\nWe eventually just went home. My dad never went back to work—he couldn’t. So we gave my uncle his tools after they found out at the University that he didn’t have his papers and fired him.\n\nAfter that, I started downloading books online about becoming a foreman and a project manager. I paid attention at work and asked my boss questions when I didn’t understand why we were doing something; I took ownership of my work, and my boss slowly started giving me more and more responsibility. Eventually, he gave me opportunities to manage jobs on my own. But that didn’t change the fact that I still didn’t have a work permit.\n\nI don’t remember how I met her, but I should have seen it coming. She actually brought it up—she said that she saw how difficult it was for me to be away from my family, and that she would marry me so that I could get my papers. I told her that I wasn’t sure I wanted to be married right now, but she said she understood that it was a marriage of convenience. I went along with it because I thought it would be such a quick fix to so many of my problems.\n\nAfter we got married, I got a conditional green card, which meant that I’d have to be with her for another two years. But she started getting very jealous and possessive. She told me that she felt I would eventually fall in love with her. I was completely dependent on her and her whims, and I guess she knew she had me where she wanted me. Eventually, all of these small financial emergencies started coming up: a fix for the car here, new furniture there. She and her mother were constantly hitting me up for money.\n\nBy the time I asked her for a divorce, I was totally broke. She, of course, completely refused. I was a total nervous wreck for months. I couldn’t take it anymore, so I showed up to the immigration office and told them everything. They said they’d cancel my application, and a lot of money, heartache, and anxiety later, I was right back where I started.\n\nI feel like I never had a childhood; I had so many people depending on me from such a young age. I work all the time—we all do—so that we can support each other. I don’t waste money on luxuries, I don’t drink, and I don’t do drugs. I just work so that my family and my siblings can have a better life, a better future. I have to believe that this will all count for something—that my life in this country matters. Otherwise, it would be impossible to wake up every morning.\n\nRead more Craigslist Confessionals here. We welcome your comments at ideas@qz.com.\n",
      "Folder": "Feedly",
      "Timestamp": "1468187678",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.792134Z"
}