{
  "id": "d63baf85759e4884b0c21ac0eb1823fe",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2017/7/28/16054694/senate-repeal-obamacare-failed-mccain",
      "Title": "The Senate had 3 Obamacare repeal bills. It has now voted against them all. Vox - All",
      "Selection": "The Senate failed to pass its Obamacare repeal bill early Friday morning after three Republican senators — Sens. Lisa Murkowski (R-AK), John McCain (R-AZ), and Susan Collins (R-ME) — voted against the effort.\n\nThis is the third day in a row that the Senate has voted down a health care bill. On Tuesday, the chamber rejected the Better Care Reconciliation Act, which would repeal and replace Obamacare. On Wednesday, it came down against the Obamacare Repeal Reconciliation Act, a straight repeal bill.\n\nAnd in a dramatic debate that began Thursday morning and stretched into Friday night, the chamber rejected the Health Care Freedom Act, a bill that whittled down the Republicans’ ambitions to repealing the individual mandate (which would still leave 16 million Americans without coverage).\n\nThree bills dead in one week now leaves the Senate with few, if any, options. The Republican caucus does not have any extra bill drafts floating around at this point. It only has options that it doesn’t like — and no clear sense of where to go next. \n\nThe HCFA wasn’t a bill that senators loved much from the start. Many senators were openly critical of the actual policy (which would spike premiums in the individual market) and tethered to their vote in favor of the bill to a promise that the House wouldn’t turn around and vote it into law. \n\nStill, through Thursday afternoon, the HCFA seemed to gather steam. A handful of senators, including McCain, liked the idea of using the bill to start a conference committee with the House and keep the debating moving forward. This group held a press conference late Thursday, saying they would support HCFA so long as the House guaranteed it would go to conference committee.\n\nThis was not a guarantee, however, the House could give. While House Majority Speaker Paul Ryan did put out a statement suggesting he’d be open to and even encourage a conference process, it wasn’t enough to win McCain over. \n\nAfter an hour of lobbying on the Senate floor — including discussions with Senate Majority Leader Mitch McConnell and Vice President Mike Pence — McCain crossed the floor to huddle with Democrats. Sen. Diane Feinstein of California gave him a big hug.\n\nIt’s not clear where the Senate Republicans go from here, their repeal options currently exhausted. They have a caucus that strongly supports repealing and replacing Obamacare but little path left to get there. ",
      "Folder": "Feedly",
      "Timestamp": "1501222146",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.646236Z"
}