{
  "id": "d743798d2d5342428dd7583979bb4a28",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/story/kanopy-best-movies-streaming/",
      "Title": "Kanopy Is Becoming the Best Free Streaming Service Out There Wired",
      "Selection": "When the classic-movie streaming service FilmStruck shuttered last month, it caused a palpable panic among cineastes. Overstuffed with exceptional big-studio films and arthouse gems, the service represented a viable alternative to the big streamers, many of which offer relatively meager film catalogs. And FilmStruck's demise was especially troubling when you realize just how many movies, from Oscar-winners to low-budget oddities, are completely missing from streaming services altogether. What are America's raging Cocoon-heads supposed to do?\n\nFor those looking for a flick-filled streaming alternative, however, there's Kanopy, an impressively stocked service available to many university students and library-card holders around the world. Though Kanopy's availability and selection varies based on your location, its catalog features must-watch titles from such outlets as the Criterion Collection, Paramount Pictures, and the recently-added A24, home of Moonlight and Lady Bird. You still won't find Cocoon, but here are a few choice Kanopy kuts that will get you started.\n\nMetropolis (1927)\n\nIf you haven't seen Fritz Lang's silent future-set classic in a while—or if you only know the movie from its pop-culture footprint—now's the perfect time to plunge into its gorgeous art-deco dystopia. It's just as visually majestic, and as politically astute, as it was nearly a century ago.\n\nThe Hitch-Hiker (1953)\n\nDirector Ida Lupino's three-man noir follows a pair of average-joe road-trippers who pick up a murderous roadside hitchhiker—and are subsequently forced into a slow-boiling sojourn through Mexico. A tense ripper full of great performances, including William Talman as the bastardly kidnapper, The Hitch-Hiker is just as relentless as the desert sun itself.\n\nPurple Noon (1960)\n\nDecades before Matt Damon slimmed down for 1999's The Talented Mr. Ripley, Patricia Highsmith's classic stolen-identity novel was chillingly adapted by French director René Clément. With its gorgeous European locations, cruel twists of fate, and distractingly foxy cast, Noon is thoroughly beguiling.\n\nSave the Tiger (1973)\n\nA forgotten existential-crisis classic, Save the Tiger stars Jack Lemmon as a troubled LA businessman whose flailing career forces him to take desperate measures. Lemmon, rough and wry, plays a middle-aged man who no longer recognizes the world around him; it's one of his greatest roles, and would eventually win an Oscar.\n\nClue (1985)\n\nA once-drubbed novelty that has grown into a genuinely beloved latter-day hit, Clue nowadays feels like a true rarity: A zippy, quippy screwball murder-mystery in which several fantastic performers—from Michael McKean to Madeline Kahan—gamefully play along without ever batting a wink.\n\nDogtooth (2009)\n\nNearly a decade before The Favourite, Greek director Yorgos Lanthimos enjoyed an international breakout with this discomforting drama about a family whose young children have been kept completely away from the modern world. It's sometimes funny, frequently shocking, and impossible to forget—no matter how much you might try.\n\nLet the Fire Burn (2013)\n\nIn 1985, Philadelphia police dropped a bomb on a row house occupied by members of a radical group called MOVE. Nearly a dozen occupants were killed and multiple properties were destroyed—yet the incident remained, in many ways, a local story. Let the Fire Burn chronicles the incident via remarkable archival footage and sharp editing. One of the best documentaries of the past 10 years.\n\nBeyond the Lights (2014)\n\nDirector Gina Prince-Bythewood's epic music-industry romance is the kind of smart, sumptuous grown-up movie that rarely gets made anymore. Gugu Mbatha-Raw is a troubled young pop icon; Nate Parker is a cop who gets pulled into her glitzy orbit. A ridiculously catchy love story.\n\nGood Time (2017)\n\nA grimy, giddy tale of big-city desperation, starring Robert Pattinson as a greaseball charmer who robs a bank with his brother—and then spends the rest of the time trying to bail him out of jail. A little bit After Hours, a little bit Dog Day Afternoon, and definitely worth a late-night viewing.\n\nMadeline's Madeline (2018)\n\nAnchored by a trio of remarkable performances, Josephine Decker's experimental drama is enchanting, confounding, and sometimes downright difficult—in other words, everything a deeply personal indie should be. Newcomer Helena Howard—in a mesmerizing, almost mind-meldy turn—plays a young theater performer torn between her put-upon mom (Miranda July) and her increasingly invasive director (Molly Parker). As Madeline's life intensifies, so does Madeline's Madeline, in ways that are all but impossible to predict.\n\nMore Great WIRED Stories\n",
      "Folder": "Feedly",
      "Timestamp": "1544066667",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.445917Z"
}