{
  "id": "d7e13632314c4df9b14933a723247dd4",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theboot.com/2011/01/03/country-strong-extras/",
      "Title": "My Day as an Extra on 'Country Strong' - The Boot",
      "Selection": "My Day as an Extra on 'Country Strong'\nPosted Jan 3rd 2011 10:00AM by Donna HughesComments [0]\n\nPrint this page|EmailShare on FacebookShare on TwitterShare on DiggShare on Lifestream\n \nSony Pictures\nTim McGraw helped bring the production of his new film 'Country Strong,' which also stars Gwyneth Paltrow, to Nashville this past February, and that gave temporary jobs and the chance to be seen on the big screen to hundreds of Middle Tennesseans, like me. \n\nThe producers wanted Tim in their movie badly enough that they agreed to film it in Nashville, a convenient driving distance from his home which helped accommodate his touring schedule and family obligations.\n\nPrior to arriving on the set of the movie, I had hoped to get Tim's attention so that I might be offered a bigger part, maybe even a speaking role. He would see me, and say, \"There is my good friend! She would be great in a more pronounced part.\" And then, Gwyneth and I would be best friends, and we would live happily ever after, trading recipes and tips for living well. However, that was not to be the way things would play out. In fact, there is the remote possibility that I may be seen in the far reaches of the auditorium during a concert scene ... or maybe not.\n\nMy day began as usual, with breakfast and a shower, and then I packed up and headed to downtown. The rest of my day's schedule as a 'Country Strong' extra follows:\n\nAt 9:15 AM: I was rocking along to Foghat's 'Slow Ride' and then ZZ Top's 'Sharp Dressed Man' in my green Xterra to the place I would meet the production folks to head over to that day's film location.\n\n9:30 AM: I noticed there were more people than I thought would be there, and I suddenly did not feel special anymore as I did a few days earlier when the production folks called to tell me I had been picked to appear in the film. We were loaded onto buses, herded a bit like cattle. There were various types of people ranging in age from 21 to 71.\n\n9:47 AM: We arrived at Nashville's Municipal Auditorium and proceeded to get into two separate lines based on the first letter of our last names. We moved along at a good pace to sign in and get our paperwork to fill out.\n\n10:32 AM: I finished my paperwork and got into another line. Handed my paperwork to one of the many production assistants on the film crew, who were seated behind several white tables, definitely keeping their distance from us \"extras.\"\n\n11:10 AM: After waiting around, I was sent to wardrobe, and the \"fashion consultant\" had me go into the bathroom to change, even though what I was wearing was comfortable and would go well at a concert scene -- jeans, a cute top and most importantly, flip flops. However, she picked out my most uncomfortable pair of boots, even though nobody would ever see them and a little dress over jeans and a denim jacket.\n\n11:45 AM: Now that I was appropriately attired, we were seated and then moved from one section to another located at the corner of stage left. I noticed up in the rafter seats there were some pretty stiff people, just staring ahead, and I realized they were dummies set to appear as people.\n\n12:07 PM: Got a little hungry, so I ate some pop tarts that I brought with me just in case I could not find anything to appease my appetite.\n\n12:14 PM: I overheard us described as \"warm bodies\" by who I thought was a production assistant on the film. I checked my temperature, and it was true -- I registered 98.9 degrees, a nice warm body, for sure.\n\n12:16 PM: A bunch of us had to stand up and move to another section of the auditorium.\n\n12:38 PM: Leighton Meester, in character as 'Chiles Stanton,' walks on stage in a frilly white dress, and the guy behind me, obviously a 'Gossip Girls' fan, starts yelling, \"I love you, Leighton Meistra,\" mispronouncing her name. I was hoping maybe he would get thrown out or at least moved to another section, only after he kept yelling. \n\n12:40 PM: Actor Garrett Hedlund, best known as Tim's son in the film 'Friday Night Lights,' appears on stage, dressed in well-worn jeans, and from a distance, he looked like Eric Church with a cowboy hat. \n\n12:47 PM: The two were on stage getting makeup and hair ... Leighton started stretching her legs and dancing for her scene. The music started playing; it was an uptempo song, \"I'm just a girl ...,\" and she started lip-synching along to the song.\n\n12:57 PM: The makeup artist came back again, because Leighton was working up a sweat with her size 0 body dancing and prancing around the stage.\n\n1:15 PM: Leighton finishes the fourth run of the song, and the guy behind me yells for the 12th time, \"I love you, Leighton!\"\n\n1:18 PM The \"band\" sets up on stage, and then Garrett in character as 'Beau Hutton,' starts to perform what I think was called 'A Little Bit Stronger.'\n\n1:50 PM: Our section was told we were \"too stiff,\" and the production team wanted us to sway to the slow song. I've never been called stiff in my entire life!\n\n1:52 PM: I feel I have to use the bathroom, but I'm unsure of when I can leave my seat. For the moment, I can hold it. But soon I might have to find someone with a set of Depends if we are going to sit here much longer.\n\n2:05 PM: The crew changes the set a bit, and I figured this would be the time to go to the bathroom. Um, absolutely not.\n\n2:21 PM: The two stars rehearse the same scene for the second time, and then we were told that in the next scene, we don't have to clap, just simulate. The extra handlers told us, \"No noise!\"\n\n2:50 PM: I finally make my escape and go racing to the bathroom. Whew!\n\n3:01 PM: I catch a glimpse of the Oscar-winning Gwyneth Paltrow, who was sporting big, blonde curls (which The Judds would describe as \"jacked up to Jesus\") and a gold sparkly gown with a split up to her thigh. I figured I would get banned from the set if I leaned over the railing and started flailing my arms to get her attention, so I refrain from making a fool out of myself. I wanted to see how her scene would play out. I know she would notice me and suddenly feel a bond of sisterhood, marking our first moment of becoming BFFs.\n\n3:10 PM: We are now moved to different sections again, so the cameras can shoot a different angle and the seats would look full.\n\n3:14 PM: The curtain in front of the stage is lifted, revealing the \"headliner's\" set.\n\n3:22 PM: We are able to take a break while the set is being changed and lighting re-set, so many of us saunter out to craft services (set lingo) to see what we can scrounge up. A banana looks pretty good, as do another package of Pop Tarts. Yes, I'm living the good life!\n\n5:58 PM: Back to filming the beginning of the concert scene with Gwyneth, while she lipsynchs a song called 'Country Strong,' which will later become the first single from the movie's soundtrack. As she walks off the stage to the side, Gwyneth's character, 'Kelly Canter,' has a \"tense moment\" with Leighton's, before she disappears in the tunnel.\n\n7:00 PM: Many of us return from grabbing some dinner ... Diet Coke and barbecue, plus another banana for me.\n\n7:17 PM: The director calls \"Quiet on the set,\" and Tim appears on set for the first time that I could see, sporting a suit. He was standing next to Garrett, who walks on stage to a piano, while Tim turns and walks backstage.\n\n7:21 PM: Take two of the previous scene. Music emanates from the speakers, and Garrett stops before getting to the piano. This time, Tim claps before turning and walking backstage.\n\n7:25 PM: The third take featuring Tim, and this time, he crosses his arms, turns and looks back, then walks backstage.\n\n7:33 PM: A fourth take of the same scene.\n\n7:57 PM: The third take of the concert opening scene takes place.\n\n7:59 PM: The extra handlers ask for January to April birthdays to stand up; I stay seated since my birthday is in August. They move them to a different section in front of the stage. The irritating boy who \"loves Leighton Meistra,\" is among that group. Hallelujah! \n\n8:06 PM: Garrett's double sits in at the piano for blocking purposes.\n\n8:10 PM: Garrett returns and they shoot another scene, followed by a run-through of an entire song performance. He waves to the small audience, then shakes hands with the extras lining the stage.\n\n9:16 PM: A set change occurs, and the extras are moved to another section. The natives are getting restless.\n\n9:32 PM: Rehearsal for another song with a Texas feel.\n\n9:40 PM: Garrett, the drummer and steel guitar player jam with each other, while the production crew gets everything re-set.\n\n9:51 PM: I'm getting real good at this clapping stuff, but I think I've developed big, puffy blisters on the palms of my hands.\n\n10:22 PM: I think I've lost count of how many takes of the same scene they've filmed. Was it because I dozed off for a second, or did one take drift into the next? Not sure.\n\n11:00 PM: The crowd is instructed to chant \"Kelly! Kelly!\" for Gwyneth's character. \n\n11:02 PM: We practice applause. I thought we had it down pat after the first few hours. Maybe the timing was off.\n\n11:34 PM: We shot different scenes of entering the arena and walking to our seats. We do this for different sections of the room which were surrounding the stage. They play some music from a couple of country artists including Jason Aldean and Gretchen Wilson.\n\n11:47 PM: We have to sing along to another one of Gwyneth's songs, titled 'Shake That Thing,' which will appear in the movie. I didn't know the words, but tried to mouth them anyway. The people standing closest to me would not have wanted to hear me sing ... at all!\n\n11:51 PM: We were thanked and released from our indentured servitude. We then had to take some of our paperwork that we had to keep up with throughout the day, to check out.\n\nCheck out 'Country Strong,' featuring Tim, Gwyneth and ... me ... when",
      "Folder": "Archive",
      "Timestamp": "1294205894",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:24.182012Z"
}