{
  "id": "d7f93349899745b98b5fbbc770617914",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://fivethirtyeight.com/features/the-ultimate-wedding-playlist/",
      "Title": "The Ultimate Wedding Playlist FiveThirtyEight",
      "Selection": "In early May, I asked FiveThirtyEight readers to send in their wedding reception set lists, and good God, did you deliver. I received 163 playlists1 with 9,281 songs among them.\n\nAs a result, I’m pleased to introduce FiveThirtyEight’s ultimate wedding playlist, based on the most popular songs among the reception set lists people sent in:\n\nSONG\n\nSET LIST APPEARANCES\n\n1\n\nHey Ya!\n\n69\n\n–\n\n2\n\nI Wanna Dance With Somebody\n\n57\n\n–\n\n3\n\nUptown Funk\n\n55\n\n–\n\n4\n\nShout\n\n54\n\n–\n\n5\n\nCrazy In Love\n\n50\n\n–\n\n6\n\nDon’t Stop Believin’\n\n45\n\n–\n\n7\n\nBillie Jean\n\n44\n\n–\n\n7\n\nGet Lucky\n\n44\n\n–\n\n7\n\nTwist and Shout\n\n44\n\n–\n\n10\n\nShut Up and Dance\n\n43\n\n–\n\n11\n\nSeptember\n\n41\n\n–\n\n11\n\nDon’t Stop ‘Til You Get Enough\n\n41\n\n–\n\n13\n\nYeah!\n\n40\n\n–\n\n14\n\nI Want You Back\n\n39\n\n–\n\n14\n\nYou Make My Dreams\n\n39\n\n–\n\n16\n\nSigned, Sealed, Delivered (I’m Yours)\n\n38\n\n–\n\n17\n\nSweet Caroline\n\n36\n\n–\n\n18\n\nHappy\n\n34\n\n–\n\n18\n\nWe Found Love\n\n34\n\n–\n\n20\n\nCall Me Maybe\n\n33\n\n–\n\n20\n\nIgnition (Remix)\n\n33\n\n–\n\nThe ultimate wedding playlist\n\nBefore we dive into the data, let’s go back to those responses, because they were really something else. There were winery weddings and ski lodge weddings, destination weddings and barn weddings. There were big weddings, small weddings, straight weddings, same-sex weddings, secular weddings and big church weddings. I heard from the top live wedding band in California — all three of them. I received playlists designed for Polish weddings, Indian weddings, French-Canadian weddings and Brazilian weddings, along with the necessary musical additions for weddings in Buffalo, New York. I heard from someone who distributed my analysis of the proper rate of descent during “Shout” at his nuptials, which was pretty rad. I had someone send me “The Rains of Castamere” from an anonymous email account, which as a “Game of Thrones” nut I should have seen coming. One person sent me a 20-song playlist composed entirely of “Rock Lobster,” which is a far longer song than you likely recall. My heart was warmed by all the stories that couples sent in and then re-frosted when I saw how few of them played “Danza Kuduro.”\n\nAnd the variety of responses really came through in the data. Even though the list of the most popular overall songs suggests a consensus, there was far from total homogeneity. There were 3,358 unique songs in this set. The top 359 songs accounted for just half of the plays. The point: Wedding playlists consist of a core of songs that appear very regularly, plus several more unusual songs that are informed by the choices of the couple and — based on what people told me in their emails — the often emphatic recommendations of family.\n\nIt’s very much the same way with the artists:\n\nARTIST\n\nSET LIST APPEARANCES\n\n1\n\nMichael Jackson\n\n202\n\n–\n\n2\n\nBeyoncé\n\n130\n\n–\n\n3\n\nThe Beatles\n\n120\n\n–\n\n4\n\nStevie Wonder\n\n108\n\n–\n\n5\n\nOutkast\n\n94\n\n–\n\n6\n\nQueen\n\n88\n\n–\n\n7\n\nRihanna\n\n85\n\n–\n\n8\n\nVan Morrison\n\n74\n\n–\n\n9\n\nThe Jackson 5\n\n73\n\n–\n\n10\n\nJustin Timberlake\n\n71\n\n–\n\n10\n\nWhitney Houston\n\n71\n\n–\n\n12\n\nDaft Punk\n\n69\n\n–\n\n13\n\nPrince\n\n64\n\n–\n\n14\n\nPitbull\n\n63\n\n–\n\n15\n\nLady Gaga\n\n59\n\n–\n\n15\n\nMark Ronson\n\n59\n\n–\n\n15\n\nUsher\n\n59\n\n–\n\n18\n\nJourney\n\n58\n\n–\n\n19\n\nThe Isley Brothers\n\n57\n\n–\n\n20\n\nElvis Presley\n\n52\n\n–\n\n21\n\nEarth, Wind & Fire\n\n50\n\n–\n\n21\n\nFrank Sinatra\n\n50\n\n–\n\n21\n\nKanye West\n\n50\n\n–\n\n21\n\nThe Temptations\n\n50\n\n–\n\n25\n\nThe Rolling Stones\n\n49\n\n–\n\n26\n\nDaryl Hall & John Oates\n\n48\n\n–\n\n26\n\nMadonna\n\n48\n\n–\n\n28\n\nDavid Bowie\n\n47\n\n–\n\n29\n\nJay Z\n\n46\n\n–\n\n30\n\nFlo Rida\n\n45\n\n–\n\n30\n\nTaylor Swift\n\n45\n\n–\n\n32\n\nWalk the Moon\n\n44\n\n–\n\n33\n\nKaty Perry\n\n43\n\n–\n\n33\n\nSam Cooke\n\n43\n\n–\n\n35\n\nR. Kelly\n\n42\n\n–\n\n36\n\nBilly Joel\n\n40\n\n–\n\n36\n\nLMFAO\n\n40\n\n–\n\n36\n\nNeil Diamond\n\n40\n\n–\n\n39\n\nThe Black Eyed Peas\n\n39\n\n–\n\n40\n\nThe B-52s\n\n38\n\n–\n\n41\n\nBruce Springsteen\n\n37\n\n–\n\n41\n\nKesha\n\n37\n\n–\n\n43\n\nCarly Rae Jepsen\n\n36\n\n–\n\n44\n\nElton John\n\n35\n\n–\n\n44\n\nMiley Cyrus\n\n35\n\n–\n\n44\n\nMissy Elliott\n\n35\n\n–\n\n47\n\nNotorious B.I.G.\n\n34\n\n–\n\n47\n\nThe Beach Boys\n\n34\n\n–\n\n47\n\nThe Cure\n\n34\n\n–\n\nTop wedding playlist artists\n\nMichael Jackson appears most often, but even that understates his essential role in wedding dance parties given that the Jackson 5 are No. 9 on the list.\n\nJust as important as the stuff that gets played, though, is the material that couples make unambiguously clear will not be played under any circumstances. We didn’t get “do not play” lists from everyone, so take this with a grain of salt, but a few trends appeared. Line dances are a big presence: Guess some people got burned by the “Cha-Cha Slide” and don’t want to mentally go back there. Other polarizing songs include Meghan Trainor’s “All About That Bass,” “Sweet Caroline” and the detestable “Blurred Lines,” as well as the entire catalogs of Dave Matthews Band,2 Maroon 53 and the Village People.4 Hey, it’s your party.\n\nThere are several distinct eras evident in the data. You’ve got your Motown and oldies: “Signed, Sealed, Delivered (I’m Yours),” by Stevie Wonder; “Ain’t No Mountain High Enough,” by Marvin Gaye and Tammi Terrell; and “At Last,” by Etta James. There are hits from the 1970s and 1980s, including Earth, Wind & Fire’s “September,” Journey’s “Don’t Stop Believin’” — the song with the most interesting popularity trajectory in pop music5 — and the B-52s’ “Love Shack.” There’s a robust contemporary contingent — “Uptown Funk,” “Shut Up and Dance,” “Happy” and “Shake It Off” are hot right now — plus some established modern icons, including “Get Lucky,” “Ignition (Remix),” “Hey Ya!,” “Single Ladies” and “Yeah!”\n\nOne thing this data doesn’t tell us is how wedding playlists have changed over the decades. When new songs join the canon every year, we don’t extend receptions to accommodate them: There’s a finite amount of dance floor time, and all we’ve got is a snapshot here. Still, I am endlessly curious about how these generic set lists would change over time.\n\nMy first thought was that different songs get phased out survival-of-the-fittest style. In 10 years’ time, perhaps “Low” will be the sole vestige of 2007, and its contemporaries — “Cupid Shuffle,” “Paper Planes” and “Electric Feel” — will be lost to time. But then I saw the distribution of release years, and I contrived a new theory.\n\nThere are peaks centering on the mid-1960s, the early 1980s and (obviously) the last few years. Now, I don’t have any hard proof for this theory besides [expressively waves hand at that chart], but here’s what I think is causing the funky trimodal distribution above: Everyone at the wedding — the couple, their parents, their parents’ parents — gets a few songs from when they were in their late teens and early 20s. Let’s do some back-of-the-napkin math. According to the U.S. census, the median age at first marriage for the bride is about 27, so for a 2016 wedding, we can approximate that she was born around 1989. That means her parents would have gotten married in the late 1980s — let’s just say 1986. Mom would have been 22 or so back then based on the census data, which would place her birth around 1964. That would put the 2016 bride’s grandparents’ wedding around the early 1960s, when the median marriage age for women was 20.\n\nSo it isn’t so much that “‘Uptown Funk’ will be absent from weddings within 10 years,” but rather “‘Uptown Funk’ may be absent from weddings within 10 years, but it could make a hell of a comeback in 25 years when the 2016 couple’s offspring starts getting married.”\n\nIn the end, receptions are another reflection of the whole point of weddings: starting something new and uncertain and kind of frightening, but beginning it in something traditional and established and fundamentally familiar. As the old saying goes, “something old, something new, something borrowed, to the window, to the wall, ’til the sweat … [redacted],” or some crap like that.\n\nThe top 200 are here:\n",
      "Folder": "Feedly",
      "Timestamp": "1464914261",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.767696Z"
}