{
  "id": "d827d5c31b584257a2635803a907faf9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/story/la-is-doing-water-better-than-your-city-yes-that-la/",
      "Title": "LA Is Doing Water Better Than Your City. Yes, That LA Feed All Latest",
      "Selection": "The frantic phone calls to the Community Water Center began in the summer of 2014. In the 7,000-strong unincorporated community of East Porterville, nestled against California's Sierra Nevada mountains, homeowners' wells were failing amid a historic drought. Folks were hauling water from their workplaces or from agricultural wells. Parents were sending their kids to shower at the local high school. Residents with still-functional wells were snaking hoses over fences to nourish their neighbors.\n\n\"People were in dire straights. They were desperate,\" says Ryan Jensen of the Central Valley's Community Water Center. \"Elderly people or people battling chronic illnesses that need water to be able to deal with their health issues had no access to it. There was just absolute desperation.\"\n\nIn total, the wells at 300 properties had failed. So a local nonprofit distributed 275-gallon tanks and officials trucked in water. That didn't cut it.\n\nOn account of being unincorporated, East Porterville only had a handful of buildings connected to the water system in Porterville proper. So beginning in August 2016, workers hurried to connect 750 homes, the last of which tapped into Porterville this past February.\n\nLA's sprawling Hyperion Water Reclamation Plant processes the wastewater of 4.5 million people.\n\nwired\n\nEast Porterville's situation is extreme, but it is not an outlier. If anything, it is a harbinger. \"It was only an outlier in the concentration and sheer number of people who lived in a very small area that were affected by this,\" Jensen says. \"There's approximately 300 communities in the state of California and more than a million residents who don't have reliable access to safe drinking water, and that's not even counting people who are on domestic wells.\"\n\nCalifornia is in trouble. Computer models show that with climate change will come harsher droughts and less frequent, yet more powerful storms. The state is not ready for this new reality, but one city south of Porterville could teach California how to survive desiccation: Los Angeles.\n\nThat is not a typo. Agreed, Los Angeles doesn't exactly have a sterling reputation as a responsible consumer of water. After all, in the early 1900s it drained Owens Lake, 200 miles away, materializing a dust bowl in its place and giving local residents the old ¯\\_(ツ)_/¯.  These days, it imports the vast majority of its water from Northern California and the Colorado River to the east at a cost of hundreds of millions a year.\n\nBut Los Angeles is in the midst of an aqueous awakening, setting an ambitious goal to cut its reliance on imported water in half by 2025 by following an increasingly urgent rule of good water policy: diversification. In a nutshell, that means getting your water from a range of sources—rain capture, aquifers, wells, desalination, even right out of the air. A study from UCLA earlier this year even said the city could feasibly reach 100 percent locally sourced water. To do it, the city is diving into a series of high- and low-tech campaigns that could transform Los Angeles into a model city for water management.\n\nAgain, not a typo.\n\nWater Begins With Dirt\n\nArt Castro of the LA Department of Water and Power stands atop his city's future: the San Fernando aquifer, which sprawls for 175 square miles. It is, essentially, a giant underground water tank that can provide some 28 billion gallons of water. (Usage fluctuates from month to month and year to year, but in July 2017, Angelenos consumed 102 gallons a day per capita.) Behind Castro, tractors push massive amounts of dirt. Dirt to the left, dirt to the right. In fact, this place is nothing but dirt, which is weird considering it's just 25 miles north of downtown LA. This should be concrete. Maybe a condo complex or two.\n\nConcrete, though, is the enemy of Los Angeles' future. Back when the city sprouted, designers laid it out to channel stormwater away as quickly as possible. City Planning 101. SoCal's notorious downpours and flash floods were a menace. There were properties and human lives to consider, after all. \"Now there's been there's been a shift in that thinking,\" Castro says. \"Now we see stormwater as an asset.\"\n\nAt the Edward C. Little Water Recycling Facility, engineers turn wastewater into something so pure, it'd do terrible things to your body if they didn't add minerals back in.\n\nWired\n\nThe answer is this rare empty plot of land, the 150-acre Tujunga Spreading Grounds, laid out in 1930 and preserved as open space to this day. Stormwater flows in, gathering in giant basins and slowly percolating into the dirt and, eventually, the aquifer. When these crews are done excavating 1.9 million cubic yards of soil to consolidate 19 basins into 9 deeper basins (fewer berms = more surface area for soakage), enough water will be captured each year to hydrate an average of 50,000 households.\n\nSure, the LADWP serves more than 4 million customers, so it's but a drip. But the Tujunga Spreading Grounds are just the start. A mile and a half away in a frenetic LA street is a beautified median—some nice little trees, shrubs, and dirt, with a walking path meandering through—that doubles as a spreading ground in miniature. Stormwater from the neighborhood flows here and soaks into the ground, instead of flowing to the sea.\n\nIt may only collect enough for 150 households, but that ain't bad for a single median. And the thing about medians is, LA has a few of them: The city can duplicate this project wherever the soils are permeable enough to accept water. A storm that dumps 1 inch of rain will deposit over 8 billion gallons of water on Los Angeles. (The LADWP supplies about 160 billion gallons a year.) Of course, you're not going to collect all the stormwater that falls on Los Angeles, but catchment projects like the Tujunga spreading grounds and green medians can grab a fraction that would otherwise drain to the sea.\n\nAnd grab the city must. Climate change will not be kind to Southern California. \"More droughts, more floods, and more warm temperatures all will result in more water when we don't want it, and less water when we do,\" says Michael Kiparsky, director of the Wheeler Water Institute at UC Berkeley.\n\nWhich means that when Los Angeles gets those rare deluges, it needs to somehow get that water into that aquifer, where it can be drawn on in times of want. \"We understand that we're sitting on a gold mine,\" Castro says.\n\nWater, Water, Everywhere\n\nNot every city is so geologically fortunate, though. A hundred miles south of Los Angeles is the coastal city of Carlsbad, near San Diego. Just off the beach, up a well-manicured hill, sits a nondescript building—not the kind of place you'd think would suck in 100 million gallons of seawater and turn it into 50 million gallons of fresh drinking water every day.\n\nBut step inside the Carlsbad Desalination Plant and the scale becomes clear: row after row of stacked tubes loaded with membranes poked full of minuscule holes. Pump saltwater through these at a staggering 900 pounds per square inch (for reference, the air in your car tire is around 30 psi) and you can filter out viruses, bacteria, and, of course, salt. This is known as reverse osmosis.\n\nUnlike Los Angeles, San Diego isn't sitting on an aquifer goldmine, says Jessica Jones, director of communications for Poseidon Water, which operates the plant. \"So we have very few local supplies. Having such a high dependence on imported supplies makes a project like this perfect for this county, because we'll always need it.\"\n\nFor this county being the operative phrase. Desalination has been around for decades, yet hasn't really taken off—for good reason. Pumping millions of gallons of water at 900 psi isn't exactly energy efficient, though that's changing with new technologies. At this plant, they use exchangers that recycle pressure that would otherwise be lost, and they claim it has reduced the energy consumption of the reverse osmosis process by half.\n\nThe Carlsbad Desalination Plant sucks in 100 million gallons of seawater and turns it into 50 million gallons of fresh drinking water every day.\n\nWired\n\nSan Diego knows full well it has a water diversity problem. Almost all its water comes from Northern California and the Colorado River. Problem is, eight other states get a taste of the Colorado before California. \"We're at the end of a very long straw,\" Jones says.\n\nDesalination is still expensive, yes. But for San Diego, it could well be a critical fallback if, say, an earthquake cuts off the supply of imported water. That said, desalination ain't for everyone. Where plenty of rain falls, there's not much of a case for spending money to tap into the sea.\n\nStill, relying on a single source of water is extremely perilous. \"Diversification is important for water management in the same way that it's important for your financial portfolio,\" says Kiparsky, of the Wheeler Water Institute.\n\nIf you bet all your money on one company and that company craters, you're broke. Spread your money around, though, and you can ride out the rough times. Same goes for water: Los Angeles is betting big on catchment, and San Diego diversified its portfolio with desalination. At no small expense, sure, but in the end San Diego has better prepared itself for an uncertain future.\n\nBack up in Los Angeles, they're taking another, more … contentious step to prepare themselves for that uncertainty: recycled toilet water.\n\nWaste Not, Want Not\n\nFor a facility that processes the wastewater of 4.5 million people, the Hyperion Water Reclamation Plant doesn't smell nearly as bad as you'd expect. Until, that is, you start making your way to the headworks, where giant mechanized rakes scoop out inorganic material—cloth and such. The stench is eye-wateringly spectacular.\n\nAfter scooping, Hyperion further refines most of the water until it's safe to pump 5 miles out to sea. Around 40 million gallons a day, however, flow down the road to the Edward C. Little Water Recycling Facility, where a complex filtering system turns the fairly-clean-but-nowhere-near-drinkable stuff into water so pure, it'll make you very, very sick if you drink enough of it. (More on that in a moment.)\n\nThat level of purity is the result of the very same process that turns seawater fresh down in Carlsbad: reverse osmosis. The water is pumped through membranes, which sort out nasties like viruses and the many pharmaceuticals that come out with urine. It's even blasted with UV light to make sure nothing biological gets through. The end product is very nearly pure hydrogen and oxygen, which would actually end up leaching minerals out of pipes, not to mention the human body. \"If you were to drink enough of that water, it could pull calcium from your bones,\" says Christiana Daisy, operations manager at West Basin Municipal Water District, which runs the facility. So they actually have to add minerals back in.\n\nFor now, the purified water doesn't go into customers' taps. Instead, it's injected into the ground to act as a kind of barrier between seawater and fresh groundwater. But the idea is to one day recycle wastewater and put it right back into the system. The industry is moving cautiously, though, given what you might call a considerable \"ick\" factor for the public. But hell, if  Texas can go toilet to tap, why can't California?\n\nHere's the thing, though: You've been drinking recycled wastewater this whole time. \"Somebody upstream of you is using the water, treating it, and then discharging it back,\" says USC engineer Amy Childress, who specializes in the membranes that make desalination and wastewater treatment possible. \"And then that water is treated again and used as drinking water.\"\n\nSalt water under pressure passes through membranes, purifying it for drinking.\n\nWired\n\nAre reverse osmosis processes like desalination and wastewater treatment still expensive? Sure. But they rely on technology, and technology generally improves. Membranes will get more efficient, and prices will fall. That'll help more communities diversify their water portfolios.\n\nWhich is an immediate, not future, concern. \"Fresh\" water isn't always as fresh as you're expecting it to be. \"There are a lot of places in the US that people wouldn't think have issues with water supply—the East Coast for example,\" Childress says. \"In places where we weren't considering desalination in the past, even if it's just brackish groundwater, we're now maybe needing to desalinate.\" This could grow increasingly relevant as rising seas begin to infiltrate supplies of fresh groundwater.\n\nBut maybe pulling water from the ground isn't the only way to go about this—perhaps you can pull it from the air too. Nets in Chile, for instance, collect fog as drinking water, though the efficiency is only 2 percent, max. But MIT researchers recently developed a system that ionizes fog droplets, making them attracted to mesh, thus raising the efficiency to 99 percent. And over at UC Berkeley, engineers have concocted a fancy sponge-like material that collects moisture from cool desert air at night and releases it as drinking water when things heat up during the day.\n\nAll well and good, but technology will only get us so far. We can't just engineer our way out of this one. \"It's got to be a conservation mind-set,\" Childress says. \"We have to start valuing water more.\"\n\nLessons From the State of Plenty\n\nThis is bigger than Los Angeles. This is about fundamentally changing humanity's perverse relationship with water.\n\nYou don't appreciate water, because no one in the developed world really does, save for the residents of East Porterville, which very nearly withered and fell from the vine that is bountiful California. \"Ultimately, if things were to get far worse, I think we could see this happening in bigger cities,\" says Jensen of the Community Water Center. \"But I think the bigger, more likely problem is that wide swaths of rural California may have to pack up and move.\"\n\nNot everyone is as lucky as Los Angeles, with its piles of money and sprawling aquifer, or San Diego, with its piles of money and desalination plant. In the developed and developing worlds alike, those without the means or conditions to diversify their water sources face peril. Water wars will rage, and communities will perish.\n\nThose communities fortunate enough to be able to engineer their way toward water security damn well better start thinking about it. Take it from La La Land: It's never too late to change.\n\nMore Great WIRED Stories\n",
      "Folder": "Feedly",
      "Timestamp": "1528991419",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.461084Z"
}