{
  "id": "d85197bc508f43da80e3c52e4ab38a4a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://millionmilesecrets.com/2017/09/14/ending-soon-generous-transfer-bonus-thats-great-for-cheap-short-haul-flights/",
      "Title": "Ending Soon Generous Transfer Bonus That’s Great for Cheap Short-Haul Flights Million Mile Secrets",
      "Selection": "Don’t forget!  American Express is offering a 40% bonus for transferring AMEX Membership Rewards points to British Airways through September 17, 2017.\n\nUse This Bonus to Book Short Haul Flights Anywhere British Airways or Its Partners Fly for Extra Cheap\nBonus for Transferring AMEX Membership Rewards Points to British Airways\n\nThe normal rate for transferring AMEX Membership Rewards points to British Airways Avios points is 1:1.  But with this limited-time bonus, you’ll get 1,400 British Airways Avios points for every 1,000 AMEX Membership Rewards points you transfer.\n\nJust the other weekend, team member Meghan took advantage of this deal for a short-haul award ticket to Seattle from Missoula, Montana.  On British Airways’ partner, Alaska Airlines.\n\nShe loves the fact that because British Airways prices award flights according to distance, short flights cost fewer miles!\n\nSo if you’re planning to use British Airways Avios points to book an award ticket soon, you’ll want to take advantage of the 40% bonus!  Even if you don’t have a specific trip in mind, it could be worth it.  Because these deals don’t come around often.\n\nBottom Line\n\nThe 40% bonus for transferring AMEX Membership Rewards points to British Airways is ending on September 17, 2017.\n\nIf you have an upcoming trip planned and want more British Airways Avios points, this is a great deal!\n\nEven if you do NOT have a specific trip in mind, it’s still worth considering.  Because you can use British Airways Avios points for cheap flights to fun destinations like Hawaii and Ireland.  And for short-haul flights within the US and Europe!\n",
      "Folder": "Feedly",
      "Timestamp": "1505432512",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.552835Z"
}