{
  "id": "d9c5e24063304c5fa87f81fb0e1afc18",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/work/1605050/job-advice-site-ask-a-manager-started-a-salary-spreadsheet/",
      "Title": "The Google spreadsheet with over 12,000 salaries—and counting Quartz",
      "Selection": "The popular workplace-advice site Ask A Manager, founded in 2007 by management consultant Alison Green, offers insight into some of the most personal and potentially embarrassing issues related to work. Topics range from the innocuous, such as whether to list being fluent in Klingon—a language in the Star Trek universe—on a resume, to more difficult questions such as whether to let a colleague know that he or she is about to be laid off.\n\nAt least twice in recent years, Green also has used her blog to take on one of the most sensitive subjects in the workplace: compensation. And this week, she’s done it again.\n\nOn April 24, Green uploaded a salary survey on her blog to provide more clarity around how much people get paid. More than 12,000 respondents have answered the survey to date.\n\nIn addition to annual salary figures, the survey asks people to identify their age, industry, job title, location, post-college job experience, and the currency in which they are paid. It also provides a field for additional context. The information lives on an anonymous Google spreadsheet that can be publicly viewed.\n\nAs Green notes in her latest post about the topic of compensation, salary websites are often inaccurate, and “people can get weird when you ask them questions directly.” Even when salaries are available, it can be difficult to find a more granular breakdown by industry, geography, or experience level.\n\nA single, sortable spreadsheet does away with the frills and hurdles you get with sites like Glassdoor and PayScale, which often require you to join before you can get access to information, and lets the numbers speak for themselves.\n\nAsk A Manager’s salary spreadsheet is the latest example of “Google-doc activism” where sensitive information is shared via anonymous spreadsheets. The idea first became popular after engineer Erica Baker, while working at Google, created and shared a spreadsheet that showed pay inequities at the tech giant. News of the spreadsheet went viral in 2015. Since then, similar spreadsheets and surveys have been used to provide insight on sensitive topics from the gender breakdown of engineers at tech companies to the alleged mistreatment of women at companies such as Nike.\n\nGreen’s spreadsheet offers some interesting tidbits about jobs and pay. In St. Louis, Missouri, there’s a “zoo curator” who makes $70,000 annually. In Portland, Oregon, there’s a respondent with 8 to 10 years of experience who earns $68,000 a year importing coffee, and an elementary-school teacher with 21 to 30 years of experience who takes home just $30,000.\n\nThe survey suggests that well-paying jobs can be found outside tech or finance or the biggest cities. A consumer safety officer (who inspects government-regulated industries) in Long Beach, California, a grocery store HR director in Spokane, Washington, and a marketing manager in Milwaukee, Wisconsin, all make more than $96,000 a year.\n\nYou can watch the data come in live, and it's fascinating. (We're already at 1400+ responses in 30 minutes so far.) https://t.co/qr5UGvT1k7\n\n— Ask a Manager (@AskAManager) April 24, 2019\n\nBut the information does not necessarily provide a complete picture. It is self-selecting survey, after all, and it has its share of misspellings, typos, and responses that don’t actually answer the question. Notably, the survey does not include race or gender, which can provide more nuanced insight into salaries.\n",
      "Folder": "Feedly",
      "Timestamp": "1556417503",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.409855Z"
}