{
  "id": "da818959b3d84d828702ce60b2556406",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://awealthofcommonsense.com/2016/11/dont-try-to-get-rich-twice/",
      "Title": "Don’t Try to Get Rich Twice A Wealth of Common Sense",
      "Selection": "Don’t Try to Get Rich Twice\n\nPosted November 22, 2016 by Ben Carlson\n\nWarren Buffett recently spent some time giving a talk to a group of MBA students at the University of Maryland and was asked what the most important skill in finance is. This was his response:\n\nThe most important skill in finance is salesmanship. That’s how you convince someone to marry you and that’s how you get a job. The most important quality to do well is temperament which would permit the control of fear and greed which have ruined many. Anyone who has become rich twice is dumb. Why would you risk what you need and have for what you don’t need?  If you are already rich, there is no upside to taking on a lot more risk, but there is disgrace on the downside.\n\nThe first part about sales is crucial (something that took me a long time to understand), but I thought his comments on becoming rich were insightful, as well.\n\nObviously, being rich is a good problem to have, but it can actually be difficult for many people to stay rich. There was a study performed earlier this year that took a look at the composition of the top 1% of incomes in the U.S. They found that 11% of Americans join the top 1% for at least a single year during their prime working years, but less than 6% are able to stay there for 2 years or more. So this group is constantly changing.\n\nAnd as most people eventually learn, a high income is not the same thing as wealth.\n\nIt seems like every week there’s a new story about wealthy investors getting scammed in some sort of Ponzi Scheme. And the reason many people become wealthy in the first place is because they take great risks to get there. Those same risks are often their downfall. Preserving your capital is much different than obtaining it.\n\nMany serial entrepreneurs do get rich twice, but I’m with Buffett — why risk what you need and have for what you don’t need? If you’ve already won the game, why continue trying to win even more?\n\nHere are a few thoughts on how to preserve wealth if you happen to be lucky enough to be in this cohort:\n\nFirst, do no harm. Avoid unnecessary or avoidable risks such as concentrating your investment holdings. There’s no reason to be a hero. Diversification is key here.\n\nAll investors need to consider their ability, willingness and need to take risk. If you’re already wealthy, you should overweight the need side of this equation when making decisions.\n\nNever invest in something you can’t explain in 60 seconds or less. If you don’t understand it, don’t invest in it.\n\nIf it sounds too good to be true, it probably is.\n\nAvoid any financial salesperson or advisor offering guarantees, especially in regards to promised investment return numbers.\n\nUnderstand where you are in your investment lifecycle. If you are retired or are approaching retirement you have very little in terms of your greatest asset — human capital. If you are young, you still have a huge position in human capital.\n\nYou still have to worry about the threat of inflation and a rising standard of living when you are wealthy, but those worries are typically in terms of the next generation if you plan on passing money along to your children. All investors have multiple time horizons.\n\nDon’t worry about what other people’s portfolios or investment holdings look like. There’s no need to worry about what your neighbors, friends or family members are invested in. Jealously and envy have no place in portfolio management. Boring will almost always trump exciting with your investments, but many wealthy people assume they need an exciting portfolio to keep up with their peers. It’s an expensive assumption.\n\nRisk comes in many shapes and forms. For some people, risk means running out of money before they die. For others, risk means making huge mistakes. Wealthy investors should be more focused on the latter.\n\nIt’s hard enough to get rich once. Don’t force yourself to have to get rich twice.\n\nSource:Warren Buffett Meeting with University Maryland MBA Students (David Kass)\n\nFurther Reading:Book Review: Simple Wealth, Inevitable Wealth\n\n \n\n\n\n\n",
      "Folder": "Feedly",
      "Timestamp": "1479851626",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.751701Z"
}