{
  "id": "dcc9c55a3bb9479182ce70508018a2cb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.frugaltravelguy.com/2017/06/should-you-redeem-urs-or-transfer-them-for-better-value-how-to-decide.html",
      "Title": "Should You Redeem URs or Transfer Them for Better Value How to Decide Frugal Travel Guy",
      "Selection": "Deciding how to redeem your Ultimate Rewards points can seem like a daunting task, especially when you consider all of Chase’s transfer partners. Sometimes it seems like redeeming Ultimate Rewards for 1.5 cents each (with the Chase Sapphire Reserve Card) or 1.25 cents each (with the Chase Sapphire Preferred Card) through Chase’s travel portal is the best way to go. And, it might be, but you could be leaving points on the table. Here’s how I decide how to redeem my points.\n\nFirst, I think about where I’m going and which airlines can get me there. If you’re traveling to a fairly popular destination, there’s a good chance that at least one airline from each major alliance (Oneworld, Star, and SkyTeam) will fly there. If you’re flying to a smaller or off the beaten path destination, your options might be more limited. Either way, the easiest place to find out which airlines fly to a specific destination is through the Wikipedia page for the airport you want to fly to. If I wanted to go to Saigon, Vietnam, this would be the Wikipedia page I check, just scroll down the the ‘airlines and destinations section’ and focus on the airlines.\n\nNext, I would check my points options to fly there. I would only consider the cost at this time and not look into availability. As a reminder, here are the Ultimate Rewards transfer partners:\n\nUnited\n\nSingapore\n\nKorean\n\nKLM/Air France Flying Blue\n\nVirgin Atlantic\n\nBritish Airways\n\nSouthwest\n\nIf only considering redeeming Ultimate Rewards, these are the only airline award charts I would look at.\n\nIf you’re flying outside of the U.S., Caribbean, and Mexico, you can automatically ignore Southwest, but the concept is still similar if you are flying within that region.\n\nFor long haul flights, it’s pretty much a given that you can ignore British Airways, and you can also generally ignore Virgin Atlantic. If you want to make sure you’re getting the best deal, go ahead and check them anyway, the concept is the same.\n\nFor the sake of this post, we will only look at the award prices for United, Singapore, Korean, and KLM/Air France.\n\nYou can look up award charts individually, but I like to use Flyer Miler or Award Maximizer to compare many programs at the same time. However, keep in mind that these tools are not always perfectly accurate. Let’s continue with the Vietnam trip example, and we will assume that the departure airport is Lexington, KY and that we are interested in an economy class flight.\n\nUnited (Star Alliance) – 40,000 miles each way\n\nSingapore (Star Alliance) – 55,000 miles each way\n\nKorean (SkyTeam) – 45,000 miles each way\n\nKLM/Air France (SkyTeam) – 40,000 miles each way\n\nSince only two alliances are represented with these transfer partners, we only need to consider the lowest priced option from each alliance. This is because, for the most part, the same award availability is available for all partners within the alliance. In both cases, the lowest award price available is 40,000 miles each way, or 80,000 miles round trip.\n\nNow it’s time to forget about awards for a minute and take a look at the cash prices for a ticket. Let’s assume that you’re interested in traveling in November for 10-12 days, and are pretty flexible about when you go. Use your favorite flight search tool (mine is ITA Matrix) to check airfare prices.\n\nAt time of writing, the lowest price I found fitting these constraints was $1,012 roundtrip. Now, if I wanted to redeem my Ultimate Rewards through Chase’s travel portal, the value depends on which card or cards I have. With the Chase Sapphire Reserve, points are worth 1.5 cents each. I would need 67,467 Ultimate Rewards to pay for this $1,012 airfare – less that what’s required by transfer partners for the redemption. If I have the Chase Sapphire Preferred, my points are only worth 1.25 cents each and I would need 80,960 Ultimate Rewards points – slightly more than transferring to a partner. This is all found out without even checking award availability and knowing what the taxes and fees would be on the award tickets. In this case, there’s a clear winner if I have the CSR and a likely winner even if I only have the CSP because airline taxes and fees haven’t yet been accounted for.\n\nThe next step, assuming it does make sense to utilize a transfer partner, is to look for award space. If award space exists for your travel dates, book it! If it doesn’t and you can’t adjust your travel dates, then either book through Chase Travel or consider booking with cash and saving your points for a future trip.\n\nIf it’s a really close case and you need to consider airline taxes and fees, you need to subtract them from the ticket price. For example, lets say for this Vietnam trip, United does have availability but charges $80 round trip for taxes. That means you can either pay 80,960 points through Chase (if you have the CSP) or pay 80,000 United miles + $80 in taxes – both options save you $1,012. Now you need to calculate the value you are getting out of your points. You already know it’s 1.25 cents in the case of the CSP redemption, but you’ll also earn a few thousand miles from flying the fare. In the case of the transfer to United, you’re really only saving $1,012-$80=$932 for your 80,000 miles. This means your points are only worth 1.165 cents each ($932.00/80,000). In this case, it would be better to redeem your miles through Chase’s travel portal.\n\nHow do you decide whether to redeem points through Chase Travel or transfer to a partner?\n",
      "Folder": "Feedly",
      "Timestamp": "1498064443",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.584340Z"
}