{
  "id": "dccf7756d74d4710a4b12bb992e4c9bd",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://millionmilesecrets.com/2017/01/01/best-of-million-mile-secrets-december-2016/",
      "Title": "Best of Million Mile Secrets – December 2016 Million Mile Secrets",
      "Selection": "1.   It’s the perfect time to earn the Southwest Companion pass, because all 3 Southwest cards are offering 50,000 points!\n\nEarn Nearly Enough Points for the Southwest Companion Pass!  Get the Best Deal in Travel With 2 Credit Card Sign-Up Bonuses\n\n2.   Did you know you can now fly from 6 US cities to Ireland for only 26,000 British Airways Avios points round-trip?\n\nUse 13,000 British Airways Avios Points to Fly One-Way in Coach to Dublin 8 Months Out of the Year, From Cities Including Chicago, New York, and Washington, DC!\n\n3.   Read this post to find out whether gift cards qualify for the AMEX Business Platinum $200 airline fee credit.\n\nAnd don’t forget, through January 25, 2017, the AMEX Business Platinum card is offering a 100,000 AMEX Membership Rewards point sign-up bonus after meeting minimum spending requirements.  That’s worth $2,300 in airfare!\n\n100,000 AMEX Membership Rewards Points Is More Than Enough to Fly to Paris!\n\n4.   Here’s how to use AMEX Membership Rewards points for United Airlines award tickets.\n\nGet to Hawaii for 20,000 Fewer Miles Than United Airlines When You Transfer American Express Membership Rewards Points to Singapore Airlines\n\n5.   Just because you apply for lots of credit cards doesn’t mean you can’t keep an excellent credit score.\n\nApplying for Lots of Credit Cards Is NOT Always Bad for Your Credit Score.  And Can Sometimes Even Improve It!\n\n6.   Here are tips & tricks to get the Southwest Companion Pass with Marriott flight packages.  So you and a loved one can travel for free for nearly 2 years!\n\nBook a Marriott Hotel + Air Package in Early 2017 and Get the Southwest Companion Pass for Almost 2 Full Years!\n\n7.   I showed you how to select an airline with the AMEX Business Platinum card & why I chose Southwest.\n\nYou’ll Need to Select an Airline for Your $200 Airline Fee Credit\n\n8.   I let you know about better sign-up bonuses on these Citi American Airlines cards.\n\n50,000 American Airlines Miles Is Enough to Fly to Europe Round-Trip During the Off-Peak Season.  So You Can Visit Beautiful Barcelona!\n\n9.   The Alaska Airlines and Virgin America merger was approved.  And we learned Virgin America points will convert to Alaska Airlines miles at a 1:1.3 ratio.\n\nAlaska Airlines Acquired Virgin America to Create the 5th Largest Airline in the US\n\n10.   Wondering how to use your Marriott or Starwood points?  Check out my posts about great Marriott & Starwood hotels in places like Italy, Tokyo, New York City, Miami Beach, New Orleans, Washington, DC, San Diego, San Francisco, Orlando, Chicago, Australia, and Barcelona.\n\nCatch the Sunset From One of the Private Pools at the Stunning St. Regis Bal Harbour Resort\n\nBonus:   I created a step-by-step guide to see which miles to collect based on your home airport.\n\nMiles & Points Can Seem Overwhelming at First!  So I Made a Guide to Show You How to Decide Which Miles & Points to Collect Based on Your Home Airport\n\nAnd I let you know about cheap flights across the US, a Delta award sale to Asia, and flights to Europe under $350.\n\nBe sure to follow me on Twitter and Facebook and never miss another deal!\n\n       \n\nRelated Stories\n\nYou Can Now Book Korean Air SkyTeam Partners Online!\n\n50,000 Mile Citi American Airlines Card Without 24 Month Restriction!\n\nDo You Know These Secret Ways To Book Cathay Pacific Award Flights?\n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1483288471",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.731220Z"
}