{
  "id": "dcffe0d9a2ed4d72bf2c99f620f2bbfe",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/citi-thankyou-premier-review/",
      "Title": "80,000-point bonus ending soon Citi Premier credit card review The Points Guy",
      "Selection": "Editor’s note: This post has been updated with new information. Citi is a TPG advertising partner. \n\nCiti Premier® Card overview\n\nThe Citi Premier® Card is an under-the-radar gem with a phenomenal range of bonus categories. While the card isn’t as strong on the redemption side as similar offerings from Chase or Amex, the ability to earn 3 points per dollar on air travel, hotels, gas stations, supermarkets and restaurants (including takeout) for just $95 a year is still a pretty great deal. Card rating*: ⭐⭐⭐⭐\n\n* Card rating is based on the opinion of TPG’s editors and is not influenced by the card issuer.\n\nFor the past few months, the Citi Premier® Card has been offering a best-ever bonus of 80,000 points after spending $4,000 on purchases in the first three months. That’s all coming to an end soon, though, so if you have been waiting to apply, now is the time to do so.\n\nBesides the intro bonus, there are plenty of reasons this card deserves a place in your wallet.\n\nFirst, the card is one of the best earners on everyday spending you can find. It accrues 3 points per dollar on air travel and hotels as well as at gas stations, restaurants and supermarket. Not bad for a card with a $95 annual fee.\n\nNot only that, but the points you earn with the Citi Premier are also among the most versatile rewards currencies out there, and worth 1.7 cents each by TPG valuations. That’s because Citi has improved the ThankYou Rewards program substantially over the years to compete with the likes of American Express Membership Rewards and Chase Ultimate Rewards. So the 80,000-point sign-up bonus is worth $1,360 by our estimates.\n\nThe Citi ThankYou program now boasts a total of 16 airline transfer partners, including standouts like Avianca LifeMiles and JetBlue TrueBlue. The program also recently added two new hotel partners, Wyndham Rewards and Choice Privileges.\n\nHere’s what else folks should know about this card and why you should apply now while the current welcome offer is still available.\n\nWant more credit card news and advice from TPG? Sign up for our daily newsletter.\n\nIn This Post\n\nWho is this card for?\n\n(Photo by John Gribben for The Points Guy)\n\nThe Citi Premier accrues bonus points on gas stations, dining at restaurants, supermarkets, air travel and hotel purchases — one of the most prolific set of bonus categories we’ve seen offered on any card.\n\nThanks to various airline transfer partners (plus the recent addition of Choice Privileges and Wyndham Rewards), Citi ThankYou Rewards can be useful for consumers who value flexibility when it comes time to redeem their points for all kinds of different travel needs. In short, this is a solid mid-level travel credit card and a good option for folks who want to avoid premium cards with hefty annual fees but still earn valuable transferable points.\n\nThe Citi Premier is also an excellent choice for people looking to diversify their points-earning strategy away from Chase Ultimate Rewards and Amex Membership Rewards. In fact, this card gets much more compelling for people who’ve already maxed out their 5/24 slots with Chase, mainly thanks to its robust sign-up bonus…while it lasts.\n\nYou could also consider pairing the Premier with the Citi Custom Cash℠ Card, a no-annual-fee cash-back card that earns rewards through the Citi ThankYou points program. You can leverage the Custom Cash’s rewards rate of up to 5% back on your top eligible spending category each billing cycle (on up to the first $500 spent each billing cycle), then 1% on everything else. Combine it with the Citi Premier’s excellent rewards rate for everyday and travel purchases, and you’ve got a powerful card duo that can help you accumulate a large stash of ThankYou points in no time.\n\nRelated: The best Citi credit cards of 2021\n\nSign-up bonus and annual fee\n\nThe Citi Premier is currently offering a record-high 80,000 bonus points after you spend $4,000 on purchases within the first three months of account opening. Citi uses a rather interesting rule to determine bonus eligibility, though.\n\nYou won’t be able to earn the bonus on the Citi Premier if you’ve opened or closed the Citi Rewards+® Card, Citi ThankYou® Preferred*, Citi Premier or Citi Prestige® Card* in the last 24 months. Most issuers count that time solely based on when you opened a card or received a bonus, but with Citi, your clock also resets if you close a card, so it’s all in the timing.\n\n*The Citi ThankYou Preferred and Citi Prestige are no longer available for new applicants. The information for the Citi Prestige has been collected independently by The Points Guy. The card details on this page have not been reviewed or provided by the card issuer.\n\nThere’s a $95 annual fee on the Citi Premier.\n\nRelated: The ultimate guide to credit card application restrictions\n\nPerks\n\nUse your World Elite Mastercard benefits to book a room at the InterContinental Fiji. (Photo by JT Genter/The Points Guy)\n\nMuch of the Citi Premier’s value proposition comes from the fact that it offers the ability to earn bonus points in a slew of categories without charging a hefty annual fee. As such, you shouldn’t expect an overwhelming number of perks, but there are several benefits of this card that can help you recoup your annual fee:\n\n$100 annual hotel credit: You’ll enjoy a $100 credit once per calendar year for single-stay hotel bookings of $500 or more (excluding taxes and fees) made through thankyou.com.\n\nExtended warranty protection: Adds an additional 24 months to a manufacturer’s warranty.\n\nDamage and theft protection: Repairs or replaces an item that’s damaged or stolen within 90 days of purchase (up to $10,000 per item and $50,000 per year).\n\nWorld Elite Mastercard benefits: As a World Elite Mastercard, the Citi Premier confers several travel-related perks that consumers might not know about. These include a $5 monthly Lyft credit after taking three rides in a calendar month and access to the Mastercard luxury hotels and resorts portfolio for on-property perks like complimentary breakfast and room upgrades upon availability. Through the World Elite Mastercard program, you’ll also enjoy perks such as cellphone protection and Global Emergency Services.\n\nCiti® Entertainment: This program gets cardholders special access to purchase tickets to thousands of events — ranging from concerts and sporting events to unique dining experiences and movie screenings — before the general public can buy them.\n\nEarning\n\nEarn 3 points per dollar when you book air travel. (Photo by Prostock-studio/Shutterstock)\n\nThe Citi Premier’s earning structure is one aspect where the card really shines. Cardholders earn 3 points per dollar on purchases in the following categories, with no caps or annual limits:\n\nAir travel.\n\nHotels.\n\nGas stations.\n\nSupermarkets.\n\nRestaurants (including takeout).\n\nThe card earns 1 point per dollar on all other purchases. These earning rates are among the most impressive of any travel rewards card, especially considering the Citi Premier’s affordable annual fee.\n\nRelated: The eight best credit cards with annual fees under $100\n\nRedeeming\n\nThe Citi Premier is also a top choice for travelers, thanks to its participation in the ThankYou Rewards program, which currently has 16 airline transfer partners and two hotel partners.\n\nAeromexico Club Premier.\n\nAir France-KLM Flying Blue.\n\nAvianca LifeMiles.\n\nCathay Pacific Asia Miles.\n\nChoice Privileges.\n\nEmirates Skywards.\n\nEtihad Guest.\n\nEVA Air Infinity MileageLands.\n\nInterMiles (formally known as JetPrivilege).\n\nJetBlue TrueBlue.\n\nMalaysia Airlines Enrich.\n\nQantas Frequent Flyer.\n\nQatar Airways Privilege Club.\n\nSingapore Airlines KrisFlyer.\n\nThai Royal Orchid Plus.\n\nTurkish Airlines Miles & Smiles.\n\nVirgin Atlantic Flying Club.\n\nWyndham Rewards.\n\nWhile you’ll notice that many of the frequent-flyer programs are those of international airlines, there are still some high-value (and easily redeemable) awards to be booked through them.\n\n(Photo by Zach Griff/The Points Guy)\n\nFor instance, you can score some cheap Delta awards by booking through Virgin Atlantic, leverage Air France-KLM Flying Blue miles for decent business-class award availability on those airlines and their SkyTeam partners, get some phenomenal deals on Star Alliance awards using Avianca LifeMiles, offset paid fares with JetBlue TrueBlue or even book inexpensive American Airlines business-class tickets using Etihad Guest miles.\n\nYou can also redeem your ThankYou Points for travel directly through the Citi portal at a rate of 1 cent each, but that’s well below TPG’s valuation of ThankYou points at 1.7 cents each, a number derived in part from Citi’s extensive list of transfer partners.\n\nRelated: The ultimate guide to Citi ThankYou Rewards\n\nWhich cards compete with the Citi Premier?\n\n(Photo by John Gribben for The Points Guy)\n\nThe Chase Sapphire Preferred Card, with an annual fee of $95, competes directly with the Citi Premier. While Chase’s transfer partners (including United MileagePlus and Southwest Rapid Rewards) might be more beneficial for many travelers, there are some overlaps, including Singapore KrisFlyer, Emirates Skywards, and Virgin Atlantic Flying Club.\n\nRight now, the Chase Sapphire Preferred has a sign-up bonus of 60,000 points after you spend $4,000 on purchases in the first three months from account opening. Though not the best we’ve seen, TPG values this sign-up bonus at $1,200 — which is worth $160 less than the Citi Premier’s sign-up bonus.\n\nOfficial application link: Chase Sapphire Preferred Card with a 60,000-point bonus.\n\n(Photo by Wyatt Smith/The Points Guy)\n\nAnother direct competitor is the Capital One Venture Rewards Credit Card. It, too, charges a $95 annual fee, but this card comes with a less lucrative (but much simpler) earning rate of 2 miles per dollar on all purchases. Instead of an annual hotel credit, you’ll get an up to a $100 Global Entry or TSA PreCheck application credit once every four years with the Venture. You’ll even get two annual lounge visits per year to Capital One’s nascent network of airport lounges.\n\nCapital One miles transfer to 14 airlines and three hotel partner programs, mostly at a 1:1 ratio. Just note that the Capital One rewards program lost JetBlue as a partner this year and Choice Privileges transfers are not yet available.\n\nThe Venture’s sign-up bonus is also worth considering, offering the chance to earn 60,000 bonus miles after you spend $3,000 on purchases within the first three months of account opening. TPG values this sign-up bonus at $1,110 (not provided by the issuer).\n\nOfficial application link: Capital One Venture Rewards Credit Card with 60,000 bonus miles.\n\n(Photo by Isabelle Raphael/The Points Guy)\n\nFinally, one of the Citi Premier’s closest competitors over at American Express is the American Express® Gold Card, which earns 4 points per dollar at restaurants, 4 points per dollar at U.S. supermarkets on the first $25,000 in purchases per calendar year (then 1 per dollar), 3 points per dollar on flights booked directly with airlines or through Amex Travel and 1 point per dollar on other eligible purchases. It has points you can transfer to Membership Rewards’ 18 airline and three hotel partners.\n\nThe Amex Gold Card also comes with up to $10 in monthly dining credits at select restaurants (up to $120 in annual statement credits) and up to $10 in monthly U.S. Uber Cash (up to $120 annually), offsetting the majority of the $250 annual fee (see rates and fees). The card must be added in the Uber app to receive the Uber Cash benefit. Enrollment is required for select benefits.\n\nThe card has a current welcome offer of 60,000 points after spending $4,000 on purchases in the first six months of card membership.\n\nOfficial application link: American Express Gold Card with a 60,000-point offer.\n\nBottom line\n\nThanks to its long list of bonus categories and large sign-up bonus, the Citi Premier is one of the most lucrative points-earning cards in its price range. The solid and growing roster of ThankYou Rewards transfer partners also makes these points that much more compelling, especially for travelers who desire the flexibility to redeem points with various loyalty programs.\n\nOfficial application link: Citi Premier® Card with 80,000 bonus ThankYou points after $4,000 in spending in the first three months of account opening.\n\nAdditional reporting by Stella Shon and Eric Rosen.\n\nFor rates and fees of the Amex Gold Card, click here.\n\nFeatured photo by John Gribben for The Points Guy.\n",
      "Folder": "Feedly",
      "Timestamp": "1641709505",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.051481Z"
}