{
  "id": "dd3b13641b864af09f05515543525949",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2016/8/29/12688698/zero-audio-carbo-tenore-best-earphones-review",
      "Title": "Stop what you’re doing and buy these $38 earphones The Verge",
      "Selection": "Words fail me. I’ve seen — or, more accurately put, heard — the audio price-performance curve shattered into tiny little pieces and I’m still reeling from it. The Carbo Tenore earphones from Japan’s Zero Audio are astounding: they compete with the best earphones in the world, but cost a borderline illegal $38. Seriously, you could append an extra zero to their price and I’d still give them a glowing review. I’m just not sure I have the lexicon to explain how far out of the normal range of expectations these earphones are.\n\nThe Carbo Tenore land almost perfectly on the average price paid for a pair of headphones, which was $34 and rising in 2015. In that sub-$50 price range, you usually get some mix of compromised sound quality and iffy durability. The bass is either anemic, as on Apple’s EarPods, or exaggerated and distorted. And when the sound is good, as with Sennheiser’s $37 CX 300-IIs, the build quality is lacking. I’ve owned three pairs of CX 300s in my time and each one of them broke down within six months of purchase. Life on a tight budget is usually hard.\n\nZero Audio upends all of my preconceptions with the Carbo Tenore, which are tiny, beautiful, and sound monstrously good. Take any metric of sonic performance and the Carbo Tenore excel: the soundstage is wide and deep, detail retrieval is excellent, and the sound balance is basically perfect. The Tenores’ treble is never harsh, the mids are clear and present, but the star of the show here is the bass, which is simply mind-boggling. I’m talking quality and definition more so than quantity, though it is indeed plentiful. Having a bass boost is a good thing for headphones intended to be used on the move, as external noise tends to quieten the low end — which is why I consider Zero Audio’s tuning so on point. Plus, more bass is just more fun.\n\nPrincely performance at a plebeian price\n\nEverything I know about the physics of acoustics tells me that earphones of this size should not be able to extend down into the sub-bass region with the ease and grace that the Tenores exhibit. They just wow with their low end, no matter if you’re listening to Nine Inch Nails’ synthetic oeuvres or Renaud Garcia-Fons strumming an actual bass. More than once, I’ve been casually walking along and gotten walloped by this perfect low thump out of the Tenores and wondered where the hell it came from. These headphones use a teeny 5.78mm speaker in a world where the standard size is 9mm for regular earphones (or multi-speaker architectures when you get up into higher prices). The best part about the Tenores’ sound, though, is that there’s no downside to their bass bump: it’s so well controlled that it never bleeds over into disrupting the mids or making other parts of a recording sound veiled or recessed.\n\nNero’s \"Crush On You\" is a great track to show off the Carbo Tenores’ strengths. It opens with high-pitched female vocals — which can sound piercing elsewhere but are nicely reined in here — before diving into a series of satisfying bass drops. The Tenores have the resolution and composure of an audiophile headphone, but they retain the low-end bite that more expensive models often lack. It’s literally the best of both worlds, and it makes zero sense to me that this formidable combo is priced like it is.\n\nThe sound is silky and easygoing, but never sloppy\n\nAs if sounding sublime isn’t enough, Zero Audio’s also outfitted the Carbo Tenore in a composite carbon and aluminum housing. These are among the smallest and lightest earphones, and even their 3.5mm connector, angled at 90 degrees, is as thin and minuscule as possible. It’s like they’re barely even there. Like the Sennheisers, however, the Carbo Tenore have very thin cables and not much of a supporting stem at the base of each earphone, so I’m not as confident about their longevity as I am about their sound.\n\nLast week I wrote about the paramountcy of fit when picking in-ear headphones, and the Carbo Tenore shine in this respect too. With their lightness and comfortable silicone tips, finding a good fit is no problem at all (I never needed to switch away from the pre-installed medium tips). What’s more, because they’re so insubstantial, the Tenores essentially disappear into the ear and can be used while lying on one side in bed. That’s a feature touted by the $279 q-jays and the $549 Klipsch X20is, both of which I’ve tested extensively and never found to be anywhere near as engaging or downright joyous to listen to as the Tenore. Of course, these pricier options come with added extras like in-line microphones and controls, removable cables, and (perhaps) a more durable build. I suspect the Klipsch also probably has lower measurable distortion than the Tenore too, but when the price differential is so vast, that’s the least it can do.\n\nThis combo of size, comfort, performance, and price just doesn't make sense\n\nBudget earphones have been improving nicely in recent times, with HTC and LG bundling high-quality buds with their smartphones and Xiaomi’s $25 Pistons receiving rave reviews. I haven’t heard the Pistons myself, because I’ve been too busy testing opulent $1,600 options from the likes of Noble Audio and Ultimate Ears, and I’m telling you that it’s those super-expensive headphones that the Carbo Tenore should be compared to. The Zero Audio earphones are not merely good for their low price, they are excellent by anyone’s standards.\n\nPersonally, I’d take the Carbo Tenore over any other non-custom set of earphones. These are the best sub-$50, best sub-$100, best sub-$200 headphones out there, of any kind. And once your budget hits $300, they’re tied with the Beoplay H6 over-ear cans for the best and most fun sound you can get for your money. It’s only at $349, with the extraordinarily articulate and detailed Etymotic ER4SR, that I could find myself considering something else. But think about how ridiculous a thing that is to say: the Carbo Tenore are only rivaled by models ten times their cost.\n\nThe Zero Audio Carbo Tenore’s combination of size, comfort, performance, and price is simply unrivaled. I don’t know what black magic it took to create them, or how their maker can possibly hope to sell more expensive models, but that’s all beside the point. With everything taken into account, these might be the greatest earphones ever made.\n",
      "Folder": "Feedly",
      "Timestamp": "1472499991",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.720019Z"
}