{
  "id": "dd5570fb3b6f4fa6b0d942bcde78ffde",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://blog.google/outreach-initiatives/arts-culture/unravel-symbols-ancient-egypt/",
      "Title": "Unravel the symbols of ancient Egypt The Official Google Blog",
      "Selection": "Today marks the anniversary of the discovery of the Rosetta Stone, the tool that first unlocked the mystery of ancient Egyptian hieroglyphs. Ancient Egyptians used this writing system more than 4000 years ago to record their stories, but only a select group knew how to read and write them. \n\nBut today, thanks to the new Google Arts & Culture tool Fabricius, anyone can interactively discover this fascinating language by means of three dedicated gateways: First, you can “Learn” about the language of ancient Egypt by following a short educational introduction in six easy steps. Secondly, Fabricius invites you to “Play” and translate your own words and messages into hieroglyphics ready to be shared with your friends and family.\n\nPlay_Send a message.gif\n\nAn easy way to write your own messages in Egyptian hieroglyphics to share with your friends (Not academically correct, just for fun!).\n\nWork_Autoclassify.gif\n\nA desktop-only set of tools using Cloud ML to support experts in their workflow of deciphering Egyptian hieroglyphs.\n\nLearn_Gif_stage.gif\n\nSix interactive steps to introduce you to Egyptian hieroglyphs.\n\nAnd while Fabricius is your doorway to learn about and write in hieroglyphs, it thirdly offers new avenues for academic research, too. So far, experts had to dig manually through books upon books to translate and decipher the ancient language--a process that has remained virtually unchanged for over a century. Fabricius includes the first digital tool - that is also being released as open source to support further developments in the study of ancient languages - that decodes Egyptian hieroglyphs built on machine learning. Specifically, Google Cloud's AutoMLtechnology, AutoML Vision, was used to create a machine learning model that is able to make sense of what a hieroglyph is. In the past you would need a team of Data Scientists, a lot of code, and plenty of time, now AutoML Vision allows developers to easily train a machine to recognize all kinds of objects.\n\nKing Tut from LIFE collection.jpg\n\nThe famous King Tutankhamun discovered in the early 20th century by Howard Carter.\n\nImage of hieroglyphs from British Museum collection.jpg\n\nColorful hieroglyphs found on the decorated coffin of Djedhoriufankh from 1000-900 BC on display at the British Museum.\n\nRosetta Stone from British Museem collection.jpg\n\nThe Rosetta Stone is an important key to the decipherment of Egyptian hieroglyphs because the same inscription is written in three languages: hieroglyphs, Egyptian demotic script, and Greek.\n\nAvailable in English and Arabic, Fabricius is named after the father of epigraphy, the study of ancient inscriptions. We created it in collaboration with the Australian Center for Egyptology at Macquarie University, Psycle Interactive, Ubisoft and Egyptologists from around the globe. \n\nYou can also explore more stories about the wonders of ancient Egypt, including the famous King Tutankhamun, the Pyramids of Giza and the Book of the Dead. And if you’re a teacher using Google Classroom, we’ve created resources on ancient Egypt for you to use, too.\n\nExplore more stories about ancient Egypt by downloading the free Google Arts & Culture app, or visit the Google Arts & Culture website.\n",
      "Folder": "Feedly",
      "Timestamp": "1594789606",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.290042Z"
}