{
  "id": "dd9c4b116b0c4b639a5ad409c6ad8224",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1522088/chart-why-china-is-so-desperate-to-protect-its-industries/",
      "Title": "This chart shows why China is so desperate to protect its industries Quartz",
      "Selection": "Last year, the slowdown that China had staved off for years finally hit—just as Donald Trump began pummeling the country with tariffs. Beijing and the White House are now negotiating a trade war truce. What’s remarkable, though, is that China hasn’t yet cried uncle and reversed the practices Trump condemns—most notably, its industrial policies that support domestic companies.\n\nThough there are some reports that China will put on hold its Made in China 2025 program (paywall), one of Trump’s biggest bugbears, moves to scrap its industrial policies are likely to be limited to symbolism. Here’s one illustration of why.\n\nThis chart comes from a recent analysis by the Federal Reserve Bank of San Francisco that recalculates how much US consumers really spend on imports once you subtract the dollars spent locally to sell the good—for instance, the cost of trucking, rent, and workers’ wages.\n\nIf you look at the headline data, in 2017, about 11% of what American households spent went toward imported goods. But that “Made in China” or “Made in Mexico” label is deceptive. Only some of the final price that American consumers pay goes to the country where the good is actually made. A fair chunk gets pocketed by US companies and workers.\n\nFor instance, the authors cite a 2014 study that found that an Asian factory that assembles a $100 pair of Nike sneakers earns only around $25. The container shipping company pockets $3.50, while Nike collects $22 for licensing and other intellectual property. And a whopping $50 goes to the US retailer, defraying costs of rent, insurance, trucking, warehousing, and the wages of salespeople.\n\nThe proportions in the Nike analogy aren’t representative. Overall, it turns out that for every $7 US consumers spent on imported goods, about $3 stayed in America, according to the analysis. But that breakdown varies a lot by country. As you can see in the chart above, nearly 62% of the value of Japanese goods went back overseas (presumably, mostly back to Japan). That compares with only 44% for goods made in China.\n\nIn other words, Chinese companies are losing out on a much higher share of sales than Japanese firms are. To close this gap, China needs to make goods of higher value, competing on quality rather than on the low-margin, labor-intensive mass production work that powered its growth in the 1990s and 2000s.\n\nWhether Chinese people’s living standards continue to improve depends heavily on this process of “moving up the value chain.” In turn, to pull this shift off, China must boost its skills base, build well-managed firms, and pioneer in new technologies. Its industrial policies channel resources toward doing all that. Which means that to get China to ditch said policies, Trump will probably have to wage a much uglier trade war than anything we’ve seen yet.\n",
      "Folder": "Feedly",
      "Timestamp": "1547341520",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.434648Z"
}