{
  "id": "df3ebcaebb3f4711a57632d23bb55111",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.getrichslowly.org/blog/2017/10/19/side-hustles/",
      "Title": "Side Hustles The Good, the Bad, and the Ugly Get Rich Slowly",
      "Selection": "In my spare time recently (which isn’t much), I’ve been reading Side Hustle, the new book from my friend Chris Guillebeau. Because CG is a friend, I’m not sure I can provide an objective review of the book, so I’m not going to try. Instead, I’ll give a brief summary and then share some of my own experiences earning money on the side.\n\nSide Hustle Nation\n\nFundamentally, there are only two ways to improve your financial situation: You can earn more or you can spend less. Most money writers focus on the “spend less” side of the equation. That’s great, but there’s only so much you can cut. Eventually, if you really want to pursue your goals with passion, you’re going to have to earn more. “More income means more options,” Guillebeau writes. “More options mean more freedom.”\n\nFor many folks, a side hustle is a smart way to earn more. A side hustle, Guillebeau says, is “a moneymaking project you start on the side, usually while still working a day job. In other words, it’s a way to create additional income without taking on the risks of going full throttle into the world of working for yourself.”\n\nThe beauty of side hustles is that they can be started with little or no money. They’re most often passion projects, ways for a person to take something they already love and maybe earn a bit of extra cash.\n\nGuillebeau says there are five core steps to starting a side hustle:\n\nBuild an arsenal of ideas. The first step is to brainstorm a list of ways that you could earn money in your spare time. How could you match your skills and resources to a product or service that people would pay for? List as many as you can think of, then weigh the pros and cons of each.\n\nSelect your best idea. You can’t do everything, of course, so you’re going to have to narrow your list to the single best idea — the one that excites you the most. “You’re not making a lifelong decision,” Guillebeau writes. “You’re looking for the right idea at the right time.” After you’ve picked a project, do some research. Learn how other people have done the same thing. Figure out who your ideal customer is. Decide what it is you’re going to sell.\n\nPrepare for liftoff. After you’ve chosen your product or service, it’s time to prepare for launch. Figure out the core logistics issues. Set a price. Create your workflow. Don’t worry about getting everything perfect, but do take the time to master the basics of your business.\n\nLaunch before you’re ready. This is a lesson I’ve had to learn the hard way. There is always more to be done before you start a big project. (Heck, I wasn’t ready to re-launch Get Rich Slowly last Sunday, but I did so anyhow.) When you have your logistics, workflow, and pricing roughly right, then go. Start your hustle.\n\nRegroup and refine. Naturally, not everything will be perfect — especially since you launched before you were ready. As you sell, as you interact with customers, learn from your experience. Enhance what is working, and discard what isn’t. If there are things you can’t handle, ask for help. If a process can be automated, automate it. Adjust pricing, if necessary.\n\nBut the most important ingredient to starting a successful side hustle is action. If you don’t take action, nothing else matters.\n\nObviously, there’s much more to the book than that, but those are the core concepts. If you’ve considered making money with a side project, Side Hustle is a book filled with ideas and info that can help you start earning money in your spare time.\n\nIf you’re less into books and more into podcasts, check out Guillebeau’s daily Side Hustle School, which profiles casual entrepreneurs from all walks of life. (You might also enjoy Nick Loper’s Side Hustle Nation.)\n\nLike Father, Like Son\n\nAs I read the Side Hustle, my mind drifted to my own side hustles, and to those of family and friends.\n\nAs I’ve mentioned many times before, my father was a serial entrepreneur. He was always starting businesses. Even when he worked for other people — selling staples, selling industrial supplies, selling boxes — he had something brewing on the side.\n\nWhen I was very young, for instance, he decided he wanted to get in on the health food craze of the mid-1970s. In his spare time, he built a wheat grinder. After showing his prototype around, he decided to make and sell them to health food stores around Oregon. This side gig blossomed into an actual business, and within a few years Harvest Mills was also building and selling food dehydrators.\n\nLater, after Dad had sold Harvest Mills and returned to sales, he dabbled in lots of other things.\n\nHe sold World’s Finest Chocolate door to door.\n\nHe tried to write and sell accounting software for Apple II computers.\n\nHe tried to grow and sell nursery stock.\n\nNone of these ventures was particularly successful. But eventually he started Custom Box Service, which still supports our family today.\n\nWith a dad like mine, it’s no wonder that I grew up wanting to run businesses of my own. In grade school, I would repackage my duplicate Star Wars and sports cards to sell to other kids in class. When I finished reading my Hardy Boys books, I’d sell those too. My friends and I drew comics to sell in the school store. (True story: Several years before the Teenage Mutant Ninja Turtles were created, one of my own comics was about a team of super-hero turtles!)\n\nAs an adult, I pursued side projects too. While working at the box factory, I took computer programming classes. Then I got a job (a couple of jobs, actually) programming at a local college. At one time, I was working three jobs totalling 60+ hours per week! I earned some good money with my side hustles — but I spent it all on stupid stuff. (I hadn’t yet become a money boss, hadn’t discovered how to get rich slowly.)\n\nFrom there, I moved on to computer consulting. I repaired computers for family and friends, and I helped set up their networks. This in turn led to building websites — including this website, Get Rich Slowly.\n\nThat’s right: Get Rich Slowly started as a side hustle. It was a way for me to earn some extra cash, money I could use to dig out of debt.\n\nAnd that’s the thing about side hustles. While most never amount to much, some turn into something bigger. Sometimes a passion project turns into something huge.\n\nSide Gigs Aren’t Always Awesome\n\nAs much as this stuff is in my blood, I don’t want to pretend that side hustles always work out. They don’t.\n\nMy computer consulting gig, for instance, never amounted to much. Sure, I made a few thousand dollars from it, but it took tons of time. The money was never worth my while. And of the many businesses my father started in his spare time, only two ever really made money. (Still, two out of ten isn’t bad, right?)\n\nMore recently, my girlfriend Kim tried a side gig that didn’t turn out. While working her day job as a dental hygienist, she set up an online store during her evenings and weekends. She sold teething necklaces. People liked the necklaces, and she sold several hundred, but ultimately she found she wasn’t making money. She was only breaking even. After two years, she decided to pull the plug. (Kim doesn’t regret the experience; it just wasn’t profitable.)\n\nI know other folks who have tried side hustles with varying degrees of success. I have a friend who makes and sells grapeseed oil. I know several people who dabble in rental properties. I know a woman who designs websites in her spare time. I’ve met several folks who write books and/or articles to make extra money. Some folks earn tons from their projects; others only make enough to keep to barely keep the business going.\n\nUltimately, though, I think side hustles are mostly awesome. Even if they don’t bring in big bucks, they give you experience with entrepreneurship. They teach you to be proactive and self-directed. And many times they do help you to supplement your income.\n\nWhat about you? Have you ever pursued a side hustle? How did it turn out? What would you do differently if you had to do it again? Would you recommend that others start their own side gigs? What advice can you offer?\n\nThe post Side Hustles: The Good, the Bad, and the Ugly appeared first on Get Rich Slowly.",
      "Folder": "Feedly",
      "Timestamp": "1508549739",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.536190Z"
}