{
  "id": "df7f75bbbb7e45a2861c6e175c6c237f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/science-and-health/2017/4/14/15178528/s-town-podcast-mercury",
      "Title": "The science behind S-Town’s mercury poisoning mystery Vox - All",
      "Selection": "S-Town spoiler alert: This story discusses key details from the popular S-Town podcast, including the ending. Do not read any further if you don’t want to know what happens.\n\nWhat could antique clocks, burnished gold, top hats, and silver mercury possibly have in common? They’ve all been linked to mad hatter disease, or mercury poisoning, a syndrome made famous by 1865’s Alice’s Adventures in Wonderland and more recently by the popular new podcast S-Town. \n\nIn S-Town’s final episode, we learn that the podcast’s protagonist, John B. McLemore, might have had this obscure affliction, and that if so, it might have dramatically affected his mental health and his decision to take his own life.\n\nMad hatters and furs\n\nDoctors first identified mad hatter disease among 19th-century milliners, or hatmakers, when many of them began to display bizarre symptoms after years in the business. \n\nTo make top hats and other hats from animal skins they transformed into felt, milliners had to separate the animal skin from its fur and then mat the fur together. This process — called “carroting,” because it involved mercury nitrate, an orange mixture of mercury and nitric acid — meant boiling and drying the fur. And that generated toxic mercury vapors. \n\n        Beaver fur hats were common in the 1800s.Wikimedia Commons\n\nWhile this process was efficient, it was extremely dangerous, according to NYU environmental health professor Jack Caravanos. Many hatmakers got erethism, a form of chronic neurological mercury poisoning, which presented a range of symptoms including tremors, nervousness, and insomnia. \n\nWith erethism, “[t]here may be an insidious change in mood to shyness, withdrawal, and depression along with explosive anger or blushing,” writes Dr. Michael Kosnett of the Colorado School of Public Health in a book on clinical pharmacology. These symptoms led to a reputation of “madness” among hatmakers, and the expression “mad as a hatter” probably grew from there (though its etymology is disputed).\n\nBy the 1880s, the adverse health effects of using mercury for hatmaking were known in France, Britain, and the United States. Though alternative options, like a hydrochloride-based felting process, were introduced by then, it took a while for the mercury trend to retire. \n\nFrance and England had stopped using mercury to make hats around the turn of the 20th century. But it wasn’t until later in the 1900s that the practice faded in the US; the United States Public Health Service officially banned the use of mercury nitrate in 1941.\n\nWhy mercury is so poisonous\n\nScientists have learned a lot about mercury and its effects on the body over the years. The heavy metal comes in several different forms, and exposure at high levels to any of these can lead to various degrees of poisoning:\n\nElemental mercury is liquid and silvery at room temperature — the stuff in thermometers and dental amalgam fillings. It’s also used in small-batch gold processing and fire gilding. Exposure happens through inhaling fumes.\n\nInorganic mercury occurs when mercury is combined with other elements, often to form salts. It’s been used in a range of products ranging from preservatives to cosmetics to herbal supplements, and can harm the digestive tract and kidneys if ingested.\n\nMethylmercury, an organic mercury compound formed when mercury combines with carbon, is what accumulates in some of the fish species we eat, like tuna and swordfish. Fish get mercury through the food chain and water containing mercury pollution from coal plants and waste incineration. (It’s only a risk for pregnant women and small children; more on that here.)\n\nInhaling elemental mercury, as the milliners did, causes the body to respond in “myriad different ways,” according to Kosnett. Mercury affects the function of proteins and enzymes in the brain and the kidneys, which causes some of the symptoms listed above. \n\nWhen it comes to how much mercury exposure is too much, it all depends on the rate at which you’re exposed, which chemical form you’re encountering, and your own body. But “whether it’s a little every day or a lot in one day, it’s damage,” says NYU environmental health professor Jack Caravanos, a mercury expert featured on S-Town. “It’s a cumulative toxin.” And there is no treatment.\n\nMad hatter disease in S-Town\n\nThe symptoms above will sound pretty familiar if you’ve heard the story of John McLemore, the protagonist of S-Town. Vox’s Aja Romano sums him up aptly in her review of the podcast:\n\nJohn is all of the following: a queer liberal conspiracist who socializes with neighborhood racists; a manic depressive consumed by predictions of cataclysmic global catastrophe; an off-the-grid hoarder of gold who takes in stray dogs; a genius with a photographic memory who’s spent his whole life caring for his mother while designing a massive and elaborate hedge maze in his backyard; and one of the most skilled antique clock restorers in the world.\n\nBut it’s his unique skill as an antique clock restorer and his depression that come to a head in the final episode. John often finished restoring clocks (like the one pictured below) with a process called fire gilding, which embellishes clocks with gold decoration. In fire gilding, gold is melted into mercury, the mixture is brushed onto a surface, and then the mercury is evaporated with heat. As with carroting, a person practicing fire gilding (without proper safety equipment) could inhale those toxic mercury fumes. \n\nJohn performed fire gilding throughout his life, starting at or before he got to college, according to one of his professors. And John’s friends remember him fire gilding for most of his remaining 57 years. One friend said John told him he was doing it “dozens of times a year.” \n\n“I do not have a definitive answer as to whether or not John had mercury poisoning  and if that could have been a force behind some of his behavior, his personality, and even his suicide,” says S-Town creator Brian Reed.\n\nBut Reed makes a strong case that mercury poisoning from fire gilding could have contributed to John’s neurological symptoms, and his physical ones. In addition to insomnia and depression, John told Reed he occasionally experienced spontaneous vomiting, and his autopsy showed an enlarged brain and congestion in the lungs, which mercury experts told Reed is consistent with poisoning from the toxin. Plus, John admitted to friends he thought he was having health problems due to fire gilding or chemicals. \n\nIt’s impossible to know how much mercury might have been in John’s body, though, and the current owners of his property won’t consent to a test of his workshop for residue. \n\nBut some mercury experts say there’s a strong possibility he was poisoned. “He was doing it for years, so the quantity of mercury in his workshop must have been unbelievable,” Caravanos of NYU told me. “So that’s why his health effects, I think, are completely plausible.” \n\nEven if John were still alive, there’s no test a neurologist can do to for mercury poisoning, says Caravanos. And tragically, once you’re poisoned, “there’s no real treatment,” he adds, since “your nerves are already damaged.”\n\nMercury poisoning today: artisanal gold mining\n\n        A miner in Indonesia pans for gold in Timika, Papua Province, Indonesia.Photo by Ulet Ifansasti/Getty Images\n\nMercury poisoning from elemental mercury is rare today in developed countries, mostly because health and safety regulations and practices have evolved such that hardly anyone is exposed to dangerous levels. But among gold miners in Indonesia, Peru, and a few other developing countries, mercury poisoning from artisanal gold processing is still prevalent, says Caravanos.\n\nThe price of gold has risen dramatically over the past 10 years, which, according to Caravanos, means that more small-scale gold miners in developing communities, mostly in Indonesia, Peru, and Brazil, are using mercury to extract gold in their homes. Families will mine rock that has very tiny amounts of gold ore inside it, crush the rock, and then mix in mercury, which has a strong affinity for gold, to extract the precious metal. \n\nWhen they reheat the mercury amalgam — “a pea-shaped nugget of silvery material” — to reduce the mixture back to pure gold, “it’s exactly what John was being exposed to,” Caravanos says. “It’s vaporous mercury. So you have inhalation, and stuff spreads around the community and soil, and into people’s houses.”\n\nPart of the reason these miners continue to use mercury is because they’re unaware of the risks — and because mercury doesn’t hurt right away. “Mercury has no acute health effects,” says Caravanos, “so these people don’t know they’re being poisoned.” \n\nCaravanos and his Pure Earth nonprofit are teaching these small-scale miners how to use other techniques to extract gold from rocks, mainly using methods that allow for the very heavy gold ore to separate out from the materials surrounding it, instead of using mercury to draw it out. Switching people over to this process is tough, though, because it’s so much quicker and easier to use mercury. And even though technically mercury has been banned in many of these countries, the bans aren’t yet very effective. \n",
      "Folder": "Feedly",
      "Timestamp": "1492204854",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.611860Z"
}