{
  "id": "e0ec584771f64d479cb3cabddaea3d44",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://thepointsguy.com/2016/12/skip-bali-for-the-gili-islands/",
      "Title": "Why You Should Skip Bali for This Indonesian Paradise The Points Guy",
      "Selection": "Bali, Indonesia, is all the rage, with more than three million visitors flocking to the gorgeous island each year. But that’s precisely the problem. Thanks to books like Eat, Pray, Love, a growth in fancy yoga retreats and luxe resorts and a new, relaxed visa policy, Bali isn’t the sleepy Indonesian beach-bum town it used to be. Hordes of tourists and expensive hotels and restaurants have since sullied the island’s charm.\n\nSo forget Bali, but don’t give up your dream of a Indonesian dream vacation. If you’re looking for an off-the-beaten-path adventure that’s cheaper and more authentic yet still includes amazing diving, snorkeling and deserted sandy beaches, the Gili Islands are where it’s at.\n\nComprised of three small Indonesian islands located off the northwest coast of Lombok, the Gili Islands are Gili Meno, Gili Air and Gili Trawangan. Gili Meno is the tranquil island, perfect for a restful vacation full of peaceful sunsets and fruit smoothies, or for honeymooners looking for lots of romantic, deserted beaches. Gili Air has the largest local population and is a fun mix of calm shores and happening beach bars — having both more infrastructure and a calm environment makes this island nice for families and couples. Gili Trawangan is great for groups of friends or solo travelers wanting to party it up, with beach clubs pumping music until the wee hours of the morning.\n\nUpon stepping onto the white sandy shores of the Gili Islands, I knew I was in for a special experience. You’ll feel the same way, I’m sure. Here’s why you should head there.\n\nThe crystal-clear waters of Gili Meno. Image courtesy of the author.\nBikes and Horse Carts Are Used Instead of Cars \n\nThere’s something truly wonderful about the idea of having no cars around — you never really realize how smelly and noisy motor vehicles are until they’re gone and you can wander about freely in peace, without having to look both ways before crossing the street, or, in Gili, the sandy pathways.\n\n“No Cars Go” could be the Gili Islands theme song. Image courtesy of the author.\nThe no-car rule makes the islands feel quaint and tranquil, allowing travelers to truly escape. As the islands are fairly small, you can move around on foot — bike rentals are widely available, too. (Prepare to jump off your bike and walk when the pathways get too sandy, though.) For those worried about carrying heavy luggage, there are horse carts available, ready to take you from the docks to the various hotels and bungalows around the island.\n\nBike rentals should cost you between $3 and $6 per day per bike. Image courtesy of the author.\nAll Three Islands Are Super-Affordable\n\nWhereas Bali is slowly becoming a leader in luxury travel, the Gili Islands remain inexpensive — an air-conditioned inland bungalow with a private bathroom and Wi-Fi, for instance, can cost you as little as $20 per night. More luxurious hotels are also widely available, but still at a fairly reasonable price, and backpackers can easily find plenty of cheap shared dorm options. Beachfront dining can cost as little as a few dollars per meal if you stick to the local cuisine, like nasi goreng (fried rice, typically served with chicken). Western food, finer dining and fresh seafood are all available and affordable — even a splurge on a feast won’t break your budget on these islands. Activities are also pretty cheap, and an afternoon of scuba diving — including all equipment, monitors and boat rides — generally run about $45. Whether you want to travel like a backpacker, a king or anyone in between, the Gilis have got you covered.\n\nYou Can Truly Go off the Grid\n\nMany locals still reside on the Gilis and the interior of the islands are quite rural, so don’t be surprised to see roaming chickens and goats, wooden bungalow homestays and makeshift restaurants dotting the sandy roads. You may hear strains of Arabic now and then because Indonesia is an Islamic country where the locals pray several times a day. The people living here are friendly, open to tourists and enjoy sharing their tranquil way of life with visitors. Though Wi-Fi is widely available, you may find yourself letting go of life’s modern comforts and just enjoying the simple way of life the Gilis are known for. There are unique surprises around the islands to discover for yourself, like a small inland saltwater lake on Gili Meno, one of the best spots in the world to enjoy a sunset.\n\nA breathtaking sunset over the inland lake on Gili Meno. Image courtesy of the author.\nThey’re Home to Stunning Beaches and Great Snorkeling\n\nEven during the high season, the beaches of the Gili Islands are still blissfully empty, featuring pristine, white sands and clear, turquoise waters. Of course, if you prefer beaches with all the amenities, there are plenty of spots with beachfront dining, lounge chairs, beanbags, kayaks and paddle-board rentals, among other activities.\n\nWhite sands, clear waters and virtually no one on the beach! Image courtesy of the author.\nCruising the island by bike can help you find the perfect beach, as there are many small beach bars with hammocks strung up and reggae on the radio just waiting for you to stop and enjoy a fresh fruit smoothie or cold beer.\n\nMost beach bars will also rent you snorkel gear — the Gili Islands may be one of the few places you can see giant hawksbill turtles so close to the shore. Snorkel day trips are also available from boats that take you to various spots around the islands. (It’s the perfect place to get your PADI certification, too.) Check out Blue Marlin Dive, which has locations on all three islands. Hopefully you’ll spot a reef shark or a giant sunfish, as both species can be found in the Gili waters.\n\nA sea turtle shows off for divers in the Gili Islands. Image courtesy of Jorge Ortega Villanueva.\nNewsflash: You Can Still Do Bali\n\nIf you are still dying to visit Bali, you can travel by boat to the Gilis from there, allowing you to visit both places. The public ferry boat takes about five hours and is the cheapest option, but you can also fly between Bali and Lombok on Lion Air and Wings Air, then take the ferry.\n\nTo get to the Gili Islands via Lombok, hop a flight on AirAsia from Kuala Lumpur, a SilkAir flight from Singapore or a Garuda Indonesia (a SkyTeam alliance member) flight from Jakarta. Once in Lombok, you have several options for public ferries and private speedboats at a variety of prices. The trip takes about 15 minutes from Lombok, so if you prefer a shorter boat ride, this is the ideal option. Plus, Lombok is a lovely island to explore, with plenty of beaches, great surfing and the famous Mount Rinjani volcano. It also tends to have fewer tourists than Bali.\n\nA charted speedboat from Lombok to the Gili Islands cost me about $35 one way for a 15-minute ride. Image courtesy of the author.\nThere are also plenty of options to use points and miles to get to an Asian hub like Kuala Lumpur, Singapore or Jakarta. Although Garuda Indonesia doesn’t yet operate flights to the US, the carrier does fly to Asia from Europe, and is a ThankYou Rewards transfer member, as are Singapore Airlines, Cathay Pacific and EVA Air.\n\nHave you been to the Gili Islands? Tell us about your experience below.\n\nFeatured image by the author.\n\nChase Sapphire Preferred® Card\n\nAPPLY NOW\n\nEarn 50,000 bonus points after you spend $4,000 on purchases in the first 3 months from account opening. That's $625 toward travel when you redeem through Chase Ultimate Rewards®\n\nNamed Best Credit Card for Flexible Travel Redemption - Kiplinger's Personal Finance, July 2016\n\n2X points on travel and dining at restaurants worldwide & 1 point per dollar spent on all other purchases.\n\nEarn 5,000 bonus points after you add the first authorized user and make a purchase in the first 3 months from account opening\n\nNo foreign transaction fees\n\n1:1 point transfer to leading airline and hotel loyalty programs\n\nGet 25% more value when you redeem for airfare, hotels, car rentals and cruises through Chase Ultimate Rewards. For example, 50,000 points are worth $625 toward travel\n\nNo blackout dates or travel restrictions - as long as there's a seat on the flight, you can book it through Chase Ultimate Rewards\n\nIntro APR\n\nRegular APR\n\nAnnual Fee\n\nForeign Transaction Fee\n\nCredit Rating\n\nN/A\n\n16.24%-23.24% Variable \n\nIntroductory Annual Fee of $0 the first year, then $95\n\n0%\n\nExcellent Credit\n",
      "Folder": "Feedly",
      "Timestamp": "1482038713",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.679126Z"
}