{
  "id": "e50f50a42ba4434f816f7bb707b27ebe",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/news/alila-ventana-big-sur-goes-all-inclusive/",
      "Title": "Alila Ventana Big Sur goes all-inclusive The Points Guy",
      "Selection": "When it comes to hotel chains, we can all agree on one thing: Hyatt does all-inclusive right. Whether it’s the family-friendly Ziva properties, adult-only Zilara or high-end Miraval resorts, Hyatt takes the all-inclusive experience up a notch with great food and on-site entertainment options. Recently, Hyatt has added another great property to its all-inclusive portfolio: The Alila Ventana Big Sur, reports One Mile at a Time.\n\nFor more TPG news delivered each morning to your inbox, sign up for our daily newsletter.\n\nBixby Bridge, Big Sur. (Photo by Dave Lastovskiy via Unsplash)\n\nThis hotel has been part of the World of Hyatt program since 2019 and bookable for 30,000 points per night. The property has been closed since March due to the COVID-19 crisis but is set to reopen on July 15, 2020. When it does, the nightly rate (including award redemptions) will include meals, snacks, select activities and chauffeur service within a three-mile radius. Here’s a complete list of what’s included:\n\nDining in-room (all meals), poolside (lunch), or at The Sur House (breakfast and dinner) — which has a new seating plan and is reserved exclusively for resort guests.\n\nSnacks to take on outings, along with complimentary reusable water bottles.\n\nAccess to the resort’s Signature Experiences such as yoga, meditation, Tai Chi, and daily hikes.\n\nThe Ventana Big Sur picnic program.\n\nAccess to indoor and outdoor fitness studios.\n\nChauffeur service within a three-mile radius.\n\nAccess to private, reservation-only indoor and outdoor wellness studios.\n\nThe Excursion Outpost, which offers complimentary items for use on picnics, hikes, etc.\n\nNew outdoor lounging across the grounds.\n\nThis is a pretty generous list of offerings, especially considering how expensive staying at this property can be. Room rates regularly go for over $1,000 per night, while the award redemption rate is 30,000 points per night. Not having to worry about paying for meals and activities beyond that is even more of an incentive to stay at this resort.\n\nRelated: 11 all-inclusive beach resorts you can book with points\n\nEarning enough Hyatt points for a free night\n\nVentana Big Sur’s Vista Hot Tub Suite. (Photo courtesy Alila Hotels)\n\nIf a stay at the Alila Ventana Big Sur sounds like a perfect post-pandemic retreat, you’ll be glad to know you don’t need to shell out thousands of dollars for the privilege. This property is a terrific use of 30,000 Hyatt points, which aren’t too difficult to come by.\n\nYou can transfer points at a 1:1 ratio from a card like the Chase Sapphire Reserve, which currently offers a 60,000-point sign-up bonus after $4,000 spent in three months. The World of Hyatt Visa is another great alternative if you want a card with Hyatt-specific perks like elite status.\n\nThe card comes with 25,000 bonus points after you spend $3,000 in three months. Plus another 25,000 points after $6,000 in total spending within six months. The card comes with Discoverist status, which gets you perks like 10% bonus points, M life Pearl status, free premium internet, space-available room upgrades, 2 p.m. checkout and more.\n\nIf you want to earn high status, you’ll also get five qualifying nights toward elite status plus two credits for every $5,000 spent on the card. Through June 30, this number is elevated to three credits for every $5,000 spent.\n\nPlus, you’ll earn 4x points at Hyatt hotels and 2x points on restaurants, direct airline ticket purchases, local transit and fitness club/gym memberships. The card’s $95 annual fee can be easily offset with the annual free night certificate, valid at any Category 1-4 Hyatt hotel. You’ll get an additional certificate for charging $15,000 on the card every cardmember anniversary.\n\nRelated: Hyatt offering 10,000 points for expiring free night certificates\n\nBottom line\n\nOne of the best ways to get value out of Hyatt points is to use them at high-end properties like the Ventana. However, high-end redemptions often come with high ticket prices for on-site amenities and meals. The Ventana Big Sur’s new status as an all-inclusive property helps solve this conundrum. I for one look forward to making the 1.5-hour drive up to Big Sur, once it’s safe to do so, to check out the new offerings for myself.\n\nFeatured photo by Dave Lastovskiy via Unsplash.\n",
      "Folder": "Feedly",
      "Timestamp": "1592089902",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.293867Z"
}