{
  "id": "e59e7d7004e3408ea359c4ff43b04725",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/policy-and-politics/2017/7/3/15893996/7-types-people-out-of-work",
      "Title": "7 types of people who are out of work, categorized with data Vox - All",
      "Selection": "In the past year, researchers Martha Ross and Natalie Holmes gave a handful of presentation to local officials about how to match up job seekers with employment.\n\nBut they realized there was a problem: It was incredibly difficult for people to form a mental model of what their out-of-work population looked like.\n\nAnd without having a way to think about this population, it was hard to devise programs to help people who were looking for work.\n\nThere were some frameworks that tried to group the out-of-work population into management bits and pieces. For examples, the Workforce Innovation and Opportunity Act of 2013 diagnosed 14 groups of people who have barriers to employment:\n\nBut this often meant local officials were creating hyper-specific programs, like for low-income moms with kids. This meant their programs often didn't fit the \"typology\" of many people in their out-of-work population.\n\nSo the researchers sought out something that could be \"grafted\" onto existing mental models so people could broaden the way they thought about this population, rather than looking at single defining characteristics.\n\nLet's find a way to cluster people\n\nThe first step for Ross and Holmes, both of the Brookings Institution, was figuring out who needs help finding work.\n\nIt wouldn't be sufficient to merely look at who officially qualifies as \"unemployed\" under the official measure, since it only counts people who looked for work in the past four weeks. So, on top of those people, they took everyone else ages 25 to 64 who isn't in the labor force, and subtracted out people who appeared to be in school, rearing a child, or retired.\n\nNow that they had an out-of-work population, they had to figure out how to group them. Here's where the magic happens:\n\nThey diagnosed a handful of characteristics that would shape the kind of workforce intervention someone might need — things like age, education, race, English proficiency, whether they had a disability, and whether they had children.\n\n\"Those clustering variables are a pretty good window into what we thought were the important factors for someone's readiness to work,\" Ross said.\n\nThen they used clustering algorithms to group these people based on the attributes they chose.\n\nThey ended up with seven clusters of people that could be easily described, largely using age and educational attainment:\n\nAnd ultimately, these seven clusters give us a framework that can shape the way we think about the out-of-work on both a national and local level.\n\nThe seven types of unemployed people\n\nHere are the seven groups they came up with. I'll give a quick run-down of the groups, but their report delves much deeper into the demographics of each one.\n\nLess-educated young people: This is a diverse group made up of people who don't have high school degrees. They're often those who have either never worked or those who lost their low-wage jobs. About one in three people in this group are raising children under 6, and about one in five are single parents.\n\nLess-educated middle-age people: The people in this group are often not proficient in English, and about one in three people are not US citizens. This is the largest swath of unemployed people nationwide.\n\nLess-educated older people: This group has a hard time reentering the workforce because about one in five people are disabled, and fewer than two-thirds speak English \"very well.\" About half of this group was born outside the US.\n\nModerately educated younger people: These are people who completed some college. For the younger moderately educated, about 39 percent are caring for children under 18, and often they have worked jobs as home health aides and sales representatives. Those who attend school are nontraditional students who are looking for work to get them through school.\n\nModerately educated older people: This group is predominantly white, and 90 percent are US citizens. Ross speculates they are often dislocated workers who gained a lot of on-the-job experience, but were laid off or demand for their skill set has lessened. What's hard about this group is that older folks are less likely to want to go back to school, especially if they're eyeing retirement. Many of them don't have fond memories of school.\n\nAccording to Ross, instead of skill-building programs, policies to help displaced workers might be \"more along the lines of wage insurance to compensate for taking lower-wage jobs, or relocation assistance.\"\n\nHighly educated younger people: The younger folks who are highly educated are predominantly white and Asian, and they are either recently out of school and looking for jobs or laid off and not necessarily in a hurry to find a new job.\n\nHighly educated older people: The older folks are predominantly white, and have a median household income of almost $84,000. So often they are professionals who are waiting for the right job to come along, or people who moved with their families for various reasons and are unable to find work in their fields.\n\nThe most powerful part: localization\n\nNational data on the unemployed isn't particularly useful for local officials.\n\nSo the researchers looked at how their framework played out in various locales — and they saw huge variability. (You can spend some time with their interactive tool to dive deeper into how this data works on a local level.)\n\nHolmes used her hometown, Seattle, as an example. There, the largest swath of the out-of-work population is highly educated high-income people, which isn't exactly a nationwide priority population for policymakers, and it’s a particularly small portion of the nation's unemployed.\n\nBut the localization of data helps diagnose that problem while not obfuscating other types of out-of-work people.\n\nIt's notoriously hard to conceptualize who the out-of-work are. Far too often we think about the unemployed in terms of stereotypes. This research helps us get a little bit more specific when we talk about out-of-work people — and that can help us start to think about policy solutions.\n",
      "Folder": "Feedly",
      "Timestamp": "1499110757",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.579204Z"
}