{
  "id": "e5cc3fbc813f4bc4afd42769ede640cb",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://qz.com/729821/the-idea-that-a-womans-fertility-plummets-at-age-35-comes-from-bad-science/",
      "Title": "The idea that a woman’s fertility plummets at age 35 comes from bad science Quartz",
      "Selection": "As an unmarried woman approaching 30, I’m increasingly aware of the looming biological deadline that might make it difficult to have both a career and a family. Or at least what I thought was the biological deadline.\n\nIn fact, as this video shows, the belief that you’re taking a lot of risk with your fertility if you wait to have kids after age 35 is simply not true.\n\nThere is no cliff at 35. In fact, fertility is very dependent on the individual. Some women will have more trouble than others getting pregnant, regardless of age. There is a slow decline in fertility, and an increase in the risk of birth defects, but it’s less dramatic than we’ve been led to believe. There’s no one-size-fits-all advice that can pinpoint the perfect moment to have a child, and it’s bad science to suggest otherwise.\n\nIt’s not the first time we’ve seen myths like this become conventional wisdom. Time and again, the difficulty of balancing work and family has proven to be a ripe target for what some aptly dub the Woman Panic Industry. And at the dawn of the 21st Century, that meant warnings to women that pursuing a career meant playing Russian roulette with your biological clock.\n\nIn 2002, economist Sylvia Ann Hewlett, author of Creating a Life: Professional Women and the Quest For Children, claimed career women were suffering a “crisis of childlessness.” At the same time, the American Society of Reproductive Medicine, the nation’s largest professional organization of fertility specialists, released an ad campaign featuring an upside down baby bottle in the shape of an hour glass, running out of milk. The group warned that a woman’s chance of pregnancy was just 20% each month at age 30, and dwindled to a worrying 5% by age 40. The society still reports these numbers.\n\n(The Society claims not to know where their alarming data comes from. The best its spokesperson could tell me was, “The patient materials were developed by a committee, the membership of which has changed over time and I have not been able to discover the source for them.” We did discover the source of these statistics, and, as you’ll see in the video, it’s astonishing that such flimsy data has crept into so much of contemporary medical advice.)\n\nBut it’s no wonder we’re so easily panicked. The fearful narrative around women’s fertility fits with a broader theme that’s become all too common as women have gained economic independence over the last several decades: we’re going to pay for our equality. Mothers going to work in the 1980’s were told they were subjecting their kids to an epidemic of sexual abuse at daycare centers. In 1986, Newsweek reported that 40-year-old single women were “more likely to be killed by a terrorist” than find a husband. These stories and many more like them, of course, are completely false. Perhaps the best way to fight the panic is to question those who’ve made a business of selling it.\n\nThis video report was produced in collaboration with Retro Report. Here’s our first story in the series.\n\nWatch this next: Myths of the “mommy wars”\n",
      "Folder": "Feedly",
      "Timestamp": "1468453482",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.734377Z"
}