{
  "id": "e5ebcb09b4b1433ab2c2d32694328e10",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/culture/2017/10/5/16430050/kazuo-ishiguro-nobel-prize-best-works",
      "Title": "Kazuo Ishiguro just won the Nobel Prize. Here’s a brief guide to his bleak, beautiful world. Vox - All",
      "Selection": "The 2017 Nobel Prize in literature went to Kazuo Ishiguro, the Japanese-born English novelist who writes lovely, lyrical books about trauma, repression, and survival.\n\nIshiguro’s novels range from the polished and conventional to the sprawling and incoherent, so if you’re new to his work, trying to get a handle on which book does which can be overwhelming. If you’d like to dip into his oeuvre and aren’t sure where to start, this guide is for you.\n\nBeginner level\n\n Knopf\n\nWe’ll begin with Never Let Me Go — unless you are a science fiction purist, in which case the clone story will only annoy you and you are to head directly to Remains of the Day.\n\nIshiguro has described Never Let Me Go as his most uplifting novel, because it is the only one to feature a wholly sympathetic cast: Kathy H., our narrator, is a thoroughly likable, thoroughly sensible, thoroughly ordinary young girl, which makes what happens to her all the more upsetting. It’s a good place to get your bearings with Ishiguro and figure out how he sees the world.\n\nA word of caution: Do not read Never Let Me Go in public if you do not like to cry in public. “Oh,” you might think, “I’ll be that cool person on the train with my book cover tilted just so, so everyone can see I’m reading a Nobel Prize winner —” No. You will not be the smart person reading an acclaimed work of literature that shows the world you are serious and intelligent; you will be that weirdo sitting on the train sobbing over a book. And then when you remember that Ishiguro calls Never Let Me Go his most uplifting work, you’ll be that weirdo hysterically laugh-crying over a book.\n\nFrom there, move along to Remains of the Day, the second of the two most famous Ishiguros: If you hit just those two, you will still be fully qualified to discuss his works at a cocktail party. Remains of the Day is a little colder than Never Let Me Go, and the main character — an English butler in a manor house around World War II — is much more warped by the world in which he lives than sweet Kathy H. was. This is Ishiguro delving into monstrosities hidden beneath a stiff British upper lip, and while Remains of the Day may or may not make you cry, it will certainly make you shiver.\n\nIntermediate level\n\n Faber & Faber\n\nThe next step in your Ishiguro education is When We Were Orphans. Ishiguro fans sometimes talk about this one as his hidden gem, the dark horse favorite for his best novel. Its form is more deconstructed than either Never Let Me Go or Remains of the Day: It begins as a detective novel, evolves into a family story, and then gestures at turning into a war story without ever quite doing so; you can feel the narrative becoming less coherent as you slowly lose confidence in the narrator’s ability to understand the world. It’s unsettling and sad to read, with all sorts of dark undercurrents.\n\nNext up is Ishiguro’s most recent novel, 2015’s The Buried Giant. This one led to a public spat with Ursula Le Guin, in which Ishiguro fretted that readers might not understand that he was writing a literary novel with fantasy tropes and Le Guin accused him of condescending to those tropes without fully understanding them.\n\nIshiguro is certainly using his fantasy ideas in a heavily allegorical mode: The Buried Giant is a melancholy story built around the idea of a medieval English legend, with a dragon and a curse, and even readers who love it will tell you straightforwardly that it is a cold and misanthropic book that sees the worst in human nature. Ishiguro’s other books tend to be about fallible human beings who are warped by the world in which they live but are still worthy of empathy and love, but The Buried Giant is about how human beings warp the world themselves.\n\nAdvanced\n\nDepending on whom you ask, Ishiguro’s sprawling 1995 novel The Unconsoled — with its elliptical dream logic and refusal to even appear to cohere into a recognizable narrative structure — is either a masterpiece or an incomprehensible wreck. I myself am perfectly willing to believe it a masterpiece if Anita Brookner says it is, but I also have never managed to get past page 275 of 535. You may attempt it with my blessing.\n",
      "Folder": "Feedly",
      "Timestamp": "1507242015",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.541260Z"
}