{
  "id": "e63524eb1490433fb43fb34787de740f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/2016/12/fail-safe-science-delicious-crispy-chicken/",
      "Title": "The Fail-Safe Science of Delicious Crispy Chicken WIRED",
      "Selection": "Chicken breast is a ubiquitous weeknight dinner item, but there’s a fine line between crispy, juicy yum and overcooked cardboard yuck. One crowd pleasing technique is to just deep fry it—mmm, crunchy goodness. But then you’re looking at a messy, labor-intensive, and fattening extravaganza. You can get the same satisfying crunch using just a pan and some basic ingredients, without the mess and added fat of deep frying. So let Cook’s Science editor Dan Souza walk you through a few fail-safe tips for crispy chicken that seals in its own juices to make for a satisfying weeknight throw-together. \n\nThe trick is to start with a piece of chicken with its skin still on: That’s what’s going to crisp up in the pan and give you that crunchy outer layer. Souza pokes the chicken with a sharp, small knife several times, opening up channels that allow the meat’s fat to escape as it heats up in the pan. Then he pounds the chicken flat to break down the protein fibers in the meat, which softens it for a more tender bite. As the fat renders out of those channels, the skin is going to fry in it, which gives it that nice crunchy texture. \n\nThis is where things get a little tricky. Chicken skin is delicious, but it’s also full of collagen, the structural protein that gives it its stretchy strength. When exposed to heat, collagen proteins contract and tighten up, which is why the skin will shrivel if you just throw a chicken breast right into a hot pan. Pounding the chicken out before you cook it helps weaken that collagen. But Souza also puts a cast iron skillet over the chicken when it’s cooking. The added weight forces the chicken to stay stretched out as it cooks, so you get a bigger piece of crispy chicken skin that stays splayed out across the breast. \n\nTo further prevent the chicken skin from shriveling and the meat from toughening up, Souza also recommends starting with a cold pan. I know, I know—every other cook book you’ve ever read told you to start with a hot pan, but Souza’s endless tinkering at America’s Test Kitchen ultimately led him to the discovery that the collagen in chicken skin causes it to recoil and shrink back from sudden heat the same way a person would snap their finger back if they accidentally touched a hot pan. Stretching out the skin by pounding out the breast, weighing it down with the cast iron skillet, and slowly bringing it up to temperature is the ultimate trifecta of tough-meat prevention. Together, it breaks down those tough collagen proteins and holds them down until they’re cooked to a golden crisp in the rendered fat. \n\nGo Back to Top. Skip To: Start of Article.\n",
      "Folder": "Feedly",
      "Timestamp": "1480713729",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.747398Z"
}