{
  "id": "e6792df46532429792087cc8704c796b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.theverge.com/2017/3/24/15049656/elon-musk-tesla-model-3-tweets-video",
      "Title": "Elon Musk shares video of near-final Model 3, but says he won’t drive one The Verge",
      "Selection": "Tesla CEO Elon Musk today shared the first video of what he calls a “release candidate” version of Tesla’s upcoming Model 3 electric car. We’ve seen Model 3 prototypes before, and this five-second clip doesn’t really show us anything new — but Musk enjoys feeding the hype train.\n\nHe also noted that calling the new car the “Model 3” was sowing confusion among customers about whether it was the “next version” of Tesla’s car, like Apple going from the iPhone 2 to iPhone 3 — “not true,” Musk said.\n\nHe called himself “a dumb idiot” for naming it Model 3, saying he “didn’t realize at the time that it would cause confusion.” Instead, he says customers should think of the Model 3 as similar to the BMW 3 Series or Audi A4, while the Model S is like a BMW 5 or 6 Series — different cars but sold side by side. Musk noted that he will keep driving the Model S even after the Model 3 arrives.\n\nIn an anecdote we’ve known for a while, Musk reminded followers that the Model 3 was originally going to be named the Model E (“for obvious dumb humor reasons” — meaning the cars would be Models S, E, and X), but a Ford trademark lawsuit prevented that from happening. Next up, naturally, is Model Y. S3XY.\n\nFirst drive of a release candidate version of Model 3 http://pic.twitter.com/zcs6j1YRa4\n\n— Elon Musk (@elonmusk) March 24, 2017\n\nAs part of his tweetstorm this morning — which occurred during a flight to Cape Canaveral for a SpaceX rocket launch — Musk replied to a number of current and potential Tesla customers about what’s coming from the company in the coming months. Among other things, he said:\n\nThe first Model 3 cars will all be rear-wheel drive, much like the Model S was, to make production a bit simpler. All-wheel drive / dual-motor versions will come six to nine months after launch.\n\nPerformance versions of the Model 3 will come “probably a year from now,” though the Model S will remain faster because it has room for a larger battery.\n\n“More cowbell” will be coming in the Tesla 8.1 software update, which is expected next week. It’s a reference to a Will Farrell Saturday Night Live skit of which Musk is a fan. Previous versions of Tesla’s vehicle operating system have included Easter eggs referencing cowbell.\n\nThe Model 3 will have a single screen combining instrument cluster and infotainment information in one place. Hinting at possible increased autonomy, Musk asked how often riders look at the instrument panel in a taxi.\n\n@arctechinc The more autonomous a car is, the less dash info you need. How often do you look at the instrument panel when being driven in a taxi?\n\n— Elon Musk (@elonmusk) March 24, 2017\n\nThe Model S will remain the fastest Tesla until the next-generation Roadster is released — though that car is “a few years away.”\n\nA Tesla semi-truck will beat sports cars from zero to 60 mph.\n\nTesla and SolarCity will begin taking orders for its “solar roof” product next month.\n",
      "Folder": "Feedly",
      "Timestamp": "1490373243",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.696543Z"
}