{
  "id": "e801b2a7fc81421fb066cbb89fbd26d3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://frequentmiler.boardingarea.com/2016/09/23/marriott-spg-complete-guide-sweet-opportunities/",
      "Title": "Marriott SPG Complete Guide to Sweet Opportunities Frequent Miler",
      "Selection": "Thanks to the Marriott Starwood merger, it is now possible to link your Marriott Rewards and SPG (Starwood Preferred Guest) accounts.  By linking accounts you can now do the following:\n\nMatch Status: Marriott Gold matches to SPG Gold; Marriott Platinum matches to SPG Platinum\n\nTransfer Points: Points transfer in either direction. 3 Marriott Rewards points = 1 SPG Starpoint\n\nMarriott Rewards and SPG each have unique program sweet spots and partnerships.  As a result, this merger has opened up some really sweet opportunities.  This post serves as a complete overview to these opportunities.  I’ll add to the post as more sweet spots are discovered.  I’ll also follow up with in-depth coverage of some of these sweet spots (and I’ll update this post to link out to those).\n\nTo learn pretty much everything you need to know about the merger and how it affects the two loyalty programs, Marriott has put together an excellent FAQ (Frequently Asked Questions) site, found here: http://ift.tt/2cMYTkH.\n\nSweet Opportunities: Point Earnings\n\nEarn more SPG points per dollar at Marriott properties.  With the exception of Residence Inns and Towneplace Suites, stays at Marriott properties earn 10 points per dollar for general members, 12.5 points per dollar for Gold elites, and 15 points per dollar for Platinum elites.  If you then convert those points 3 to 1, it translates to the following earning rates:\n\nGeneral Members: 3.33 SPG Starpoints per dollar (vs. 2 Starpoints per dollar at Starwood properties)\n\nGold Members: 4.17 SPG Starpoints per dollar (vs. 3 Starpoints per dollar at Starwood properties)\n\nPlatinum Members: 5 SPG Starpoints per dollar (vs. 3 to 4 Starpoints per dollar depending on your Platinum status level)\n\nEarn more Marriott points per dollar with the SPG credit card. The Amex SPG credit card offers 1 point per dollar for most spend and 2 points per dollar at Starwood properties.  This translates to 3 Marriott points per dollar for most spend and 6 Marriott points per dollar at Starwood properties.  This is much better than Marriott branded cards that earn 5X at Marriott, 2X for airline, car rental, & restaurants, and 1X elsewhere.\n\nConvert the Amex SPG signup bonus into 75,000 Marriott Rewards points.  Skip the stinky new 2 free night offer and go for the good old 25K signup bonus offer instead.\n\nEarn 3X Marriott points with SPG partners. Delta, Emirates, Caesars Entertainment, Design Hotels, Uber, and Audience Rewards all offer opportunities to earn Starpoints.  Now, you can indirectly earn 3X Marriott points.  You can find details of these partnerships here.\n\nEarn 1/3X SPG points with Marriott partners.  Obviously this is less compelling than going the other way around, but there may be some opportunities worth pursuing.  Find Marriott point earning partnerships here.\n\nAdditional options for earning SPG points which now convert 1 to 3 to Marriott Rewards, can be found here: Top 10 shortcuts to earning SPG points.\n\nSweet Opportunities: Free Nights\n\nConvert SPG points to Marriott to book free nights for 24% more value: Hotel Hustle shows median point redemption values for most hotel chains.  At the time of this writing, the median point value (in cents per point) for SPG is 1.849 and Marriott is 0.763.  This means that, on average, you can get more value per SPG point by converting to Marriott 1 to 3.  By doing so, each SPG point, on average, should yield 0.763 x 3 = 2.289 cents per point value.  That’s a 24% increase in value over using SPG points to book SPG hotels!  Of course, this is just based on median results — your specific results will vary.\n\nBook Marriott hotels for 2000 to 15,000 SPG points per night.  Marriott’s free night award chart ranges from 6,000 to 45,000 points per night.  With the SPG to Marriott 1 to 3 conversion ratio, that means that SPG points go really far when booking Marriott stays.\n\nBook Ritz Carlton hotels for 10,00 to 23,333 SPG points per night.  Again, SPG points represent a great value for booking Ritz properties.\n\nBook low category SPG properties for 6,000 to 12,000 Marriott points per night: SPG category 1 and 2 properties range in award price from 2,000 to 4,000 SPG points per night.  That translates to only 6,000 to 12,000 Marriott points per night.\n\nBook SPG Points & Cash nights, up to Category 5 for 18,000 (or fewer) Marriott points per night (plus cash)\n\nBook SPG Points & Cash upgraded rooms, up to Category 5 for 21,750 (or fewer) Marriott points per night (plus cash)\n\nBook SPG Points & Cash suites, up to Category 5 for 36,000 (or fewer) Marriott points per night (plus cash)\n\nSweet Opportunities: Nights & Flights\n\nBoth Marriott and SPG offer travel packages in which you can redeem hotel points for 5 or 7 night hotel stays plus get airline miles as well.  The airline miles go to your airline loyalty account and do not have to be used for the same trip in which you book your stay.\n\nFor background, please see:\n\nSPG Nights & Flights vs. Marriott Travel Packages\n\nAnalysis of Marriott Travel Packages: 5 Night vs. 7 Night\n\nThese travel packages lead to the following sweet opportunities:\n\nGet 5 nights at a category 5 Marriott property plus 132,000 United MileagePlus miles for 79,000 SPG points*\n\nGet 5 nights at a category 5 Marriott property plus 120,000 air miles for 79,000 SPG points*\n\nGet 7 nights at a category 5 Marriott property plus 132,000 United MileagePlus miles for 90,000 SPG points\n\nGet 7 nights at a category 5 Marriott property plus 120,000 air miles for 90,000 SPG points\n\nGet 5 nights at an SPG category 3 property plus 50,000 air miles for 180,000 Marriott points\n\nGet 5 nights at an SPG category 4 property plus 50,000 air miles for 210,000 Marriott points\n\n* Note that Marriott 5 Night travel packages exist, but they’re intended to be only available to Marriott Vacation Club (timeshare) owners.  In some cases, Marriott elite members have been able to book these packages without being Vacation Club owners.  More details can be found here: Marriott 5 Night Travel Packages exist, but they’re secret.\n\nSweet Opportunities: Transfer to Miles\n\nSPG has a huge list of transfer partners (found here) and most transfer at a very favorable rate: 20,000 SPG Starpoints = 25,000 air miles.  But, SPG does not transfer to Southwest Airlines, and the transfer ratio to United is poor (2 to 1).\n\nWhen SPG to Marriott to Miles is a good idea…\n\nMarriott points transfer to many airlines as well, but transfer ratios vary by the number of points transferred, whether or not you use a travel package to transfer, and the specific airline you transfer to.  I’ll cover these intricacies in a future post.  For now, consider converting SPG points to Marriott and then to miles as follows (note that you can often do better than SPG’s usual 1 to 1.25 ratio!):\n\nConvert SPG to United at a great ratio!\n\n5 Night Category 1-5 Travel Package: 79,000 SPG =  more than 235,000 Marriott = 132,000 United miles (1 to 1.67)\n\n7 Night Category 1-5 Travel Package: 90,000 SPG = 270,000 Marriott = 132,000 miles (1 to 1.47)\n\nDirect conversion: 19,000 SPG = more than 56,000 Marriott points = 25,000 miles (1 to 1.31)\n\nConvert to many other airlines* at a ratio of 1 to 1.33 or better:\n\n5 Night Category 1-5 Travel Package: 79,000 SPG =  more than 235,000 Marriott = 120,000 miles (1 to 1.52)\n\n7 Night Category 1-5 Travel Package: 90,000 SPG = 270,000 Marriott = 120,000 miles (1 to 1.33)\n\nDirect conversion: 24,000 SPG = more than 70,000 Marriott points = 25,000 miles (1 to 1.04)Direct conversion is not recommended here except where SPG does not directly support the same partner such as with Southwest.\n\n* “Many other airlines” = Aeromexico, Aeroplan (Air Canada), Alaska, American Airlines, British Airways, Copa Airlines, Delta Air Lines, Frontier Airlines, GOL/Varig, Hawaiian Airlines, Iberia Airlines, Southwest, Virgin Atlantic\n\nAs you can see above, you can now indirectly convert SPG points to United miles at a terrific ratio. Plus, you get a free Marriott stay as well! This indirect technique also makes Southwest available at a very good transfer ratio.  Even airlines that are usually good options for SPG transfers are better with Marriott Travel Packages.  These include: Aeroplan, Alaska, American Airlines, British Airways, and Delta.\n\nQuick Tips Regarding Marriott Travel Packages:\n\nIf you really don’t want that free stay, you can return the certificate and they’ll give you some of your points back!  That makes the conversion to miles ratios even better!  Unfortunately, I don’t know how much is returned for each travel package. I’ll update this when I get that information.\n\nIf you’re not sure which exact hotel you will stay in, always buy the Cat 1-5 package because it is the cheapest, and always go for the most miles possible within that category.  You can always pay additional Marriott points when it’s time to actually book your stay, if you want to stay in a higher category hotel.\n\nWhen Marriott to SPG to miles is a good idea…\n\nWith select airlines, Marriott conversions to miles are much worse than shown above.  So, if you need miles with these airlines, you’d be better off transferring from SPG.  60,000 Marriott points = 20,000 SPG = 25,000 air miles.  In other words, you’ll get a 2.4 to 1 Marriott to miles conversion ratio with these airlines:\n\nVirgin America, Airberlin, Air China, Air France/KLM, Alitalia, ANA, Asiana Airlines, Avianca-TACA, China Eastern, China Southern, Emirates,  Etihad Airways, Japan Airlines, Korean Air, LAN, Lufthansa Miles & More, Qatar Airways, Saudia Airlines, Singapore Airlines\n\nSweet Opportunities: Hotel Elite Status\n\nAmex Platinum card = SPG Gold = Marriott Gold = Free breakfast or lounge access at most Marriott properties\n\nSPG card spend $30K = SPG Gold = Marriott Gold = Free breakfast or lounge access at most Marriott properties\n\nUnited MileagePlus Gold status or higher = Marriott Gold (via RewardsPlus) = SPG Gold\n\nRitz card = Marriott Gold = SPG Gold\n\nRitz card spend $75K = Marriott Platinum = SPG Platinum\n\nSPG Gold = Marriott Gold = Marriott Taste of Platinum Challenge = SPG Platinum (I’ll explain in a future post)\n\nSweet Opportunities: Airline Elite Status (and Companion Pass)\n\nSPG Platinum = Marriott Platinum = United Silver Elite (via RewardsPlus)\n\nMarriott Gold = SPG Gold = Delta elite privileges and bonus Starpoints on Delta flights (via Crossover Rewards)\n\n90,000 SPG Starpoints = 270,000 Marriott = 7 Nights + 120,000 Southwest points = Southwest Companion pass (Important: Wait until beginning of calendar year to do this!)\n\nSweet Opportunities: Weird Point Conversion Options\n\nConvert Amex Membership Rewards to Marriott 1 to 1, or better\n\nUsual: 3000 Membership Rewards = 1000 SPG = 3000\n\nWith occasional 50% transfer bonus: 3000 Membership Rewards = 1500 SPG = 4500 Marriott\n\nConvert Ultimate Rewards to SPG\n\n1000 Ultimate Rewards = 1000 Marriott = 333 SPG\n\nConvert Diners Club to Marriott at better than usual rate\n\nUsual: 1250 Diners Club = 1500 Marriott\n\nVia SPG: 1250 Diners Club = 750 SPG = 2,250 Marriott\n\nSweet Opportunities: Buy Points for Less\n\nI don’t usually recommend buying points directly from any loyalty program, but at times it can make sense.  Standard prices are:\n\nMarriott: $12.50 per 1000 (1.25 cents per point)\n\nSPG: $17.50 per 500 (3.5 cents per point)\n\nYou can now indirectly buy Marriott points via SPG:\n\n$17.50 = 500 SPG = 1500 Marriott = 1.17 cents per point\n\nEven with the standard price for SPG points, it is a little bit cheaper to buy Marriott points this way.  However, SPG frequently runs deals where points are 25% to 35% off.  In those cases it will be much cheaper to buy Marriott points indirectly through SPG.\n\nSweet Opportunities: Transferring Points to Others\n\nBoth SPG and Marriott allow points to be transferred for free to a spouse or domestic partner.  SPG goes further and allows free point transfers to anyone in the same household.  So, it should be possible to transfer Marriott points to another member of the household who is not your spouse or domestic partner as follows:\n\nHousehold Member 1: Convert Marriott points to SPG\n\nHousehold Member 1: Transfer SPG points to household member 2\n\nHousehold Member 2: Convert SPG points to Marriott points\n\nThis may also get around point purchase limits in place with each chain (30K per year SPG, 50K per year Marriott).\n\nReader Suggestions?\n\nWhich sweet opportunities did I miss?  I’d like to try to keep this post up to date.  Please comment below\n\nEarn miles without flying—> Start Here\n\n \n\n \n\nThe post Marriott SPG Complete Guide to Sweet Opportunities appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1474778369",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.774039Z"
}