{
  "id": "e92ca598e13640178f144ce003b4f747",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.businessinsider.com/sorry-malcolm-gladwell-but-youre-making-zero-sense-on-twitter-and-egypt-2011-2",
      "Title": "Sorry Malcolm Gladwell, But You're Making Zero Sense On Twitter And Egypt",
      "Selection": "Sorry Malcolm Gladwell, But You’re Making Zero Sense On Twitter And Egypt\n\nPascal-Emmanuel Gobry | Feb. 3, 2011, 8:32 AM | 1,813| 5\n\nSee Also:\n\n \n \n \n\nThe New Yorker’s Malcolm Gladwell is a very smart writer with a knack for smart, provocative, “contrarian” statements. One such argument that gets digerati in a tizzy is the idea that social media actually doesn’t help bring down oppressive regimes, despite all the hype. That debate is back in the news with the protests in Egypt.\nWe’ll say right off the bat that we’re skeptics that social media can bring down oppressive regimes. We believe Twitter makes a tangible, positive difference in the real world, but probably not quite at the level of regime change.\n\nBut Gladwell wrote a blog post yesterday on social media and Egypt that just doesn’t make any sense.\n\nHere’s the gist of the post: revolutions have happened before there was social media, and therefore social media doesn’t matter to the current revolutions. Why do we think they do? Because we focus on how people communicate rather than what they communicate. Just because someone says something on Twitter as opposed to through a bullhorn doesn’t mean it’s Twitter that matters.\n\nTo start, no one disputes that revolutions happened before social media. The argument is whether social media makes revolutions easier or faster. It’s an open argument, but that’s what the argument is. Gladwell’s point a classic and pretty ridiculous straw man.\n\nBut take this paragraph:\n\nWhen Mao famously said that power springs from the barrel of a gun, it was assumed that he was talking about guns. There wasn’t much interest at the time in how he chose to communicate that sentiment: whether he said it in a speech, say, or whispered it to a friend, or wrote it in his diary or published it in a book. That would never happen today, of course. We now believe that the “how” of a communicative act is of huge importance. We would say that Mao posted that power comes from the barrel of a gun on his Facebook page, or we would say that he blogged about gun barrels on Tumblr—and eventually, as the apostles of new media wrestled with the implications of his comments, the verb would come to completely overcome the noun, the part about the gun would be forgotten, and the the big takeaway would be: Whoa. Did you see what Mao just tweeted?\n\nActually, when Mao said that power springs from the barrel of a gun, we’re pretty sure it was (and still is) assumed that he was talking about power. The sentence is about power. Not guns.\n\nThe logic only gets worse from there.\n\nAfter all, one reason why many people make sure to mention “the ‘how’ of a communicative act” is because journalistic convention (wisely) requires sourcing statements.\n\nAnother pretty big reason is that a lot of people, ourselves included, think that context matters. It’s often pretty relevant whether a quote was said off the cuff or published in a book.\n\nTo go back to Gladwell’s example, it actually makes a pretty big difference whether Mao said in confidence  or in a highly public setting that power springs from the barrel of a gun. And he did the latter: the quote appears in a book titled “Quotations from Chairman Mao.” That book is better known as The Little Red Book, the most printed book after the Bible and the Koran, which every Chinese citizen under Mao was required to own and carry at all times. It’s actually very significant that every Chinese citizen under Mao was required to carry a book that said to them, essentially, “you must obey me because otherwise I’ll kill you.” It says something about the character of the regime that Mao built.\n\nAgain — we’re not arguing for social media utopianism. Someone like Evgeny Morozov makes very compelling arguments about how the web also enables repressive regimes. But Gladwell’s argument here makes zero sense.",
      "Folder": "Archive",
      "Timestamp": "1297451608",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:27:00.102490Z"
}