{
  "id": "eaba74f1a84e4615aa4876c3d1598b27",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://kottke.org/19/02/buy-the-cheap-thing-first",
      "Title": "Buy the Cheap Thing First kottke.org",
      "Selection": "Beth Skwarecki has written the perfect Lifehacker post with the perfect headline (so perfect I had to use it for my aggregation headline too, which I try to never do):\n\nWhen you’re new to a sport, you don’t yet know what specialized features you will really care about. You probably don’t know whether you’ll stick with your new endeavor long enough to make an expensive purchase worth it. And when you’re a beginner, it’s not like beginner level equipment is going to hold you back…\n\nHow cheap is too cheap?\n\nFind out what is totally useless, and never worth your time. Garage sale ice skates with ankles that are so soft they flop over? Pass them up.\n\nWhat do most people do when starting out?\n\nIf you’re getting into powerlifting and you don’t have a belt and shoes, you can still lift with no belt and no shoes, or with the old pair of Chucks that you may already have in your closet. Ask people about what they wore when they were starting out, and it’s often one of those options…\n\nWhat’s your exit plan?\n\nHow will you decide when you’re done with your beginner equipment? Some things will wear out: Running shoes will feel flat and deflated. Some things may still be usable, but you’ll discover their limitations. Ask experienced people what the fancier gear can do that yours can’t, and you’ll get a sense of when to upgrade. (You may also be able to sell still-good gear to another beginner to recoup some of your costs.)\n\nWearing out your beginner gear is like graduating. You know that you’ve stuck with the sport long enough that you aren’t truly a beginner anymore. You may have managed to save up some cash for the next step. And you can buy the nicer gear now, knowing exactly what you want and need.\n\nThis is 100 percent the truth, and applies to way more than just sports equipment. Computers, cooking, fashion, cars, furniture, you name it. The key thing is to pick your spots, figure out where you actually know what you want and what you want to do with it, and optimize for those. Everywhere else? Don’t outwit yourself. Play it like the beginner that you are. And save some scratch in the process. Perfect, perfect advice.\n\nTags: computing   cooking   Lifehacker   sports",
      "Folder": "Feedly",
      "Timestamp": "1549677781",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.428158Z"
}