{
  "id": "eae0fb762af442d1a7b96f47cf42102a",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://ritholtz.com/2018/05/dont-put-half-net-worth-anything/",
      "Title": "Don’t Put Half of Your Net Worth Into Anything The Big Picture",
      "Selection": "A Billionaire Makes a Classic Investing Error\nConcentrating in a single asset class can be an invitation to trouble.\nBloomberg, May 3, 2018\n\n \n\n \n\nI try to avoid giving unsolicited advice to billionaires. They are doing just fine without me. Besides, nobody likes to hear from the cheap seats, especially when they just made a terrible, horrible, reckless investing error that poses unnecessary risk and could cost quite literally billions of dollars.\n\nI bring this up after I read this headline, “This Billionaire Has Put Half His Net Worth Into Gold,” on Bloomberg News and the story that went with it. It describes a very concentrated investing bet:\n\nSome big investors see warning signs ahead for markets but are holding their positions. Egyptian billionaire Naguib Sawiris is taking action: He’s put half of his $5.7 billion net worth into gold.\n\nHe said in an interview Monday that he believes gold prices will rally further, reaching $1,800 per ounce from just above $1,300 now, while “overvalued” stock markets crash.\n\nSome big investors see warning signs ahead for markets but are holding their positions. Egyptian billionaire Naguib Sawiris is taking action: He’s put half of his $5.7 billion net worth into gold.\n\nThe billionaire in question, who is buying gold directly and investing in gold miners, is No. 338 on the Bloomberg Billionaires Index and comes from the wealthiest family in Egypt. His father, Onsi Sawiris, is also a billionaire who established Orascom Group. Naguib’s youngest brother is the richest man in Egypt.\n\nContinues at A Billionaire Makes a Classic Investing Error\n\n \n",
      "Folder": "Feedly",
      "Timestamp": "1526040692",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.509746Z"
}