{
  "id": "ebc5dd81225e41f094cb18b4f8d572a9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.southsidesox.com/2016/12/6/13856808/a-quick-look-at-moncada-kopech-basabe-and-diaz",
      "Title": "A quick look at Moncada, Kopech, Basabe, and Diaz South Side Sox - All Posts",
      "Selection": "White Sox get the top prospect in baseball and a whole lot more.\n\nWith Chris Sale on the move to Boston, the White Sox are expected to get an armload of prospects in return. Based on multiple reports, those prospects are Yoan Moncada, Michael Kopech, Luis Alexander Basabe, and Victor Diaz.\n\nYoan Moncada is probably the most recognizable name of the bunch. He’s currently the #1 prospect in baseball at MLB.com. Moncada turns 22 in May and has mostly played second base, but the Red Sox gave him some time at third base at AA and in the majors last season.\n\nHe left Cuba in 2014 and was signed by the Red Sox in February 2015. After an extended Spring, Moncada went straight to Greenville in the SAL. Last season, he started out at Salem in the Carolina League where he hit .307/.427/.496. That earned him a promotion to AA Portland where he hit .277/.379/.531 with 11 home runs in 207 plate appearances. He finished off the season in Boston where he appeared in eight games, playing third base in five of those games. Oh, I forgot to mention he also stole 94 bases in the past two seasons, and he’s a switch hitter. His offensive potential is sky high. He’s also major league ready if the Sox want him to start the season in Chicago, but with no AAA experience and a rebuild, a short trip to Charlotte to work on “things” with a May callup seems likely.\n\nMichael Kopech came up in conversations in our house recently. Apparently, he dating a young reality TV star. We’ll get to off-field stuff with him in a moment. Kopech, who turns 21 next April, has one of the biggest arms in baseball. He’s was consistently throwing 98 in his Carolina League debut last season, getting as high as 105. For the Red Sox, he was their #5 prospect and in the top 100 at #67. He fits snuggly between Carson Fullmer and Zach Collins at #3 for the White Sox. Along with the fastball, he’s got an average-plus slider and changeup that will probably be focuses for the White Sox this season.\n\nAs you probably suspected, the problems with Kopech are off the field. In 2015, he was suspended 50 games for testing positive for oxilofrine. In spring training last season, Kopech broke his right (pitching) hand in an altercation with a roommate and missed most of the first half of the season.\n\nSo, what’s this power arm give you? Last season, in eleven starts over 52 innings, Kopech walked 29 and struck out 82 for a 2.25 ERA and a 2.60 FIP. He gave up one home run, a first inning grand slam to Brett Austin of the Dash to end Kopech’s last start of the season. He’ll likely start the season at either Winston-Salem or Birmingham, and could conceivable be in Chicago next September and contending for a spot in the rotation in 2018.\n\nLuis Alexander Basabe is all about potential. The #8 prospect for the Red Sox, he hasn’t played above A-ball yet. He did finally find his power stroke last season, hitting .258/.325/.447 with 12 home runs for Greenville last season. He also only turned 20 at the end of last season. That power came with a slightly frightening 25.7% K%. So, yes, he’s still pretty raw. In the outfield, he’s split time between center and the corners, but with a decent arm is likely a right fielder long term. He likely starts at Winston-Salem next season and is probably a few years off from Chicago. As for his White Sox prospect ranking, he’s probably #5, just ahead of Charlie Tilson.\n\nVictor Diaz is the lottery ticket here. He got a late start and didn’t start playing professionally for the Red Sox until he was 21 for one of the Red Sox’ DOSL teams. Last season, he made the jump to their SAL league team in Greenville. In 60⅓ innings, he walked 25 and struck out 63 for a 3.88 ERA and 3.19 FIP. He works consistently in the upper 90s and reaches 100 regularly. He works from a three-quarters slot, and has some pretty inconsistent secondary pitches. That sounds like the typical project for the White Sox development staff. He had a fine season for the SAL and will likely start the season at Winston-Salem. While he was a reliever for Boston, the White Sox will likely have him start some for the extra reps. He’ll probably need the whole season there and, like Basabe, is a few years out from the majors. Long-term, he’s probably a reliever, but in the majors could be anywhere from a short-term fill-in to a closer. There’s a whole lot of variance there.",
      "Folder": "Feedly",
      "Timestamp": "1481076814",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.685227Z"
}