{
  "id": "edd24a2c12a14497bca66f2f78196f92",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.fangraphs.com/blogs/top-25-prospects-chicago-white-sox/",
      "Title": "Top 25 Prospects Chicago White Sox FanGraphs Baseball",
      "Selection": "Below is an analysis of the prospects in the farm system of the Chicago White Sox. Scouting reports are compiled with information provided by industry sources as well as from our own (both Eric Longenhagen’s and Kiley McDaniel’s) observations. For more information on the 20-80 scouting scale by which all of our prospect content is governed you can click here. For further explanation of the merits and drawbacks of Future Value, read this.\n\nAll the numbered prospects here also appear on THE BOARD, a new feature at the site that offers sortable scouting information for every organization. Click here to visit THE BOARD.\n\nTop Prospects Series\n\n20182017\n\nAL\n\nBAL\n\nCHW\n\nHOU\n\nBOS\n\nCLE\n\nLAA\n\nNYY\n\nDET\n\nOAK\n\nTBR\n\nKCR\n\nSEA\n\nTOR\n\nMIN\n\nTEX\n\nNL\n\nATL\n\nCHC\n\nARI\n\nMIA\n\nCIN\n\nCOL\n\nNYM\n\nMIL\n\nLAD\n\nPHI\n\nPIT\n\nSDP\n\nWSN\n\nSTL\n\nSFG\n\nAL\n\nBAL\n\nCHW\n\nHOU\n\nBOS\n\nCLE\n\nLAA\n\nNYY\n\nDET\n\nOAK\n\nTBR\n\nKCR\n\nSEA\n\nTOR\n\nMIN\n\nTEX\n\nNL\n\nATL\n\nCHC\n\nARI\n\nMIA\n\nCIN\n\nCOL\n\nNYM\n\nMIL\n\nLAD\n\nPHI\n\nPIT\n\nSDP\n\nWSN\n\nSTL\n\nSFG\n\nWhite Sox Top Prospects\n\nRk\n\nName\n\nAge\n\nHigh Level\n\nPosition\n\nETA\n\nFV\n\n1\n\nEloy Jimenez\n\n21\n\nAA\n\nRF\n\n2019\n\n65\n\n2\n\nMichael Kopech\n\n21\n\nAAA\n\nRHP\n\n2019\n\n60\n\n3\n\nLuis Robert\n\n20\n\nR\n\nCF\n\n2020\n\n60\n\n4\n\nAlec Hansen\n\n23\n\nAA\n\nRHP\n\n2020\n\n50\n\n5\n\nZack Burdi\n\n22\n\nAAA\n\nRHP\n\n2019\n\n50\n\n6\n\nZack Collins\n\n22\n\nAA\n\n1B\n\n2018\n\n50\n\n7\n\nDane Dunning\n\n22\n\nAA\n\nRHP\n\n2018\n\n50\n\n8\n\nDylan Cease\n\n22\n\nA+\n\nRHP\n\n2020\n\n45\n\n9\n\nMicker Adolfo\n\n21\n\nA+\n\nRF\n\n2021\n\n45\n\n10\n\nJake Burger\n\n21\n\nA\n\n3B\n\n2020\n\n45\n\n11\n\nBlake Rutherford\n\n20\n\nA+\n\nLF\n\n2020\n\n45\n\n12\n\nRyan Cordell\n\n26\n\nAAA\n\nRF\n\n2018\n\n40\n\n13\n\nCarson Fulmer\n\n22\n\nMLB\n\nRHP\n\n2018\n\n40\n\n14\n\nGavin Sheets\n\n21\n\nA+\n\n1B\n\n2020\n\n40\n\n15\n\nA.J. Puckett\n\n22\n\nA+\n\nRHP\n\n2019\n\n40\n\n16\n\nLuis Gonzalez\n\n22\n\nA\n\nRF\n\n2021\n\n40\n\n17\n\nSeby Zavala\n\n24\n\nAA\n\nC\n\n2020\n\n40\n\n18\n\nLuis Alexander Basabe\n\n20\n\nA+\n\nCF\n\n2020\n\n40\n\n19\n\nIan Clarkin\n\n23\n\nAA\n\nLHP\n\n2019\n\n40\n\n20\n\nSpencer Adams\n\n21\n\nAA\n\nRHP\n\n2019\n\n40\n\n21\n\nTyler Danish\n\n22\n\nMLB\n\nRHP\n\n2017\n\n40\n\n22\n\nJameson Fisher\n\n23\n\nAA\n\nLF\n\n2019\n\n40\n\n23\n\nAaron Bummer\n\n24\n\nMLB\n\nLHP\n\n2018\n\n40\n\n24\n\nJordan Stephens\n\n24\n\nAAA\n\nRHP\n\n2019\n\n40\n\n25\n\nDanny Mendick\n\n24\n\nAAA\n\nSS\n\n2019\n\n40\n\n65 FV Prospects\n\n1. Eloy Jimenez, RF\n\nVideo\n\nSigned: July 2nd Period, 2013 from Dominican Republic\n\nAge\n\n20\n\nHeight\n\n6’4\n\nWeight\n\n205\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/50\n\n70/80\n\n50/70\n\n45/40\n\n45/50\n\n60/60\n\nJimenez was largely compared head-to-head with now-Yankees SS Gleyber Torres as the top talents in the loaded 2013 July 2nd class. Both players signed with the Cubs, then later were traded as headliners in blockbuster trades for Aroldis Chapman and Jose Quintana, respectively.\n\nJimenez has developed as many hoped he would as an amateur, already showing 70 game power due to a rare feel for hitting from a prospect with potential 80 raw power. He also has a rare level of baseball-specific athleticism that allows him to play a solid right field while doing these things, a combination present in players like Giancarlo Stanton and Aaron Judge, even if Jimenez likely won’t be that level of player. He’s continued to exhibit that rare playability of rare tools early in 2018 and seems on track for a big-league audition late this summer at age 21.\n\n60 FV Prospects\n\n2. Michael Kopech, RHP\n\nVideo\n\nDrafted: 1st Round, 2014 from Mt. Pleasant HS (TX)\n\nAge\n\n21\n\nHeight\n\n6’3\n\nWeight\n\n205\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n70/70\n\n50/60\n\n45/55\n\n40/45\n\nKopech was frustrating for scouts earlier in his high-school career, as his quick arm was obscured by a long arm action and inconsistent delivery that led to inconsistent velocity, secondary pitches, and command. Just before the draft, his quick arm became even quicker and, early in pro ball, he was able to make his arm action a little shorter, unlocking perhaps the best fastball in the minor leagues. Depending on the gun, Kopech tops out at 102 or 105 mph and his plus slider gives him a clear second weapon.\n\nAs you may guess, there are some concerns about the command. Also, his changeup remains inconsistent and there are health questions simply because throwing that hard puts a greater level of stress on an arm than throwing 90 mph. He’s now performed at the upper level and is ready to fine-tune his game with a big-league look at some point in 2018. He’s not a finished product, though the loud stuff gives him a large margin for error.\n\n3. Luis Robert, CF\n\nVideo\n\nSigned: July 2nd Period, 2017 from Cuba\n\nAge\n\n19\n\nHeight\n\n6’3\n\nWeight\n\n185\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n25/50\n\n65/65\n\n30/55\n\n60/60\n\n45/55\n\n60/60\n\nChicago signed Robert for $26 million just weeks before the new CBA put a hard cap on international spending. He had been of interest to international scouts for several years because of his precocious combination of raw power and speed. About a year before he signed, Robert looked heavy and sluggish on tour with the Cuban national team in the U.S., but by the time he defected and was ready to work out for teams he had transformed his physique, putting on an absolute show in his open workout. He showed plus straight-line speed and plus power during BP.\n\nRobert doesn’t have great bat control and his ability to get the bat to the baseball might be limited, but there’s enough going on here that he has a chance to be a star anyway (teammate and fellow countryman Yoan Moncada has similar limitations). If the bat does come, he’ll be a five-tool monster at a premium position. He had a wrist injury that he’s been rehabbing in Arizona at the White Sox’ spring-training facility, but made his first appearance in a game yesterday. He’ll head to High-A Winston-Salem when he’s deemed ready.\n\n50 FV Prospects\n\n4. Alec Hansen, RHP\n\nVideo\n\nDrafted: 2nd Round, 2016 from Oklahoma\n\nAge\n\n22\n\nHeight\n\n6’7\n\nWeight\n\n235\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\n60/60\n\n45/50\n\n60/60\n\n40/45\n\n40/45\n\nA talented enigma at Oklahoma, Hansen’s prodigious stuff was finally deployed with some consistency in 2017, as he struck out a whopping 191 hitters in 141.1 innings. His fastball and curveball are both plus, while his changeup, slider, and command remain fringey. Nevertheless, fringe command is still more than a grade better than what Hansen showed in college. He’s progressing but remains a volatile prospect with No. 2/3 starter potential. Hansen has had a slow start to 2018, staying back in extended spring training in Arizona. Eric saw him pitch recently, though, and said he looked healthy and almost back to his former self.\n\n5. Zack Burdi, RHP\n\nVideo\n\nDrafted: 1st Round, 2016 from Louisville\n\nAge\n\n22\n\nHeight\n\n6’3\n\nWeight\n\n205\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n80/80\n\n60/65\n\n55/60\n\n40/45\n\nBurdi had Tommy John surgery in July and will miss most of 2018, if not all of it. He’s also a reliever with lots of effort in his delivery. Once you get past those two things, there’s only good news: he sits 97-100 and hits 102 mph, his slider is regularly plus to plus-plus, and he’s developed a changeup that’s also plus at times. The rare combination of a plus three-pitch mix and enough command to have some idea where it’s going makes him a near unicorn. From the White Sox’ perspective, the risk isn’t so great as one might think at first glance: they only need him to be healthy for his six controlled years, throwing 20-30 pitches at a time, and he was almost big-league ready before surgery. Look for Burdi to deliver on his first-round pedigree as an elite reliever for the Sox in 2019, with the upside of one of the top five relievers in the game, but plenty of risk for obvious reasons.\n\n6. Zack Collins, 1B\n\nVideo\n\nDrafted: 1st Round, 2016 from Miami\n\nAge\n\n22\n\nHeight\n\n6’3\n\nWeight\n\n220\n\nBat/Throw\n\nL/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/40\n\n70/70\n\n40/65\n\n20/20\n\n40/45\n\n50/50\n\nScouts think it’s pretty unlikely that Collins catches, at least full-time. Even with that strike against him, though — not to mention a strikeout-heavy offensive profile — it’s still likely that his combination of tireless patience and plus-plus raw power enables him to reach base and slug enough to profile even at first base. Collins could end up resembling the 2017 version of Eric Thames, except with the added value of being able to catch once in a while.\n\nWhile it doesn’t show up in his tool grades, Collins has plus-plus pitch recognition that may be best in the minors among prospects, which helps him get to his power in games and rack up walks to prop up a low batting average. His is a profile of extremes, but the end result is a solid, perhaps bland, everyday first baseman, something like a better version of Pedro Alvarez.\n\n7. Dane Dunning, RHP\n\nDrafted: 1st Round, 2016 from Florida\n\nAge\n\n22\n\nHeight\n\n6’4\n\nWeight\n\n200\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n55/55\n\n55/60\n\n50/55\n\n45/50\n\nDunning was a projection arm in high school who would run it up to 93 mph at times but did it inconsistently enough with a high enough price tag to get to the University of Florida. Despite occupying a number of roles in a deep Gators staff, Dunning excelled in Gainesville, in large part due to a heavy sinker that reached 96 mph with excellent extension. He’s also flashed an abov- average two-plane breaking ball, changeup, and command at times, which is why scouts envisioned him in a starting role.\n\nAs expected, he’s blossomed in the pros after going in the late first round and was one of the three pieces in the Adam Eaton deal, moving from Washington to the White Sox with Lucas Giolito and Reynaldo Lopez. He should spend 2018 in the upper levels and may get a look in September, but more conservatively in early 2019.\n\n45 FV Prospects\n\n8. Dylan Cease, RHP\n\nVideo\n\nDrafted: 6th Round, 2014 from Milton HS (GA)\n\nAge\n\n21\n\nHeight\n\n6’2\n\nWeight\n\n190\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCommand\n\n70/70\n\n55/60\n\n45/50\n\n40/45\n\nCease showed upper-90s velo and a potential plus breaking ball as a high-school underclassman and he’s still largely that guy, despite having encountered a couple road blocks since then. Cease was an overslot sixth-rounder in 2014, part of the same the Cubs draft in which they got Kyle Schwarber for a discount with their first pick. Cease has also had a Tommy John surgery and, on the field, has quieted his mechanics a bit, giving him a shot to start.\n\nThat being said, he’s still more a thrower than a pitcher, relying more on his power fastball/curveball combo with his changeup/command lagging behind. The fastball is still really good: 94-96, topping at 101 mph in 2016, with good extension to his delivery and plane that works well up in the zone, where he tends to deliver it. Odds are he ends up in the bullpen operating in the late innings, but he’s had a largely healthy and productive 2017 and first part of 2018 in a rotation, so there’s still a chance Cease puts it all together.\n\n9. Micker Adolfo, RF\n\nSigned: July 2nd Period, 2013 from Dominican Republic\n\nAge\n\n20\n\nHeight\n\n6’3\n\nWeight\n\n200\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/40\n\n65/70\n\n40/55\n\n50/45\n\n40/50\n\n60/60\n\nAdolfo had loud tools and questionable hitability when he was an elite July 2nd prospect, and that’s still largely the report on him. The feel aspects of the game (including defensive instincts) still largely elude him, but that’s possibly just a product of youth. On the positive side, the raw power projects for plus-plus, and his arm strength is a plus, too. The bat speed is also plus, and there’s some twitch to his game that keeps his upside high.\n\nLike Eloy Jimenez, Adolfo has demonstrated an ability to get to his big raw power in games, even while facing older competition. Unlike Jimenez, Adolfo’s pitch selection and bat control are still both below average, but early returns this year suggest he may be making some progress in both areas.\n\n10. Jake Burger, 3B\n\nVideo\n\nDrafted: 1st Round, 2017 from Missouri State\n\nAge\n\n21\n\nHeight\n\n6’2\n\nWeight\n\n210\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n35/50\n\n65/65\n\n45/55\n\n45/30\n\n40/45\n\n60/60\n\nBurger has a surprising amount of twitch, bat control, and baseball athleticism in his game for such a thick, husky frame. He isn’t especially loose or athletic in a football or overall sense, but he has explosive hands that create huge raw power, solid first-step quickness despite a more ordinary top speed, and plus arm strength. Burger knows what he is and is geared to lift the ball and hit for power, so the offensive questions revolve around maintaining his athleticism in the box and picking good enough pitches to get to his power in games, with which he’s struggled a bit against better competition.\n\nDefensively, he’ll always need some work to stick at third base, and most scouts think he eventually slides over the first, but it’s up to him how long it will be until that happens. Burger will miss all of 2018 and likely some of 2019 with a torn Achilles, which will likely put more pressure on him both offensively and defensively.\n\n11. Blake Rutherford, LF\n\nDrafted: 1st Round, 2016 from Chaminade Prep HS (CA)\n\nAge\n\n20\n\nHeight\n\n6’3\n\nWeight\n\n195\n\nBat/Throw\n\nL/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/55\n\n50/50\n\n30/50\n\n50/45\n\n40/50\n\n45/45\n\nRutherford was a hyped southern California prep prospect. Some scouts thought he was a bit overheated since he was older than his peers his whole amateur career, but no one doubted his feel to hit. The Yankees went over slot to get him in the middle of the first round in 2016 but traded him to the White Sox last year in the deal than landed them bullpen help in David Robertson and Tommy Kahnle.\n\nOnce in pro ball and facing his prospect age peers, Rutherford’s offensive skills appeared less impressive, with power and loft absent from his (still pretty) game swing. He also lost a little athleticism: once conceivably an outfield tweener, he now looks like a definite left fielder. This has made the loft/power issues more important. The feel to hit is still there, though, so if Rutherford can make some gains in the power department, there’s still low-end everyday upside here; it’s just less exciting than it appeared when he was arguably the top high-school junior in the country.\n\n40 FV Prospects\n\n12. Ryan Cordell, RF\n\nDrafted: 11th Round, 2013 from Liberty\n\nAge\n\n25\n\nHeight\n\n6’4\n\nWeight\n\n195\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n40/45\n\n55/55\n\n45/50\n\n60/60\n\n50/50\n\n55/55\n\nCordell has an unusual profile, a late-blooming 6-foot-4 athlete with plus speed, above-average raw power and arm strength, but no clear position. He’s tried the infield in recent years but doesn’t have the instincts to play anywhere other than an outfield corner at this point. Cordell has shown flashes of feel to hit and starting lifting the ball more in recent years to help him get to his raw power in games. By the end of 2018 or early 2019, he’ll be ready for a big league look to see if he can turn everyday tools into an everyday player or just a solid bench piece.\n\n13. Carson Fulmer, RHP\n\nVideo\n\nDrafted: 1st Round, 2015 from Vanderbilt\n\nAge\n\n23\n\nHeight\n\n6’0\n\nWeight\n\n195\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCutter\n\nCommand\n\n50/50\n\n55/55\n\n55/55\n\n60/60\n\n40/45\n\nFulmer has been a big name since his underclassman days in high school around 2011, when he’d run his fastball into the mid-90s while showing impressive athleticism and a three-pitch mix from a delivery that pointed to relief. He’s since made a number of changes to his mechanics, giving some scouts hope that he can stick as a starter — and he is, technically, a big-league starter right now. That said, Fulmer’s always leaned more to the power in his game and has always had some effort to his delivery, along with a quicker tempo that makes it hard to repeat that delivery. So, despite performing in the SEC and earning a place among the top 10 picks in his draft, it’s largely the same set of tools (albeit with a new cutter developed last year). He seems to be in that nexus where neither a traditional starting role nor one-inning relief spot make sense, so he may settle in a fireman, multi-inning type role in the end.\n\n14. Gavin Sheets, 1B\n\nDrafted: 2nd Round, 2017 from Wake Forest\n\nAge\n\n21\n\nHeight\n\n6’4\n\nWeight\n\n230\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n30/50\n\n70/70\n\n40/55\n\n30/30\n\n40/50\n\n50/50\n\nSheets has patience and huge raw power from the left side, but he doesn’t actualize the latter as much as you’d like to see, instead exhibiting a flatter swing plane than the platonic ideal of this profile, like Zack Collins. For a 22-year old first-day college pick with not much value in the speed or defensive departments, Sheets needs to figure how to find that happy medium of contact, patience, and power to avoid going down the same road as Casey Gillaspie (a former first-rounder who missed this list) and something more like what Jameson Fisher is doing when it comes to approach and launchangle adjustments.\n\n15. A.J. Puckett, RHP\n\nDrafted: 2nd Round, 2016 from Pepperdine\n\nAge\n\n22\n\nHeight\n\n6’4\n\nWeight\n\n200\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n50/50\n\n45/50\n\n55/60\n\n45/55\n\nPuckett wasn’t a well-known name to the public in the 2016 draft, but some teams loved him for his aggressive pitching style and the separators he possessed, both in his changeup and feel to pitch. He was traded to the White Sox from the Royals last year in the Melky Cabrera deal and projects as a back-end starter who eats innings and gets the most out of his stuff. It’s a nice type to have in a system full of more volatile, relief-risk type power arms, but the strikeout rates and prospect rankings will probably never excite White Sox fans.\n\n16. Luis Gonzalez, RF\n\nDrafted: 3rd Round, 2017 from New Mexico\n\nAge\n\n22\n\nHeight\n\n6’1\n\nWeight\n\n185\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n35/55\n\n50/50\n\n30/45\n\n50/50\n\n45/50\n\n50/50\n\nGonzalez doesn’t have huge tools. With the exception of a 55 on the bat, everything else gets average grades across the board from scouts. He profiles as an outfield tweener who can play all three spots but doesn’t have the traditional everyday profile for any of those same three spots. Gonzalez has above-average bat control and pitch selection but more of a line-drive approach that doesn’t tap into all of his raw power, so he fits more as a solid platoon/role-player type than a true everyday player.\n\n17. Seby Zavala, C\n\nDrafted: 12th Round, 2015 from San Diego State\n\nAge\n\n23\n\nHeight\n\n5’11\n\nWeight\n\n215\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n35/40\n\n60/60\n\n40/50\n\n30/30\n\n40/45\n\n45/45\n\nZavala was a later-round pick due in part to questions about his defensive quality behind the plate and his arm strength after Tommy John surgery. He’s worked his way to serviceable but is still likely more of an offensive-minded backup than an everyday quality defensive catcher. He exploded to hit 21 homers in 2017 largely by putting the ball in the air more often, helping him get to his plus raw power in games. His pitch selection and bat control are both fringy, so Zavala is more of a passable catcher who will hit for power in a part-time role than a traditional potential starting catching prospect, but there’s an obvious role for players like this in today’s game.\n\n18. Luis Alexander Basabe, CF\n\nSigned: July 2nd Period, 2012 from Venezuela\n\nAge\n\n20\n\nHeight\n\n6’0\n\nWeight\n\n160\n\nBat/Throw\n\nS/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n25/40\n\n45/50\n\n30/50\n\n60/60\n\n40/50\n\n60/60\n\nBasabe came over as one of the lesser pieces in the Chris Sale trade but with tantalizing upside. A plus runner, he has a center-field profile with average raw power and some twitch. He had a tough 2017, as his swing broke down a bit when he got too big and power-oriented. A combination of below-average bat control and some nagging injuries seemed to produce inconsistent contact quality. Basabe can still turn into an average defensive center fielder with plus run and throw tools, so the profile has some give on the offensive side. Early reports are he’s making progress in terms of quality contact this year, so he may be on the rise.\n\n19. Ian Clarkin, LHP\n\nDrafted: 1st Round, 2013 from Madison HS (CA)\n\nAge\n\n22\n\nHeight\n\n6’2\n\nWeight\n\n215\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nFastball\n\nCurveball\n\nChangeup\n\nCommand\n\n45/45\n\n60/60\n\n50/55\n\n45/50\n\nClarkin was a first-round pick out of a southern California high school in 2013 due, in part, to a heater that ran into the mid-90s and starter traits, but mostly because of his plus curveball. He still has all of those things and projects as a back-end starter, but his velocity has backed up a bit (88-91, touching 93 mph) due to Tommy John surgery and the rigors of regular pitching in pro ball. Given the plus breaking ball, if Clarkin’s stuff doesn’t play as a starter, he can always be a matchup reliever.\n\n20. Spencer Adams, RHP\n\nVideo\n\nDrafted: 2nd Round, 2014 from White County HS (GA)\n\nAge\n\n21\n\nHeight\n\n6’3\n\nWeight\n\n171\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n50/50\n\n50/55\n\n45/50\n\n45/55\n\nIn his draft year, Adams had a velo spike, hitting 96 mph. That, combined with athleticism and four pitches that graded out to average or better, allowed scouts to project mid-rotation potential. He’s still a solid athlete who runs it up to 95 mph at times with a four-pitch mix, but the velocity has settled at 90-92 mph and the slider has improved in pro ball and overtaken the curveball as his main offspeed weapon. Adams throws a lot of strikes and doesn’t have a traditional out pitch, so he fits as a back-end type along with the other starters in this range.\n\n21. Tyler Danish, RHP\n\nVideo\n\nDrafted: 2nd Round, 2013 from Durant HS (FL)\n\nAge\n\n22\n\nHeight\n\n6’0\n\nWeight\n\n200\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n45/45\n\n50/55\n\n50/55\n\n45/50\n\nDanish has always had great feel to pitch. He’s also always had a truly awkward-looking arm action and a delivery that puts a lot of stress on his arm. His low arm slot generates lots of life on his sinker, but he’s endured diminished velocity in recent years as many scouts predicted, the pitch sitting 88-90 and hitting 93 mph but also playing down a bit due to his short stride. He still knows how to sequence hitters — and his slider and changeup flash above average — but he, like Fulmer, may fit best in a one-time-through-the-order relief role.\n\n22. Jameson Fisher, LF\n\nDrafted: 4th Round, 2016 from Southeast Lousiana\n\nAge\n\n23\n\nHeight\n\n6’2\n\nWeight\n\n200\n\nBat/Throw\n\nL/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n40/55\n\n45/45\n\n30/45\n\n45/40\n\n40/50\n\n40/40\n\nFisher was one of the best performers in the country in his draft year out of Southeast Louisiana, but his lack of impact power as a corner outfielder pushed him down to the fourth round. He’s continued to perform in pro ball, abandoning the more line-drive-oriented approach of his amateur days and adding loft to his swing. Now he looks something like a solid platoon left fielder, though it’s still a hit-over-power profile. Rays right fielder Jake Bauers is a superior version of Fisher due to more twitch and athleticism, but there is some track record of advanced hitters with good pitch selection and ordinary power learning to lift the ball while adding some strength and developing more raw power along the way. The upside isn’t huge, but Fisher is making the necessary improvements to get there.\n\n23. Aaron Bummer, LHP\n\nDrafted: 19th Round, 2014 from Nebraska\n\nAge\n\n23\n\nHeight\n\n6’3\n\nWeight\n\n200\n\nBat/Throw\n\nL/L\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nChangeup\n\nCommand\n\n60/60\n\n50/50\n\n50/50\n\n40/40\n\nBummer is a sturdy lefty with a plus sinker that sits 92-94, hitting 96 mph, and two average offspeed pitches. Normally that adds up to a starter, but Bummer doesn’t have the cleanest delivery, instead fitting best in short stints where his command is better and he’s not forced to turn over a lineup. This year he’s been able to bring the effectiveness he had in the minors into a big-league role and should be losing prospect eligibility soon. He is one of the only players on this list who is a finished product, with the same present value as future value (40).\n\n24. Jordan Stephens, RHP\n\nDrafted: 5th Round, 2015 from Rice\n\nAge\n\n24\n\nHeight\n\n6’1\n\nWeight\n\n190\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nFastball\n\nSlider\n\nCurveball\n\nChangeup\n\nCommand\n\n55/55\n\n50/50\n\n55/60\n\n40/45\n\n45/50\n\nStephens pitched at Rice. That fact alone is often enough to scare most teams, due to the injury history of the program’s alums. Stephens got his Tommy John surgery before the draft and slid a few rounds to the fifth, so the White Sox thought they were getting a nice value and it appears they were right so far. Stephens sits 90-93 and hits 95 mph with a hard curveball that flashes plus and a separate slider that’s also solid. His command should be enough to continue to start, but his changeup is below average, so he’ll need to figure out a way to get high-level left-handed hitters out reliably. After a quick start to the season in Double-A, Stephens is now in Triple-A and may get a big-league look late in 2018.\n\n25. Danny Mendick, SS\n\nDrafted: 22nd Round, 2015 from UMass Lowell\n\nAge\n\n23\n\nHeight\n\n5’10\n\nWeight\n\n189\n\nBat/Throw\n\nR/R\n\nTool Grades (Present/Future)\n\nHit\n\nRaw Power\n\nGame Power\n\nRun\n\nFielding\n\nThrow\n\n45/55\n\n40/40\n\n20/30\n\n45/45\n\n45/50\n\n50/50\n\nMendick is a familiar type amongst fringe prospects: a later-round, small-school, senior-sign middle infielder with good makeup who compensates for a lack of tools by hitting more than expected. Mendick is okay at short and a hair above average at second base, where he fits better due to his average arm strength. He doesn’t have much raw power but has learned to lift the ball more in recent years. The headliner here is his above-average hit tool — due mostly to above-average pitch selection and bat control — which should allow him to hang around for a while and possibly carve out a nice big-league career.\n\nOther Prospects of Note\nGrouped by type and listed in order of preference within each category.\n\nCorner Bats\nMatt Rose, 1B\nDaniel Palka, 1B/RF\nJustin Yurchak, 1B\nCasey Gillaspie, 1B\nAlex Call, RF\nLuis Curbelo, 3B\n\nRose was the last cut from the list: he’s playable at third but below average and fits better at first base, where he has fringe contact skills but plus power. The wrong side of a first-base platoon is a tough profile, but he’s in Double-A and has performed the whole way. Palka has a little more pop and is left-handed but also older and with worse pitch recognition that should dampen some of that power against elite pitching. Yurchak is another tweener who fits best at first and lacks huge power but has bat-to-ball skills and very good pitch selection. Since college, Gillaspie has had trouble getting to his power in games, with a flatter swing plane and more contact-oriented approach, which it sounds like he’s trying to remedy this year but is having a rough go of it.\n\nUp-the-Middle Bats\nEvan Skoug, C/1B\nTito Polo, CF\nCharlie Tilson, CF\nLenyn Sosa, 2B\nAmado Nunez, 2B\n\nSkoug has poor bat control and receiving skills but solid power and patience that could help him carve out a bench role. Nunez and Sosa are athletic young infielders with bat control and some defensive value, but are pretty raw at the plate.\n\nProjected Relievers\nThyago Vieira, RHP\nJace Fry, LHP\nTyler Johnson, RHP\nBrandon Brennan, RHP\nVictor Diaz, RHP\nConnor Walsh, RHP\nJake Elliott, RHP\nZach Thompson, RHP\nJake Johansen, RHP\nIan Hamilton, RHP\nYosmer Solorzano, RHP\n\nVieira sits 96-100 and hits 102 mph, mixing in a solid-average breaking ball with some control but little command and fastball life. Fry has five pitches, all average to a bit above, and decent command but has fit best in the pen since his second Tommy John surgery. Johnson has three average or better pitches and runs his heater into the high-90s but has delivery issues and was overused at South Carolina, which led to arm issues. Brennan sits 93-97 mph with a heavy sinker and mixes in a plus changeup, but his command and breaking ball are both below average. Similarly, Diaz is up to 100 mph with an even better changeup but sits normally in the mid-90s with a below-average breaking ball and command. Walsh is up to 98 mph and mixes in a plus curveball but may have the worst command of this whole bunch of flamethrowers. Thompson is long and lanky with a power sinker up to 94 mph and a three-pitch mix that all flash above average, but has always had fastball command issues and seems like a pen fit.\n\nProjected Starters\nKade McClure, RHP\nLincoln Henzman, RHP\nBernardo Flores, LHP\nJordan Guerrero, LHP\n\nMcClure is 6-foot-7 and also came from Louisville with a innings-eater profile: 90-94, touching 95 mph, with good extension, and a slider and changeup that both flash above average at times. Henzman was an effective three-pitch reliever (heater up to 95 mph, hard slider and change) at Louisville whom the White Sox are trying as a starter. Flores’ velo was way down in 2017 (he was up to 96 mph after signing in 2016, then sat 86-89 mph in 2017), but he still has a shot to succeed due to an above-average curveball and changeup to go with good feel to pitch. Guerrero sits 88-91 mph with his sinker and has three fringy pitches that he uses to get to his plus changeup.\n\nCistulli’s Guy\nSelected by Carson Cistulli from any player who received less than a 40 FV.\n\nTi’Quan Forbes, 2B/3B\nForbes has more pedigree than most of the players who appear in this space, having received a $1.2 million bonus from the Texas Rangers, who selected him out of a Mississippi high school in the second round of the 2014 draft. In the meantime, however, his stock has dropped: he appeared 13th on the Rangers list in the 2014-15 offseason, then 23rd in the 2015-16, and the Other Prospects section last year.\n\nTraded to the White Sox at the end of last August in the deal that sent Miguel Gonzalez to Texas, Forbes has made considerably more contact so far this season than in years past, cutting his strikeout rate nearly in half relative to his previously established levels. He’s repeating High-A, but he’s also still just 21 years old, which places him on the young side for the level. The athleticism, the emerging contact skills, and the infield defense (he’s been used at second and third base exclusively this year) conspire to create a promising profile.\n\nSystem Overview\n\nThe White Sox seem to have some clear tendencies in the types of prospects they have acquired during this rebuild overseen by GM Rick Hahn: power arms rather than command ones, power bats rather than contact ones, prospects with pedigree over late bloomers. It’s produced a top-heavy system with 10-12 premium prospects for whom it’s easy to see a role on a championship club followed by depth types that are more single-tool back-of-the-roster players with limited upside than projection types with big upside. By contrast, the Braves and Padres did the same thing in their rebuilds with top-tier prospects, largely speaking, and continued looking for upside with lower-level players as well.\n\nThat’s more just a description of what’s here than a criticism, as the top two prospects, Jimenez and Kopech, were headliners in key blockbuster trades that have performed even better than most expected. They’re the types of trades that dictate if a GM keeps his job and/or if a rebuild has a chance to work in the end. There has been a college lean to the organization’s top picks in recent years, so it’s possible that the top 10 guys here will be in Double-A or higher at the end of the year. With some of the core already in Chicago, it seems like the plan is to be competitive sooner than later.\n",
      "Folder": "Feedly",
      "Timestamp": "1527650693",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.465988Z"
}