{
  "id": "ee7097d5a1b344f69818348bbccef594",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/work/1672333/blinkist-shares-the-most-popular-passages-from-its-business-book-summaries/",
      "Title": "The most highlighter-worthy ideas from popular business books, according to time-pressed readers Quartz",
      "Selection": "If you’re a voracious reader of new business titles, there’s a good chance you’ve heard of Blinkist, the app that sells condensed versions of top-selling books.\n\nThe Berlin-based startup wants to solve what it calls the “modern reading problem,” which is that no one has much time for reading anymore. The app’s writers consume books on behalf of subscribers and reduce them to texts that take 15 minutes to zip through. The company hopes you’ll call these executive summaries “Blinks.”\n\nIf that sounds gross to you, you’re not alone. On the surface (Blinkist’s native territory) the service sounds like yet another sign of our culture’s demise. Facing short attention spans and a constant need for novelty, we’re throwing in the proverbial towel, giving up on any act that stretches our ability to focus on a narrative or go deep. (“After taking Blinkist for a spin, I think it may appeal less to a time-poor, avid reader than a sweating businessman, crouched in a golf course toilet, trying to quickly brush up on his knowledge of politics or astrophysics to impress his boss,” Sian Cain writes in her review of the app for The Guardian.)\n\nSome argue that Blinkist and its competitors, like Scribd’s new Snapshots, can have a place in one’s life if applied judiciously. They ought to be prohibited as stand-ins for literary work, goes the thinking, but may be acceptable shortcuts for mainlining non-fiction. Some books, meanwhile, really are meant to be information delivery systems, not experiences. In theory, that should make Blinkist perfect for books about careers and entrepreneurship, which are often fat with repetitive anecdotes, bullet-pointed material, and rehashed descriptions of social psychology or management studies.\n\nTo get a sense of what’s resonating with US readers, who make up the bulk of the app’s 10 million subscribers, we asked Blinkist to share the most frequently highlighted passages in its career and entrepreneurship categories over the past year.\n\nThe results do seem to capture certain preoccupations in our work lives: namely a desire for grounded-ness, presence, and balance. Readers were very taken, for instance, with Blinkist’s paraphrased definition of empathetic listening, from its summary of The 7 Habits of Highly Effective People. Instructions for chilling out, distilled from Psyched Up: How the Science of Mental Preparation Can Help You Succeed (Portfolio, 2017) also ranks high on the list.\n\nTellingly, one of the top 10 passages on careering has nothing to do with achievement at work. It comes from Blinkist’s summary of No Hard Feelings, a recently published book that calls for an end to emotional compartmentalization in the office. The favored line: “If your mood and life are coming to be dominated by work, then a good approach is to simply try to care a little less about your work, and a bit more about yourself.”\n\nBelow are the full results, the best of the Blinks, so to speak. Do they accurately reflect the nuance or revolutionary spirit that helped make the books upon which they are based so popular? Tell us your thoughts—tweet to us at @QuartzAtWork, send us an email at work@qz.com, or leave a comment on the Quartz app.\n\nThe most frequently highlighted passages from Blinkist’s summaries of books about careers\n\n“Empathetic listening means active listening: repeating back to the person what they’ve said in your own words, mirroring their emotions and helping them to structure their own thought processes.” —The 7 Habits of Highly Effective People\n\n“It’s time, the billionaire said, to learn how you can transform your creativity, performance, utility, wealth and productivity. Just rising at 5 a.m. alone won’t do it…What will is the 20/20/20 formula that says you use 20 minutes to move, 20 minutes to reflect and 20 minutes to grow.”—The 5 AM Club  (Unbolded text was not part of the highlighted passage but is provided here for helpful context.)\n\n“Knowledge blindness occurs when you assess your competencies not on how you actually perform, but on general beliefs about how you should perform.”—Insight: The Surprising Truth About How Others See Us, How We See Ourselves, and Why the Answers Matter More Than We Think\n\n“Begin by breathing deeply. While concentrating on your breath, release the tension in your muscles. Then imagine that all your body’s energy is concentrated in your physical center, the point just beneath your belly button. Once it’s all there, release it.”—Psyched Up: How the Science of Mental Preparation Can Help You Succeed\n\n“What do you love so much that you’d be willing to make significant sacrifices for it?”—The Execution Factor: The One Skill That Drives Success\n\n“The possibility of receiving praise as a reward is a much stronger incentive than the threat of punishment for a bad job.”—How to Win Friends and Influence People\n\n“A great way to start a learning loop is to spend 15 minutes of your workday improving a certain skill.”—Great at Work: How Top Performers Do Less, Work Better, and Achieve More\n\n“If your type is INFJ, INTJ, ENFP or ENTP, you’re a dominant intuitive, so rather than facts, you focus on implications—all the meaning and subtext that is going on behind the facade that other people can’t see past. You’re also likely to have a strong creative streak and will be in your element if you can exercise your imagination or originality. Have you thought about a job in advertising?”—Do What You Are\n\n“This leaves us with the million-dollar question: How do you start shaking things up and improving your life? The good news is, it’s simpler than you might think. All it takes are three steps—the author calls them awakening, disrupting and designing.”—Design Your Future\n\n“If your mood and life are coming to be dominated by work, then a good approach is to simply try to care a little less about your work, and a bit more about yourself.”—No Hard Feelings: The Secret Power of Embracing Emotions at Work\n\nThe most frequently highlighted passages from Blinkist’s summaries of books about entrepreneurship\n\n“As Albert Einstein once said, ‘Failure is success in progress.’ What really matters isn’t that you managed to avoid failure your entire life, it’s that you went after your goals and learned the lessons behind the inevitable failures that came your way.”—Be Fearless\n\n“An intrapreneur takes initiative by handling what needs to be done whether or not they’re asked to do so. Intrapreneurs have the get-up-and-go to follow through with “first draft” ideas until they’re polished, profitable products.”—Think Like an Entrepreneur, Act Like a CEO\n\n“Remember: your competitors can offer similar skills, products or services, but they can’t replicate your personality, and your personality is what’s going to allow you to stand out from the crowd – so let it shine!”—Company of One: Why Staying Small is the Next Big Thing for Business\n\n“When it came to everyday work, Phil followed General Patton’s words of wisdom: “Don’t tell people how to do things. Tell them what to do and let them surprise you with their results.”—Shoe Dog: A Memoir By The Creator of Nike\n\n“[P]rocrastination can be overcome by imagining your future self.”—15 Secrets Successful People Know About Time Management\n\n“What we fear doing the most is often exactly the thing we should do to turn our dreams into a reality.”—The 4-Hour Workweek\n\n“Two words—relationships and transactions—make all the difference between a heroic working culture and a toxic one. Heroic cultures are focused on the relationships they have with their employees and clients, and unheroic ones are solely concerned with transactions.”—The Hero Factor\n\n“Winning new clients costs anywhere from five to twenty-five times more than retaining an existing customer.”—Growth IQ\n\n“What you need to do when you find yourself in a jam is follow this simple, four-step plan: slow your pace, figure out the immediate cause of the crisis, come up with a solution and, finally, proactively implement it.”—Dear Founder: Letters of Advice for Anyone Who Leads, Manages, or Wants to Start a Business\n\n“Every day, write down ten ideas on new ways you could pursue your passions.”—Reinvent Yourself\n",
      "Folder": "Feedly",
      "Timestamp": "1564006410",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.358008Z"
}