{
  "id": "ef06eba921124163804565ee3a15ca81",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guides/aa-adds-first-class-los-angeles-miami/",
      "Title": "AA Adds True First Class Miami-LAX, And You Can Book It for 25,000 Miles The Points Guy",
      "Selection": "American Airlines’ domestic fleet can be frustratingly inconsistent. While AA consistently has aircraft flying cross-country routes without power or in-flight entertainment, even in first class, you can also score lie-flat business class seats on some flights just an hour long. That’s why we at TPG dig into AA’s flight schedule every few months to let you know where you can find internationally-configured aircraft operating domestic flights.\n\nDespite this overall inconsistency, there was one route that reliably offered an internationally-configured aircraft: Miami (MIA) to/from Los Angeles (LAX) using AA’s flagship Boeing 777-300ER. However, due to schedule adjustments, that opportunity dried up back at the end of October 2017.\n\nStarting on October 4, Miami-LA got an internationally-configured aircraft once again when AA added a once-daily Boeing 777-200 to the route. Although it’s arranged as a three-class aircraft (economy, premium economy, business class), AA only opts to operate it as a two-class aircraft. This means that the lie-flat business class cabin is bookable for the standard domestic “first class” rate of 25,000 AAdvantage miles each way — without the 7,500-mile surcharge for three-class flights.\n\nB/E Aerospace Super Diamond business class on some AA Boeing 777-200 aircraft.\n\nThere are currently two versions of business class: B/E Aerospace Super Diamond or Zodiac Concept D. If you have the choice, you want the Super Diamond seats. However, the seat maps look identical, so it ends up being a roll of the dice. And either one is a huge upgrade from the standard recliner seats offered on the Airbus A321 and Boeing 737 aircraft also operating on this route:\n\nDomestic first class on AA’s Boeing 737-800.\n\nStarting June 6, 2019, American Airlines will swap the 777-200 for a daily 777-300ER flight between MIA and LAX. It’s probably not a coincidence that this is the same day that AA is adding a 777-300ER to the Los Angeles-Tokyo Haneda route. These flights will operate on the following schedule:\n\nAA 1297 — Miami (MIA) 6:50am Departure ⇒ Los Angeles (LAX) 9:05am Arrival\n\nAA 1297 — Los Angeles (LAX) 1:10pm Departure ⇒ Miami (MIA) 9:27pm Arrival\n\nWhether you get the 777-200 now or the 777-300ER starting next June, these options are a huge upgrade from the Airbus A321 and Boeing 737 aircraft on this route. On these other aircraft, chances of elites getting an upgrade isn’t great. The A321 has 16 first class seats vs. 165-171 economy seats (~10 economy seats for every first class seat) and the 737-800 has 16 first class seats vs. 144-156 economy seats (~9-10 economy seats for every first class seat).\n\nHowever, on the 777-300ER, there are a whopping 52 business class seats (not counting the 8 true first-class seats) vs. 244 economy seats — or about 5 economy seats for every business class seat. And instead of getting a reclining chair for the long cross-country flight, this upgrade will get you an excellent lie-flat business class seat.\n\nA window seat in AA’s new 777-300ER business-class cabin.\n\nThe 777-300ER is one of only two aircraft types (the other one is the “A321T”) that has a true first class cabin. This will make LA-Miami the fourth domestic route to offer a true first class cabin and service. The others are:\n\nNew York Kennedy (JFK) to Los Angeles (LAX)\n\nNew York Kennedy (JFK) to San Francisco (SFO)\n\nBoston (BOS) to Los Angeles (LAX) — starting April 2019\n\nEven in economy, this aircraft is an upgrade. The 777-300ER has in-seat power and in-flight entertainment screens at each seat — which can’t be said for all flights on AA’s A321s and 737s.\n\nIn addition, American Airlines’ 777-300ER recently went through a retrofit to add a premium economy cabin, but AA isn’t trying to sell premium economy as a separate class of service on this route. That means that the premium economy seats are being coded as Main Cabin Extra — which Platinum, Platinum Pro and Executive Platinum elites can select at booking for free. Even non-elites can select these seats for just $52-54 each way.\n\nLounge Access: As it currently stands, the Miami-LA route is not considered a premium transcontinental route. So, business and first class passengers won’t get access to the Flagship Lounge in Miami or Los Angeles, and first class passengers won’t get access to Flagship First Dining. TPG has asked American Airlines if this will be changed before the June 2019 launch.\n\nBooking with Points & Miles: When the 777-300ER starts next June, the flight is being sold as a three-cabin flight. On three-cabin flights, American Airlines AAdvantage levies a surcharge for business and first class over the standard award pricing. That means that the following rates will apply to this three-cabin flight:\n\nEconomy: 12,500 AAdvantage miles each way\n\nBusiness: 32,500 AAdvantage miles each way\n\nFirst Class: 50,000 AAdvantage miles each way\n\nHowever, there’s a cheaper mileage option. For example, you can book business-class awards through Alaska to pay just 25,000 Alaska miles plus $19 of taxes/fees each way.\n\nYou can stock up on Alaska miles by buying them for just 1.97 cents per mile — meaning under $500 each way for the cross-country business class flight. You can score a 30,000-mile bonus — plus the “Famous Companion Fare” — by signing up for the Alaska Airlines Visa Signature credit card. Or, you can transfer Marriott points to Alaska at a 3:1 ratio, with a 5,000-mile bonus for transferring 60,000 Marriott points.\n\nBut there’s an even better way to book award flights on this route — especially if you can find first class award availability. Etihad Guest will let you book either business or first class for just 25,000 miles each way. And it’s not hard to get Etihad miles, as the program is a 1:1 transfer partner of Citi ThankYou Rewards and American Express Membership Rewards. In addition, you’ll soon be able to transfer Capital One miles to Etihad at a 2:1.5 ratio.\n\nIf you don’t already have one of these three transferable point currencies, here are a few sign-up bonuses that’ll help you rack up these points:\n\nCapital One® Spark® Miles for Business: up to 200,000 Capital One miles (150,000 Etihad miles)\n\nThe Business Platinum® Card from American Express: up to 75,000 Membership Rewards points (75,000 Etihad miles)\n\nThe Platinum Card® from American Express: 60,000 Membership Rewards points (60,000 Etihad miles)\n\nCapital One® Venture® Rewards Credit Card: 75,000 Capital One miles (56,250 Etihad miles)\n\nCiti Premier Card: 50,000 Thank You Points (50,000 Etihad miles)\n\nAmerican Express® Gold Card: 25,000 Membership Rewards points (25,000 Etihad miles)\n\nOr, you can buy Etihad points for a very reasonable two cents per mile for buying its miles — even when buying just 1,000 miles. At this rate, you can score first class or business class for just $500 each way.\n",
      "Folder": "Feedly",
      "Timestamp": "1543881600",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.448134Z"
}