{
  "id": "ef941d57ed17428f80a524f9f741b8b1",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/all-about-turkish-miles-smiles/",
      "Title": "Everything You Need to Know About Turkish Airlines Miles & Smiles The Points Guy",
      "Selection": "There’s a wave of excitement whenever a transferable loyalty currency adds a new partner. We all want to know if the new partner will add value to the currency or if it’ll be another program to completely avoid. Citi recently announced that, effective immediately, you can transfer your ThankYou points at a 1:1 ratio to Star Alliance member Turkish Airlines. Today, I’ll tell you everything you need to know about the Turkish Airlines Miles & Smiles program and show you how to get the most value from any ThankYou points you decide to transfer.\n\nMost people who are familiar with the Miles & Smiles program have used the it to earn Star Alliance Gold status in order to have things like domestic United Club access. Miles & Smiles has been routinely offering status matches and challenges for the last few years. If you call and speak with phone agents or look for a landing page on the Turkish Airlines site, you’d believe nothing is available. However, according to this FlyerTalk thread, you can request a match via this web form.\n\nUtilize a Turkish status match to always have access to the new lounge at IAD or United Clubs when flying domestically.\nThe match is now reportedly only good for a four-month trial period, during which you must fly one international segment on Turkish metal to extend the match to a period of one year. Earning 15,000 status miles during that year will extend the status match for an additional year. Lately, however, flyers are having a hard time getting Turkish to honor the challenge agreement after completing 15,000 status miles, and their accounts are not being updated.\n\nOne final note before we dive into the details: The redesigned Turkish Airlines website can be difficult to navigate — if you’re having trouble getting links to load or finding the information you’re looking for, try reverting to the previous version of the website. You’ll find a link for doing so at the bottom of the homepage.\n\nEarn Miles (& Smiles)\n\nUntil this week, the only avenues for Americans to earn miles with Turkish were crediting paid Star Alliance flights to Turkish Airlines or redeeming Marriott points for Night + Hotel packages. These packages can earn you up to 85,000 Turkish miles plus seven hotel nights.\n\nWith the ability to now transfer ThankYou points at a 1:1 ratio, you can use points earned from your Citi Prestige Card, Citi ThankYou Premier and Citi AT&T Access More (no longer available for new sign ups) to quickly pad your Turkish account.\n\nThe next-easiest way to earn miles is when flying United Airlines. You can enter your Turkish number on your reservation in lieu of United and earn Miles & Smiles miles based on the following partner chart:\n\nEarn miles when flying any other Star Alliance carrier or when flying Jet Airways, LATAM and Turkish regional airline AnadoluJet.\n\nIn addition to flights, you can earn miles at 29 different hotel partners — typically a flat 500 miles per stay, or at chains like Marriott and Hilton, between 1 and 2 miles per dollar spent. You can also earn miles on hotel stays for bookings made from Pointshound.com and Rocketmiles.com. Earn up to 1,000 miles per rental from 11 different car rental companies. Earn up to 3,000 miles with rentals from Enterprise through September 30.\n\nIf you happen to be a resident of Turkey, a plethora of partners are available for you to earn miles. Some of the most unique include medical expenses, college tuition, Shell station gas fill-ups and buying Madam Tussauds Wax Museum tickets. Unfortunately, there don’t appear to be any further viable options for Americans to earn Turkish miles.\n\nRedeem Miles (& Smiles)\n\nThe Miles & Smiles program definitely has a few idiosyncrasies and basic rules you need to understand before deciding to redeem miles. I recommend reading through the FAQs if you aren’t familiar with the program.\n\nHere are a few of the most important rules to know:\n\nMiles expire three years from the time they are earned. You can pay $10 for every 1,000 miles that are about to expire and extend them for another three years.\n\nFuel surcharges can be excessive.\n\nIf you need 10,000 miles or less to issue an award ticket, you can buy them at a rate of 25 euros per 1,000 miles.\n\nThe program rules state you must have Star Alliance award tickets issued from a physical Turkish ticket office. Some people make a trek in person, but there are several reports of being able to call and have ticket offices complete the transaction over email or the phone. Turkish has offices in Atlanta, Boston, Chicago, Houston, Los Angeles, Miami, New York, San Francisco, Seattle and Washington, D.C. FlyerTalk reports the Toronto office is able to ticket over email; contact YTO.INFO@THY.COM.\n\nYou can redeem miles for someone else, but the website says the request must be made in writing. Miles & Smiles members should have a signed written request that includes name, surname, birth date and relationship to the member of the person to whom the award will be issued. You also need to share departure and arrival points, travel dates and a photocopy of your Miles & Smiles membership card, a valid ID and a written, signed request. The program says you must also complete the process to redeem miles for a spouse.\n\nTransferring and combining miles is not allowed.\n\nThe redemption scheme for Miles & Smiles at face value is quite simple. There are two region-based charts. The more expensive chart is called Seat Guaranteed, which is like a standard-level award ticket and applicable only to Turkish-operated flights. Second, the less expensive Capacity Controlled chart shows prices for the equivalent of a saver level ticket. Seats at these prices are subject to award seat availability and applicable to Turkish and Star Alliance-operated flights.\n\nYou can easily redeem miles online for Turkish-operated flights but the site won’t show you the required fuel surcharges unless you have the required miles in your account:\n\nA unique feature of Miles & Smiles is the ability to redeem miles for a companion ticket when flying a round-trip revenue flight operated by Turkish Airlines. With companion tickets, there are also capacity-controlled and seat guaranteed levels of miles required. A round-trip Atlanta-Istanbul companion ticket will cost 42,000 miles and $290 compared to 60,000 miles and $300 for an award ticket.\n\nIn addition to free flights, you can redeem miles at Shop and Miles and receive free merchandise. Turkish residents can also redeem miles for free gas at Shell stations. As always, these represent poor value and I recommend sticking to award flights.\n\nAward Ticket Fees\n\nMileage refund (assuming a no-show has not occurred): $25 for domestic ticket, $50 for international\n\nDate/time/routing change (only allowed for Turkish-operated segments for changes within the same award zones): $25\n\nNo-show fee: $50\n\nAward Routing Rules\n\nYou can redeem miles for one-way awards at half the price shown in the award charts.\n\nYou cannot mix carriers on the outbound or inbound legs ( or you’ll be charged two awards) and can never mix cabins of service.\n\nOne stopover is permitted for award flights on Turkish Airlines.\n\nFor Star Alliance awards, one stopover is allowed for economy tickets that cost a minimum of 60,000 miles, for business tickets with a minimum cost of 90,000 miles, and for first class tickets with a minimum cost of 135,000 miles.\n\nTickets can have a maximum of 8 segments.\n\nBacktracking is allowed, but the same airport cannot appear more than once in the outbound or inbound legs. There are no enforced Maximum Permitted Mileages (MPMs), but if you transit via a third region that’s more expensive than your destination, you’ll be charged the higher price.\n\nOne open jaw is permitted on round-trip itineraries.\n\nMiles & Smiles Sweet Spots\n\nThe first place to start when looking for sweet spots in region-based charts are the region definitions. In Miles & Smiles, there’s an expansive, single Far East region which covers everything from Japan to Sri Lanka. Round-trip flights within the region cost a great 40,000, 70,000 and 110,000 round-trip for economy, business and first class respectively, with one-ways costing half those totals. That means seven-hour routes like Tokyo to Singapore or Tokyo to Bangkok in Thai, Singapore or ANA business class are available for 35,000 miles.\n\nThe next region to look at is North America, which includes the US along with Bermuda, Canada, Mexico and Netherlands Antilles. Here are the round-trip prices for intra-North America flights:\n\nThat means lie-flat transcons on United for 12,500 miles cost each way. Before you get too excited, Turkish somehow manages to put extensive fuel surcharges even on domestic flights; expect to pay $117 per leg. Even then, 12,500 ThankYou points and $117 for IAD-SFO in BusinessFirst is a heck of a deal. Remember you can also visit the Caribbean (Saint Maarten and Curacao included) for those prices.\n\nThat means pending United availability, you could fly San Francisco – Newark – Saint Maarten- Washington – San Francisco all in business class for 25,000 miles and ~$300:\n\nLooking at the rest of the award chart, here are a few regions and example routes that look like good deals, pending fuel surcharges:\n\nRoute\n\nClass\n\nCost (One-Way)\n\nMunich – Tokyo – Bangkok\n\nBusiness\n\n45,000\n\nSydney – Honolulu\n\nEconomy\n\n15,000\n\nNew York – Frankfurt – Dubai\n\nBusiness\n\n47,000\n\nFrankfurt – Capetown\n\nBusiness\n\n45,000\n\nMunich – Dubai\n\nBusiness\n\n24,500\n\nBrazil – Bogota – London\n\nBusiness\n\n52,500\n\nSydney – Delhi – Paris\n\nBusiness\n\n60,000\n\nChicago – Mumbai\n\nBusiness\n\n52,500\n\nTurkish Airlines itself has a great business-class product, and round-trip from North America to Turkey only costs 90,000 miles. These flights are redeemable online and should also be an option you consider.\n\nPromos\n\nThe last item to keep an eye on for good deals with Miles & Smiles are the promos which routinely show on the special offers page. Now through September 14, you can book award travel from Istanbul to the Seychelles in business and economy for 50% off the required mileage. That means almost 18 hours in business class for 45,000 miles. Travel must be completed by December 31, 2017.\n\nBottom Line\n\nOften-significant fuel surcharges and a tedious award-booking process are notable barriers to entry for many people who would otherwise try to use Miles & Smiles. What that means to me is few people will take advantage of this great program and we hopefully won’t see any kind of devaluation in the near future. A 1:1 transfer ratio from Citi, 12,500 miles for domestic business class and several award sweet spots make Miles & Smiles an incredibly tempting destination for my ThankYou points.\n\nHave you booked a Miles & Smiles award ticket?\n",
      "Folder": "Feedly",
      "Timestamp": "1503674385",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.639283Z"
}