{
  "id": "efa4209cb48b456b9cbb331825a7da1c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/999867/j-crew-ceo-mickey-drexlers-rise-and-fall-in-one-chart/",
      "Title": "The incredible rise and fall of J.Crew Quartz",
      "Selection": "Just a few years ago, J.Crew seemed invincible. Sales were rocketing, as was the clothing retailer’s cultural cachet.\n\nNow, the brand is watching its sales plunge, and within the last two months, has announced the departures of the very people who engineered its success. In April, Jenna Lyons, the company’s iconic creative lead, left. Then just yesterday (June 5), CEO Mickey Drexler revealed he would be stepping down.\n\nIn recent years, Drexler and his team, including the designers Lyons and Frank Muytjens (who also left in April), have frequently missed the mark. This shakeup is arguably overdue.\n\nBut there’s no denying that together they defined a moment in the way Americans dressed, and that Drexler did what he was hired for, which was restore J.Crew to relevance and make it a financial success. Here’s a look back at the Mickey Drexler era, and a blow-by-blow on the incredible rise and fall of J.Crew:\n\n2003\n\nIn January, J.Crew names Drexler CEO. He joins a team that includes Jenna Lyons, the vice president of women’s design, who has been at the brand since 1990. That year, he buys the Madewell name, which he agrees later to lease to J.Crew for $1 a year.\n\n2004\n\nDrexler hires Frank Muytjens of Ralph Lauren as a men’s designer. Sales are already taking off.\n\n2005\n\nDrexler is widely praised for resuscitating J.Crew. “Mickey Drexler’s Second Coming,” reads one headline from Fortune. J.Crew absorbs the Madewell brand.\n\n2006\n\nJ.Crew has its much-anticipated IPO. It also launches Madewell as its own denim-centric label. Meanwhile, Lyons is drawing fashion-industry recognition for shaping J.Crew’s fresh, fashion-forward take on prep.\n\n2008\n\nSales slow as recession hits the US, but the J.Crew name remains hot. Lyons is named creative director, and Muytjens head men’s designer. He introduces the popular Ludlow Suit that year. Michelle Obama gives the brand a bump by wearing one of its cardigans on The Tonight Show with Jay Leno.\n\n2009\n\nUnder Muytjens, J.Crew has by now become a go-to resource for style-conscious American guys who love its slim-fitting workwear.\n\n2010\n\nTwo private-equity firms acquire J.Crew. The Wall Street Journal reports that it is seeing sales soften “amid a lack of fashion hits, discounting by competitors and Mr. Drexler’s efforts to elevate the price of some of the company’s goods to luxury status.” Drexler pointedly resists discounting. Lyons is named president of the brand.\n\n2011\n\nLyons is becoming a fashion celebrity, turning up at events such as the Met Gala. The industry loves the bright colors and splashes of sequins she has introduced across J.Crew’s womenswear. The styling in the company’s beloved catalogues gets more adventurous.\n\n2012\n\nJ.Crew peaks in terms of recent sales growth. By this point, e-commerce is spreading rapidly, fast-fashion competitors are growing in the US, and consumers are showing some reluctance to buy at full-price.\n\n2013\n\nDrexler picks longtime J.Crew designer Somsack Sikhounmuong to lead a turnaround at its flagging Madewell subsidiary.\n\n2014\n\nSales growth is slowing substantially. Mall traffic is dropping, but J.Crew is reluctant to close stores. It’s also known by this point to be frequently offering discounts, and once-loyal customers are finding the brand expensive and out-of-touch with their needs. Meanwhile, the Madewell brand shows strong growth.\n\n2015\n\nFor the first time since 2003, sales shrink for the year. The losses are worst at J.Crew, while Madewell continues to outperform its parent brand. In June, J.Crew fires Tom Mora, its head of women’s design, and elevates Madewell’s Sikhounmuong to the position. At the end of the year, the private-equity firm TPG Capital, one of J.Crew’s owners, substantially cuts its holdings in the company.\n\n2016\n\nAnother year of losses. J.Crew is now frequently discounting to keep selling, hurting margins and its brand image. Investors are concerned about the company’s sizable debt.\n\n2017\n\nIn April, Lyons and Muytjens both part ways with J.Crew. Sikhounmuong takes over as the chief designer of all lines, but J.Crew announces Lyons’s position will not be filled. Then the other shoe drops: In June, Drexler says he will step down as CEO. West Elm president Jim Brett will assume the role in July, beginning a new era for the company.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1496789513",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.591677Z"
}