{
  "id": "f05e2f5df2aa452f931b1f4ced12a80b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1505355/amazon-is-everywhere-and-companies-cant-stop-talking-about-it/",
      "Title": "Amazon is everywhere, and companies can’t stop talking about it Quartz",
      "Selection": "The modern company can work with Amazon, or work against it.\n\nIgnoring Amazon.com Inc. is no longer a viable option. The company—if company is even an adequate word to describe it—touches e-commerce, logistics, manufacturing, grocery, customer service, cloud services, hardware, robotics, artificial intelligence, the auto industry, the finance industry, real estate, health care, and fashion, among other things. The corners of the economy that Amazon has yet to reach get fewer and farther between every day.\n\nAmazon’s breadth and influence is evident not only in its recently acquired position as world’s most valuable company, or the unprecedented personal fortune of founder and chief executive Jeff Bezos (assuming his pending divorce leaves enough of it intact). It’s also apparent in just how frequently other companies wind up discussing, well, Amazon.\n\nIn 2018, executives of public companies worldwide mentioned “Amazon” in more than 2,300 calls and conference presentations, according to a Quartz analysis of transcript data from research firm Sentieo. That was slightly less than the 2,402 conversations that “Amazon” cropped up in during 2017, and far more than the nearly 1,600 transcripts the company’s name graced in 2016. Those counts exclude mentions of “Amazon” by Amazon itself.\n\n“Amazon” comes up in different contexts. Sometimes it’s a company praising Amazon as a business partner. (Salesforce co-CEO Keith Block this past November: “Amazon is a great company, they’re a super partner of ours.”) Other times it’s a boast of stacking up favorably against one of Amazon’s offerings. (Oracle’s Larry Ellison in October: “Our cloud is as easy to use as Amazon, and we have ambitions to be better.”)\n\nWhether Amazon is bad for competition is a matter for lawyers and regulators to decide. But the sheer volume of “Amazon” mentions by companies across industries and around the globe leaves little doubt of how powerful and pervasive Amazon is. Every company on some level fears an onslaught from the so-called Everything Store. Amazon’s ruthless efficiency, willingness to scrape by on thin margins, and unmitigated ambition make it the ultimate competitor.\n\n“There’s not a company in the world that shouldn’t be worried about Amazon on some level,” Robert Perdue, chief operating officer of digital ad firm The Trade DeskPerdue, said at a technology conference in September. “You can put up almost every industry sector, and some part of that sector Amazon is competing with at this point.”\n\nA bitter pill\n\nOne of the most notable industries to experience a spike in Amazon chatter over the last 18 months was health care.\n\nAmazon popped up on the health-care sector’s radar in 2017 for its rumored interest in pharmacy and drug distribution. Health-care executives were forced to address the Amazon factor so often that mentions of “Amazon” eclipsed mentions of “emergency room” in both the third and fourth quarters of that year. ”Amazon could be both a competitor in some areas and a collaborator in others,” Susan DeVore, president and CEO of health-care services provider Premier, said on an earnings call in November 2017. That December, CVS Health said it would merge with health insurer Aetna, a decision widely interpreted as a hedge against Amazon.\n\nAmazon’s rumored interest in pharmacy was substantiated in June 2018 when it bought PillPack, a prescription-management startup, for a reported $1 billion. The acquisition instantly shaved $23.5 billion off the market capitalization of the biggest 10 health-care companies.\n\nAnother shock to health care arrived earlier that year, in January, when Amazon, Warren Buffett’s Berkshire Hathaway, and JPMorgan Chase announced a joint plan to tackle health care. The companies said they would create a new venture, “free from profit-making incentives and constraints,” to reduce health care costs and improve satisfaction for their US employees. The market values of health insurance and pharmacy stocks dropped by billions of dollars. And in the first quarter of 2018, health-care companies mentioned Amazon on 54 separate calls and conferences, an all-time high.\n\nFrom online to offline\n\nAmazon buying Whole Foods was a game-changer in grocery but also in real estate.\n\nThe $13.7 billion purchase was a clear sign that Amazon, a company known for its prowess online, intended to develop a physical presence. If Amazon was doing it, other e-commerce companies were sure to follow. All of that was good news for property managers and developers, and in late 2017, real-estate executives mentioned “Amazon” almost as often as “landlord.”\n\n“As demonstrated by Amazon’s acquisition of Whole Foods … online retailers demonstrated a need for physical space for a variety of reasons,” SmartREIT CEO Huw Thomas said in November 2017.\n\nAs of Dec. 31, 2017, Amazon leased 240 million square feet of space for offices, physical stores, fulfillment and data centers, and unspecified other uses. That included leases for 465 Whole Foods stores in North America and seven internationally that Amazon gained with its June purchase of Whole Foods. As of Dec. 31, Amazon also owned 14 million square feet, most of which was used for Amazon Web Services or its international operations.\n\nThat number almost certainly rose in 2018, with Amazon’s lease of the 400,000-square-foot Expedia tower in Seattle, the expansion of its Amazon Go automated convenience stores, and its planned lease of 1 million square feet of office space in Long Island City.\n\n“We really see brick-and-mortar retail becoming relevant again,” Michael Landy, CEO of Monmouth Real Estate Investment Corporation, said on an earnings call in November 2018. “You see Amazon owning Whole Foods, Amazon Go. They’re investing at brick-and-mortar retail.” A month earlier, David Jamieson or Kimco Realty Corporation said the Amazon Go expansion demonstrated “high, high demand for great quality real estate on the small shop category.”\n\nThe customer-obsession pays off\n\nConsumer discretionary companies, which sell goods and services considered “non-essential” to consumers, are obvious competitors of Amazon.com. The sector includes Ebay, Gap, Hasbro, Macy’s, Nike, Starbucks, and Amazon itself. Amazon is the behemoth that can’t be ignored.\n\nSince 2016, mentions of “Amazon” by executives from this sector on calls and at conferences have soared. Many of these references come from companies describing how they have integrated their products and services into Amazon’s platform. “Our brand and select products are now accessible through our Harley-Davidson branded Amazon storefront,” Matthew Levatich, CEO of the motorcycle maker, said on an October 2018 call. “Amazon offers unrivaled access to hundreds of millions of potential new customers.”\n\nSuch partnerships can be seen as a deal with the devil. Nike, for example, partnered with Amazon in June 2017 to sell products directly through its website after years of resistance. The deal gave Nike access to Amazon’s estimated 80 million US Prime members. Nike also got Amazon to commit to closer monitoring of third-party merchants selling Nike wares without permission, or even sometimes Nike counterfeits. But selling on Amazon also risked diluting Nike’s premium brand, especially if Amazon pressured it into uncharacteristic price cuts.\n\nThe rise in consumer discretionary firms talking about Amazon is particularly stark compared to mentions of “Walmart” (or “Wal-Mart”), which if anything has been discussed less in recent years.\n\n“Amazon faces intense competition every day in every business we operate, from retail to entertainment to consumer electronics to technology,” an Amazon spokesman said in an emailed statement. “Retail is our largest business and it’s still less than 1% of global retail.”\n\nOne new reason consumer companies are eyeing Amazon is the company’s push into private- and exclusive-label brands. These labels are either owned by Amazon or made by another company or manufacturer and sold exclusively on Amazon’s site. These brands compete directly with name brands and house labels sold by traditional retailers, like Target’s Up&Up or Walmart’s Great Value. For the manufacturer, fashioning an exclusive brand for Amazon can be an alternative to being subsumed outright.\n\n“Amazon for a number of years had asked us to consider selling them the Carter’s brand,” Richard Westenberger, CEO of $3.7 billion baby and children’s clothing company Carter’s, said at a retail conference this past September. “For a number of reasons, we didn’t know if that made sense. So we shared that experience with Amazon and last year we launched a brand called ‘Simple Joys,’ made exclusively for Amazon Prime customers by Carter’s.” Simple Joys, Westenberger continued, was “by far the most successful” of the four brands Carter’s sold with Amazon. “Amazon uses it as their private label brand and because of that, they put more energy behind it, more marketing dollars,” he said. “It’s been a very, very good relationship.”\n",
      "Folder": "Feedly",
      "Timestamp": "1548625875",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.405032Z"
}