{
  "id": "f086da4095e1439785afec7d36d6241d",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://marginalrevolution.com/marginalrevolution/2019/09/how-harvard-makes-admissions-decisions.html",
      "Title": "How Harvard makes admissions decisions Marginal Revolution",
      "Selection": "Here are some new and very thorough results from Peter Arcidiacono, Josh Kinsler, and the excellent Tyler Ransom:\n\nThe lawsuit Students For Fair Admissions v. Harvard University provided an unprecedented look at how an elite school makes admissions decisions. Using publicly released reports, we examine the preferences Harvard gives for recruited athletes, legacies, those on the dean’s interest list, and children of faculty and staff (ALDCs). Among white admits, over 43% are ALDC. Among admits who are African American, Asian American, and Hispanic, the share is less than 16% each. Our model of admissions shows that roughly three quarters of white ALDC admits would have been rejected if they had been treated as white non-ALDCs. Removing preferences for athletes and legacies would significantly alter the racial distribution of admitted students, with the share of white admits falling and all other groups rising or remaining unchanged.\n\nAm I allowed to observe that this seems wrong to me?  And that our “liberal elite” (not my preferred term, but what you see in the discourse and I don’t know which other referent to use) has failed us?\n\nAnd from Garett Jones:\n\nControlling for academic traits and much else, being Asian American predicts a substantially lower probability of Harvard admission… And being female predicts a substantially higher probability of admission.\n\nHere is the full paper.  For the pointer I thank various MR readers.\n\nThe post How Harvard makes admissions decisions appeared first on Marginal REVOLUTION.\n",
      "Folder": "Feedly",
      "Timestamp": "1568959820",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.340856Z"
}