{
  "id": "f157062498dc41d584eaa3356ec0448c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2019/2/4/18210205/yincrow-x6-earphones-review-specs-price",
      "Title": "The Yincrow X6 cost less than $10, sound like $100 The Verge",
      "Selection": "Champion of cheap\n \nWhen I wrote about TCL’s sensational new $15 earbuds last month, I didn’t think I’d be singing the praises of a product that’s even cheaper so soon after. But here I am, marveling at the sight and sound of another pair of Chinese earphones, this time from a company I’d never previously heard of called Yincrow. A friend pointed me in the direction of the Yincrow X6, urging that I try their unfathomable performance for a sub-$10 price.\n\nIt’s going to be hard for me to write about these without making it seem like an advertisement, but seriously, the £6.91 ($9.03) that I paid for a pair of the X6s would be a reasonable price just for their shipping from China to the UK. I can’t pretend to understand the economics of running a profitable business at such pricing. One hint might be that the X6 design appears to be identical to that of the celebrated Venture Electronics Monk buds that are on sale at Massdrop for, um, $4.99. Someone, somewhere along the production chain, spent money on research and development for these earphones, but I have my doubts that it’s the companies selling the final products at such unbelievable prices.\n\nBut enough talk about the provenance of cheap gadgets. Let’s talk about why the Yincrow X6 are impressive. First and foremost, their sound belies any prejudice you might have about their design (which seems to have come straight out of the ‘90s, replete with a soft foam cover that you pull over their plastic casing). The bass that comes out of these earphones is full, powerful, taut, and richly satisfying. Put on Lorn’s The Maze to Nowhere, and try not to smile at the throbbing, rumbling, and menacing rendering that the X6s provide. Vocals aren’t overwhelmed by the pronounced bass bump of these earbuds, either, as Halsey’s Hopeless Fountain Kingdom, The Knife’s Silent Shout, and Kaytranada’s 99.9% demonstrate. The only things missing from the sound are the things I don’t want: distortion and a hot treble response. This is friendly, enjoyable sound.\n\nMy favorite budget earphones to date have been the Zero Audio Carbo Tenore, but at their price of $38 or so, they cost four times as much as a pair of X6s. I still prefer the Carbo Tenores for their more refined sound and better isolation of external noises, but the X6s aren’t far behind.\n\nThe Yincrow X6s are worn in the classic earbud style of sitting just outside your ear canal. They’re similar to a pair of Apple’s EarPods or AirPods in their light weight and undemanding fit — except they sound substantially better. As a fan of the AirPods, I don’t say this lightly. The X6s’ meatier bass response and marginally better sound isolation make them more pleasing and more practical to listen to than the AirPods.\n\nThere’s no microphone to be found on the Yincrow X6, and the wire’s connection to the earbuds has no strain relief to protect it from accidental tugs. Without wishing to encourage careless consumerism, I think the price is so low that I’d buy a fresh pair if one of these breaks. And anyone categorically in need of a built-in mic might want to check out the aforementioned Monk earphones, which include upgraded cable options.\n\nWired earphones have been growing more interesting over the past few months with the rollout of the first affordable USB-C buds like the OnePlus UBS-C Bullets, but evidently, even the old-school analog ones are capable of surprising and surpassing expectations. Growing pressure from wireless competitors is likely to push prices of wired earphones down, though I doubt Yincrow has any further to go. What the company has done with the X6 is already an exceptional outlier on the price-to-performance curve. If you still have devices with a headphone jack or a dongle you don’t hate, you really should own a pair.\n\nPhotography by Vlad Savov / The Verge\n\nVox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy.",
      "Folder": "Feedly",
      "Timestamp": "1549293182",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.402679Z"
}