{
  "id": "f190e5d2443841139143558f47a18c01",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/identities/2017/11/13/16643448/fbi-hate-crimes-2016",
      "Title": "A new FBI report says hate crimes — especially against Muslims — went up in 2016 Vox - All",
      "Selection": "The number of reported hate crimes in 2016 increased by nearly 5 percent to more than 6,100, according to a new report by the FBI.\n\nAs has long been true, hate crimes based on race were by far the biggest category, with more than half of reported hate crime incidents motivated by race, ethnicity, or ancestry. Among those, nearly half were anti-black crimes, and nearly 10 percent were anti-Latino. About one in five were anti-white, although white people were still much less likely, when accounting for total population, to suffer a hate crime than minority groups.\n\nHate crimes motivated by religion were the next biggest category, making up more than 20 percent of reported incidents. Jewish and Muslim people were the two most common targets in this category.\n\nCompared to 2015, there were increases in reported hate crimes nearly across the board. Reported anti-Muslim hate crimes rose by nearly 20 percent, anti-white by 17 percent, anti-Latino by 15 percent, and anti-Jewish by 3 percent. The number of anti-black crimes remained nearly flat from 2015 to 2016.\n\nThere were also increases in hate crimes motivated by sexual orientation — by about 2 percent — and gender identity — by nearly 9 percent. Together, those two types of hate crimes made up nearly one in five of all hate crimes reported by the FBI in 2016.\n\nNearly 26 percent of reported hate crimes were intimidation. About 24 percent were assault. More than 41 percent were property crimes. And five total were murders.\n\nThe FBI reported a nearly 7 percent rise in hate crimes in 2015, driven in large part by a 67 percent increase in reported hate crimes against Muslims.\n\nAlthough the FBI report is the most comprehensive look at the nation’s hate crimes released every year, the report is known to be woefully inadequate — because it may undercount the number by the hundreds of thousands, based on other federal surveys.\n\nBut the report gives a glimpse at the numbers in a year in which concerns about hate crimes skyrocketed due to President Donald Trump’s campaign and election. Research shows that support for Trump was driven largely by racial resentment, and Trump played into that resentment with his own racist rhetoric. As a result, Trump’s election led to widespread fears that there would be an emboldening of racist acts across America. (Indeed, some attendees at the violent protests in Charlottesville, Virginia, in August — made up of white nationalists, neo-Nazis, and Ku Klux Klan members — cited Trump as partial inspiration for the demonstration.)\n\nThe FBI report doesn’t prove there was a Trump-driven increase in hate crimes in 2016. But it shows there was, at least, an increase in the FBI’s figures that year.\n\nAmerica’s hate crime data is really bad\n\nIn the month after Trump was elected, there were more than 860 reports of hate attacks to the Southern Poverty Law Center — including school teachers making Islamophobic comments, students telling Latino peers that Trump would deport them, and outright physical violence that was seemingly motivated by racism. \n\nThere have also been reports of mosques being burned, violent attacks against Indians, and a drive-by shooting at the Tulsa, Oklahoma, headquarters for the LGBTQ organization Oklahomans for Equality. And then there were the white supremacist protests in Charlottesville, in which a Nazi sympathizer allegedly killed a woman after he drove his car into a crowd of counterprotesters. Not all of these attacks have been verified as acts motivated by bigotry, but they’re certainly a cause for alarm. \n\nThe reality, though, is it’s hard to say if hate crimes are on the rise — even after the FBI’s latest report — because the data used to track these cases is so poor.\n\nOver the past two decades, the FBI reported between 6,000 and 10,000 hate crimes each year in the US. But when the US Bureau of Justice Statistics (BJS) surveyed large segments of the population between 2007 and 2011 to try to gauge the real number of hate crimes, it concluded that there are nearly 260,000 such crimes annually.\n\nSo the FBI, although it’s supposed to be our most reliable source of current nationwide crime data, is potentially undercounting hate crimes by a magnitude of more than 40 times. Yet short of the BJS doing another in-depth survey and analysis on this issue, the FBI provides the best national data we have for more recent years.\n\nThis makes it difficult to know for certain if the number of hateful acts we have seen since Trump campaigned and was elected actually represent an increase in the total number of hate crimes. The hate crime experts I’ve talked to said there’s likely been an uptick given Trump’s rhetoric and support from white supremacists, but it’s impossible to say for sure without better hard data.\n\nWhat makes a hateful act into a hate crime\n\nBehind all of this is a simple issue: What crimes qualify as hate crimes in the first place?\n\nThe answer varies by state. The federal government has a hate crime law that bans crimes based on race, color, religion, national origin, gender, sexual orientation, gender identity, or disability, but some places don’t have such laws at the state level. That presents a major challenge: While the federal government will take on some of these cases, it doesn’t have the resources to enforce its law against all hate crimes nationwide — so a gap in state laws means some hate crimes will go unpunished.\n\nIf a state does have a hate crime law or federal law enforcement gets involved in a case, the important thing here is that someone must commit an actual crime to be charged with a hate crime. That crime can then be elevated to a hate crime if there’s enough evidence to suggest that the motive for the act was hate. But if no crime was committed in the course of someone doing something hateful, it’s a hateful act, but not a hate crime.\n\n“It could be an act of trespassing or vandalism. It could be a violent crime, like rape or murder,” Jack Levin, an expert on hate crimes at Northeastern University, previously told me. “But when the motive involves targeting someone because of a difference, then it becomes a hate crime.”\n\nAn example: A man walks into a lesbian bar and attacks one of the women there. This attack would be considered assault and battery, maybe even attempted murder, under the law. \n\nBut would it be a hate crime? For a prosecutor and police officers, there would be several factors to consider before going after the perpetrator on hate crime charges: Did the attacker yell anti-gay or sexist slurs, or otherwise say anything explicitly anti-gay or sexist? Does the attacker have a history, perhaps on social media or in other writings, of homophobia or sexism? Did the attacker purposely target a lesbian bar, or was the location irrelevant to his actions?\n\nInvestigators would piece all of this together, building up evidence to decide if there’s enough to meet standards of proof for a hate crime charge and conviction. There’s no hard rule here, and whether something is deemed a hate crime can vary from officer to officer, prosecutor to prosecutor, judge to judge, or jury to jury. But generally, once there’s a certain threshold of evidence that the attack was motivated by hate, an otherwise run-of-the-mill crime can become a hate crime.\n\nNow, if a man walked by a lesbian bar and simply yelled anti-gay slurs but didn’t attack anyone, that wouldn’t qualify as a hate crime. His speech, as reprehensible as it may be, would be protected by the Constitution. Until he commits an actual crime, his act can’t be additionally prosecuted as a hate crime.\n\n        Daniel Munoz/Getty Images\n\nThe idea, essentially, is to take extraordinary steps against crimes that can go much further than harming individual victims. “If someone assaults me because they want my money, it’s going to affect me, it’s going to affect my wife, it’s going to affect my family,” Toni Bisconti, a University of Akron professor who studies hate crimes, previously told me. “But if someone assaults me because they know I’m gay, then all of a sudden it’s going to affect people that don’t even know me. They have no idea who I am. I’m just the conduit to gay people [in that situation].”\n\nThe focus on motives in these cases can get into some legally and philosophically murky territory: Does focusing so much on what’s in a criminal’s mind allow the government to regulate a person’s free speech and expression?\n\nBisconti acknowledged that such a concern has some merit. Although she said she probably comes down in support of hate crime laws, she acknowledged, “I’m not sure it’s right to legislate someone’s brain.”\n\nJeannine Bell, a scholar on hate crimes at Indiana University’s Maurer School of Law, took a different view, arguing that it’s not really about a person’s speech or ideas but the person’s actions. “It’s not just that you dislike people of my background. You’re entirely free to dislike people of my background. It’s not that you tell me that you don’t like me. Again, entirely free to do that,” Bell said. “It’s that you selected me for some sort of criminal action because of my background.”\n\nWhatever one’s view on this debate, the central focus of hate crimes — what elevates them above other crimes — is the criminal’s motive.\n\nThis makes it very difficult to actually prosecute hate crimes. “The problem is not all hate-mongers are stupid,” Levin said. “They may not let you know that they hate the members of a particular group. They may realize that they’re better off not voicing a racial slur or [putting] racist graffiti on a sidewalk or wall of a building.”\n\nFor investigators, this is always going to make it difficult to definitively prove that an act is a hate crime. So while they might be able to land a conviction for, say, assault in the example of a man attacking a lesbian bar, they may not be able to get convictions for a hate crime.\n\nHate crime laws probably don’t deter crime, but they can still be valuable\n\nOf course, none of this matters much if hate crime laws are ineffective. So I posed a question to experts: Do hate crime laws actually deter hateful acts?\n\nEvery hate crime expert I spoke to agreed that hate crime laws probably don’t deter any crimes. And they said there’s no good research settling this question one way or the other.\n\n“I don’t think that perpetrators think about whether they’re going to commit a hate crime, look to see whether there’s a law that can be punished, and then don’t commit the hate crime when they learn it could be punished,” Bell said. “That doesn’t make sense to me.” \n\nBut experts said that it doesn’t matter if hate crime laws actually deter crime.\n\nFor one, hate crime laws do more than just enhance criminal penalties for committing otherwise typical criminal acts. They often devote funds to police departments — so they can, for example, set up an LGBTQ liaison who works closely with the community to ensure they feel safe. They also label these acts as a very specific kind of vile crime, encouraging law enforcement to take the issue more seriously.\n\n“By making it a hate crime, you call attention to it in the minds of police [and] in the minds of prosecutors,” Bell said. She said, for instance, that most hate crimes are low-level — the kinds of crimes that police and prosecutors may not pay attention to. But once these low-level acts are defined as hate crimes, then they get attention.\n\nShutterstock\n\nBisconti agreed: “Hate crime legislation allowed groups that don’t feel safe with police officers to come forward, and for police officers to understand that this really is a group that’s targeted.”\n\nMore broadly, hate crime laws also send societal signals against hate. Hate crimes are, experts said, message crimes against certain groups of people. Hate crime laws act as a countermessage to that bigotry.\n\n“Hate crime laws have important symbolic meaning,” Levin said. “Hate crimes are message crimes — that is, they send a message not only to the primary victim but to every member of this group.” He added, “That’s the kind of message that has to be counteracted. And I think hate crime laws do that. They send a message to two groups: They send it to the perpetrator, informing him that our community will not tolerate his intolerance. And then at the same time, they send a message to potential victims that they are welcome in our community.”\n\nIn fact, to the extent that hate crime laws increase prison sentences, some of the experts I spoke to didn’t see much of the value in the enhanced penalties. \n\nLevin, for one, cited the empirical evidence against expanding prison sentences. The research suggests that severity of punishment doesn’t do much to prevent crime. As the National Institute of Justice concluded in 2016, “Research shows clearly that the chance of being caught is a vastly more effective deterrent than even draconian punishment. … Research has found evidence that prison can exacerbate, not reduce, recidivism. Prisons themselves may be schools for learning to commit crimes.”\n\nIn other words, more certainty of punishment can deter crime, while more severity — through longer prison sentences — can actually make crime worse.\n\nGenerally, though, experts said that hate crime laws serve a purpose even if they don’t do much to actually deter crime — by giving marginalized communities resources to fight back and sending a message to criminals that bigotry isn’t accepted. \n\nAs long as the FBI reports an uptick in hate crimes, those resources will likely be even more appreciated in these communities.\n",
      "Folder": "Feedly",
      "Timestamp": "1510629831",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.601900Z"
}