{
  "id": "f223169dbad44c47b0f3387857c75828",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/identities/2017/2/22/14697320/jewish-cemetery-vandalism-st-louis",
      "Title": "Muslims are fundraising for a vandalized Jewish cemetery Vox - All",
      "Selection": "This week, a historic Jewish cemetery in the suburbs of St. Louis, Missouri, is in the process of rebuilding, with help from a fundraiser from concerned Muslims who wanted to demonstrate solidarity.\n\nOver the weekend, more than 150 headstones were vandalized at Chesed Shel Emeth Cemetery in University City — one of multiple instances of anti-Semitic threats that led President Donald Trump to explicitly condemn anti-Semitism and sparked a response from two Muslims, who started a fundraiser to help the cemetery make repairs. The effort has now raised more than $64,000.\n\nThe 124-year-old cemetery has been working to document the affected 154 graves —amounting to thousands of dollars’ worth of damage — and listing the damaged blocks on Facebook to notify families. On Tuesday, workers began erecting the knocked-over headstones.\n\nCrews lifting one of vandalized tombstones at Chesed Shel Emeth Cemetery in University City. 170-200 hit by vandals. http://pic.twitter.com/IMat0yCW5X\n\n— Chris Regnier (@chrisregniertv) February 21, 2017\n\nThe cemetery vandalism is part of a wave of anti-Semitic incidents\n\nReports have suggested there has been a spike in hate crime in the United States since President Trump’s election. This week, the number of bomb threats against Jewish community centers since the start of 2017 rose to 53, according to the New York Times. Still, Trump had been reluctant to condemn hatred and violence against Jews in specific terms rather than referring to “hatred.”\n\nThat changed on Tuesday. “Anti-Semitism is horrible, and it’s going to stop,” he told NBC. He called the threats “horrible” and “painful.”\n\nWhile Trump’s presidency has notably been marked by divisive political rhetoric, and given a platform to white nationalist fringe groups, the incident of violence at the Jewish cemetery has brought together community groups for the rebuilding efforts.\n\n“One measure of a community's strength is what we do in moments like this,” Missouri Gov. Eric Greitens — who himself is Jewish — wrote on his Facebook page in response to the incident. “We can choose to cower, or we can choose productive action and shared service. We can turn a vile act into a moment for resolve and a demonstration of our state's faith.”\n\nMuslim activists are fundraising in support of vandalism\n\nThere has been an outpouring of support around the vandalism at Chesed Shel Emeth Cemetery.\n\n“There is a concept in Jewish teaching and thought known as tikkun olam — It translates literally into ‘repairing the world,’ but what it means more broadly is that we all have an obligation to one another and to be of service,” wrote Greitens. “It is in moments like this that the world is in most need of repair, and we must do our part.”\n\nA fundraising campaign organized by Muslim Americans — Linda Sarsour of MPower Change and Tarek El-Messidi of CelebrateMercy — has raised more than $64,000 in support of the rebuilding efforts, more than triple the initial goal of $20,000. The funds remaining after the cemetery is restored will be contributed to repair other vandalized Jewish centers, the campaign said.\n\n“Through this campaign, we hope to send a united message from the Jewish and Muslim communities that there is no place for this type of hate, desecration, and violence in America,” the campaign wrote on its fundraising landing page. “We pray that this restores a sense of security and peace to the Jewish-American community who has undoubtedly been shaken by this event.”\n\nOn Wednesday, Missouri’s governor and community members will gather at the cemetery to help clean and repair the damage. As of Tuesday afternoon, the cemetery was able to reset about 50 headstones.",
      "Folder": "Feedly",
      "Timestamp": "1487815125",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.710657Z"
}