{
  "id": "f2347a514e1644a3b541b64ec3dcc7db",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://skillet.lifehacker.com/stainless-steel-doesnt-get-enough-love-1818582513",
      "Title": "Stainless Steel Doesn't Get Enough Love Skillet",
      "Selection": "Today, we’re talking about the most perfect cookware material on Earth: stainless steel. Before you smash that comment button, I want to make it clear that I’m not disparaging cast iron. I would never do such a thing. My 12-inch cast iron skillet is my very large, heavy son and I love him dearly (he turned 8 in July, thank you for asking). Here’s the truth, though: stainless steel is the only truly all-purpose cookware material you can buy, which is why I recommend it above all others.\n\nIt Just Works\n\nEven, Responsive Heat\n\nStainless steel’s amazing versatility lies in its responsiveness to heat adjustments. Cast iron delivers beautifully consistent cooking temperatures, but it takes forever to adapt to temperature changes. A well-constructed stainless pan distributes heat evenly and releases it quickly enough to take a covered pot of rice from a rolling boil to a low simmer without boiling over or scorching the bottom.\n\nhttp://ift.tt/2xhDzN3\n\nCracked has rounded up five simple things bad cooks (or cooking newbies) do wrong, and among them…\n\nRead more\n\nNon-Corrosive and Oven-Safe\n\nWhen it comes to stew, there’s no substitute for a long, slow oven braise—and there’s no better vessel for that than a covered stainless steel pan. This is especially true for something acidic like bolognese sauce, which you can’t safely cook in cast iron or aluminum. My personal favorite pan for oven braises is the five-quart deep sauté pan I got in my Cook’s Standard set (which I’ll talk more about later). Its wide base makes it ideal for browning ingredients in a single layer, while its straight sides accommodate a surprising amount of food. Throw on a lid and it can go straight into the oven for a nice long braise, which brings me to my next point.\n\nMulti-Use Lids\n\nI love my cast iron skillet with a fierceness matched only by my hatred for its awful hat. Trying to find a place to put down an oven-hot, dripping-with-condensation cast iron lid so you can check on your stew is a huge pain. Cleaning one, and then finding a place for it to dry, is even worse. Stainless steel lids are oven-safe too, but they’re lightweight, easy to maneuver, and dishwasher-friendly. Plus, there’s often some overlap with pan diameters in stainless sets, so one lid fits two or more pots. Finally, I love how easy they are to store — I use an IKEA accordion rack and it’s perfect.\n\nDurable and Easy to Clean\n\nThe difference between a chef and a cook is access to a dishwasher (the human, not the machine). If you’re in charge of your own cleanup, you need cookware that can be cleaned quickly, easily, and on your schedule. Unlike cast iron, non-stick, and carbon-steel pans, stainless ticks every one of these boxes and you can put it in the damn dishwasher (the machine, not the human; the latter is assault). Should you burn something on that’s not responding to a regular soap-and-water scrub, don’t panic, because God gave us Barkeeper’s Friend for exactly this reason.\n\nhttp://ift.tt/2ueCsOI\n\nIn the abstract—which is to say, if you were an extremely rich person with an army of servants to…\n\nRead more\n\nThere’s Nothing it Can’t Do\n\nAs I mentioned earlier, stainless steel is truly all-purpose, but it does some things exceptionally well. Here are my favorite applications.\n\nPan-Frying\n\nWhen used properly, a stainless steel skillet is the best pan-frying surface, period. It’s nonstick enough for perfect softly-scrambled eggs, yet sticky enough to facilitate the all-important Maillard reaction. The secret is to preheat your pan at the desired heat for a few minutes before adding the fat, then heat the fat in the hot pan for an additional minute or two. (This works at any temperature.) When you’ve got a hot stainless steel skillet coated with hot fat, nothing will stick to it—not even fried cheese.\n\nhttp://ift.tt/2ydUPlM\n\nWhen I first started cooking for myself and others, I considered a steak dinner to be the epitome…\n\nRead more\n\nBoiling and Steaming\n\nA good stock pot is a true kitchen workhorse. Whether you’re boiling three pounds of pasta, simmering a gallon of Sunday gravy, or steaming up some artichokes, a stainless stock pot will get the job done right.\n\nBraising\n\nI already talked a little bit about how much I love using a big stainless sauté pan for slow-roasted stews, but a covered stainless pan is also excellent for quick stovetop braises. The lids I waxed poetic about earlier are the true stars here: they make braising super-easy.\n\nhttp://ift.tt/2xjkJoU\n\nBraising or pot roasting is a great technique for making meat more tender. If you braise the meat…\n\nRead more\n\nIt Costs Whatever You Can Afford\n\nHigh-quality stainless steel can be found in every price range. The only kind you want is “clad” or “multi-ply,” which means it’s made from multiple layers of metal. Super-fancy clad stainless uses a copper core for heat conduction; less-expensive models generally use an aluminum core. As long as you look for heavy-bottomed, multi-ply, all-stainless construction, you can’t go wrong. Here are some recommendations to get you started.\n\nBourgie\n\nIf price is no object, All-Clad is the gold standard of stainless cookware. A ten-piece copper-core set costs about $1300; a fourteen-piece set is just under $2000. Believe it or not, you can spend even more if you want—check out Alessi pans for some real cookware porn—but I don’t condone spending thousands of dollars on cookware. Buy a reasonably-priced used car or contribute to your IRA instead, for Pete’s (or your own) sake.\n\nhttp://ift.tt/2cwC2qQ\n\nDespite their high price tags, All-Clad Tri-Ply skillets are among the most popular pieces of…\n\nRead more\n\nMedium-Bourgie\n\nBoth Williams Sonoma and Sur La Table make excellent cookware under their house brands, and Calphalon and Anolon both offer very good multi-ply stainless sets. Steer clear of the reasonably priced “Classic Stainless” sets you find in department stores, though: they lack the multi-ply construction and heft that makes a great pan.\n\nBudget\n\nShould the dystopian hellscape that is late-stage capitalism provide you no options outside of ethically-questionable Chinese knockoffs, I highly recommend a Cook’s Standard set. I’ve used mine daily for five years and it shows zero wear and tear. It was also less than two hundred dollars, but I have no plans to upgrade.\n\nhttp://ift.tt/2xiFYHs\n\nDear Lifehacker, I've had the same pots and pans for years. Some of it's starting to look …\n\nRead more\n\nVery Tight Budget\n\nIf you know what to look for, Goodwill and other thrift stores can be treasure troves. My best tip for cookware thrifting is to Google makes and models on your phone right there in the store before buying. You probably won’t find a full matching set, and you’ll absolutely have to rifle through piles of terrible thin-bottomed pots, but you also might find a really nice Calphalon pan for five bucks.\n\nWhen it comes to versatility, durability, and functionality, stainless steel is truly unmatched. If you’ve ever passed on stainless in favor of other cookware, I hope this inspires you to take a second look. You won’t regret it.\n",
      "Folder": "Feedly",
      "Timestamp": "1505943343",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.549996Z"
}