{
  "id": "f2d918e40065491fba5bae0a23174023",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1098242/silicon-valleys-fasting-craze-is-proof-that-self-denial-is-the-new-indulgence-for-elites/",
      "Title": "Silicon Valley’s fasting craze is proof that self-denial is the new indulgence for elites Quartz",
      "Selection": "Eating well has always been a marker of success. Our prehistoric ancestors received praise and renown based on the size of gazelle they hauled home, while the 1st century Roman gourmand and nobleman Marcus Apicius fed honeyed wine and figs to his pigs to fatten their livers. To eat well is to live well, or so we’ve thought.\n\nBut the concept of eating and living well is changing—perhaps nowhere more so than in Silicon Valley, where fasting is having a moment.\n\nFormer Evernote CEO Phil Libin is a fasting enthusiast, according to a splashy profile in Wired. So are Daniel Gross, a partner at Y Combinator, and entrepreneur Loic Le Meur, The Guardian reports. Kevin Rose, a co-founder of Digg, launched an app called Zero in December to help biohackers track their calorie-restricting goals. And fasters are also forming their own communities: Under the banner of WeFa.st, a fasting group run by the biohacking company HVMN, there’s a monthly “break fast” meet-up in Silicon Valley, and accompanying Slack and Facebook groups where devotees can swap tips and share stories.\n\nIt’s easy to see how the fasting trend is of a piece with other Silicon Valley obsessions, from productivity hacks to blood transfusions and meal-replacement drinks. Fasting is yet another way that tech types hope to buck the banal realities of human biology. Why eat, sleep, or take a break when you could be disrupting?\n\n In Silicon Valley, self-discipline and self-denial are the new aspirational markers of success. Traditionally, being powerful has meant being able to indulge in life’s pleasures—think of the Wall Street yuppies of the 1980s, snapping up expensive suits and binging on bottle service. But in Silicon Valley, self-discipline and self-denial, rather than abundance, are the new aspirational markers of success.\n\n“In some ways, in Silicon Valley, we’re fighting on an economic and intellectual battlefield,” says Geoffrey Woo, the co-founder and CEO of HVMN, a biohacking technology company backed by Andreessen Horowitz. At HVMN, all 12 employees, including Woo, partake in some form of intermittent fasting (IF for short), although the company does not require them to. “I think there is some sort of warrior or monk ethic that people [in the tech world] at least have some attraction towards. You’re here on a mission, the stakes can be pretty high economically, so how do you create an advantage for yourself?”\n\nThe science of fasting\n\nThe methodologies used for IF range from eating during an eight-hour window to restricting food two days a week, and people’s reasons for doing it range from effective weight loss to boosting cognitive function. For those interested in the latter, IF is not so much a diet as a lifestyle choice. It’s of a piece with tech culture’s faith in biohacking—the practice of manipulating and systematizing your biology to enhance performance.\n\nProponents say that fasting mimics the “feast and famine” cycles of our pre-agricultural ancestors. Research has shown that fasting boosts ketone levels—the acids that our bodies produce when they begin burning fat for energy, instead of carbohydrates. While more research into the effects of fasting on humans is needed, early evidence from human and animal studies suggests that calorie restriction may have positive effects not just for our metabolism, but for our brains and longevity too.\n\n Part of the fascination with fasting in Silicon Valley seems to relate to the idea that it’s a competitive advantage. “Fasting is a challenge to your brain, and we think that your brain reacts by activating adaptive stress responses that help it cope with disease,” Mark Mattson, a professor of neuroscience at Johns Hopkins School of Medicine, tells the Johns Hopkins Health Review. “From an evolutionary perspective, it makes sense your brain should be functioning well when you haven’t been able to obtain food for a while.” In other words, if our ancestors were hungry, their brains responded to that stress by working harder to find food. Why not apply that enhanced brain power to building a company, instead of hunting game?\n\nIndeed, part of the fascination with fasting in Silicon Valley seems to relate to the idea that it’s a competitive advantage. In the last few months, Woo has become a kind of de facto spokesman for biohacking and the IF community. He has a podcast covering topics including human enhancement and entrepreneurship, and his company organizes the aforementioned online and offline community called WeFa.st. He also has more than just a personal health stake in the game—the nootropic supplements that HVMN sells complement the biohacking and IF lifestyle.\n\n “What one has to do to differentiate is the focus on the mind.” Woo says it’s only a matter of time before we see fasting the way we see exercise: as a necessary offset to our sedentary lifestyle and knowledge-economy jobs.\n\n“In Silicon Valley, we’re not just in a culture of food availability, we’re being pushed food— Google gives you three meals a day plus snacks and happy hours as standard,” Woo told me. “I don’t do anything physical for my livelihood anymore. What one has to do to differentiate is the focus on the mind. I think everyone should consider fasting if they are in a context with ample access to nutrition.”\n\nAn obsession with optimizing\n\nThe question of access is an important one. Silicon Valley’s quest for self-improvement has long been tied to monetization. Tech bros don’t just want to create a meditation tool to enrich people’s inner lives; they want to make a bunch of money off it, too. And so, the trend of intermittent fasting isn’t just about giving up food for 16 hours at a stretch; it’s also about the fact that one can afford to make the choice in the first place.\n\nNiketa Kumar is a clinical psychologist based in Silicon Valley who specializes in working with underrepresented populations working in tech, including women and people of color. She sees the tech world’s interest in fasting is a kind of fusion of its interest in relentless self-improvement and worldly ambition.\n\n“I see in tech culture—and broadly in society as well—there is this fascination, sometimes bordering on obsession, with optimizing,” Kumar said. “So many of the problems that many companies in the Valley want to solve for are around these issues of being a little bit better, or more productive, or putting out higher metrics. It doesn’t surprise me that people are turning this on themselves.”\n\n “I see in tech culture that there is this fascination, sometimes bordering on obsession, with optimizing.” But the realities of fasting as a lifestyle aren’t for everyone. Scientists have called for more research to determine whether men and women respond differently to fasting, for example. And as Woo admits, “Women have an additional angle or critique around eating disorders that men don’t have the pressure of.” If Silicon Valley is embracing IF as the supposed key to cognitive advantage (and by extension, financial and professional success), it’s worth noting that there are certain biological realities and social constructs that may prevent some groups from joining in.\n\nThat’s not to say that women in the Valley are eschewing fasting. In the WeFa.st Faceboook group, the gender split is more or less even: 49.1% women, 50.5% men, and 0.4% other. However, an influential female faster in the Valley named Sumaya Kazi—who has lost more than 50 pounds using IF and wrote a guide on Medium that’s earned 300,000 hits and counting—told me that the majority of women she encounters are interested in IF for weight loss, not biohacking their way to a competitive cognitive edge.\n\nThen there’s the obvious facts that in many contexts—indeed, for some of the service workers at tech companies—not eating lunch or dinner would be the very definition of not being successful. If you have to get up at 5 am to take a bus to work, or look after small children, or basically do anything other than drive to work to sit in a knowledge-economy desk job, you’ll probably require food to keep you going. And fasting can be downright expensive. Biochemist Valter Longo sells a $300 kit, featuring kale chips and plenty of tea packets, for people who want to stick to a five-day, extra-low-calorie fast.\n\nMeanwhile, proponents like Libin make fasting sound like a rarified lifestyle, in which globetrotters save their calories for peak culinary experiences. As Wired put it: “If he’s coming through New York, he’ll plan to eat a bagel. If he is in Tokyo, he’ll have ramen and feel good about it.” The underlying message is clear: Ordinary, everyday food is for the plebes.\n\nWoo has thought about the irony of not eating as a marker of success. But he doesn’t see the criticism as a valid reason to stop. He seems earnest in his belief that fasting improves his health, and in a country where obesity is undeniably becoming the norm, he thinks it can do the same for others, too.\n\n“I think it’s kind of a false pedestal to stand on, like ‘Oh you Silicon Valley people are fasting while people are starving,’” Woo said. “What is the counter argument? Keep a standard American diet? To me, the status quo seems broken.”\n\nA matter of choice\n\nLeandra Rouse is a nutritionist and CEO of Le’ola Wellness, a corporate wellness consulting firm that works with tech companies to optimize their food and wellness programs. She notes that the culture around food and wellness in a given company is often set at the top, whether that’s extreme biohacking, group juice cleanses, or having Red Bull and Coca Cola in every conference room.\n\n“In a company setting, if the management is into a given health or wellness philosophy, [employees] do tend to idolize that. One of the companies I work at has a CEO and CFO who are super health-focused and one of them is a major biohacker,” Rouse said. “I think in this particular company, they are idolizing that idea more because they see their boss do it and they want to aspire to be like their boss.”\n\nThis kind of culture-setting concerns Kumar—especially when it’s around something as personal as food.\n\n “I don’t think humans are naturally meant to work in an office 14 hours a day.” “Everyone is welcome to do what they want to do and what works for them,” she says. “But I also think there is something about CEOs in Silicon Valley who have this power and these kinds of followings. I worry about people who think that’s the route of becoming successful and wealthy.”\n\nPerhaps the most intriguing thing about Silicon Valley’s passion for fasting is what it reveals about its deeper values. Traditionally, ascetics across cultures have practiced self-denial—eschewing the pleasures of food and sources of sensual satisfaction—in an effort to become more spiritually enlightened and gain inner peace. Silicon Valley has a kind of religious fervor for the ascetic lifestyle—whether that means living on a drink that tastes like wet cardboard, renouncing material possessions, devoting oneself to meditation, or avoiding the opposite sex. But the end goal here is not inner peace or spirituality. It’s to perfect yourself as much as possible so that you can do more, better, faster work.\n\n“I don’t think humans are naturally meant to work in an office 14 hours a day,” Kumar says of the clients who ask her for advice in optimizing their lives. “And yet there is this whole culture to be superhuman and try to ignore the parts of ourselves that really make us human.” Whether it’s possible to disrupt being human, however—with all the indulgences and vices that entails—remains up for debate.\n\nLearn how to write for Quartz Ideas. We welcome your comments at ideas@qz.com.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1507743329",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.539064Z"
}