{
  "id": "f2ea7e83cb0d470e88d61273a3dbe43c",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/india/1377219/crude-oil-us-china-trade-war-are-reasons-for-indian-rupees-fall/",
      "Title": "Here’s why the Indian rupee is in a free-fall Quartz",
      "Selection": "Asia’s worst-performing currency is simply unable to break its fall.\n\nOn Sept. 03 the rupee closed below the Rs71 per dollar mark for the first time ever. This came a mere 18 days after it ended below the key Rs70 threshold. Since January, the Indian currency has already depreciated by 10%.\n\nThe news that the Indian economy grew at a sprightly 8.2% in the April-June period, the highest in nine quarters, provided some cushion, but only so much. “…with the environment we are in right now, the rupee is more likely to track global cues,” IFA Global, a forex advisory firm, said in a report.\n\nHere are some reasons for the rupee’s incessant slide.\n\nThe triggers\n\nCrude prices: In the past many weeks, international crude oil price, which had stabilised in the April-June quarter, has been on the rise again. In the last fortnight alone, it gained $7 per barrel and the crude oil futures were trading above $75 per barrel on Sept. 03. Considering that India imports nearly 80% of its fuel needs, rising oil prices leads to a higher dollar bill which, in turn, weakens the rupee.\n\nCurrent account deficit: Rising oil prices and a weakening rupee mean that India’s current account deficit may widen to 2.8% of the GDP this financial year, up from 1.9% last year, according to a report by Nomura Research. This year, the deficit has already jumped to nearly a five-year high of $18 billion. This only adds further pressure on the rupee.\n\nInternational developments: The situation in Turkey is taking a toll on currencies of the emerging markets. Lira, the Turkish currency has already lost over 40% of its value this year. Last month, the US imposed higher tariffs on imports of steel, aluminium, and other commodities from Turkey which has set off turbulence in the latter’s economy.\n\nBesides the US-Turkey confrontation, there is also the bigger US-China trade war brewing. The two countries have also been increasing duties on each other’s goods. Some observers view this as the beginning of a new Cold War.\n\nNone of this augurs well for the Indian currency.\n\nPassive RBI: Typically, when the rupee weakens, the central bank sells dollars from its reserves to rescue it. So far, though, the Reserve Bank of India (RBI) has not intervened aggressively to shore up the domestic currency.\n\n“The intensity of RBI’s intervention has dissipated,” said Abheek Barua, chief economist at HDFC Bank, India’s biggest private lender. “While there is complete lack of communication from the RBI, comments from officials from the government and quasi-government agencies appear to give the impression that they support this fall in the rupee’s value in the interests of competitiveness.”\n\nUS economy: The dollar is having a good run this year due to an uptick in the US’s GDP numbers. That country’s economy grew 4.1% in the second quarter of this year, the fastest since late 2014. It has also been adding more jobs while average wages have picked up, too.\n\nBy all indications, most of these global cues are unlikely to change much in the immediate future. So businesses and individuals in India need to brace themselves.\n",
      "Folder": "Feedly",
      "Timestamp": "1536126288",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.442276Z"
}