{
  "id": "f2ec83827b1a4653a26a4b1ed56de051",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://awealthofcommonsense.com/2018/06/the-best-free-investing-tools-on-the-web/",
      "Title": "The Best Free Investing Tools on the Web A Wealth of Common Sense",
      "Selection": "One of the great things about the Internet is that it’s broken down many of the barriers to information that existed in the past. Investors can now become more informed than ever before if they know where to look and who to trust. You no longer have to go through the gatekeepers to access relevant financial market information.\n\nThis has leveled the playing field for the individual investor. With an abundance of information available, the winners and losers will be determined by those who are able to better process, filter and analyze the firehose of information that’s being put out there these days.\n\nI spend a lot of time looking at historical market data and am always trying to figure out more efficient ways of doing so. While it can’t help me predict the future, it can help me analyze the present and assess probabilities from the past. Historical data does a better job predicting risk than returns but that’s about the best you can do in the absence of a functioning crystal ball. I prize evidence over opinions so I use a lot of back-tested data in my work.\n\nI get a lot of questions from readers asking what data sources or models I use. I’ve been building my own excel models and formulas for a while and have access to a handful of professional subscription-based offerings. But you don’t have to spend tens of thousands of dollars on historical data providers to access useful financial data in the Internet age. There are plenty of really useful free websites out there that have historical market data, back-testing tools, risk statistics and scenario analysis capabilities.\n\nHere are a number of them that I have found helpful over the years:\n\nNYU’s stock, bond & cash historical returns\nNYU professor Aswath Damodaran uses this site to update the performance numbers for stocks (S&P 500), bonds (10-year treasuries) and cash (3-month t-bills) once a year. It shows the annual returns for these three asset classes going all the way back to 1928. You can also download an excel file that contains historical interest rates, bond yields, and dividend yields. I use these numbers frequently.\n\nPortfolio Visualizer\nThis site has one of the best free asset allocation back-testing programs I’ve come across. There are probably 20-30 different asset classes and sub-asset classes you can back-test to the 1970s with historical returns, drawdowns, real (after-inflation) returns, and growth of your initial investment. This site also allows you to perform Monte Carlo simulations on withdrawal strategies, correlation matrixes between different assets, risk factor analysis and back-test real world portfolios using actual mutual funds and ETFs. That this website is available for free is pretty remarkable.\n\nRobert Shiller’s online data\nShiller has one of the longest running data sets I’ve seen. His famous CAPE spreadsheet has the monthly stock price, interest rate, earnings and dividend data going back to 1871. This site also has his comprehensive real estate data on home prices going back well over 100 years.\n\nTwitter\nPeople on social media love to complain about social media but I find a ton of value in the information I receive from Twitter. I’m constantly finding helpful research, graphs, data and analysis that I wouldn’t be exposed to otherwise. Twitter is my go-to source for what’s going on in the world of finance and the markets along with under-the-radar research.\n\nFama-French\nKen French updates this site using much of the research he’s done over the years with Eugene Fama. This one is a factor investing nerd’s dream, although the site does take some time to figure out how to use efficiently (at least in my experience). French updates his data regularly with historical returns on factors such as small-cap stocks, value stocks, quality stocks and momentum stocks going back to the 1920s. This site also has great data on sector and industry historical returns. All of the data is easily exportable to excel.\n\nCredit Suisse Global Investment Returns Yearbook\nResearchers Elroy Dimson, Paul March, and Mike Staunton update this report once a year with numbers on stocks, bonds, and inflation going back to 1900 for a number of different countries. It’s worth it to go through the entire report at least once.\n\nMSCI\nMSCI provides the most comprehensive free source of historical market data on foreign stock markets. They have performance numbers going back to 1970 for different countries, regions, and markets, both developed and emerging.\n\nAbnormal Returns\nThe best curated content each and every day on investing, personal finance, research and anything else in the world of finance. If you miss anything worth reading you can be sure it will be here.\n\nFederal Reserve Economic Data (FRED)\nEcon geeks love this site because the Federal Reserve has data on almost anything related to economics you can think of. There’s also plenty of good market data on stocks, bonds, and interest rates as well. And the site allows you to personalize the graphs and datasets.\n\nMorningstar\nI find that Morningstar has the best data on mutual funds and ETFs for performance purposes. You can see annual returns going back 10 years, and monthly and quarterly returns going back 5 years. They provide after-tax returns and fund behavior gaps, which I find really useful for seeing what investors are actually earning in these funds. You can also find breakdowns of fund holdings, investment styles, geographic allocations and more.\n\nYahoo! Finance\nI like Yahoo! Finance for daily historical data on stocks, interest rates, and indexes. They also have annual and quarterly performance numbers for mutual funds going back to inception, many of which give you decades of returns.\n\nPortfolio Charts\nThis is another great asset allocation back-testing tool that allows you to see how a number of different well-known portfolios have performed over the years. This site has the best visuals of any I’ve played around with. You can also stress-test a large number of asset classes and strategies.\n\nAnd here are a few more I’ve used over the years:\n\nFeel free to shoot me an email if there are any that I’ve missed and I’ll be sure to add them to this list.\n\nFurther Reading:\nOn the Merits of Being a Financial Historian\n\nUpdate: Here are the many suggestions I received from my readers for some of their favorites:\n\nThis post originally appeared on March 17, 2017.\n\n \n\n\n",
      "Folder": "Feedly",
      "Timestamp": "1530391591",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.457099Z"
}