{
  "id": "f2fad50a99f14e3f85e22c56117e1f59",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.boardingarea.com/las-vegas-easy-wins/",
      "Title": "Las Vegas easy wins Frequent Miler",
      "Selection": "This past weekend, I was in Las Vegas. While Las Vegas is a love-it-or-leave-it destination for many, the undeniable fact is that it draws millions of visitors each year. When I took my first trip to Vegas almost 20 years ago, I had $258 to my name. I needed to find the various hacks to enjoy Vegas on a budget — and so I did the research to know where to get a 3/4lb hot dog for $0.99 (Westward Ho), one dollar blackjack (Sahara), a free ice cream social with Elvis (Fitzgerald’s) and all-you-can-eat pancakes for less than $3 (Riviera). None of those casinos even exist anymore (that makes me feel old), but (thankfully) I’ve moved on from chasing after cheap hot dogs to finding bigger easy wins in Las Vegas by leveraging loyalty programs and credit card benefits along with some of the traditional Las Vegas hacks. Here are a few small hacks to make your next trip a winner from the start.\n\nStatus match to Caesar’s Diamond / MGM Gold for great benefits\n\nI recently wrote about hopping on the status-match-go-round by matching credit card hotel status to Wyndham Diamond in order to end up with Caesar’s Diamond status. In Atlantic City, reports indicate that you can match that status to MGM Gold (unlikely to work in Las Vegas). Hyatt Explorist members or higher can status match to MGM Gold by linking their accounts online.\n\nEach program has some useful benefits. For example, MGM Gold status gave me access to the Gold & Platinum check-in line at Mandalay Bay. Check-in lines in Las Vegas can easily be an hour long at busy times. See this line at Mandalay Bay this past weekend:\n\nYou’ll notice the line extended into the brightly over-exposed part of that image where it wrapped around several times on the right. If you look at the left side of the desk (the side perpendicular to the check-in line), you’ll see no people waiting (maybe you can make out an agent in the distance if you zoom in on that left side of the desk). That’s where I checked in as an MGM Gold member, walking directly up to an agent without waiting at all.\n\nIn fact, avoiding the wait is one of the key benefits of status in Las Vegas as upper-level status means you can often skip the line at restaurants/buffets, rewards desks, taxi stands, etc. You’ll also get free parking — by status matching on both sides, I could have parked for free at most of the Las Vegas Strip casinos had I rented a car. It never hurts to flash your Player’s Club card in Vegas and at least ask if there are any benefits available based on your status, which could vary from discounts to free drinks.\n\nCaesar’s Diamond status is particularly good. As I previously reported in the status matching post linked above, Caesar’s Diamond status will get you 2 free show tickets each month and a “Diamond Celebration Dinner” once a year — essentially a $100 dining credit voucher. I’ll cover my experience with that in a separate post, but the short version of the story is that the credit posted quickly after matching, it was easy to use, and more than one member can use his/her celebration dinner at the same meal.\n\nHaving status with either program can also give you access to room offers that can help you save money on your stay — more on that under “even better deals for elite members” below.\n\nChase Luxury Hotels: better than Fine Hotels & Resorts for Las Vegas\n\nEnjoying free room service breakfast with a view of the planes landing at McCarran airport thanks to booking through Chase Luxury Hotel Collection.\n\nOn previous trips to Las Vegas, I’ve found American Express Fine Hotels & Resorts to provide a nice win in terms of benefits and price. My personal favorite hotel listed in the Las Vegas Fine Hotels & Resorts is Delano. I love Delano because it’s an all-suites property (true suites with a separate bedroom / living room and 2 bathrooms) and while it is connected to Mandalay Bay by a hallway, there is no casino in Delano itself. Further, you get access to the Mandalay Bay pool (“The Beach”), which includes a lazy river (that I would classify as more ambitious than lazy — it had quite a current).\n\nThe bedroom in a standard room at Delano, my preferred place to stay in Las Vegas.\n\nAs a reminder for those unfamiliar with American Express Fine Hotels & Resorts, Amex Platinum cardholders (both business and personal) can book select hotels and resorts through Amex Fine Hotels & Resorts in order to receive the following benefits:\n\nDaily breakfast for 2\n\nA “local amenity” (generally some type of credit worth $100) once per stay\n\nGuaranteed 4pm late checkout\n\nNoon check-in (upon availability)\n\nRoom upgrade\n\nUnfortunately, Amex updated benefits at Las Vegas hotels last year. Whereas several Las Vegas casino resorts used to offer a $100 dining credit, all of the Las Vegas properties on FHR now  offer a spa credit for the “local amenity”. That’s not so exciting to me as I’m not much of a spa person and I know that $100 likely won’t cover most of the treatments, meaning that it’ll cost me money I didn’t intend to spend to take advantage of that benefit.\n\nHowever, this time around, I thought to check my options via Chase Luxury Hotel Collection (a program available to those with select Chase credit cards). I’ve previously written about Chase LHC and compared it to Fine Hotels & Resorts – even specifically comparing Las Vegas hotels and benefits. I was pleasantly surprised when I found that Chase Luxury Hotel Collection still offers a resort credit or food & beverage credit at many of the Las Vegas properties rather than a spa-only credit (and it further includes more Las Vegas properties than FHR, like Mandalay Bay shown below).\n\nResort credits can typically be applied to restaurant charges (at select restaurants), and I know I’ll definitely spend money on food while in Las Vegas. Furthermore, rates were decent for the first night I’d need to book in Las Vegas: Delano was available for $109 before tax and resort fee (around $160 all-in). I knew from past stays that breakfast for 2 could be eaten in the restaurant or used as a $60 credit towards room service breakfast. Essentially, I’d be paying $160 and getting $160 in credits ($60 specifically for breakfast and $100 that could be used as I pleased). That’s definitely not quite a wash as I wouldn’t ordinarily spend $60 on breakfast and tying up $100 towards a specific selection of restaurants at Mandalay Bay & Delano certainly isn’t equal to $100 cash. Still, that seemed like a good enough deal for me to book one night through Chase Luxury Hotel Collection. I was further happy when I was offered a 4pm late checkout (the Chase LHC site says it is based on availability). The late checkout meant I was able to use part of the resort credit towards lunch the next day. Also potentially notable: the $100 resort credit from Chase LHC does not need to be used in one shot and even works at Starbucks. While Starbucks did not sell gift cards, they did have plenty of merchandise. I intentionally tried charging a merchandise item to my room and sure enough it was erased by the resort credit. Note that the resort credit does not apply to service charges (like the delivery fee for in-room dining) or any gratuities.\n\nI ended up booking a single night through Chase LHC. I was actually staying in Las Vegas for 4 nights, but I did not book the next 3 through LHC. That’s because I had access to….\n\nEven better deals for elite members\n\nAs an MGM Gold member, I frequently (every week or two) receive emails from MGM properties with offers for cheap or complimentary room nights, despite not being any type of high-rolling gambler (I usually play poker if I gamble and I may sit at a $5 or $10 blackjack table for an hour now and then, though not at all on this trip). Offers run the gamut: I frequently see offers for 3 or 4 complimentary nights in standard rooms at places like Luxor and Excalibur, but may only see 1 or 2 free nights at mid-tier properties and only a discount on higher-end resorts (surely this varies some with gambling activity).\n\nFor this trip, I had received an offer for up to 2 complimentary nights at Mandalay Bay (the best offer I received for Delano was rates “from $55 per night”, though rates were higher during my dates). Looking at the availability calendar, I saw that I could book 2 nights for free at Mandalay Bay (paying just the resort fee and resort fee tax) and a third night for $25. That beat paying for additional nights at Delano through Chase Luxury Hotel Collection even though booking through the M Life offer for 2 free nights didn’t come with any dining credits. I hadn’t previously stayed at Mandalay Bay, but knew I liked the pool from past stays at Delano and since the hotels are connected it would be easy to switch rooms after spending the first night at Delano. That seemed like a win to me. More on how I parlayed this offer into something even better in a minute.\n\nAfter checking out from my stay, I’ve already received an email offer that I found interesting since I didn’t do any gambling at MGM properties, but did book one night via the Luxury Hotel Collection and subsequently charged several expensive meals to our room (since I charged meals for our entire group to my folio to collect double Hyatt points via a current promotion, which stacks with 1,000 points back per night). My new offer is for a daily dining credit:\n\nI looked up dates at Delano later this year and found that some nights are as cheap as $74 (before tax and resort fee) and stays at Delano could be booked with a $60 daily food & beverage credit. That comes out to around $125 all-in, which isn’t a bad deal when bundled with a daily $60 dining credit (though keep in mind that Chase Luxury Hotel Collection bookings do come with a daily allowance of $60 towards breakfast, so you may still be better off booking shorter stays through Chase LHC for the $100 resort credit). Offers for M life members aren’t always better than booking via Chase LHC or Amex FHR, but they can be pretty good.\n\nOn the Caesar’s side, I previously covered the fact that Caesar’s offers rooms at some resorts quite cheaply or even complimentary, and Diamond members  pay no resort fee — so free is free.\n\nOne of my family members spent a few nights at Rio before we arrived and wasn’t thrilled — though I have to imagine that for free, she might have been more forgiving. Another family member used the status match at Caesar’s to get a room at The Linq for less than it would have cost to book Excalibur.\n\nOn that note, if and when you aren’t satisfied, it’s always a good idea to:\n\nNegotiate and ask for what you want (e.g. “the $20 trick”)\n\nOne of the Las Vegas hacks you’ll hear most often referenced is “the $20 trick”. This basically refers to offering the possibility of a $20 tip to the front desk person in exchange for a complimentary upgrade. This won’t always work (and in fact may require more money at nicer properties). This is usually done by conspicuously holding a $20 bill in hand and asking if there are any complimentary upgrades. If there are (and it’s one with which you’re satisfied), you’d then pass the $20 to the desk person in between your license and credit card.\n\nI decided to give the $20 trick a try at Mandalay Bay. I was moving from Delano (where I’d booked the first night through Chase Luxury Hotel Collection) to Mandalay Bay for the next few nights under my M life Gold offer for a couple of free nights — potentially leaving a suite for a (nearly free) regular king room. Traveling with a baby, I’ve come to really value suites as our son just sleeps much better in his own space. I went to the desk at Mandalay Bay hoping to negotiate an upgrade to a suite.\n\nThe desk agent was initially pretty enthusiastic and said that he could absolutely upgrade me to a ~600 square foot “suite” that would have plenty of space, though maybe not the best view. I let him know that the view was of secondary importance to us (the extra space of a suite was key). He assured me that the room would be spacious, but then mentioned it was just one larger room with a separate sitting area, not a traditional 1-bedroom suite (something I’d more typically classify as a “junior suite”). I let him know that I was really hoping to have something with a separate bedroom so we could put the baby to bed and still be able to move around and converse without disturbing him. The agent said most of those rooms were sold out for the weekend, but he could offer me a massive 1600sq ft suite for $100 per night (couldn’t be done complimentary). I didn’t care that much about the suite (despite the fact that I’m still curious about what that room looked like). So I pushed back a little, repeating that we were really hoping for a 1-bedroom suite. He then asked me, “Do you like Delano?”. I perked up and let him know that I like it quite a bit. He then offered to move my reservation to Delano and upgrade me to a panoramic suite with a nice strip view for the same deal (2 complimentary nights plus one for $25). Um, yes please.\n\nMoral of the story: if at first you don’t get what you’re looking for, ask/bribe. Could I have gotten the huge baller suite if I’d have increased my tip offer? I think I probably could have, but I was happy to pay $20 to get a suite at Delano instead.\n\nRideshare instead of shuttle\n\nOn past trips to las Vegas, I’d taken one of the many airport shuttles offered from McCarran Airport to the strip casinos. Those shuttles typically charge from $8 per person each way to get to or from hotels on The Strip. However, if you’re traveling with at least 2 people, you can probably save money with Uber or Lyft. For example, even with an evening theater / dinner time arrival, an Uber from the airport to Delano was less than $12. Signs within the airport guide you to rideshare pickup, which is popular but we found to be pretty well organized and faster than we thought it might be after seeing the number of people waiting when we arrived.\n\nBottom line\n\nThese are just a few current Las Vegas hacks that came in handy this time around. Without wagering a dime, we walked away feeling like we won at least a little via status we didn’t quite earn and leveraging credit cards for better benefits. Those same tactics can obviously help you in places other than Las Vegas — but if you’re planning a trip to Sin City, the techniques above certainly can enhance your stay.\n\nEarn Miles Without Flying: START HERE\t\n\nThe post Las Vegas easy wins appeared first on Frequent Miler.",
      "Folder": "Feedly",
      "Timestamp": "1557890640",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.372698Z"
}