{
  "id": "f3a5f012f4c3480ca2831c0684e5dec9",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/hyatt-club-lounge-awards-m-life-status-match/",
      "Title": "Last Chance Earn Hyatt Club Lounge Access By Matching M Life Status The Points Guy",
      "Selection": "Hyatt and M Life have a relationship where you can match your elite status in one program to get a status match and perks in the other program. Even if all you have is Hyatt Discoverist elite status from the World of Hyatt Credit Card, that matches to M Life Pearl status and provides tangible perks, including free parking at M Life properties in Las Vegas.\n\nThat’s all valuable even at face value, but for years, there has been a really fun merry-go-round of elite status matches available with Hyatt and M Life that could perpetuate itself if you matched your status levels each year. If done correctly, you could put four Hyatt lounge passes (aka Hyatt Club Access Awards) in your virtual pockets each year with very little effort. This helped travelers save lots of money on food and drinks by enjoying Hyatt lounges on vacation in places like Grand Hyatt Kauai, Grand Hyatt Baha Mar, Hyatt Regency Coconut Point and beyond.\n\nSnacks in the lounge at Hyatt Coconut Point\n\nSadly, that specific status matching merry-go-round perk is likely closing for good on March 1 as the way Hyatt awards annual lounge passes is changing on that date. Beginning March 1, Hyatt Club Access Awards will no longer be awarded all at once with Hyatt Explorist elite status. Instead, they’ll be awarded based on your activity in Hyatt’s program, starting at 20 eligible nights in a calendar year.\n\nHowever, if you have M Life Gold status or above right now (even if you “earned” it by matching from Hyatt), you can potentially match that status back to Hyatt by Feb. 28 and earn a final round of four easy Hyatt Club Access Awards and Hyatt Explorist status that’s valid for another year.\n\nFor those looking to match (or re-match) their M Life status to Hyatt before March 1, here are the steps:\n\nHead to this M Life page and log in to your M Life account.\n\nScroll down to World of Hyatt Tier Match and select “Opt In.”\n\nEnter your World of Hyatt account information and sign in to your Hyatt account.\n\nYou should then be able to link your accounts and receive four additional Club Access Awards with a successful status match.\n\nNote that you may get an error message if your accounts are already linked, but that doesn’t necessarily mean it didn’t work. Try logging out of your Hyatt account and then logging back in to see if your four Club Access Awards have indeed been deposited in spite of the error message.\n\nNote that if you currently have Hyatt Globalist status, even if it is expiring after tomorrow, this status match from M Life doesn’t seem to work, as the system says your Hyatt status tier is already higher than what would be matched.\n\nIf you’re sad that this pathway to Hyatt club lounge access is closing, you could always ramp up the spending on your World of Hyatt Credit Card. That card comes with five annual elite qualifying nights and you can earn two more for every $5,000 you charge to the card. You only need to get to 20 annual nights with Hyatt to earn two lounge passes, so some Hyatt stays (remember, even award nights count) plus some spending on the card should get you there in no time.\n\nBottom Line\n\nTo earn a final round of easy Hyatt club lounge access passes for the next year, be sure and act on this status match now as the new rules for earning lounge passes based on Hyatt activity begin on March 1.\n\nFeatured image by author.\n",
      "Folder": "Feedly",
      "Timestamp": "1551336350",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.422108Z"
}