{
  "id": "f48d0424f82148c7862ad1c103d435ba",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.core77.com//posts/58555/Check-out-the-Features-of-a-95000-Luxury-Tiny-House",
      "Title": "Check out the Features of a $95,000 Luxury Tiny House Core77",
      "Selection": "There are two main aims with the tiny house movement. The first is to reduce your footprint, doing more with less. The second is that it's supposed to be cheap, as in sub-$50,000. But looking past the second aim, a company called New Frontier Tiny Homes is betting that there's a market for luxury versions, and has thus created a $95,000 model.\n\nCalled the Alpha, it features reclaimed barnwood, walls that are spray-foam-insulated, hardwood floors, a ductless mini-split for the A/C and heat, granite countertops in the kitchen and a few interesting design tricks. Let's take a closer look.\n\nHere's the front of the Alpha, which features sliding glass doors.\n\nEnter a caption (optional)\n\nOn the back we see this shou-sugi-ban-finished center portion.\n\nEnter a caption (optional)\n\nThat flips down to provide a deck.\n\nEnter a caption (optional)\n\nEnter a caption (optional)\n\nJust inside the deck is a glass garage door that slides open.\n\nEnter a caption (optional)\n\nMoving to the interior, on one side we've got the kitchen, which you'll notice is elevated. We'll get to why in a minute.\n\nEnter a caption (optional)\n\nInside the kitchen is a 33\" stainless steel sink;\n\nEnter a caption (optional)\n\na drawer-style dishwasher;\n\nEnter a caption (optional)\n\nan 11-cubic-foot stainless steel 'fridge;\n\nEnter a caption (optional)\n\nand a sleek-looking induction cooktop.\n\nEnter a caption (optional)\n\nOpposite the kitchen we've got the bed loft.\n\nEnter a caption (optional)\n\nYou ascend it by means of this ladder.\n\nEnter a caption (optional)\n\nWhen it's not in use, you can put on a felt ladder-moving hat and tuck the ladder away in this compartment.\n\nEnter a caption (optional)\n\nThe bed loft will fit a king-sized bed. \n\nEnter a caption (optional)\n\nBeneath the bed loft is the bathroom, which contains a washer/dryer combo unit;\n\nEnter a caption (optional)\n\na small sink;\n\nEnter a caption (optional)\n\na composting, separating toilet that vents to the outside;\n\nEnter a caption (optional)\n\nand a full-sized Jacuzzi tub.\n\nEnter a caption (optional)\n\nHere's the view from the throne.\n\nEnter a caption (optional)\n\nAnd at the front of the bathroom is a tiny, and I mean tiny, closet. There's room for two of Indiana Jones' jackets and little else.\n\nEnter a caption (optional)\n\nNow we get to why the kitchen is elevated. Anytime you want to have people over for dinner, Chris Hemsworth's body double comes over and pulls out these benches.\n\nEnter a caption (optional)\n\nEnter a caption (optional)\n\nThe stairs to the kitchen pull out…\n\nEnter a caption (optional)\n\n…revealing a folding table hidden within.\n\nEnter a caption (optional)\n\nNow you can host dinner parties. \n\nEnter a caption (optional)\n\nBut whomever's house this is apparently has lousy friends; while you can see that the table has clearly been set in the evening…\n\nEnter a caption (optional)\n\n…these jerks don't even show up until morning the next day.\n\nEnter a caption (optional)\n\nI'd never invite them back. I'd be like \"Why are you animals standing on my animal furs with your filthy shoes on?\"\n\nEnter a caption (optional)\n\nYou can learn more about the Alpha, including lower-priced versions of it, here.\n\n",
      "Folder": "Feedly",
      "Timestamp": "1480713730",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.687322Z"
}