{
  "id": "f4bb27172bc746e6b6c8832cd686fa04",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/world/2017/10/2/16396612/las-vegas-mass-shooting-terrorism-islam",
      "Title": "White American men are a bigger domestic terrorist threat than Muslim foreigners Vox - All",
      "Selection": "Since Trump took office, more Americans have been killed by white American men with no connection to Islam than by Muslim terrorists or foreigners. \n \nWhen President Donald Trump signed his since-revised executive order banning people from seven Muslim-majority countries from entering the United States, he claimed it was to protect Americans from “radical Islamic terrorists.” \n\n“We don’t want ‘em here,” Trump told reporters at the Pentagon, where he signed the order in January. \n\nBut in the eight months since Trump took office, more Americans have been killed in attacks by white American men with no connection to Islam than by Muslim terrorists or foreigners. \n\nRadical Islamic terrorists inspired or directed by groups like ISIS and al-Qaeda do pose a clear threat to the US. There is no question about that. Before last night’s deadly shooting in Las Vegas, the deadliest mass shooting in modern US history occurred in June 2016 when an ISIS-inspired man opened fire in a gay nightclub in Orlando, Florida, killing 49 people and wounding 53. \n\nAnd ISIS-linked militants have killed or injured dozens of people in countries like England, France, and Canada so far this year, including two women killed in a stabbing attack in Marseille, France, and several people injured in a car-ramming attack in Edmonton, Canada, just this weekend. \n\nBut here at home, the bigger threat has come from a very different kind of attacker, one with no ties to religion generally or Islamist extremism specifically.\n\nHere are just a few of the attacks that have occurred in 2017:\n\nSunday night, a 64-year-old white man from Nevada opened fire on a crowd of more than 22,000 people at a country music festival in Las Vegas, killing more than 50 and wounding more than 200. \n\nIn August, a 20-year-old white Nazi sympathizer from Ohio sped his car into a crowd of anti-racist protesters in Charlottesville, Virginia, killing a woman and injuring at least 19 others.\n\nIn June, a 66-year-old white man from Illinois shot at Republican Congress members during an early morning baseball practice, severely wounding several people including Rep. Steve Scalise of Louisiana, the House of Representatives Majority Whip. \n\nIn March 2017, a 28-year-old white man from Baltimore traveled to New York City with the explicit aim of killing black men. He stabbed 66-year-old Timothy Caughman to death and was charged with terrorism by New York state authorities.\n\nIn May, a 35-year-old white man from Oregon named Jeremy Joseph Christian began harassing Muslim teenagers on a train in Portland, telling them “We need Americans here!” Two men interceded; Christian then stabbed and killed them both.\n\nIn fact, between 2001 and 2015, more Americans were killed by homegrown right-wing extremists than by Islamist terrorists, according to a study by New America, a nonpartisan think tank in Washington, DC. \n\nA June 2017 study by Reveal and the Center for Investigative Reporting found a similar pattern:\n\nEven the “radical Islamic terrorists” are usually US citizens\n\nIn Trump’s very first speech to Congress, he claimed that “the vast majority of individuals convicted of terrorism and terrorism-related offenses since 9/11 came here from outside of our country.”\n\nBut none of the perpetrators of the major US terrorist attacks carried out in the name of Islam in the past 15 years have come from the nations on Trump’s travel ban (either the original one or the new, revised version that was released late last month). In fact, the country home to the biggest number of terrorists who have carried out successful attacks inside the US is the US itself. \n\nThe San Bernardino shooting that killed 14 people was carried out by an American-born US citizen of Pakistani descent and a lawful permanent US resident of Pakistani descent. The Orlando nightclub shooter who murdered 49 people was an American-born US citizen of Afghan descent. The Boston marathon bombers, who identified as ethnic Chechen, came to the US from Kyrgyzstan and grew up in Cambridge, Massachusetts, before carrying out attacks that left three dead. Faisal Shahzad, the attempted Times Square bomber, was Pakistani-American. Nidal Hasan, who killed 13 people at Fort Hood in 2009, was born in Virginia to Palestinian parents.\n\nAnd as my colleague Zack Beauchamp has written, the average likelihood of an American being killed in a terrorist attack in which an immigrant participated in any given year is one in 3.6 million — even including the 9/11 deaths. The average American is more likely to die from their own clothing or a toddler with a gun than an immigrant terrorist. But we’re not banning guns and T-shirts from coming into the country.\n\nAdopting extremist views and committing horrendous acts of violence in the name of some \"righteous\" cause, be it religion or politics or just plain old hatred, isn't something that only Muslims, or Arabs, or immigrants, or any other group of people do. It's something humans do.",
      "Folder": "Feedly",
      "Timestamp": "1506968313",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.621410Z"
}