{
  "id": "f5e9070489764e86b36464427d903d78",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/story/how-to-take-better-photos-with-your-phone/",
      "Title": "How to Take Better Photos on Your Phone Wired",
      "Selection": "When Steve Jobs unveiled the first iPhone in 2007, Richard Koci Hernandez stood in the audience, covering the historic event as a photojournalist for the San Jose Mercury News. Hernandez raised his camera, a Canon EOD 30D, and snapped a photo of the device that would change his career. Since then, Hernandez’s photos have been featured in print and online for the New York Times, Time, and right here at WIRED—many of them captured with a smartphone. “I've had images taken with my mobile phone printed in coffee table National Geographic books, and you can't tell the difference,\" he says.\n\nToday, Hernandez shoots with a Google Pixel, the iPhone XS, and the 2016 iPhone SE, which he likes for its smaller size. The simplicity of mobile phones, he says, lets people focus on the most important in a photo: the moment, the subject, and the story.\n\nMany other pro photographers have similarly turned to smartphones to get their shots. We spoke with some of them to get their tips, advice, and app recommendations for taking and editing fantastic photos with your 12 megapixel shooters. The bottom line? Pick the editing tools that fit your needs, and take advantage of spontaneity, and don't sweat it if your phone is a few years old. The ability to take photos anytime, anywhere, is the greatest advantage—even on last year's phone.\n\nDon’t Knock the Native Functions\n\nYou can achieve a lot with what’s already on your phone. Before you even take the photo, tap on the screen to designate your desired subject in the frame. This helps to adjust the exposure and focus around that subject. \"What happens is you ultimately get more properly exposed images,\" Hernandez says, \"which means that your blacks look better, your whites look better, all your tones look better.\"\n\nBefore you start downloading third-party apps, start in your native camera app. Native editing functions have only gotten more comprehensive and sophisticated over the years, especially on more recent iPhones and Androids. Play around with basic brightness and contrast controls to dramatically change your shot.\n\nHernandez also advises turning the flash off by default, since a phone's native flash settings can be harsh and unflattering. Instead, try to time and position your shots so that you can make the most of natural light. \"It has a more organic, authentic feel,\" he says, \"and I think that offers a little bit of emotion to it.\" Flash can be useful in really dark settings, but for the most part, more sophisticated phones have been getting better at taking low-light shots, so there's less of a need to keep it on.\n\nEdit With Pro Apps\n\nWhen you want to achieve an effect that requires more nuance than the native editing functions can provide, turn to these pro-recommended editing apps.\n\nSnapseed (free on iOS and Android) provides an extensive set of editing tools with a simple, usable interface. When Brooklyn-based photographer Andrew Kung edits on his iPhone 7, he starts out by making granular edits on Snapseed, like fine-tuning saturation, contrast, or adding portrait-specific enhancements. \"It's just so thorough,\" Kung says. While less extensive than desktop web editing tools, Kung says it has almost all of the inputs he'd look at when he's editing in Lightroom and Photoshop, all packaged in an intuitive interface.\n\nAdobe Lightroom CC (free on iOS and Android) offers another comprehensive suite of tools. It’s a favorite of Los Angeles-based photographer Michelle Groskopf, whose photos have appeared in WIRED. She's used Lightroom CC to cover broad needs, like playing with exposure, and fix specific issues, like pulling a subject’s face out of a backlit photo.\n\nVSCO (free on iOS and Android) is a little more limited in its editing tools, but streamlined and simple to use for beginning photographers. With perfectly satisfying set of editing options, and a suite of beautiful filters, VSCO’s better suited for faster, more cursory edits.\n\nFinally, for those who want to grace their smartphone photos some analog charm, our photographers recommend Hipstamatic and NOMO - Point and Shoot. When you shoot photos on Hipstamatic ($2.99, iOS only), you can set analog controls, like setting the manual shutter speed, and provides some post-processing editing tools. NOMO (free, iOS and Android) translates the feel of a 35mm onto a smartphone: Take the photo in the app, and shake your phone to “develop” it as you would on a Polaroid.\n\nOne Last Shot\n\nYou don't need fancy hardware to get a good shot. Kung’s photography career began as a college student, casually snapping photos of his native San Francisco on an early iPhone. “It’s a different path than a lot of ‘serious’ photographers take,” he says, but it illustrates smartphone cameras’ greatest advantage: simplicity and accessibility. Our steadfast pocket cameras allows us to take lots of pictures, anywhere, without the investment of film or costly accessories.\n\nFor Kung, becoming a better smartphone photographer is all about \"taking a bunch of photos and understanding what attracts you to those photos.\" He encourages photographers to examine an image and try to understand what, specifically, makes photos beautiful to them, whether that's the image's light, shadow, contrast, subject, or symmetry—all qualities that, as Hernandez points out, the smartphone's simplicity allows you to focus on better.\n\nHernandez suggests photographers to take advantage of what he calls the \"invisibility cloak\" that smartphone cameras afford photographers. While a “serious” camera draws attention to itself, an ubiquitous smartphone blends into a scene seamlessly. Mobile photographers can take advantage of the kinds of photos that phones are in a unique position to take: the scenes where subjects are less aware of the camera, less posed, and more interesting.\n\nAt the end of the day, Michelle Groskopf says that good photography is more about the scene and less about the tool. “The best camera is the one you have on you,” she says. Given our ever-smarter smartphone cameras, the shooter in your pocket makes for a fine tool indeed.\n\nMore Great WIRED Stories\n",
      "Folder": "Feedly",
      "Timestamp": "1542313165",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.427405Z"
}