{
  "id": "f5ee1812fa984234ae9f3d74e327dde3",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/17435-the-beefy-korean-barbecue-classic-that-s-surprisingly-easy-to-make-at-home",
      "Title": "The Beefy Korean Barbecue Classic That's Surprisingly Easy to Make at Home Food52",
      "Selection": "We're always looking for tips on how to add something global to our meals, so we teamed up with the Beef Checkoff to share a favorite Korean preparation of beef—bulgogi.\n\nWalk the streets of the west mid-30s in Manhattan and you'll pass rows and rows of Korean restaurants and markets and food courts, lit up and stretching from the ground floor toward the sky. It's Koreatown you've arrived in, where every storefront you pass smells strongly and looks wonderfully of all the good stuff: roaring grills covered in meat, sour-sweet kimchi, bowls of rice cakes and bibimbap, and platters of squid and shrimp.\n\nInsa's Bulgogi\nby Food52\n\nIt's one of those places where you can lose yourself in culture without having to hitch a flight, a special perk to the cities in which these enclaves exist.\n\nOne of the most ubiquitous dishes you'd encounter is bulgogi, or fire beef, sliced thinly and sometimes grilled on the tabletop grill you'll find at Korean restaurants. Bulgogi is, as Deuki Hong and Matt Rodbard put it in the cookbook Koreatown, \"the workhorse of Korean barbecue.\" You'll often see this spicy steak in recipes made with Ribeye, Sirloin, or Flat Iron because of how well these cuts take to marinating.\n\nHow to Make Bibimbap Without a Recipe \nby Posie Harwood\nBeyond Kimchi: 15 Essential Tools & Ingredients for Korea...\nby Matt Rodbard\n\nIn many Koreatown restaurants, you'll commonly grill your own bulgogi among friends and family on a stove in a tabletop—but at Insa, a cavernous Korean barbecue spot located not in Koreatown but on a sleepy street in Gowanus, Brooklyn, the bulgogi is grilled Flatiron steak that's been marinated in soy, explains Michael Stokes, the Chef de Cuisine. Insa's cooks prepare their bulgogi in the kitchen because it can easily get too dry on the table. \"We usually cook it that way...if there is any excess marinade, you can add that to the pan three-quarters of the way through cooking,\" Michael explains. \"A splash of water at the end can also help.\" He adds that you shouldn't be aiming for \"caramelization\" on the meat when you cook it, though.\n\nThe Funky, Flavorful Sides a Korean Meal Wouldn't Be Complete Without\nby Samantha Weiss Hills\n\nBulgogi is sometimes served alongside banchan (Korean for side dish), and maybe lettuce to wrap it all up and eat in a bite or two. Banchan itself has a fascinating and intertwined history with Korean cuisine—an essential in everyday Korean cooking. Altogether, it can add up to an impressive feast for a group, one that should be completed with a lot of beer and a little soju (a clear Korean spirit).\n\nInsa's Bulgogi\n\nBy Food52\n\nMarinade\n\n1/3\ncup grated onion\n\n1/3\ncup grated asian pear\n\n1\ntablespoon minced garlic\n\n1\nteaspoon grated ginger\n\n1\ncup soy sauce\n\n1/3\ncup light brown sugar\n\n1\nteaspoon freshly ground pepper\n\n1\ntablespoon sesame oil\n\nBeef\n\n2\npounds Flat Iron Steak\n\n1\nlarge white onion sliced thin, pole to pole\n\nView Full Recipe\n\nWe teamed up with the Beef Checkoff to share recipes, tips, and videos all season long, showing you how to prep and cook beef at home like you've been doing it forever.",
      "Folder": "Feedly",
      "Timestamp": "1472441676",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.783295Z"
}