{
  "id": "f61c2471bb9d4e75a2f7df9ea8a1a5aa",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.kpcb.com/blog/2016-internet-trends-report",
      "Title": "Mary Meeker’s 2016 Internet Trends Report Daring Fireball",
      "Selection": "View a PDF of the Report\n\nThe 2016 edition of Mary Meeker’s annual Internet Trends report covers today’s Internet growth and an in-depth look at the following:\n\nGlobal Internet users have surpassed 3B; India has supplanted the US as the world’s second-largest Internet market.\n\nInternet user growth remains consistent (led by acceleration in India), while smartphone user and shipment growth have slowed.\n\nIn the face of a slowing global economy, key macro growth drivers from the past 2 decades are less certain.\n\nInternet advertising (particularly via mobile) continues to grow, but so does ad-blocking, pushing the envelope on development of more innovative ad formats.\n\nNew online-first brands have rapidly grown in popularity for the millennial generation with their focus on omni-channel and personalized distribution strategies.\n\nIn communication, video and images shared are growing as a means of storytelling; creators, consumers, and advertisers are taking part.\n\nMessaging has evolved from simple, expressive conversation to business-focused use cases, with Asian platforms often leading the way.\n\nMore efficient and often more convenient than typing, voice-based interfaces are ramping quickly and creating a new paradigm for human-computer interaction.\n\nTransportation is being re-imagined, as the rise of car computerization, autonomous driving, and sharing transform our understanding of mobility.\n\nLooking to China, Internet leadership continues, as the country boasts global innovation powerhouses in e-commerce, messaging, travel, financial services, and on-demand transportation.\n\nThe proliferation of data generated by a multitude of devices has fostered tremendous business opportunity, but privacy concerns abound.\n",
      "Folder": "Feedly",
      "Timestamp": "1464838733",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.802448Z"
}