{
  "id": "f68d213dad74461fbd3c951672972969",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.wired.com/story/lucid-dreaming-alice-robb-why-we-dream/",
      "Title": "Lucid Dreaming This Retreat Can Train Your Nighttime Visions Wired",
      "Selection": "Of all my memories of that summer in Peru—drinking pisco in the desert, finding a mummified baby, unwrapping it under less than scientifically optimal conditions— the one that stands out most is the memory of my first lucid dream. At 9 o’clock, I climbed into the bottom bunk and curled up in my sleeping bag, worn out from physical exertion and the monotony of digging. I set my alarm for 5 am and drifted off almost immediately, my body too tired to let my mind wander down its usual anxiety-laden paths.\n\nAnd then, the scene changed. It was a summer afternoon—not the Andean summer, with its thin warmth and cloudy nights, but a real summer, the kind of heat so extravagant you jump in the water and dry off in the sun. I soaked up the warmth I’d been craving, treading water in some bucolic pool I’d never seen before. I don’t particularly like swimming in real life; I don’t like exercising in any form without the distraction of podcasts or Pandora. But this was different—effortless\nand sensual. I had a heightened awareness of every part of my body, the physicality of the cool water and the bright air and a surreal forest enclosing the pool in magnificent foliage. I woke up euphoric.\n\nThe memory had none of the haziness that usually clouds dreams, and the details remain perfectly crisp years later. But I wasn’t just elated; the whole thing was also vaguely disturbing. I hadn’t been in my sleeping bag in a dusty dormitory in Peru—I had been transported to some faraway place, and I preferred it there. My jaunt in the pool had shaken my sense of what was real, and I couldn’t explain it without sounding crazy. All I knew was that I wanted to do it again.\n\nHoughton Mifflin Harcourt\n\nI spent the rest of the summer practicing tips from a secondhand copy of Stephen LaBerge’s Exploring the World of Lucid Dreaming. I repeated LaBerge’s mantra ad nauseam: “Tonight, I will have a lucid dream.” I made up mantras of my own: “Tonight, I will fly to the moon.”\n\nNo one had done more to advance lucid dreaming than Stephen LaBerge. He is to lucid dreaming what Louis Pasteur is to pasteurization, Thomas Edison to electricity. In spite of his discoveries, LaBerge failed to attract much attention from the scientific establishment. Lucid dreaming didn’t seem likely to cure cancer, after all; it was thought of as weird, nonessential, if it was thought of at all. Instead of devoting himself to research, he had to find a way to make money. He set up a private company called the Lucidity Institute and began writing primers on lucid dreaming—like the one I found in Peru.\n\nI learned to recognize the signs that I was dreaming, like finding myself flying or meeting dead people. Every couple of hours, I would do what LaBerge called a reality test, asking myself if I was awake or asleep—a trick that, once ingrained, LaBerge promised would trigger lucidity. I’d had lucid dreams on occasion, but couldn’t predict when they would come; I got lazy about my reality tests, and I didn’t always make time to meditate. Sleep was precious; waking myself up in the middle of the night was out of the question.\n\nYet the more I learned about the power of lucid dreaming, the more I wanted to be able to induce lucid dreams on a consistent basis. I wanted to learn from Stephen LaBerge himself.\n\nOn a hot, humid day in September, I flew into Hawaii’s tiny Hilo airport to find a bleary-eyed group already gathering. My fellow lucid dream enthusiasts had picked one another out without too much trouble; they were the ones milling around sheepishly, looking a little rumpled, a little apprehensive, not quite sure what they had signed up for. I joined them and we waited for the shuttle, exhausting the browsing potential of the kitschy gift shop with its cheap leis and turquoise hoodies, swapping names and dreaming résumés.\n\nThe whole district of Puna has a history as a magnet for seekers and searchers, a respite for pilgrims fleeing the pressures of modern life. Hippie co-ops and intentional communities are dotted across the area. So-called Punatics wander the black-sand beaches in dreadlocks and ratty clothes and loiter in the hot springs, smoking.\n\nNatalie showed me to my room, a simple dormitory-like space with hokey pastoral paintings on the walls, a few pieces of wicker furniture, and little else. The primary source of light was a single bare bulb on the why-we-dream ceiling, but the electricity was out that night. I stumbled around with the tiny flashlight on my key ring and passed out.\n\nWhen I drew back the flimsy curtains in the morning, I took in the scene properly for the first time. From my window, I could see luscious palm trees and tall tropical grasses misted over by a layer of fresh dew. My first thought was that the landscape resembled a desktop background come to life.\n\nIn the morning, we convened in a bright, airy structure on top of a hill, one side opening directly onto the rainforest. Knotted scarves hung from the window frames, and a portrait of the volcano goddess Pele, painted in fiery primary colors, dominated one of the eight walls. (I have never found four-walled rooms particularly stifling, but this space had been designed, according to the promotional literature, to liberate visitors from “box-based architecture.”)\n\nLaBerge's assistant, Kristen—a clinical psychologist and master lucid dreamer, with the pun-embossed T-shirts and upbeat mien of a camp counselor—regaled us with tales of her lucid adventures. Kristen taught herself to induce lucid dreams in college after she learned about the phenomenon in a psychology class. “I couldn’t believe it wasn’t a commonly known thing,” she said. “I was just so in awe.” She had since trained herself to become lucid as often as three times a week and could even meditate and practice yoga in the dream state. She was outlining our curriculum for the week when she was interrupted by a low-pitched masculine shout.\n\n“What are we doing here?” bellowed a barefoot man in a baggy Hawaiian shirt and shorts, bright blue eyes peering out from beneath bushy white eyebrows. Stephen must have slipped in through the back door while Kristen was talking; I had missed his entrance. His voice swung theatrically; each question began as a rumble and ended as a squeal.\n\n“What is this all about?” he demanded. “How do I know you’re people? Maybe you’re robots or aliens or dream figures. Does anybody think that it really might be a dream?”\n\nThis barrage of questions was a fitting introduction; Stephen would spend much of the coming week training us to pay closer attention to our surroundings, to scrutinize the details of our environment, to search for incongruities and stop assuming that we were awake. He greeted us one by one, mustering an impressive show of curiosity over each person’s individual path. At 69, he had devoted the better part of his life to lucid dreams, and it was “revivifying,” he said, “to be with people who find the topic intriguing.”\n\nStephen was intense in a way that a sympathetic observer might describe as cerebral; a less generous one might have characterized him as awkward, even manic. He was constantly in motion even when he was sitting, contorting his body this way and that, crossing and uncrossing his ankles. When he got excited—which was often—he jumped out of his chair. His gesticulations sometimes devolved into jazz hands, and his voice could cover several octaves in a single sentence. More than once, I heard his manner likened to that of a wizard.\n\nLucid dreaming has been slowly gaining prominence in recent years. The release of Christopher Nolan’s 2010 science-fiction blockbuster Inception— in which corporate spies sneak into their marks’ dreams to steal their secrets and implant bad ideas — was a landmark moment. (The spies use a top as a tool for reality tests; if it spins indefinitely, then they know they are in the dream state; if it falls, they are awake.) Nolan said that the film was inspired by his own experience of lucid dreaming and that its ambiguous ending—the camera lingers on a spinning top, leaving viewers to wonder whether or not it will fall—should be taken to mean that “perhaps all levels of reality are valid.” Google searches for \"lucid dreaming\" spiked around the movie’s release and have never returned to pre-2010 levels. And the internet, of course, has helped. A constantly updated Lucid Dreaming forum on Reddit has accumulated more than 190,000 subscribers.\n\nStill, lucid dreaming has not exactly permeated the culture. Our contemporary neglect of our dream lives is not only a historical anomaly, but a particular paradox. People are obsessed with hearing the latest research on sleep, even if scientists haven’t yet reached a consensus on why we pass out every night. We want to know how screens and modern scheduling affect our sleep patterns. We click on studies warning us that anything less than eight hours of sleep destroys our health, looks, and happiness—or promising that six hours is enough or that some people are fine with just three or four.\n\nMeanwhile, we chart, track, and optimize our time, buying Fitbits and phone apps to count the minutes spent on exercise, work, and hobbies; we suffer from “fear of missing out.” Yet in ignoring our dreams, we squander an opportunity to experience adventure and boost our mental health, about five or six years’ worth of opportunity (20 to 25 percent of total time asleep) over the course of an average lifetime.\n\nSleep is usually discussed as a means to an end—a tool to ensure the daytime is productive, to improve memory, regulate metabolism, and keep the immune system in order. But as LaBerge asked: “If you must sleep through a third of your life, as it seems you must, are you willing to sleep through your dreams too?”\n\nBy the end of his painstaking period of trial and error as a student at Stanford, not only had LaBerge created a powerful system that let him lucid dream whenever he wanted, but also it worked for other people too. The core of his method, the sine qua non, is what he calls the reality test. Aspiring lucid dreamers should make a habit of asking ourselves at regular intervals throughout the day whether we are awake or asleep. Because daytime routines work their way into dreams, we should pose the same question in our sleep. If we are sufficiently attuned, we will respond that we are asleep, and a lucid dream will commence.\n\nEffective reality tests entail reorienting yourself in the world, cultivating a skeptical outlook toward your environment. Is everything as it should be? Look for clues that your surroundings might not be real. Inspect your hands: Does each one have the usual number of fingers? Check the clock, and check it again: Has a reasonable amount of time elapsed? Find a shiny surface: Are you reflected back as you really are, or are you distorted, as though you’re looking in a funhouse mirror? Jump up in the air: Do you drop back to the ground, or have you suddenly acquired the ability to fly? The dream world is constantly in flux; check whether your environment is stable. Exit a scene and then return to it. Are you in a different room? Find a piece of text—the spine of a book, a word on a bracelet, an email—look away from it, and then look back. If you’re in a dream, the words are likely to have changed by the second inspection.\n\nStephen demonstrated a reality test: “Does anybody think that this might be a dream?”\n\nSilence; we glanced sideways at one another, like students taken aback by a pop quiz.\n\n“Are you sure you’re not going to wake up in bed in another 10 minutes or an hour?”\n\nTentative nods of assent.\n\n“But how do you know?” he asked. “What is the evidence for that assumption?”\n\n“I can’t float,” one brave guy called out. He was sitting motionless in his chair.\n\n“You call that trying?” Stephen shouted. His incredulity was melodramatic, his voice rising in a show of outrage. “That’s not a real effort!” Stephen straightened his back as though trying to levitate out of his chair, his face crumpling with the strain of his imagined effort. He jumped up, his eyes widening as if in hope. But he dropped back down into his seat; he could not float.\n\nHe was awake, and he had conveyed his point. A proper reality test entails truly considering, with your body as well as your mind, the possibility that you are in a dream.\n\nLaBerge didn’t start leading retreats just to pay the bills or even to share the joys of lucid dreaming. The workshops have also provided him with a way to move his own research ahead. They have given him access to a group of people who are willing to participate in his studies, even if they aren’t certified by a lab.\n\nThis year, that tradition continued. On three consecutive nights, those of us who agreed to take part in what LaBerge cryptically called “the experiment” were given plastic bags of unmarked, oversize capsules and instructions to swallow them after our third REM period, meditate, or write in our dream journals for 30 to 60 minutes, and go back to sleep. The three packets contained one set of placebo pills and two of galantamine, a drug developed to treat Alzheimer’s disease. (It’s available both over the counter and as an FDA-regulated prescription.) Alzheimer’s patients suffer from low levels of neurons that respond to acetylcholine, a chemical that sends signals between nerve cells; the imbalance can contribute to their lapses in memory. Galantamine—one of a number of drugs classified as cholinesterase inhibitors—works by preventing the breakdown of acetylcholine in the brain. Bizarre dreams are a side effect; galantamine reduces “REM sleep latency,” the time between sleep onset and the first REM stage, and increases “REM density,” a measure of frequency of eye movement that corresponds to dream intensity.\n\nGalantamine should enhance mental clarity in the dream state in the same way that it improves memory in dementia patients. Over the years, LaBerge has served different doses of galantamine and other cholinesterase inhibitors to over 100 aspiring lucid dreamers. His results are promising; he has found that people who are already proficient lucid dreamers are five times more likely to become lucid on the nights they take galantamine than on the nights they take a placebo. Even without yet publishing these findings in a peer-reviewed journal, LaBerge has—thanks to presentations at IASD and word of mouth—helped set off a wave of formal and informal research, stimulating the market for lucid-dreaming supplements with names like Galantamind. Online lucid-dreaming boards are teeming with inspirational stories of galantamine-assisted success. “The first night I took it I had one lucid dream after another,” wrote a member of the World of Lucid Dreaming Forum. “Most of the times I take it, I have outstanding dreams—often flying dreams and amazing journeys that blow my mind,” another attested. One researcher surveyed 19 lucid dreamers who incorporated galantamine into their routines and found qualitative differences in the way they described their drug-fueled lucid dreams: They were more vivid, longer, and more stable than usual.\n\nGalantamine is not a magic bullet, though; it can trigger nasty side effects like headaches, nausea, and insomnia. And it can work too well—cautionary tales of galantamine-induced nightmares can be found alongside success stories. “It felt like my brain was being drawn and quartered,” one lucid dreamer wrote. “I kept falling back asleep into these bizarre dreams that I can only describe as my head being scraped against the bottom of a submerged iceberg.” “It felt like I was falling through my bed and all these loud screeching sounds and vibrations started happening,” testified another. “It was so scary and I felt paralyzed.”\n\nThe day after our experiment began, a few people turned up to the morning lecture looking haggard and complaining that they hadn’t been able to fall back to sleep after taking their pills; one had spent the night vomiting. For me, galantamine did the trick. On both of the nights that I took it, I had lucid dreams, and no trouble falling back to sleep. When I took what I later found out was a placebo, I could recall only a mundane, nonlucid anxiety dream in which I found out that an acquaintance was also working on a book about the science of dreams. What I think was more helpful than galantamine, though, was the fact of being on the retreat—in a place where I didn’t have to think about everyday things and where I was surrounded by people who shared my goals. I don’t think it was a coincidence that my first lucid dreams in Peru came at another time when I was able to maintain a single-minded focus on my desire to become lucid, and when I had made dream talk a regular part of my day.\n\nScientists are finding powerful applications of lucid dreaming for intellectual as well as therapeutic and clinical problems. “If you want to study subjective experiences and their neural correlates, dreams are an excellent means to do that,” said Katja Valli, a neuroscientist at the University of Turku in Finland. She believes that pinpointing the neural differences among dreamless sleep, dreams, and lucid dreams could shed light on the cognitive basis of consciousness itself.\n\nLucid dreaming can also help people with common mental disorders like anxiety. Line Salvesen has been both an anxious person and an effortless lucid dreamer for almost as long as she can remember. As a child, she suffered from recurring nightmares and realized that she could escape from them if she recognized that she was in a dream. In one, she would be riding in the back seat of a car when all of a sudden, her parents, who were driving, would vanish. The car would hurtle down the road, toddler Line powerless in the back, until it crashed. She figured out that she could wake herself up, which helped, but it was only after she taught herself to seize control that she was able to banish the nightmare for good. One night, after her parents disappeared as usual, Line consciously formulated a new plan: She would summon her kindergarten classmates to steer the car. “They were in the driver’s seat, and they helped each other,” she said. “It wasn’t really a nightmare anymore.”\n\nIt wasn’t until reading an article about lucid dreaming in a magazine that Line—who was having lucid dreams almost every night—realized that not everyone was conscious in dreams. “It said that only a small fraction of people are able to have these naturally, and I was like ‘I’m special?’ ” She laughed. The habit that was as intuitive for her as breathing, she learned, was an elusive goal for others.\n\nIn spite of her special skill, Line suffered from overwhelming anxiety in her teens and early twenties. “I felt stressed all the time,” she told me. “I didn’t feel that I had any control.” She tried therapy and medication, but nothing worked. “It made life pretty hard,” she said. “It ruined my senior year in high school.” She missed classes because she was so tired—even though she was sleeping 12 hours a night—and her grades plummeted. She took sick leave from her first job to undergo more intensive treatment.\n\nUntil Line met lucid dreaming expert Robert Waggoner in a cyber-dreaming conference, she had mostly used her lucid dreams for fun, but Waggoner suggested they might hold the key to solving her anxiety. The next time she became lucid, she followed his advice. “I told myself that I would be happy and anxiety-free for one week. I just said it out loud in the dream, with confidence.” When she woke up, she could feel that something had changed inside her. “It was like my anxiety was just turned off. I was ecstatic.” Her therapist could scarcely believe her overnight transformation. “I came into his office, and he could just see that I was different. When I told him what I did, he almost fell out of his chair.” Her new sense of composure lasted, and when it began to fade, she just repeated her mantra in her next lucid dream. She still suffers the occasional panic attack, but her anxiety has never returned in full force.\n\nSports scientists, meanwhile, have latched onto lucid dreaming as a tool in performance and exercise. In a series of experiments in the 2010s, Michael Schredl and Daniel Erlacher had lucid dreamers try to use their dreams to improve at physical tasks. In one study, 40 people tried to toss a coin into a cup about 6 feet away. Afterward, one group was allowed to practice, another group tried to incubate lucid dreams about the coin toss, and a control group did nothing. When everyone attempted the task again, the people who had dreamed about it improved their hit rate by 43 percent, compared with just 4 percent for the control group. (Practicing while awake, though, was the most effective strategy.)\n\nRecent research has vindicated much of LaBerge's early work, but he is hardly bitter about the academic career he could have had. His books are still selling. His fans are ardent, his workshops well attended. Perhaps the spiritual experiences he has had in the dream state tempered his ambition. In one lucid dream, which Stephen spent about half an hour recounting, he floated into a sky stippled with religious symbols and experienced a sense of oneness with the natural world as his body dissolved into a “point of awareness.” He woke with his fear of death diminished. Lucid dreams have done enough for him.\n\nExcerpted from Why We Dream: The Transformative Power of Our Nightly Journey by Alice Robb. Copyright © 2018 by Alice Robb. Reprinted with permission of Houghton Mifflin Harcourt Publishing Company. All rights reserved.\n\nMore Great WIRED Stories\n",
      "Folder": "Feedly",
      "Timestamp": "1542834327",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.452581Z"
}