{
  "id": "f6bbde5c792b45ad9507d02620fd4f82",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/guide/ultimate-guide-to-etihad-partners/",
      "Title": "The ultimate guide to Etihad partners The Points Guy",
      "Selection": "Etihad is well-known for its posh business and first-class products, but did you know that the airline has a powerful loyalty program too? The airline has partnerships with nearly two-dozen airlines, giving you a ton of options for earning and redeeming Etihad Guest miles during your travels.\n\nSome of these redemptions offer incredible value too, with some of our favorites being cheap transcontinental first-class tickets on American Airlines and low-cost transcontinental business class tickets with Brussels Airlines and Royal Air Maroc.\n\nPlus, the airline has a number of non-airline partnerships that can help you earn Etihad Guest miles quickly. These various partnerships let you earn miles when staying at hotels, renting cars and making everyday purchases with select American Express, Capital One and Citi credit cards.\n\nHere’s a look at Etihad Guest’s most powerful partnerships. We’ll start by looking at earning and redeeming miles with Etihad’s airline partners, then move onto earning with hotel stays, rental cars and credit cards. Let’s dive in!\n\nFor more TPG news delivered each morning to your inbox, sign up for our daily newsletter.\n\nIn This Post\n\nEtihad’s airline partners\n\n(Photo by Rebius/Shutterstock)\n\nDespite not being a member of a major airline alliance, Etihad has a broad range of airline partners around the world. These were formed through codeshare agreements and investments, with Etihad owning a portion of airlines like Alitalia and Air Serbia.\n\nAll of Etihad’s partners have a unique earning and redemption chart, with varying rates. For example, American Airlines awards are priced by region, ANA prices by distance flown and Air Serbia prices by city pair.\n\nEtihad doesn’t offer online booking for any of its airline partners, so you’ll have to call Etihad Guest to book these tickets. We highly recommend finding award space before you call. We’ll dive into how to find award space for each partner below.\n\nAir Canada\n\nIn June 2020, Air Canada and Etihad announced a new partnership that allows Etihad members to earn and redeem miles on Air Canada flights, and vice-versa. Air Canada is the largest airline in Canada, serving nearly 200 destinations worldwide. Here’s a look at how you can earn and redeem miles on all of these flights.\n\nEarning Etihad Guest miles with Air Canada\n\nEtihad awards up to a 125% bonus on miles flown on Air Canada flights. The earning chart is extensive and has different earning rates intra-Canada and international flights. The international chart includes flights to and from the U.S. as well, so make sure you’re using the right chart to calculate your earnings.\n\nAnother thing to keep in mind is that some Air Canada domestic fares earn 0% miles flown when credited to Etihad. It’s in your best interest to credit intra-Canada flights in the S, T, L, A and K fare classes to programs like Air Canada Aeroplan and United MileagePlus, which do award miles for these fare classes.\n\nRedeeming Etihad Guest miles with Air Canada\n\nEtihad’s Air Canada award chart is distance-based, so you’ll redeem miles based on how far you’re flying. You’ll get the best value when redeeming Etihad miles for short-haul flights on Air Canada.\n\nFor example, you can redeem 5,000 miles for an economy class ticket if the flight is under 500 miles. This includes the 357-mile jaunt from Toronto (YYZ) to New York (LGA) and 324-mile flight from Montreal (YUL) to New York.\n\nBoth of these flights can get expensive when booking at the last minute. I’ve personally paid over $250 for a one-way ticket from New York to Montreal over the holidays. Having this low-cost redemption option is great for those who fly on the route often.\n\nAir New Zealand\n\nAs the flag carrier of New Zealand, Air New Zealand operates routes domestically as well as to Asia, North America, the South Pacific and even Europe. Plus, the airline has a solid business class product and even offers an innovative Skycouch in economy class.\n\nEarning Etihad Guest miles on Air New Zealand\n\nYou can earn Etihad Guest miles on all Air New Zealand flights. Flights will earn miles based on your booking class, the distance of your flight and the region you’re flying in — you can find an up-to-date earning chart on the Etihad website. Simply multiply the distance of your flight by the percentage listed next to your booking class to see how many miles you’ll earn on your partner flight.\n\nFor example, if you flew Auckland (AKL) to Los Angeles (LAX) in Air New Zealand C fare business class, you’d earn 9,756 Etihad Guest miles as a non-elite member. The math looks like this: 6,504 miles X 1.5 miles = 9,756. If you have status with Etihad Guest, be sure to factor in elite bonuses, which range from 25-75%.\n\nRedeeming Etihad Guest miles on Air New Zealand\n\nYou can redeem Etihad Guest miles on all Air New Zealand flights with open award space — the easiest way to find this is to use a Star Alliance search tool. Like all Etihad Guest partner awards, you have to call the airline to actually book your award ticket.\n\nEtihad prices Air New Zealand award tickets by distance. To calculate the cost of your ticket, use a website like Great Circle Mapper to find your flight distance and then match it to the appropriate tier on Etihad’s award chart. In the case of AKL to LAX, you’d need a whopping 210,000 miles to book a one-way ticket in business class.\n\nUnfortunately, this makes Etihad Guest one of the most expensive options when it comes to redeeming miles for Air New Zealand flights. You may want to consider other options like Air Canada Aeroplan or ANA Mileage Club if you’re transferring American Express Membership Rewards, Citi ThankYou or Capital One miles for an Air New Zealand flight.\n\nFind Air New Zealand award space with your favorite Star Alliance search engine or on ExpertFlyer.\n\nAir Serbia\n\nEtihad owns 49% of Air Serbia, and its funding has helped the Eastern European carrier launch its first long-haul route: Belgrade (BEG) to New York-JFK. Additionally, Air Serbia uses Etihad Guest as its default loyalty program, so you can earn and redeem Etihad Guest miles on all flights operated by Air Serbia.\n\nEarning Etihad Guest miles on Air Serbia\n\nEtihad Guest has two Air Serbia earning charts: one for short and mid-haul flights and another for its BEG–JFK route. Miles earned are based on class of service and distance flown, so you’ll earn more miles for longer flights. You can view these earnings charts on Etihad’s website.\n\nEtihad Guest’s Air Serbia short- and mid-haul earning chart.\n\nUnfortunately, Economy Light fares — commonly referred to as “White” fares — aren’t eligible to earn Etihad Guest miles. Thankfully, these fares are only sold on intra-Europe flights, so you will earn at least 25% miles flown in all other fare classes.\n\nEtihad Guest’s Air Serbia long-haul earning chart.\n\nRedeeming Etihad Guest miles on Air Serbia\n\nEtihad Guest prices Air Serbia awards route-by-route, so you’ll need to find your route of choice on the Etihad Guest website and match it to the award’s price. In the case of the BEG – JFK route, you’ll pay 64,082 for a one-way ticket in business class or 44,970 in economy.\n\nMany of Air Serbia’s shorter, intra-Europe routes start at 5,000 miles one-way in economy class, making them a good option if you’re planning a tour around Europe. Just be sure to compare paid fares and make sure you’re getting at least 1.4 cents of value out of each point.\n\nYou can find Air Serbia award space using ExpertFlyer but you must call Etihad Guest to book an award ticket.\n\nAir Europa\n\nAir Europa is the third-largest airline in Spain, with its largest hub being located in Madrid (MAD). The airline serves a number of intra-Europe routes and also flies from Madrid to the U.S. and various destinations in South America, the Caribbean, South America, Central America and the Middle East.\n\nEarning Etihad Guest miles on Air Europa\n\nYou’ll earn Etihad Guest miles on Air Europa based on the distance of your flight and fare class, but note that a handful of discounted economy fares are not eligible to earn Etihad Guest miles. You can see the latest Air Europa earning chart on Etihad’s website.\n\nRedeeming Etihad Guest miles on Air Europa\n\nAir Europa awards are priced based on distance flown, so be sure to check out Etihad Guest’s website for an up-to-date award chart. Prices are reasonable, but not best-in-class. For example, you can fly one-way from JFK to MAD on Air Europa for 71,000 Etihad Guest miles in business class. That’s higher than the 57,500 miles American Airlines charges for Iberia flights to Madrid or the 59,500 miles required by Air Frace/KLM Flying Blue.\n\nFind Air Europa award space using ExpertFlyer or a SkyTeam search tool.\n\nAir Seychelles\n\nEtihad Guest is the default loyalty program for Air Seychelles. Etihad owns 40% of the Seychelles-based carrier and has helped the small airline beef up its fleet to include two new A320neo planes. The carrier operates international routes between the Seychelles and South Africa, Israel, India and others.\n\nEarning Etihad Guest miles on Air Seychelles\n\nLike many of the airlines discussed, Air Seychelles has its own Etihad Guest earning chart. We’ve posted a copy of the airline’s 2020 earnings chart belowand you can view and up-to-date earning chart on Etihad’s website.\n\nRedeeming Etihad Guest miles on Air Seychelles\n\nUnfortunately, you can’t redeem your Etihad Guest miles for all Air Seychelles flights. Only certain destinations are eligible for redemption and each has its own respective award cost. Additionally, the Air Seychelles award chart is pricey — for example, a flight from Seychelles (SEZ) to Johannesburg (JNB) costs 60,295 miles one-way in business class.\n\nYou can find Air Seychelles award space using ExpertFlyer.\n\nAlitalia\n\n(Photo by Alberto Riva/TPG)\n\nEtihad currently owns 49% of the Italian flag carrier, Alitalia. While this could change when the Italian government nationalizes the airline, you can currently earn and redeem Etihad Guest points on Alitalia flights.\n\nEarning Etihad Guest miles on Alitalia\n\nYou can earn Etihad Guest miles on all Alitalia flights in accordance to the Alitalia-specific award chart. You’ll earn between 50% and 300% bonus miles depending on your booking class. 300% earning on Alitalia business class tickets is significantly higher than other Alitalia partners.\n\nRedeeming Etihad Guest miles on Alitalia\n\nEtihad Guest’s Alitalia award chart lists out a specific price for each of Alitalia’s various routes. As a general rule of thumb, intra-Europe flights are 12,000 miles one-way in economy and 24,000 miles in business class. Meanwhile, flights between the U.S. East Coast and Europe cost 60,000 one-way in economy and 120,000 miles in business class.\n\nThese aren’t particularly great deals, so we recommend booking Alitalia award tickets with a SkyTeam partner like Flying Blue or Delta SkyMiles.\n\nAll Nippon Airways (ANA)\n\nAll Nippon Airways — commonly referred to as “ANA” — and Etihad have a limited partnership that allows Etihad members to earn and redeem miles on all ANA flights. For reference, ANA is based in Tokyo and flies to most major cities in the U.S., Asia and the South Pacific, and also has extensive service in Europe, the Middle East and Africa.\n\nEarning Etihad Guest miles on ANA\n\nAs of April 2019, you’ll earn Etihad miles on all ANA flights in accordance with the airline’s earning chart. This is a huge upgrade to the pre-2019 earning chart which, at the time, only let Etihad Guest members earn miles on select ANA routes.\n\nEarning rates are pretty standard with ANA: you’ll earn 50% to 150% miles flown, with the 150% being reserved for paid first-class tickets. You can also credit your ANA flights to Star Alliance carriers and Virgin Atlantic, so use a tool like Where To Credit to find the best partner to credit your miles.\n\nRedeeming Etihad Guest miles on ANA\n\nANA award tickets are based on distance flown, so use GC Mapper to find the length of your flight and compare it to the Etihad Guest ANA award chart. For example, a 6,772-mile flight from New York-JFK to Tokyo-Haneda (HND) would cost 78,000 miles one-way in business class.\n\nThat said, you’d be better off redeeming Aeroplan, ANA Mileage Club or Virgin Atlantic Flying Club miles, which price out awards much cheaper.\n\nYou can find ANA award space using a Star Alliance search engine or ExpertFlyer.\n\nAmerican Airlines\n\nYou might be surprised to learn that Etihad has a non-alliance partnership with American Airlines. American miles have long been one of the best ways to book Etihad awards. Likewise, you can score excellent value when booking certain American Airlines award flights with Etihad Guest miles.\n\nEarning Etihad Guest miles with American Airlines\n\nAs you’d expect, you can earn Etihad Guest miles based on your fare class and the distance of your flight. At the time of publishing this article, you can earn between 25% and 250% of miles flown, depending on your fare class.\n\nRedeeming Etihad Guest miles with American Airlines\n\nEtihad employs a regional award chart for American Airlines redemptions and there are some great deals to be had. Some of the best deals include American Flagship first-class tickets to Europe for 62,500 miles and JFK to San Francisco (SFO) and Los Angeles (LAX) for 32,500 miles in American’s A321T first class.\n\nYou can see the whole American Airlines award chart on Etihad’s website. You’ll often get a far better deal using Etihad Guest miles instead of AAdvantage miles, so keep this award chart in mind the next time you need to book an American award ticket.\n\nReady to book? Use a Oneworld search tool or ExpertFlyer to look for award space.\n\nAsiana Airlines\n\nAsiana is based in South Korea, with flights to major cities in Asia, Europe and North America. You can earn and redeem Etihad Guest miles on Asiana flights and there are a few good deals to be had if you’re flying from the U.S. to Asia.\n\nEarning Etihad Guest miles with Asiana Airlines\n\nYou can earn up to 200% miles flown when crediting Asiana miles to Etihad Guest, but note that many of the airline’s economy fares aren’t eligible for points earning with Etihad. You’ll earn the most points when booking the airlines’ premium first and business class products.\n\nRedeeming Etihad Guest miles with Asiana Airlines\n\nThe Asiana award chart is based on the distance of your award flight. Flights from the U.S. to Asia generally fall into the 6,000-10,000 mile range. This means that a flight from New York-JFK to Seoul (ICN) would cost 88,000 miles in business class. While not the best deal, it’s about the same as using United miles for the same flight.\n\nOne exception to this are flights from the West Coast to Asia. San Francisco, Seattle and Los Angeles to ICN flight are under 6,000 miles in distance, so you can book these routes for just 59,000 Etihad miles in business class and 35,000 miles in economy.\n\nYou can find Asiana award space using a Star Alliance search engine or ExpertFlyer.\n\nBangkok Airways\n\nBangkok Airways is a regional carrier based in Thailand. Its route network mostly consists of domestic routes, as well as international destinations like Singapore, Hong Kong and China. This can be a useful partner to have when traveling within Thailand.\n\nEarning Etihad Guest miles with Bangkok Airways\n\nThe Bangkok Airways earning chart is pretty simple: you’ll earn 50% to 150% miles flown. Note that many of the airline’s deeply discounted Web Promotion fares are not eligible for mileage earning with Etihad Guest. So be sure to check your fare class before you book.\n\nRedeeming Etihad Guest miles with Bangkok Airways\n\nEtihad’s Bangkok Airways award chart is priced by route and you can see the full award chart on Etihad’s website. Flights start at just 5,000 miles one-way in economy, so these redemptions can be a good option for last-minute or otherwise expensive flights within Thailand.\n\nThere’s no easy way to find Bangkok Airways award space online, so you’ll have to ask an Etihad representative to find the space for you.\n\nBrussels Airlines\n\nBrussels Airlines is a Lufthansa Group airline based in Belgium. While most of the airlines’ routes are intra-Europe, it also offers extensive service to Africa and nonstop flights to New York-JFK, Washington-Dulles (IAD) and Toronto (YYZ).\n\nEarning Etihad Guest miles with Brussels Airlines\n\nYou’ll earn between 25% and 150% miles flown when you credit Brussels Airlines flights to Etihad Guest. See the airline’s earning chart for more details.\n\nRedeeming Etihad Guest miles with Brussels Airlines\n\nLike Bangkok Airways, the Brussels Airways award chart is priced by route. There are plenty of good deals to be had, too — intra-Europe routes start at just 5,000 miles one-way and a business class ticket from JFK to Brussels (BRU) is only 44,000 miles one-way. The ladder redemption is one of our favorite ways to use Etihad Guest miles as it offers the lowest redemption rate on this route.\n\nYou can find Brussels Airlines award space using a Star Alliance search engine like United.com. Alternatively, you can search with ExpertFlyer.\n\nCzech Airlines\n\nCzech Airlines is the flag carrier of the Czech Republic. While the carrier has downsized over time, it still maintains a solid intra-Europe route network and has long-haul service to Seoul (ICN). The airline has a suite of new aircraft on order too, so we may see the return of North American service with its upcoming A321XLR.\n\nEarning Etihad Guest miles with Czech Airlines\n\nYou can earn up to 150% miles flown when crediting Czech Airlines flights to Etihad Guest. Note that you can only credit flights marketed and operated by Czech Airlines to Etihad; flights booked through the airline’s parent company, Smart Wings, are not eligible for earning.\n\nRedeeming Etihad Guest miles with Czech Airlines\n\nThe Czech Airlines award chart is priced by route, and one redemption sticks out the most: business class from Prague (PRG) to Seoul (ICN). You can book this route for just 25,610 Etihad miles one-way, which is an excellent option for flying from Europe to Asia. Even better, the route is operated by a Korean Airlines A330.\n\nNote that Czech Airlines is set to return this aircraft to Korean Airlines by October 2020, so this route may be coming to an end. Use ExpertFlyer or your favorite SkyTeam search engine to find award space on this route.\n\nGaruda Indonesia\n\nGaurda Indonesia is the largest airline in Indonesia with hubs in Jakarta (CGK) and four other major cities in Indonesia. Its fleet was recently revitalized with some of its newest planes being the 777-300ER and Airbus A330-300neo.\n\nEarning Etihad Guest miles with Garuda Indonesia\n\nYou can earn up to 200% miles flown when you credit Garuda Indonesia flights to Etihad Guest. Unfortunately, the airline’s cheapest economy tickets only earn 25% with Etihad Guest, so make sure to assess all of your crediting options.\n\nRedeeming Etihad Guest miles with Garuda Indonesia\n\nYou can redeem your Etihad Guest miles on all Garuda Indonesia flights. Awards are priced based on flight distance, with the airline’s longest route — a 7,284-mile jump from London-Heathrow (LHR) to Jakarta (CGK) — costing a whopping 140,000 miles one-way in business class.\n\nFind Garuda Indonesia award space using a SkyTeam search tool or by using ExpertFlyer.\n\nGOL\n\nGOL is the largest domestic carrier in Brazil, with numerous domestic and international routes. The airline even operates flights to the U.S. from its gateways in Miami (MIA) and Orlando (MCO). While the airline recently partnered with American Airlines for mile redemptions, you can score a better deal with Etihad Guest in many cases.\n\nEarning Etihad Guest miles with GOL\n\nYou’ll earn Etihad miles with GOL based on distance flown. While the earning chart only shows earning for economy class awards, the carrier’s premium economy product (referred to as “Max”) earns 125% to 150% miles flown as it books into the C, D, F or L class.\n\nRedeeming Etihad Guest miles with GOL\n\nThe GOL award chart is distance-based and offers a good deal on short domestic flights. For example, you can book a one-way ticket from Sao Paulo (GRU) to Rio de Janeiro (GIG) for just 3,000 miles in economy class. This flight can get expensive at the last minute, so it’s a good option to have when planning a tour of Brazil.\n\nYou can find GOL award space on ExpertFlyer.\n\nGulf Air\n\nGulf Air is an international airline based in Bahrain, with connections available to major cities in the Middle East, Asia, Europe and Africa. Many of its aircraft are outfitted with a new business class product that TPG Writer JT Genter enjoyed on a 2018 flight from London (LHR) to Bahrain (BAH).\n\nEarning Etihad Guest miles with Gulf Air\n\nYou can earn up to 175% miles flown when crediting Gulf Air flights to Etihad. The carrier often has solid deals from Europe to the Middle East, so this can be an interesting way to see another region, experience a new airline and rack up Etihad miles at the same time.\n\nYou can find Gulf Air award space on ExpertFlyer. Unfortunately, the Gulf Air website doesn’t show award availability unless you have enough miles in your account to book the ticket you’re looking for.\n\nRedeeming Etihad Guest miles with Gulf Air\n\nEtihad’s Gulf Air award chart is distance-based. Most Gulf Air routes to Continental Europe fall into the 2,000 to 3,000-tier, so you’ll pay 70,000 Etihad miles for a one-way ticket from Vienna (VIE) or Frankfurt (FRA) to BAH.\n\nHainan Airlines\n\nHainan Airlines is a Chinese carrier offering flights to major cities in Asia, Europe, North America and the South Pacific. The carrier has a relatively new fleet too, with many of its long-haul routes being operated by a mixture of Boeing 787 and Airbus A350 aircraft.\n\nEarning Etihad Guest miles with Hainan Airlines\n\nHainan Airlines’ Etihad earning chart awards miles for nearly all booking classes, with first-class tickets earning up to 200% miles flown. Note that Hainan Airlines flights operated by Hong Kong Airlines or another Hainan affiliate are not eligible for earning.\n\nRedeeming Etihad Guest miles with Hainan Airlines\n\nEtihad’s massive Hainan Airlines award chart is distance-based and presents a set of solid deals for short-haul intra-Asia awards. However, we recommend staying away from long-haul awards — you can get a better deal by booking these with Alaska Airlines Mileage Plan.\n\nYou can find Hainan Airlines award space using ExpertFlyer and on the Alaska Airlines website.\n\nKorean Airlines\n\nKorean Airlines is the flag carrier of South Korea and is well-known for its great service and excellent first-class product. Etihad and Korean’s long-time partnership not only offers reciprocal mileage earning, but also extends elite status benefits like lounge access, baggage and priority check-in to Etihad elites traveling on Korean Airlines.\n\nEarning Etihad Guest miles with Korean Airlines\n\nYou can earn up to 200% miles flown when crediting Korean Airlines flights to Etihad Guest. Note that many premium classes earn more miles when crediting to Delta SkyMiles, so do your research and see which loyalty program is best for you.\n\nYou can find Korean Airlines award space on ExpertFlyer and many SkyTeam search tools, but note that not all flights will be bookable with Etihad miles.\n\nRedeeming Etihad Guest miles with Korean Airlines\n\nThe Korean Airlines award chart is distance-based. Do note, however, that Korean Airlines only opens select award tickets to partner bookings, so it’s unlikely that you’ll be able to book Korean Airlines business class with Etihad miles. Likewise, you cannot redeem Etihad miles for Korean Airlines first class.\n\nMalaysia Airlines\n\nMalaysia Airlines is a Oneworld member and the flag carrier of Malaysia, connecting the country to major destinations around the world. The airline currently serves major destinations in Asia, Europe and the South Pacific.\n\nEarning Etihad Guest miles with Malaysia Airlines\n\nYou can earn up to 150% miles flown when crediting Malaysia Airlines flights to Etihad Guest.\n\nRedeeming Etihad Guest miles with Malaysia Airlines\n\nStrangely enough, Etihad prices Malaysia Airlines awards as round-trip tickets. You can, however, book one-way tickets at half the cost of the prices shown above. Like other airlines on this list, the Malaysia Airlines award chart is distance-based.\n\nAdditionally, you can book stopovers on Malaysia Airlines awards booked with Etihad miles, making these awards particularly useful for multi-stop Asia tours beginning and ending in Malaysia. You can find Malaysia Award space on various Oneworld search engines like AA.com.\n\nOman Air\n\n(Photo courtesy of Boeing)\n\nOman Air connects its home airport of Muscat to over 40 destinations in the Middle East, Europe and Asia. It’s known for its hospitality, with its economy, business and first-class cabins all scoring well in recent TPG reviews.\n\nEarning Etihad Guest miles with Oman Air\n\nEtihad recently revamped the Oman Air earning chart, raising the earning rates for a number of fare classes. However, the airline’s cheapest fare — E fare economy — was downgraded to earning just 10% miles flown.\n\nRedeeming Etihad Guest miles with Oman Air\n\nThe Oman Air award chart is priced by destination and its pricing is very reasonable. At the time of writing this article, you can use just 39,000 Etihad miles for a one-way business class flight from Frankfurt (FRA) to Muscat (MCT). This route is operated by the airline’s new 787 aircraft, so you’ll enjoy a posh cabin and a solid hard product.\n\nUnfortunately, however, you must book Oman Air awards at least seven days prior to departure, so you can’t use this for last-minute journeys. Additionally, you can’t search for Oman Air award space online, so you’ll have to call Etihad and have the phone representative find award space for you.\n\nRoyal Air Maroc\n\n(Photo by Brendan Dorsey/The Points Guy)\n\nRoyal Air Maroc is Oneworld’s newest member, but its non-alliance partnership with Etihad is here to stay. Redeeming miles for flights from the U.S. to Morocco is an excellent deal too — a business flight from New York-JFK to Casablanca (CMN) can be booked for less than 50,000 miles.\n\nEarning Etihad Guest miles with Royal Air Maroc\n\nEtihad’s Royal Air Maroc earning chart was revamped in late 2019, but it kept earning rates the same for most of the popular business and economy booking classes. You can earn between 75% and 150% miles flown, with the 150% rate being reserved for business class tickets.\n\nRedeeming Etihad Guest miles with Royal Air Maroc\n\nNow for the fun part: redeeming Etihad miles on Royal Air Maroc. The airline’s earning chart is distance-based, with flights above 2,001 miles costing just 44,000 miles one-way in business class. This tier includes all three of Royal Air Maroc’s North American gateways: Montreal (YUL), New York-JFK and Washington-Dulles (IAD), making it one of the best ways to cross the Atlantic with points and miles.\n\nIn addition, Etihad recently added the ability to book stopovers on Royal Air Maroc award tickets. Unfortunately, however, you’ll pay per segment when booking a stopover. This means that a ticket from JFK to CMN to Madrid (MAD) would cost 56,000 miles in business class as CMN to MAD clocks in at 539 miles.\n\nThe bad news? You can’t find Royal Air Maroc award space online, so you’ll have to call Etihad and have the phone representative search for you.\n\nScandinavian Airlines (SAS)\n\nScandinavian Airlines — “SAS” for short — is the largest airline in Northern Europe. It maintains hubs in major Scandinavian cities like Copenhagen (CPH), Stockholm (ARN) and Oslo (OSL) where it flies to major destinations in Asia, Europe and North America.\n\nEarning Etihad Guest miles with SAS\n\nYou can only earn miles on select SAS routes, all of which are intra-Europe. Thankfully, the earning rates on these routes are high compared to many Star Alliance programs, so it may be worth a look if you find yourself booked on a flight departing Scanianavia.\n\nRedeeming Etihad Guest miles with SAS\n\nLike earning miles, you can only redeem your Etihad miles on select SAS routes. The redemption rates aren’t particularly intriguing, especially since cash fares on these routes are already cheap. That said, you may want to skip these redemptions and save your miles for a more exciting award ticket.\n\nIf you’re interested in booking one of these tickets, use ExpertFlyer or your favorite Star Alliance search engine to find award space.\n\nSriLankan Airlines\n\nFinally, we have SriLankan Airlines. This Oneworld carrier flies from its hub in Colombo (CMB) to major destinations in Asia, the Middle East and Europe. This includes daily flights to the Maldives, giving you an easy way to connect to tropical paradise from elsewhere in the world.\n\nEarning Etihad Guest miles with SriLankan Airlines\n\nSriLankan Airlines doesn’t serve the U.S., so its earning chart won’t too helpful unless you’re on a trip in West Asia. Regardless, Etihad offers solid earning rates in most booking classes and offers better earning rates than AAdvantage on business class tickets.\n\nRedeeming Etihad Guest miles with SriLankan Airlines\n\nThe SriLankan Airlines award chart is priced by location and pricing is reasonable. For example, you can book LHR to CMB for 76,000 Etihad miles in business class, which is a good deal given the flight is just over 5,400 miles.\n\nFurther, you can book a one-way flight from CMB to Male (MLE) for just 7,000 miles in business class. This is helpful if you find a cheap cash ticket or open award space to Colombo on another airline and want to continue on to the Maldives.\n\nYou can find SriLankan Airlines award space using ExpertFlyer or your favorite Oneworld search engine.\n\nHotel and rental car partners\n\nYou can also earn Etihad Guest points with the airline’s various hotel and rental car partners. Etihad has partnerships with all of the major hotel groups and rental car companies, so it’s easy to earn bonus Etihad Guest points whenever you’re traveling around the U.S. or abroad.\n\nHere’s an overview of all of Etihad’s non-airline travel partners.\n\nHotel partnerships\n\nEtihad has partnerships with most major hotel chains. Some of them earn a set number of Etihad miles per stay while others earn miles based on how much you spend on a hotel stay. Many hotel loyalty programs let you transfer your hotel points to Etihad Guest as well, though you’ll usually lose value in the process.\n\nHere’s an overview of all Etihad’s hotel partnerships:\n\n \n\nHotel booking websites\n\nPartner\n\nMileage earning\n\nAgoda\n\nEarn up to 10,000 Etihad miles per hotel booking.\n\nBooking.com\n\nEarn 3 to 6 Etihad miles per dollar spent on hotel bookings.\n\nEtihad Travel Rewards\n\nEarn at least 1,000 Etihad miles per night.\n\nKilago\n\nEarn up to 12 Etihad miles per dollar spent.\n\nRocketmiles\n\nEarn up to 10,000 Etihad miles per night.\n\nRental car partners\n\nYou can also earn Etihad miles when you rent a car from select rental car companies — here’s a look at the airline’s rental car partnerships.\n\nPartner\n\nMileage earning\n\nAvis\n\nEarn up to 5 Etihad miles per dollar spent depending on your Etihad elite status tier, plus earn up to 5,000 bonus Etihad miles on your first rental.\n\nBudget\n\nEarn up to 5 Etihad miles per dollar spent depending on your Etihad elite status tier, plus earn up to 5,000 bonus Etihad miles on your first rental.\n\nCareem\n\nEarn 1 Etihad mile per $2 spent.\n\nCredit card transfer partners\n\nEtihad Guest is a transfer partner of three major U.S. transferrable points programs: Amerian Express Membership Rewards, Capital One and Citi ThankYou. Transferring miles from these credit cards is the easiest way for American travelers to quickly earn Etihad Guest miles.\n\nTransferring American Express Membership Rewards to Etihad Guest\n\nYou can transfer Membership Rewards points to Etihad Guest miles at a 1:1 ratio, meaning that 10,000 Membership Rewards points equal 10,000 Etihad Guest miles. In addition, Amex occasionally runs Etihad Guest transfer bonuses which boost this ratio even higher, effectively giving you a points discount on your Etihad bookings.\n\nHere’s a look at some of our favorite credit cards that earn Membership Rewards points (terms apply):\n\nThe Platinum Card® from American Express – Earn 60,000 points after you spend $5,000 in the first three months of account opening.\n\nAmerican Express® Gold Card – Earn 35,000 points after you spend $4,000 on purchases in the first three months of account opening.\n\nThe Amex EveryDay® Preferred Credit Card from American Express – Earn 15,000 points after you spend $1,000 in the first three months.\n\nTransferring Capital One miles to Etihad Guest\n\nCapital One added a handful of transfer partners to its travel credit cards last year, with Etihad Guest being one of the first. You can transfer points earned with your Capital One® Venture® Rewards Credit Card to Etihad Guest at a 2:1.5 transfer ratio, meaning that 10,000 Capital One miles equal 7,500 Etihad Guest miles.\n\nThe information for the Capital One Venture Card and the Amex EveryDay Preferred card has been collected independently by The Points Guy. The card details on this page have not been reviewed or provided by the card issuer.\n\nTransferring Citi ThankYou points to Etihad Guest\n\nYou can transfer Citi ThankYou points to Etihad at 1:1 transfer ratio. This is one of the best ways to use your ThankYou points, especially if you’re redeeming your points for a high-value award ticket.\n\nBottom line\n\nTPG has long seen Etihad Guest as one of the most undervalued loyalty programs. The airline has a ton of unique airline partners and great earning and redemption rates, so it’s definitely worth a look if you’re hoping to redeem miles for a premium award to the Middle East, Europe, Asia or beyond.\n\nFeatured photo by Zach Honig/The Points Guy.\n\nPartner\n\nMileage earning\n\nCristal Hotels and Resorts\n\nEarn 1 Etihad mile per dollar spent\n\nDanat Hotels and Resorts\n\nEarn 500 Etihad miles per stay\n\nDusit Hotels and Resorts\n\nEarn 500 Etihad miles per stay\n\nHyatt\n\nEarn 500 miles per stay at Hyatt Hotels & Resorts, Hyatt Place and Hyatt Summerfield Suites properties.\n\nTransfer World of Hyatt points to Etihad miles at a 2.5:1 ratio.\n\nInterContinental Hotels Group (IHG)\n\nEarn 500 Etihad miles per stay.\n\nTransfer IHG points to Etihad miles at a 10:2 ratio.\n\nJumeirah Hotels and Resorts\n\nEarn 1 Etihad miles per dollar spent on eligible rates and other on-property expenses.\n\nEarn 5,000 bonus miles on all stays of 15 nights or more regardless of if your rate is eligible.\n\nAccor\n\nTransfer Accor points to Etihad miles at a 2:1 ratio.\n\nMarriott\n\nEarn 2 Etihad miles per dollar spent on qualifying stays at the following brands\n\nThe Ritz-Carlton\n\nJW Marriott\n\nEDITION\n\nAutograph Collection Hotels\n\nRenaissance Hotels\n\nMarriott Hotels\n\nMarriott Vacation Club\n\nGaylord Hotels\n\nDelta Hotels by Marriott\n\nDesign Hotels\n\nLe Méridien\n\nThe Luxury Collection\n\nSheraton\n\nSt. Regis\n\nTribute Portfolio\n\nW Hotels\n\nWestin\n\nEarn 1 Etihad miles per dollar spent on qualifying stays at the following brands\n\nCourtyard by Marriott\n\nFairfield by Marriott\n\nSpringHill Suites by Marriott\n\nResidence Inn by Marriott\n\nTownePlace Suites by Marriott\n\nMarriott Executive Apartments\n\nAC Hotels by Marriott\n\nMOXY Hotels\n\nProtea Hotels by Marriott\n\nAloft\n\nElement by Westin\n\nFour Points by Sheraton\n\nTransfer Marriott points to Etihad Guest at a 3:1 ratio. Earn a 5,000 mile bonus when transferring 60,000 Marriott points to an airline.\n\nMinor Hotels Group\n\nEarn 500 Etihad miles per stay at participating Anantara, AVANI and Tivoli properties.\n\nMillennium & Copthorne Hotels\n\nEarn 500 Etihad miles per stay.\n\nOne&Only Resorts and Mazagan\n\n1 Etihad mile per dollar spent; 3 Etihad miles per dollar spent at the One&Only Royal Mirage.\n\nPreferred Hotels and Resorts\n\n500 Etihad miles per stay.\n\nRadisson Rewards\n\nTransfer Radisson points to Etihad miles at a 10:1 ratio.\n\nRotana\n\n500 Etihad miles per stay.\n\nShangri-La\n\n500 Etihad miles per stay at Shangri-La Hotels and Resorts, Traders Hotels and Kerry Hotels. \n\nTransfer Gold Circle points to Etihad miles at a 1:1 ratio.\n\nTaj Group\n\n500 Etihad miles per stay at Taj Hotels and Resorts; 250 Etihad miles per stay at Gateway Hotels and Resorts and Vivanta properties.\n",
      "Folder": "Feedly",
      "Timestamp": "1591567948",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.295740Z"
}