{
  "id": "f6dd7be920d74131be45b89fc56f9838",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theverge.com/2018/12/28/18150465/best-smart-tv-apps-2018-streaming-cable-youtube-netflix-amazon",
      "Title": "The top streaming apps for your new TV The Verge",
      "Selection": "So you came out of the holidays with a fancy new 4K TV? It doesn’t get much better than that. After managing to unbox it and finding the perfect spot in your living room to put it, the next crucial step is downloading the right apps that can showcase that big screen. \n\nThe easiest, fastest way to locate these apps is to open the app store on your TV — whether it be a Roku TV, Samsung TV, LG, Sony, Vizio, or something else — and look for a list of the most popular downloads. You’ll likely spot many of the choices that I’ve included below right there. If your TV comes with a voice remote, you can also look for them that way. \n\nNote that not all of these apps will be available on every smart TV. The best way to maximize your content selection is to buy a set-top box such as a Roku Premiere, Fire TV Stick 4K, or Apple TV 4K. (For complete information on how to choose which hardware you need for which apps, check out The Verge Cord Cutter’s Guide: Hardware, Software, and Services.) \n\nI’ve divided the list into several categories: “TV Everywhere” apps, which are associated with traditional cable stations; TV streaming services, which are an alternative to cable; and standalone, specialized apps.\n\nWe’ve rounded up our favorite and most-used apps, games, and utilities. Look for our picks for iPhones, PCs, and Mac; our favorite games for iOS and Android, and our top choices for the PS4, Xbox One, and the Nintendo Switch. \n\nTV Everywhere apps\n\nThese are apps that require a cable account login to get the most from them. If you want to watch full-length episodes, you’ll have to sign in. Most major cable networks have their own app. \n\nThere’s nothing necessarily better about watching your programs via these standalone apps versus just pulling up the on-demand options for these channels on your cable box. But if you prefer to keep things separated or hate your cable interface, they’re a nice option to fall back on. I’ve listed them here along with the services where they’re available.\n\nNote that many of these apps now accept login credentials from DirecTV Now, PlayStation Vue, Sling TV, YouTube TV, and other OTT TV providers such as FuboTV. \n\nA&E Available from Fire TV and Roku\n\nABC Available from Fire TV and Roku\n\nAMC Available from Fire TV and Roku\n\nBBC America Available from Fire TV and Roku\n\nBET Available from Fire TV and Roku\n\nCBS Available from Fire TV and Roku\n\nComedy Central Available from Amazon and Roku\n\nThe CW Available from Amazon and Roku\n\nE! Available from Amazon and Roku\n\nEpix Available from Amazon and Roku\n\nFood Network Available from Amazon and Roku\n\nFox Available from Amazon and Roku\n\nFox Sports Available from Amazon and Roku\n\nHBO Go Available from Amazon and Roku\n\nHGTV Available from Amazon and Roku\n\nHistory Available from Amazon and Roku\n\nIFC Available from Amazon and Roku\n\nLifetime Available from Amazon and Roku\n\nMTV Available from Amazon and Roku\n\nNBC Available from Amazon and Roku\n\nNBC Sports Available from Amazon and Roku\n\nNickelodeon Available from Amazon and Roku\n\nSyfy Available from Amazon and Roku\n\nTBS Available from Amazon and Roku\n\nTNT Available from Amazon and Roku\n\nUSA Available from Amazon and Roku\n\nVH1 Available from Amazon and Roku\n\nTV streaming services\n\nOver the last couple years, we’ve seen a wave of internet TV apps that you can subscribe to as a replacement for cable — or if you don’t have cable to begin with. Prices range from $25 for Sling TV up to over $70 for the most complete channel packages from DirecTV Now and PlayStation Vue. You’ll definitely want to reference our Cord Cutter’s Guide for help in picking the one that offers your favorite channels.\n\nStandalone streaming apps\n\n        Roku\n\nThese are either the streaming versions of specific channels, or offer specialized content. My list includes the obvious essentials such as Netflix and Amazon’s Prime Video, but I’ve added others that aren’t quite as well known. I won’t bother describing the obvious must-haves to you, but I’ve included some comments about some of the lesser-known apps you might want to consider. \n\nCBS All Access\n\nCrackleNetflix stole away Comedians in Cars Getting Coffee, but Crackle still has an okay mix of movies to stream. It’s a good Sunday afternoon service. \n\nCrunchyroll\n\nDC Universe\n\nESPN+\n\nGoogle Play TV & Movies\n\nHBO Now\n\nHulu\n\nMLB.TV\n\nMovies Anywhere\n\nNetflix\n\nPrime Video \n\nPandora\n\nPBS\n\nPBS Kids\n\nPlex\n\nThe Roku ChannelDecent choice for random older movies if you’re okay with plenty of ads. \n\nShowtime\n\nShudder\n\nSpotify\n\nStarz\n\nTwitch\n\nUFC\n\nVudu Walmart’s Vudu is probably the best single source for 4K HDR / Dolby Vision movies if you don’t mind paying to rent or purchase them individually. \n\nWWE Network\n\nVox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy.\n",
      "Folder": "Feedly",
      "Timestamp": "1546021370",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.439613Z"
}