{
  "id": "f79d777e1d28475aaa19457f19d2f496",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://www.vox.com/policy-and-politics/2017/3/9/14873480/conway-oge-white-house-ethics-violation",
      "Title": "The White House defended Kellyanne Conway by saying its employees don’t have to follow ethics rules Vox - All",
      "Selection": "That argument did not go over well.\n\nThe White House tried to claim that federal ethics rules shouldn’t apply to its employees. The Office of Government Ethics, responsible for making sure those rules are enforced, says that’s not true.\n\nNow Democrats on the House Oversight Committee have written the White House counsel asking for clarification on the matter. “The President’s staff need to follow ethics rules — not flout them,” the letter read. “When they violet these rules, the President must impose discipline, not invent a legal fiction that these rules do not apply.”\n\nIn a letter last month responding to the flap over Kellyanne Conway’s promotion of first daughter Ivanka Trump’s Nordstrom merchandise, the White House said that “many” federal ethics regulations don’t apply to executive branch employees.\n\nNEW: @OfficeGovEthics sends letter to WH counsel and @GOPoversight taking issue with decision not to discipline @KellyannePolls. http://pic.twitter.com/NcgRJiCYyr\n\n— Alex Mallin (@alex_mallin) March 9, 2017\n\nThe real purpose of the letter was to explain what the White House was doing (or not doing) to discipline Conway after she endorsed Trump’s products from the White House, a violation of federal ethics rules.\n\nOn February 9, Conway appeared on Fox & Friends in the midst of a one-sided fight between President Trump and Nordstrom department stores. The popular retailer had recently announced that it would stop carrying products from Ivanka Trump’s fashion line. Conway, speaking from the White House briefing room, said, “Go buy Ivanka’s stuff, is what I would tell you.”\n\nFederal ethics rules prohibit employees in the executive branch from endorsing “any product, service, or enterprise.” On February 13, OGE Director Walter Shaub sent a letter to the White House recommending that “the employing agency investigate the matter and consider taking disciplinary action.”\n\nBut the top White House ethics official — Deputy Council for Compliance and Ethics Stefan Passantino — defended Conway against allegations of ethical violations. Writing in response to the OGE, Passantino described the conclusions of a White House “inquiry”:\n\nUpon completion of our inquiry, we concluded that Ms. Conway acted inadvertently and is highly unlikely to do so again. It is noted that Ms. Conway made the statement in question in a light, off-hand manner while attempting to stand up for a person she believed had been unfairly treated and did so without nefarious motives or intent to benefit personally. Both before and after receiving your letter, I personally met with Ms. Conway and advised her that her comments regarding Ms. Trump’s products implicated the prohibition on using one’s official position to endorse a product or service. Ms. Conway has acknowledged her understanding of the Standards and has reiterated her commitment to abiding by them in the future.\n\nPassantino also claimed that employees of the executive office of the president aren’t bound by many federal ethics rules. Shaub was not impressed.\n\nThere is “no legal basis” for this claim, Shaub wrote in his response Thursday. Regardless of whether Conway is disciplined by the White House, all employees of the executive branch are subject to federal ethics rules. The only exceptions to that are the president and vice president, who are exempt from certain regulations under the theory that they have so much power that any action could pose a potential conflict.\n\nTrump, for his part, has touted this exemption in the past. “The president can’t have a conflict of interest,” he said in a November interview with the New York Times.\n\nOf course, Trump may have many conflicts of interest, and though he is exempt from certain regulations, several lawsuits have been filed against him arguing he violates the emoluments clause of the Constitution, which prohibits government officials from accepting gifts or payments from foreign governments.",
      "Folder": "Feedly",
      "Timestamp": "1489103213",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.627289Z"
}