{
  "id": "f7ecf36dcef84fc4b363f40772a080df",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/culture/2019/2/1/18206645/celebrating-sojourner-truth-google-doodle-aint-i-a-woman",
      "Title": "Sojourner Truth’s “Ain’t I a Woman” is one of the greatest speeches in American rhetoric Vox - All",
      "Selection": "Start Black History Month by giving it a read.\n \nGoogle is kicking off Black History Month this year by celebrating the legacy of Sojourner Truth, the subject of today’s Google Doodle. Which means that it’s time to reread one of the great works of American rhetoric: Truth’s “Ain’t I a Woman” speech. \n\nSojourner Truth was born into slavery at the end of the 18th century, but she escaped — carrying her infant daughter with her — in 1826. (“I did not run off, for I thought that wicked, but I walked off, believing that to be all right,” she would later say.) When the son she left behind was sold illegally, she successfully sued for his freedom as well. Naming herself “Sojourner Truth,” she converted to Methodism and began campaigning for women’s rights and the abolition of slavery.\n\nShe improvised her “Ain’t I a Woman” speech in 1851 at the Ohio Women’s Rights Convention in Akron. The exact wording of the speech has been contested. In contemporary transcriptions, the famous question “ain’t I a woman?” doesn’t appear anywhere, and some historians have argued that native New Yorker Truth is unlikely to have spoken in the Southern-inflected English that tinges the most widely reproduced version of the speech.\n\nBut regardless of Truth’s precise wording, the message at the core of “Ain’t I a Woman” rings powerfully true 168 years later: that women can change the world, and that Truth’s blackness did not make her not a woman. That’s the kind of intersectionality that Truth was immensely skilled at navigating, despite the enormous pressure on women of color at the time to choose between the women’s movement and the abolitionist movement. Truth never chose. As she pointed out in her speech, she shouldn’t have to.\n\nHere’s the speech in full:\n\nWell, children, where there is so much racket there must be something out of kilter. I think that ‘twixt the negroes of the South and the women at the North, all talking about rights, the white men will be in a fix pretty soon. But what’s all this here talking about?\n\nThat man over there says that women need to be helped into carriages, and lifted over ditches, and to have the best place everywhere. Nobody ever helps me into carriages, or over mud-puddles, or gives me any best place! And ain’t I a woman? Look at me! Look at my arm! I have ploughed and planted, and gathered into barns, and no man could head me! And ain’t I a woman? I could work as much and eat as much as a man - when I could get it - and bear the lash as well! And ain’t I a woman? I have borne thirteen children, and seen most all sold off to slavery, and when I cried out with my mother’s grief, none but Jesus heard me! And ain’t I a woman?\n\nThen they talk about this thing in the head; what’s this they call it? [member of audience whispers, “intellect”] That’s it, honey. What’s that got to do with women’s rights or negroes’ rights? If my cup won’t hold but a pint, and yours holds a quart, wouldn’t you be mean not to let me have my little half measure full?\n\nThen that little man in black there, he says women can’t have as much rights as men, ‘cause Christ wasn’t a woman! Where did your Christ come from? Where did your Christ come from? From God and a woman! Man had nothing to do with Him.\n\nIf the first woman God ever made was strong enough to turn the world upside down all alone, these women together ought to be able to turn it back , and get it right side up again! And now they is asking to do it, the men better let them.\n\nObliged to you for hearing me, and now old Sojourner ain’t got nothing more to say. \n",
      "Folder": "Feedly",
      "Timestamp": "1549233959",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.429249Z"
}