{
  "id": "f833f371d6604e4bb114fdea011357df",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://thepointsguy.com/2017/11/chase-cards-digital-priority-pass/",
      "Title": "Chase Sapphire Reserve and Ritz Cardholders Now Have Access to Digital Priority Pass The Points Guy",
      "Selection": "One popular benefit offered on many premium credit cards is a membership to the Priority Pass lounge network. But until recently, only certain cards would let you use a virtual card to access the lounges. Notably absent: the Chase Sapphire Reserve and the Ritz-Carlton Rewards Credit Card. Even worse, these two cards have the most generous Priority Pass guesting policies, allowing unlimited guests to enter with the member at no cost.\n\nBecause of this restriction, if you have either of these two cards, up until now you needed to take your physical Priority Pass membership card with you when traveling. This confusion could lead to mistakes, like when TPG reader Janice used the wrong Priority Pass card and ended up with a $189 charge for using a lounge that she could’ve entered for free using the correct card.\n\nBut starting this week, cardholders of both the Chase Sapphire Reserve and the Ritz-Carlton Rewards Credit Card are eligible to set-up a digital Priority Pass card. When I spoke with Chase customer service about this development, the rep noted that this feature was just added Wednesday. Affected cardholders will be receiving letters soon about the change.\n\nHowever, that doesn’t have to delay your use of this new tool. Let’s walk through how to set-up your Priority Pass account for digital use.\n\nFirst, you’re going to need your physical Priority Pass card and know your Priority Pass membership expiration date to complete the digital setup. If you don’t have access to both of these, you can call Chase via the number on the back of your card. The customer service representative can connect you with a Priority Pass agent who will read off your account number and expiration date.\n\nOnce you have this info, here are the next steps:\n\nNavigate to http://ift.tt/2B1swJu\n\nEnter your card number, expiration date and solve the Captcha.\n\nSet-up a Priority Pass account by providing your email address and setting up login information. If you already have a Priority Pass account, it looks like you’re going to have to set-up a new account for this card; I haven’t found a way to add a membership to an existing account.\n\nDownload the Priority Pass app (Google Play and Apple Store)\n\nOpen the app and log in with your new account. Note that you can have multiple accounts linked on the app.\n\nSelect the menu bar and select “My Digital Card” to confirm that the digital card is available.\n\nKeep in mind that not all lounges accept the digital card. So, it can’t hurt to bring the physical card along with you when you travel. However, now you’ll at least have a shot of entering lounges if you forget.\n\nWant to learn more about Priority Pass? Here’s some additional reading:\n\nHow Do I Get Priority Pass Cards for Chase Sapphire Reserve Authorized Users?\n\nCan I Use a Priority Pass Lounge on Arrival Instead of Departure?\n\nUsing the Wrong Priority Pass Card — Reader Mistake Story\n\nPriority Pass Adds Minute Suites Locations to Lounge Network\n\nPriority Pass Now Offers Access to More Than 1,000 Lounges\n\nHow Do I Find Airport Lounges Once I Have Access?\n\n10 of the Best Priority Pass Lounges Around the World\n\n9 Best Priority Pass Lounges in the US\n\nH/T: Points Yak\n\nFeatured image by Priority Pass.\n",
      "Folder": "Feedly",
      "Timestamp": "1511183307",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.525245Z"
}