{
  "id": "f9d9396d76574691a1e093a41999d93b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1080076/racism-is-behind-outlandish-theories-about-africas-ancient-architecture/",
      "Title": "Outlandish theories that aliens built the pyramids are rooted in racism Quartz",
      "Selection": "Some of the most impressive buildings and cities ever made by humans can be found in Africa: the ruined city of Great Zimbabwe, Mapungubwe in South Africa, Kenya’s Gedi Ruins and Meroe in Sudan. Perhaps the most awe-inspiring of these are the last remaining of the Seven Wonders of the Ancient World, the Great Pyramid of Giza, in Egypt.\n\nThis should come as no surprise. Africa has an extensive archaeological record, extending as far back as 3.3 million years ago when the first-ever stone tool was made in what is today Kenya. The continent’s cultural complexity and diversity is well established; it is home to the world’s oldest-known pieces of art. And, of course, it is the birth place of modern humans’ ancient ancestors, Homo sapiens.\n\nDespite all this evidence, some people still refuse to believe that anyone from Africa (or anywhere in what is today considered the developing world) could possibly have created and constructed the Giza pyramids or other ancient masterpieces. Instead, they credit ancient astronauts, extraterrestrials or time travellers as the real builders.\n\nWell, you may ask, so what? Who cares if relatively few people don’t believe the ancient Egyptians built the pyramids? What’s the harm? Actually, there is great harm: firstly, these people try to prove their theories by travelling the world and desecrating ancient artefacts. Secondly, they perpetuate and give air to the racist notion that only Europeans – white people – ever were and ever will be capable of such architectural feats.\n\nA threat to world heritage\n\nIn 2014 two German pseudo-scientists set out to “prove” that academics were concealing the Giza pyramids’ “real” origin. To do so, they chiselled off a piece of one of the pyramids—of course, without authorisation, so they could “analyse” it.\n\nAliens? Really? (Reuters/Mohamed Nureldin Abdallah)\nAnd earlier in 2017 scientists from the World Congress on Mummy Studies in South America published a communique on their Facebook page to draw attention to the raiding of Nazca graves for a pseudo-scientific research programme called the Alien project. It insists that aliens rather than ancient Peruvians were responsible for the famous geoglyphs called the Nazca Lines, despite all the evidence to the contrary.\n\nSuch incidents exemplify the threats to developing nations’ cultural heritage. Conservation authorities around the world must spend a great deal of money to protect and restore unique pieces of heritage, and to guard them against vandalism. For instance, the most recent overhaul planned for the Giza site—back in 2008—was estimated at a cost of $45 million.\n\nThese are not wealthy nations, as a rule, and it costs money they often don’t have to repair the damage done by, among others, pseudo-scientists.\n\nRacism and colonial attitudes\n\nA series of stone circles in South Africa’s Mpumalanga province provides an excellent example of the other problem with pseudo-archaeologists. Some people genuinely believe that these structures were designed by aliens. They scoff at scientific research that proves the stone circles were made by the Koni people using ropes, sticks and wood. They will not even entertain the notion that ancient African tribes could be responsible.\n\nBut the same people have no problem believing that medieval Europeans built the continent’s magnificent cathedrals using only ropes, sticks and wood. They dismiss scientific research that overwhelmingly proves ancient Africans’ prowess, but insist the documents which contain evidence of Europeans’ construction processes are beyond reproach.\n\nThe Mapungubwe rhinoceros was hidden for decades. (Reuters/Andrew Heavens)\nWhy is it so hard for some to acknowledge that ancient non-European civilisations like the Aztecs, people from Easter Island, ancient Egyptians or Bantu-speakers from southern Africa could create intricate structures?\n\nThe answer is unfortunately as simple as it seems: it boils down to profound racism and a feeling of white superiority that emanates from the rotting corpse of colonialism.\n\nColonial powers saw their “subjects” in Africa, South America and Southeast Asia as exotic, fascinating—but ultimately primitive.\n\nAn increasing knowledge and understanding of the archaeological record mostly dispelled these notions. But for some, and until nowadays, it seems unthinkable that ancient non-European societies have been resourceful and creative enough to erect such monuments. So, the thinking went, conventional science must have been missing or hiding something: ancient astronauts, aliens, or the lost civilisation of Atlantis. Even some mainstream scholars have dabbled in this thinking.\n\nTelling the truth\n\nThe internet and social media has given these modern conspiracy junkies a perfect platform to share their theories. They try to make others believe that scientists are hiding “the truth” about ancient monuments. Sometimes they even succeed.\n\nThere is a risk that they will drown out quality knowledge and science with their colourful, outlandish theories. When such bizarre theories emerge, it can water down people’s understanding and appreciation of Africa’s architectural and cultural heritage.\n\nAt the same time, these theories can prevent awareness about Africa’s rich heritage from developing. The heirs of the real builders may never learn about their ancestors’ remarkable achievements.\n\nScientists have a crucial role to play in turning the tide on such harmful theories. Those of us who are doing ongoing research around the continent’s architectural and fossil record should be sharing our findings in a way that engages ordinary people.\n\nWe must show them just how awe-inspiring structures like Great Zimbabwe, Meroe and the Giza Pyramids are – not because they were created by some alien race, but because they are living proof of ancient societies’ ingenuity.\n\nJulien Benoit, Postdoc in Vertebrate Palaeontology, University of the Witwatersrand\n\nThis article was originally published on The Conversation. Read the original article.\n\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.",
      "Folder": "Feedly",
      "Timestamp": "1505736649",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.551189Z"
}