{
  "id": "fa3644fcaa1444a989aae4153b87a4f8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/culture/2017/5/14/15631500/better-call-saul-episode-5-recap-chicanery",
      "Title": "Better Call Saul’s terrible, casual cruelty is thrown into stark relief in “Chicanery” Vox - All",
      "Selection": "Every Sunday, we pick a new episode of the week. It could be good. It could be bad. It will always be interesting. You can read the archives here. The episode of the week for May 7 through 13 is “Chicanery,” the fifth episode of the third season of AMC’s Better Call Saul.\n\nOne of the most famous lines from the classic romantic comedy Annie Hall is when its protagonist, Alvy, turns to Annie and tells her, “A relationship, I think, is like a shark, you know? It has to constantly move forward or it dies. And I think what we got on our hands is a dead shark.”\n\nBoth Better Call Saul and Breaking Bad, the series that spun Saul off, are shows about dead sharks.\n\nWhen they begin, their protagonists are trapped in fundamentally broken relationships they feel some need to persist with. But the deeper they get, the more pain these relationships cause them. \n\nIt might be better if everybody involved just gave up and admitted they don’t know how to save the relationship, then moved very far away from each other. But because they don’t know how to do that — because none of us knows how to do that — they end up in spirals of misery and grief.\n\nIn Breaking Bad, that relationship was the marriage between Walter and Skyler White, two people who didn’t quite realize how little they had in common anymore, who seemed to have little affection for each other even before Walter became a drug lord. \n\nBut Better Call Saul isn’t built around a broken marriage, a situation that’s theoretically solvable via divorce or separation. No, Better Call Saul is built around something more primal, something harder to fix — a relationship between brothers.\n\n“Chicanery” pits Jimmy McGill against his brother Chuck in court. It’s a fight that destroys them both.\n\nFrom the first, Better Call Saul has had a bigger heart than its parent series. Breaking Bad often suggested that when the chips are down, most people will make the morally expedient choice. Those who love them will be forced to choose: call out the one you love, or go down with the ship? At a certain point, if you’re bound to someone through marriage or other familial ties, they can damn your soul simply by choices they make. As such, much of the show’s later seasons hinged on what the characters around Walter did as they learned of his actions.\n\nSaul, on the other hand, is about people wanting others to be better, despite the best interests of both parties. In this case, brothers Jimmy (the man who will become Saul Goodman) and Chuck McGill are trapped by perceptions of each other they came to when they were much younger, which continue to influence their interactions in the present, to the detriment of both.\n\nChuck can only see his brother as the shady, not-to-be-trusted kid who stole from the till of their parents’ store. Jimmy can only see his brother as the super smart, super competent lawyer he knew way back when. Both have changed noticeably. But both also seemingly expect the other to revert to their old self at any given moment.\n\n        Chuck’s aversion to electricity has driven much of the series. AMC\n\nThey’re not without reason to expect that reversion. Jimmy may now be a lawyer, one who’s devoted himself to elder law and done some promising work, but he’s still constantly tempted to take the easy route, which often leads him down unethical paths. And Chuck might be stuck in his home, thanks to an imaginary illness that’s actually a manifestation of his troubled mental state, but he continues to have a crackerjack mind that devotes itself mostly to outwitting his brother.\n\nThese two perceptions are set on a collision course in “Chicanery,” which centers on Chuck’s attempts to have Jimmy disbarred for felonious actions he undertook in the wake of Chuck taping Jimmy confessing to one of his bigger sins. He sees this as a mercy — he won’t have Jimmy jailed, but he will keep Jimmy away from the law, which Chuck considers sacred.\n\nJimmy, of course, wants to keep being a lawyer. And he can’t be disbarred without a hearing, which he and his lover/best friend/lawyer Kim turn into a high stakes game of chicken with Chuck. Almost all of Chuck’s objections to his brother can be tossed aside if the two can just convince the court Chuck is mentally ill, not physically sick. And to do that, they have to cause him to have an outburst on the stand. In other words, Jimmy will have to abjectly humiliate the brother he venerates so much.\n\nThat he does is a foregone conclusion — we know Jimmy will continue to practice law in New Mexico for years to come, even if he eventually changes his name. But “Chicanery” makes viewers feel the weight of every moment of that showdown, from the early going when Chuck seems to have the upper hand, to the moment when Jimmy delivers the killing blow — and seems utterly destroyed by having done so.\n\n“Chicanery” is a great example of just how exquisitely crafted this show is\n\nThere’s something effortless to the way Better Call Saul makes great TV. It has maybe 20 percent of the outward flash of Breaking Bad — it’s probably not going to start blowing up nursing homes any time soon — but just as much emotional and psychological depth. If Breaking Bad was often ostentatious in its stylishness, Better Call Saul takes a worn down TV genre (the legal drama) and makes it deeply compelling through sheer force of craft.\n\nLook at how “Chicanery” is shot, by Daniel Sackheim (who also shot the past week’s exemplary Leftovers episode, in a neat coincidence). The final shot of the episode — Chuck, tiny, on the witness stand, looking up at a humming EXIT sign dominating the foreground — carries with it multiple meanings in a single image. \n\nFirst, consider that Chuck’s imagined illness causes him acute sensitivity to electricity. Earlier in the episode, he was informed the exit signs would have to remain on in the courtroom in order to stay up to building codes, and he said that, sure, he could deal with that small amount of pain. \n\nBut after Jimmy proves the illness is all in his head (by having Breaking Bad carryover Huell nimbly plant a cell phone battery in Chuck’s pocket), the final shot gains added poignancy: Chuck not only continues to feel the imagined pain of the exit sign, but also the actual pain of what his brother has done to him in front of trusted friends and colleagues. He might be looking at a way out, but he has no way to take it.\n\n        Jimmy and Kim ponder their next move.AMC\n\nThe episode’s script, by Gordon Smith, similarly displays how good the series’ writers are at being casually clever. It foregrounds, at every moment, the fact that Jimmy and Kim are Up To Something, but it never once lets you know precisely what they’re doing, leaving you more or less in Chuck’s shoes. \n\nWhen Jimmy somehow convinces Chuck’s ex-wife to attend the hearing, is that his trump card? When Jimmy pulls a cell phone out of his own pocket, is that the final grace note? Chuck never sees the battery gambit coming, and neither do we, because the episode keeps us in the dark. But because we know we’re in the dark, we somehow don’t mind. It somehow becomes compelling to wait for the other shoe to drop.\n\nThis almost workmanlike devotion to small-scale but gorgeously crafted drama has earned Better Call Saul accusations of being too boring from some corners, and as if to compensate, season three has steadily ramped up storylines about Albuquerque’s criminal element, now featuring Breaking Bad favorite Gus Fring. These stories, too, brim with beautiful shots and clever story turns, along with tremendous performances. \n\nBut for me, they’ll never be as compelling as the story of Jimmy and Chuck, two brothers bound together in fierce love and fierce hate, strapped to the same shark, not quite realizing it’s dead, plunging into the abyss together. This isn’t a show about violence against the body. It’s about violence against the heart. That’s made all the difference.\n\nBetter Call Saul airs Mondays at 10 pm Eastern on AMC. Previous seasons are on Netflix.\n",
      "Folder": "Feedly",
      "Timestamp": "1494791470",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.603103Z"
}