{
  "id": "fa7a4c8d21c645258ca1d0e7876a509f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://mashable.com/2010/04/29/deal-with-haters-tim-ferriss/",
      "Title": "Tim Ferriss - 7 Great Principles for Dealing with Haters",
      "Selection": "Tim Ferriss - 7 Great Principles for Dealing with Haters\n\nApril 29, 2010 Amy-Mae Elliott\n\nTim Ferriss: 7 Great Principles for Dealing with Haters\n\nDo you like this story?\n\nDealing with negativity online can be tough, which was why we were all ears when Tim Ferriss, author of The Four Hour Work Week, took the stage at The Next Web ‘10 event in Amsterdam to discuss how to learn to love haters.\n\nWhile Mashable recently offered you advice on how to deal with negative feedback specifically in the social media realm, Ferriss takes the concept a step further with advice on how to contend with — and benefit from — criticism across all platforms. We caught up with Ferriss backstage at the event to find out more about his seven principles for dealing with haters.\nRead on for some interesting ideas and let us know which work for you — as well as your own strategies — in the comments below.\n\n1. It doesn’t matter how many people don’t get it. What matters is how many people do.\n\n“It’s critical in social media, as in life, to have a clear objective and not to lose sight of that,” Ferriss says. He argues that if your objective is to do the greatest good for the greatest number of people or to change the world in some small way (be it through a product or service), you only need to pick your first 1,000 fans — and carefully. “As long as you’re accomplishing your objectives, that 1,000 will lead to a cascading effect,” Ferriss explains. “The 10 million that don’t get it don’t matter.”\n\n2. 10% of people will find a way to take anything personally. Expect it.\n\n“People are least productive in reactive mode,” Ferriss states, before explaining that if you are expecting resistance and attackers, you can choose your response in advance, as opposed to reacting inappropriately. This, Ferriss says, will only multiply the problem. “Online I see people committing ’social media suicide’ all the time by one of two ways. Firstly by responding to all criticism, meaning you’re never going to find time to complete important milestones of your own, and by responding to things that don’t warrant a response.” This, says Ferriss, lends more credibility by driving traffic.\n\n3. “Trying to get everyone to like you is a sign of mediocrity.” (Colin Powell)\n\n“If you treat everyone the same and respond to everyone by apologizing or agreeing, you’re not going to be recognizing the best performers, and you’re not going to be improving the worst performers,” Ferriss says. “That guarantees you’ll get more behavior you don’t want and less you do.” That doesn’t mean never respond, Ferriss goes on to say, but be “tactical and strategic” when you do.\n\n4. “If you are really effective at what you do, 95% of the things said about you will be negative.” (Scott Boras)\n\n“This principle goes hand-in-hand with number two,” Ferriss says. “I actually keep this quote in my wallet because it is a reminder that the best people in almost any field are almost always the people who get the most criticism.” The bigger your impact, explains Ferriss (whose book is a New York Times, WSJ and BusinessWeek bestseller), and the larger the ambition and scale of your project, the more negativity you’ll encounter. Ferriss jokes he has haters “in about 35 languages.”\n\n5. “If you want to improve, be content to be thought foolish and stupid.” (Epictetus)\n\n“Another way to phrase this is through a more recent quote from Elbert Hubbard,” Ferriss says. “‘To avoid criticism, do nothing, say nothing, and be nothing.” Ferriss, who holds a Guinness World Record for the most consecutive tango spins, says he has learned to enjoy criticism over the years. Ferriss, using Roman philosophy to expand on his point, says: “Cato, who Seneca believed to be the perfect stoic, practiced this by wearing darker robes than was customary and by wearing no tunic. He expected to be ridiculed and he was, he did this to train himself to only be ashamed of those things that are truly worth being ashamed of. To do anything remotely interesting you need to train yourself to be effective at dealing with, responding to, even enjoying criticism… In fact, I would take the quote a step further and encourage people to actively pursue being thought foolish and stupid.”\n\n6. “Living well is the best revenge.” (George Herbert)\n\n“The best way to counter-attack a hater is to make it blatantly obvious that their attack has had no impact on you,” Ferriss advises. “That, and [show] how much fun you’re having!” Ferriss goes on to say that the best revenge is letting haters continue to live with their own resentment and anger, which most of the time has nothing to do with you in particular. “If a vessel contains acid and you pour some on an object, it’s still the vessel that sustains the most damage,” Ferriss says. “Don’t get angry, don’t get even — focus on living well and that will eat at them more than anything you can do.”\n\n7. Keep calm and carry on.\n\nThe slogan “Keep Calm and Carry On” was originally produced by the British government during the Second World War as a propaganda message to comfort people in the face of Nazi invasion. Ferriss takes the message and applies it to today’s world. “Focus on impact, not approval. If you believe you can change the world, which I hope you do, do what you believe is right and expect resistance and expect attackers,” Ferriss concludes. “Keep calm and carry on!”",
      "Folder": "Archive",
      "Timestamp": "1289517482",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:27:00.147527Z"
}