{
  "id": "fb68569d3a4a4b1e9538428ea59abcd7",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1687360/stock-name-and-ticker-confusion-costs-investors-millions-every-year/",
      "Title": "The embarrassing trading mistake that costs investors millions every year Quartz",
      "Selection": "There are thousands of companies listed on US stock exchanges. With that many stock tickers to keep track of, it’s no surprise that people sometimes make mistakes when buying shares. These screw-ups cost investors—in transaction fees and embarrassment—when they have to undo the trades.\n\nTwo professors at the Rutgers School of Business-Camden, in a forthcoming issue of the Journal of Financial Markets, found that more than half of listed US companies share a “meaningful part” of their names or tickers with another firm, often in a separate industry and with a dramatically different market capitalization. Of that group, there are around 250 company pairs where the possibility of confusion is particularly high, and a quarter of these showed statistically significant similarities in trading patterns that can only be explained by cases of mistaken identity.\n\nTake Ford Motor, which has the stock ticker F. There’s also a consumer goods firm called Forward Industries, which has the stock ticker FORD. Forward Industries, which has a market capitalization of around $10 million versus Ford Motor’s $36 billion, sees its share purchases balloon when Ford makes a splash. These sorts of co-movements account for 5% of trades for the smaller companies in the pairs, a share that “indicates that confusion trading is not driven only by retail investors,” the professors write. Undoing the trades costs at least $1.1 million in yearly transaction fees for the most affected pairs. The effects of mistaken trades often take a week to fade away.\n\nCommon name/ticker mix-ups\n\nLarger company (Ticker)\nSmaller company (Ticker)\nMarket cap difference: Big vs small\n\nFord Motor Company (F)\nForward Industries (FORD)\n347,079%\n\nZions Bancorporation (ZION)\nZion Oil (ZN)\n26,439%\n\nR1 RCM (RCM)\nRCM Technologies (RCMT)\n3,215%\n\nAmerican Software Inc (AMSWA)\nAmerican Shared Hospital Services (AMS)\n2,883%\n\nM.D.C. Holdings (MDC)\nMDC Partners (MDCA)\n1,288%\n\nOne spectacular example was when, as the researchers document, the stock price of Tweeter Home Entertainment Group surged by more than 1,000% on Oct. 4, 2013. The company traded under the ticker TWTRQ, and social media giant Twitter had just filed plans for its IPO—it listed the following month, with the ticker TWTR.\n\nThe researchers note the phenomenon of name and ticker confusion is more common than the issue known as “fat finger trades,” when the wrong shares are bought due to an accidentally mistyped key. And the best way to avoid confusion between similarly named company pairs is easy enough: the researchers found that when companies changed their names or tickers, the abnormal trading patterns vanished.\n",
      "Folder": "Feedly",
      "Timestamp": "1566603227",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.380028Z"
}