{
  "id": "fb9dfcfded3f4004a35e0edbb681a151",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "http://tywkiwdbi.blogspot.com/2012/05/islamic-views-of-evolution.html",
      "Title": "Islamic views of evolution TYWKIWDBI (Tai",
      "Selection": "Selected passages from the Wikipedia entry on the subject.\nIslamic views on evolution are diverse, ranging from theistic evolution to creationism. Muslims believe in a God as the Creator, as explained in the Qur'an. Throughout history some Muslim thinkers have proposed and accepted elements of the theory of evolution, while believing in the supremacy of God in the process. In modern times, some Muslims have rejected evolution, and teaching it is banned in some countries. The main schism between Islam and evolution is in the Adamic descent of human beings, a concept which modern biological anthropology rejects as mythology...\nThe Qur'an does not contain a complete chronology of creation. It declares variously that it took \"six ayums\" to create the \"seven heavens [or firmaments] and earth\" An 'ayum' is defined as a stage, or a relative quantity of time rather than a 24 hour period...\nCertain verses in the Qur'an are claimed by Muslims to be compatible with the expansion of the universe, Big Bang and Big Crunch theories...The Mu'tazili scientist and philosopher al-Jahiz (c. 776-869) was the first of the Muslim biologists and philosophers to develop an early theory of evolution. He speculated on the influence of the environment on animals, considered the effects of the environment on the likelihood of an animal to survive, and first described the struggle for existence, a precursor to natural selection. Al-Jahiz's ideas on the struggle for existence in the Book of Animals have been summarized as follows:\n\"Animals engage in a struggle for existence; for resources, to avoid being eaten and to breed. Environmental factors influence organisms to develop new characteristics to ensure survival, thus transforming into new species. Animals that survive to breed can pass on their successful characteristics to offspring.\"... \n\nIn the 13th century, Nasir al-Din al-Tusi explains how the elements evolved into minerals, then plants, then animals, and then humans. Tusi then goes on to explain how hereditary variability was an important factor for biological evolution of living things:\n\"The organisms that can gain the new features faster are more variable. As a result, they gain advantages over other creatures. [...] The bodies are changing as a result of the internal and external interactions.\" ... \n\nEvolutionary biology is included in the high-school curricula of most Muslim countries. Science foundations of 14 Muslim countries, including Pakistan, Iran, Turkey, Indonesia, and Egypt, recently signed a statement by the Interacademy Panel (IAP, a global network of science academies), in support of the teaching of evolution, including human evolution. Little is known about general societal views of evolution in Muslim countries.\nA 2007 study of religious patterns found that only 8% of Egyptians, 11% of Malaysians, 14% of Pakistanis, 16% of Indonesians, and 22% of Turks agree that Darwin's theory is probably or most certainly true, and a 2006 survey reported that about 25% of Turkish adults agreed that human beings evolved from earlier animal species. In contrast, the 2007 study found that only 28% of Kazakhs thought that evolution is false. According to Salman Hameed, writing in the journal Science, there exists a contradictory attitude towards evolution in the Muslim world. While Muslims accept science as fully compatible with Islam, and most accept microevolution, very few Muslims accept the macroevolution as held by scientists, especially human evolution.\n\nI find it interesting to see \"Darwinian\" theories expressed a millennium before Darwin. This post is of necessity a rather perfunctory summary of a complex subject, so feel free to add comments.  And see also \"The Qur’an & Space Science\" at The Turbid Blog.\nHere's a relevant prior post.Reposted from 2009 in recognition of Darwin Day.",
      "Folder": "Feedly",
      "Timestamp": "1486943423",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.714525Z"
}