{
  "id": "fceed2fdeef74ffd971fee64ec53970b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/1074409/the-future-of-retail-is-tiny-stores-everywhere-that-sell-exactly-what-you-need/",
      "Title": "The future of retail is tiny stores everywhere that sell exactly what you need Quartz",
      "Selection": "Americans hate waiting. That’s why the US has drive-through fast-food chains, drive-through pharmacies, and drive-through ATMs. Why bother moving your legs slightly if not leaving your car is an option?\n\nBut over the last decade or so, as internet shopping has become increasingly simple, many Americans have managed to staunch their impatience to get what they want for slightly less money. If Amazon can sell a pack of AA batteries for $3 cheaper than the grocery store—and you don’t need those batteries immediately—it’s worth waiting.\n\nBut sometimes you can’t wait two days for your Amazon package to show up.\n\nPaul McDonald, a 13-year veteran of Google who help launched the earliest iterations of Google Wallet, wants to change the way we buy the most necessary things. “Americans are used to getting things that they want,” he said. Today, he’s launched a new startup called Bodega, that he hopes will fill a void left by shopping on the web.\n\nBodega, unlike the name suggests, is not a small deli at the end of your street that sells sandwiches, has a cat, and maybe some decent beer. The company produces squat internet-connected, wood-and-glass cabinets meant to reside in the common spaces we all use every day, like the gym or the office. The cabinets are filled with items to buy that are relevant to where you are at that given moment: In the office, they might be filled with snacks and drinks; at the gym, they could have Gatorade, supplements, and knee braces; in an apartment lobby, there could be detergent, pharmaceutical goods, and perhaps some snacks, too. Whatever makes most sense.\n\nWhat you need, where you need it. (Bodega)\n\nHere’s how it works: Users with the Bodega app find a cabinet near them, type its unique identifying number into the app, and then it opens. They take out the items they want—10 cameras with custom-trained computer vision keeps track of what they’re doing—and close the cabinet. Much like a miniature version of how Amazon intends to run its grocery stories, the customer’s card is automatically charged for whatever they take out, and they’re free to go back to their apartment with that box of Lucky Charms they were in dire need of. McDonald said the company keeps humans in the loop to review footage captured from the cameras in case their computer vision model recognizes something incorrectly. Customers can comment through the app if there’s a been a mix-up.\n\nMcDonald told Quartz that the company buys the items it stocks its cabinet with at wholesale prices, and will sell them at retail prices. Building owners can install the Bodegas at no cost—McDonald said the cost of building the cabinets is covered by the markup on the items it sells—and they pay for the goods inside. Bodega will offer a range of items to sell, building owners can choose what to stock, and customers can suggest items through the app.\n\nBodega’s model is intended to compete against the Amazon approach of selling you anything you want and getting it eventually.\n\nThis, of course, is a tall order.\n\n“We’re shrinking the store and putting it in a box,” McDonald said, suggesting his cabinets could be a way for traditional retailers to fight Amazon’s creep into their business. Perhaps a GNC-branded Bodega could be put in a gym, or a Walgreens-branded box installed in an apartment lobby.\n\nEven when Amazon achieves its dream of being able to ship small goods to customers around the world with drones, physical and logistical limitations will mean it’s highly unlikely that Amazon will be able to deliver things to people quicker than about 30 minutes. And sometimes, you just need things fast: Imagine it’s 11pm, you’re getting ready to go to sleep, and realize you’re out of toothpaste. You won’t want to wait 30 minutes for an Amazon drone to show up, or get dressed to go to the pharmacy.\n\nMcDonald said that there are now roughly 30 cabinets in use around the Bay Area, including some at fraternities and sororities at the University of California, Berkeley. That’s a space, that other than perhaps an old vending machine or two, that has never really been open to retailers. McDonald said the US has roughly 4 million vending machines and 5,000-odd 7-Eleven stores across the world—he wants Bodega to replace them all.\n\nWhether that’s possible—and what this would mean for thousands of retail employees working at convenience stores—is unclear. But Bodega isn’t alone in this quest: clothing retailer Uniqlo has been testing vending machines at airports for items you forgot to pack, and Best Buy has had similar machines for electronics for years.\n\nAt a time when Amazon is getting an increasingly large slice of the retail dollars spent on the internet, micro-shops containing the goods people need when they need them, cloud be a way for retailers to combat the online giant. It might well be a better option that selling the same commoditized items Amazon does and hoping people will choose your website over Amazon’s. Or perhaps the future will just be stores devoid of any merchandise whatsoever.\n\nMost Popular\n",
      "Folder": "Feedly",
      "Timestamp": "1505312541",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.634005Z"
}