{
  "id": "fd0ab9ed380442e49c70cf53cf0462c8",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/908391/egypts-real-estate-boom-has-turned-from-economic-safe-haven-to-rubble/",
      "Title": "Egypt’s real estate boom has turned from economic safe haven to rubble Quartz",
      "Selection": "Cairo\n\nIn the summer of 2016, outside the office of a Cairo real estate company called Mountain View, a crush of hundreds of people had gathered, and they were in a frenzy.\n\nThe crowd of men and women were there to reserve spaces in a new desert compound at a bargain price, hoping to sell it on a few weeks later for a big profit. Walid Salah-Ahmed, a real estate developer himself, was there to reserve an apartment, but he ended up having to pull a woman out of the crowd after she fainted. He splashed water on her face, she came to, and got up and plunged right back into the crowd in the hopes of closing on an apartment.\n\n“The logic is this is the best investment in town, you can dump it in 30 days and make 100,000 (Egyptian) pounds,” ($11,000 at the time of this offering) said Salah-Ahmed. Real estate values had been increasing by an average of 30-35% per year in 2016, but its primacy in the Egyptian economy could be in trouble.\n\n For years, the Egyptian real estate market was the safest game investment in Egypt, despite political turmoil. For years, the Egyptian real estate market was the safest game investment in Egypt, despite political turmoil. In fact, that upheaval also helped drive the real estate market. As protestors railed against the government and Egypt saw a new president, Mohamed Morsi, and then another, Adly Mansour, and then another, the current president Abdel Fattah al-Sisi, the value of Egyptian currency fell versus to the US dollar and the euro.\n\nSo, the government controlled the exchange rate, and applied currency controls, resulting in a black market that priced dollars at almost twice the official exchange rate. Egyptians saw cash as risky, and property as safe. But after authorities decided to float the Egyptian pound, and let the free market dictate the exchange rate, the boom days of real estate are probably over.\n\n“I think there’s a tremendous slowdown in the real estate sector,” Salah-Ahmed said. “If this was a normal country, they would call this a crash.”\n\nOver 10% of Egypt’s GDP growth is real estate development, up from 3% before the Arab Spring revolution. A slowdown means a big impact on the Egyptian economy, and depreciating real estate prices would mean a cut into middle class and wealthy Egyptians’ savings. And, every year since the foreign exchange crisis began, real estate has made up more and more of new GDP growth in Egypt.\n\nThe devalued pound also means major inflation for inputs, and weaker wages for buyers. In a field of hundreds of small brick factories this summer south of Cairo, only two were operating Mohamed Abou Atiya, the owner of the factory, said he was in debt for around 3 million Egyptian pounds ($338,000 at the time) due to rising costs. At the peak of the housing boom, each one of these kilns was producing 250,000 bricks each day.\n\n“It’s become a problem of affordability and problem of inputs on supply side,” said Noaman Khalid, an economist with CI Capital Asset Management in Cairo. Inflation also means furnishing a new home is expensive.\n\nAfter Khalid published a note on LinkedIn asking if the Egyptian market would be able to avoid a crash, hedge fund managers and real estate investors widely read the article. It triggered a serious conversation inside these industries. Most real estate industry figures dismissed it, until Egyptian billionaire real estate mogul Samih Sawiris also said that the market was approaching a bubble.\n\nWhile a crash would be bad news for the Egyptian economy trying to get back on its feet after years of stagnant growth, it would be worse news for the government’s recovery strategy, which puts a strong bet on real estate and megaprojects.\n\nJust over half of new investment goes to these new cities, major suburbs that are built from the ground up mostly in the desert, rather than the Nile Valley of Egypt, which needs major infrastructure upgrades and maintenance. There is a housing gap of 3 million units, most of which affects the areas that the government has not prioritized for investment and often are outside of the formal market.\n\nOne such project is the new unnamed administrative capital, between Cairo and Suez. A $45 billion project, which the government hopes mostly to be financed by private investors, many of whom have been given free land. The government’s strategy so far has been, build it and they will come. But if real estate isn’t what it used to be, it will be hard to fill out those empty desert lots.\n\nReporting for this article in Egypt was supported by a grant from the Pulitzer Center on Crisis Reporting.\n\nSign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox.\n",
      "Folder": "Feedly",
      "Timestamp": "1487010940",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.636493Z"
}