{
  "id": "fe2fd6c80208446088fc6654f86fffed",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://skillet.lifehacker.com/how-to-build-an-indian-spice-cabinet-1819366601",
      "Title": "How to Build an Indian Spice Cabinet Skillet",
      "Selection": "Indian cooking can seem complicated and convoluted to people who aren’t inherently familiar with it; all that grinding of various spice pastes—a dash of this, a smidgen of that. But the truth is that once you get the hang of a few basic spices, Indian cooking is as straightforward as any other cuisine.\n\nStocking a spice cabinet can be a little overwhelming, simply for the reason that there are so many …\n\nRead more Read\n\nThere is, however, a point of caution, and it is this: spices—once packets are opened and freshness seals are ripped away—do not last forever. So if you’ve had turmeric sitting in your kitchen cabinet for months and months, my advice is to throw it away, as you may as well be sprinkling flavorless yellow dust in your food. The maximum time limit for an opened spice packet is one month, which is why I buy my spices in small quantities, and store them in airtight containers. This means purchasing them more frequently, but I get the best out of the spices I buy when I buy only what I need.\n\nSpices don’t last forever, and fresher is better. If you have a few spices you don’t use all that…\n\nRead more Read\n\nIn addition to being fresh, spices need to be dry roasted to release all of their beautiful flavors. Some spices—like cardamom—have to be popped open and then dry roasted in order for them to be effective. Though you may have seen television chefs airily dropping closed cardamom pods or cloves into their food without dry roasting them first, it’s not something you should try at home. In fact, you may as well omit the spices entirely if you’re not going to roast them first. Now that we’ve got those points covered, let’s take a look at some of the most common Indian spices, what they are, and what they’re used for.\n\nCardamom\n\nCardamom is one of the most commonly used spices in Indian cooking, and it is used for both savory as well as sweet dishes, such as ladoos. Buy the green cardamom pods and crush them slightly to pop the pods open before roasting them gently. Their aromatic and slightly citrusy notes work well in baking projects with nutmeg, allspice, cinnamon and other, similar spices.\n\nCloves\n\nYou may have noticed that cloves look like little flowers. That’s because they are. Much of the oil is pressed out for clove oil—which you may have heard of if you’ve ever had a toothache—and the flowers are then dried. Slow roasting cloves releases their aroma and oils. Cloves are very spicy and slightly medicinal in taste, but when they are used in moderation in spice mixes and dishes such as biriyani (a fragrant rice dish that has meat and vegetables) they are invaluable.\n\nTurmeric\n\nTurmeric is a root that is indispensable in Indian cooking. It adds a distinctive bright yellow color and a subtle pungent, earthy flavor to everything that it touches, and it can be used fresh or dried. It can be used as part of a cold remedy, and in the Indian kitchen it is added to almost everything—from gravies to curries to sauces. My grandmother never measured anything; she instinctively knew how much of something to use, but you may want to use measuring spoons.\n\nMustard Seeds\n\nMustard seeds are varied—there are black, brown, and yellow mustard seeds—and their use in Indian cooking is also just as varied. In order to release their spicy flavor, mustard seeds must be roasted in oil until they pop. Once they pop—don’t worry, you’ll hear it—they can be added to savory dishes. Mustard oil is widely used in the north and north-east of India for cooking. You can use it to make mustard or pickling liquids, or you can temper the seeds in hot oil before adding it—along with other spices such as turmeric and red chili powder—to cooked vegetables such as potatoes or carrots and beans.\n\nMany of the cooking methods to extract maximum flavor, such as slow roasting or slow cooking, are,…\n\nRead more Read\n\nBlack Peppercorns\n\nBlack peppercorns are the fruits of a flowering vine that are dried, packaged, and sold as a spice. It is a fairly common spice in Indian cuisine although it has a tendency to be on the expensive side. This is because it is very hard to grow, and each peppercorn only contains a single seed. There are also green and white peppercorns which are used in certain dishes such as kara kulambu (spicy gravy), tamarind curry, and rasam (pepper water). Peppercorns have a distinctive heat that you can feel in the back of your throat as you eat, and their spicy, earthy taste means that they can be used in food preparation in place of chilies.\n\nCumin\n\nOne of my favourite spices, cumin is a critical addition to spice mixes. The spicy, almost nutty tasting seeds can be used whole in dishes, or ground to a paste. Its uses are varied and its smoky taste—with slightly bitter undertones—is distinctive. When you dry roast cumin make sure you do it over very low heat and don’t let it burn (it burns easily). Burnt cumin will have to be thrown away and that would be a dreadful waste. Cumin is a vital ingredient in many spice mixes such as curry powder and garam masala.\n\nGinger and Garlic\n\nGinger and garlic are a fairly obvious addition to this list. You can use them fresh, ground to a paste, or in powder form. I prefer them fresh; there is a depth and intensity to freshly ground ginger and garlic that is lacking when they are used in powder form. However, that is a personal preference, and the dried stuff can be used with perfectly fine results.\n\nCinnamon\n\nAlthough I’ve titled this “cinnamon,” Indian cooking actually employs cassia bark, or Chinese cinnamon. It is a bit less intense than the cinnamon you’re used to—which is also called “true cinnamon”—although the sweet, earthy taste is very similar. Cassia can be used whole or ground, and it is used in savory dishes such as Tandoori chicken and aloo gobi as well as sweet dishes such as payasam.\n\nSaffron\n\nI’ve left the most expensive spice to the very end. Saffron is not a common ingredient in everyday dishes; it is a special occasions sort of spice. Saffron’s subtle floral notes elevate any dish that it is added to, and it is often used in fragrant rices as well as in desserts. Saffron is very hard to grow and is hand-picked, making it worth more than its weight than gold. To get the most out of saffron, it is soaked in warm water or warm milk. The soaking liquid is then added to dishes such as saffron chicken, kesari bhat, and rasmalai.\n\nYou don’t necessarily need to run out and buy all of these at once—you may want to test the waters by picking up whatever you need for a given recipe first—but the above options should offer you a solid jumping off point to start experimenting. And if you have questions about anything spice related, please feel free to ask me in the comments!\n",
      "Folder": "Feedly",
      "Timestamp": "1507754656",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.616715Z"
}