{
  "id": "fe4a07ad42084ef7bd69a46acbe4b9d2",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://frequentmiler.boardingarea.com/aeroplan-etihad-sweet-spot-first-class-to-australia/",
      "Title": "Aeroplan Etihad first class sweet spot US to Australia & how to do it Frequent Miler",
      "Selection": "Yesterday, Greg covered the news about the Etihad and Aeroplan partnership. In that post, Greg noted some of the potentially interesting opportunities with Aeroplan miles. One of the exciting things about this partnership is the ability to mix and match flights with Star Alliance carriers in order to piece together a cool trip. This post offers a look at the various Aeroplan sweet spots starting from the United States followed by how to use the Aeroplan engine to connect the dots on the sweetest spot regarding this partnership, which could put you on Etihad apartments to Australia for a very reasonable price — perhaps even getting 20 hours of Etihad apartments for the business class price.\n\nAeroplan sweet spots from the United States\n\nWe have previously written a series of “Best ways to get to” various regions of the world in premium cabins (see this page for a full list of those posts so far). To recap Aeroplan-specific sweet spots, see the North America-centric award chart and snippets below:\n\nAsia\n\nThe short story: Aeroplan offers decent pricing for awards to and from Asia, with a decent number of partners on which you’ll pay no or low fuel surcharges. They also offer stopovers on round trip awards, which can present particular value. Lap infants are charged incredibly reasonable fees in either cash or miles and the price is the same whether booking one way or round trip.\n\nMiles required: 75K miles each way in business class to Asia 1 or the Indian Subcontinent or 77.5K miles each way to Asia 2 (roughly “Southeast Asia”). First class is 105K or 107.5K each way. Fuel surcharges are passed on with some partners, so choose carriers with low / no fuel surcharges.\n\nHow to find awards: Search for available space at Aeroplan.com (you’ll need to create a free Aeroplan frequent flyer account to search)\n\nHow to book awards: Book online at Aeroplan.com. Can also book via phone. Lap infants must be added to your reservation over the phone.\n\nKey warnings: There are high fuel surcharges on Lufthansa.\n\nNo fuel surcharges on: Aegean, Air China, Air India, Air New Zealand, Avianca, Brussels Airlines, COPA, Croatia Airlines, Egypt Air, Ethiopian, Etihad, EVA Airlines, GOL, Juneao Airlines, SAS, SWISS, Shenzhen Airlines, Singapore Airlines, South African Airways, Turkish Airlines, United Airlines\n\nLow fuel surcharges on: Cathay Pacific / Cathay Dragon, LOT Polish, Thai Airways\n\nTransfer from: Amex, Capital One, Marriott\n\nAfrica\n\nThe short story: Aeroplan offers better pricing on Star Alliance business class awards to Africa than United does, though they definitely aren’t the cheapest way to fly business class to Africa. They also offer stopovers on round trip awards, which can present particular value. Lap infants are charged incredibly reasonable fees in either cash or miles and the price is the same whether booking one way or round trip.\n\nMiles required: 75K miles each way in business class or 105K in first class to East, West, and South Africa or 82.5K each way in business class / 115K in first class to North Africa (and the Middle East). Fuel surcharges are passed on, so choose carriers with low / no fuel surcharges.\n\nHow to find awards: Search for available space at Aeroplan.com (you’ll need to create a free Aeroplan frequent flyer account to search)\n\nHow to book awards: Book online at Aeroplan.com. Can also book via phone. Lap infants must be added to your reservation over the phone.\n\nKey warnings: There are high fuel surcharges on Lufthansa, but the relative savings in terms of miles used for first class might mitigate the fees.\n\nNo fuel surcharges on: Aegean, Air China, Air India, Air New Zealand, Avianca, Brussels Airlines, COPA, Croatia Airlines, Egypt Air, Ethiopian, Etihad, EVA Airlines, GOL, Juneao Airlines, SAS, SWISS, Shenzhen Airlines, Singapore Airlines, South African Airways, Turkish Airlines, United Airlines\n\nLow fuel surcharges on: Cathay Pacific / Cathay Dragon, LOT Polish, Thai Airways\n\nTransfer from: Amex, Marriott\n\nEurope\n\nThe short story: Aeroplan offers competitive pricing on Star Alliance business class awards and the best deal on first class awards to and from Europe at 70K each way. They also offer stopovers on round trip awards, which can present particular value. Lap infants are charged incredibly reasonable fees in either cash or miles and the price is the same whether booking one way or round trip.\n\nMiles required: 55K each way in business class or 70K each way in first class. Fuel surcharges are passed on, so choose carriers with low / no fuel surcharges.\n\nHow to find awards: Search for available space at Aeroplan.com (you’ll need to create a free Aeroplan frequent flyer account to search)\n\nHow to book awards: Book online at Aeroplan.com. Can also book via phone. Lap infants must be added to your reservation over the phone.\n\nKey warnings: There are high fuel surcharges on Lufthansa, but the relative savings in terms of miles used for first class might mitigate the fees.\n\nNo fuel surcharges on: Aegean, Air China, Air India, Air New Zealand, Avianca, Brussels Airlines, COPA, Croatia Airlines, Egypt Air, Ethiopian, Etihad, EVA Airlines, GOL, Juneao Airlines, SAS, SWISS, Shenzhen Airlines, Singapore Airlines, South African Airways, Turkish Airlines, United Airlines\n\nLow fuel surcharges on: Cathay Pacific / Cathay Dragon, LOT Polish, Thai Airways\n\nTransfer from: Amex, Capital One, Marriott\n\nAustralia / New Zealand / Oceania\n\nThe short story: While priced a bit higher than ANA, Aeroplan offers three advantages: They allow one-way redemptions; they offer stopovers on round trip awards (which has “temporarily” changed as of 9/1/19, but a single stopover or open jaw is still allowed); Lap infants are charged incredibly reasonable fees in either cash or miles and the price is the same whether booking one way or round trip.\n\nMiles required: 80K each way in business class / 110K each way in first class. Fuel surcharges are passed on, so choose carriers with low / no fuel surcharges.\n\nHow to find awards: Search for available space at Aeroplan.com (you’ll need to create a free Aeroplan frequent flyer account to search)\n\nHow to book awards: Book online at Aeroplan.com. Can also book via phone. Lap infants must be added to your reservation over the phone.\n\nKey warnings: Fuel surcharges would ordinarily be the warning with Aeroplan, but I think that any carrier you might fly to this region has no / low fuel surcharges. The other key warning is to be sure to search for availability at Aeroplan.com and/or call before transferring miles. Aeroplan has an unpublished maximum permitted mileage (MPM) between any city pair, so be sure your routing is valid for Aeroplan (United shows some itineraries that are not possible with Aeroplan).\n\nNo fuel surcharges on: Aegean, Air China, Air India, Air New Zealand, Avianca, Brussels Airlines, COPA, Croatia Airlines, Egypt Air, Ethiopian, Etihad, EVA Airlines, GOL, Juneao Airlines, SAS, SWISS, Shenzhen Airlines, Singapore Airlines, South African Airways, Turkish Airlines, United Airlines\n\nLow fuel surcharges on: Cathay Pacific / Cathay Dragon, LOT Polish, Thai Airways\n\nIndian subcontinent?\n\nWhile we do not have a post specific to the Indian subcontinent, Aeroplan also offers potentially attractive pricing to this region if you’re looking to fly Etihad at 75K each way in business class or 105K each way in first class.\n\nThe real sweet spot: Australia & how to do it with multi-city\n\nWhile Greg floated the idea of flying to Europe in first class via Abu Dhabi for 70K one-way, I don’t think that will price out as he hoped based on my initial searches and my rough understanding of Aeroplan’s Maximum Permitted Mileage rules. Last year, I couldn’t book a flight from Crete to Brussels to Milan because it was about 100 miles beyond the max permitted mileage between Crete and Milan (whereas flying Crete to Frankfurt to Milan was acceptable for Aeroplan). I think Abu Dhabi is likely to be too far out of the way to be a valid connection point for Europe (and indeed, based on my initial searches, a multi-city trip that goes through Abu Dhabi prices like a US-to-Middle East award).\n\nHowever, Australia is really far away, so max permitted mileage doesn’t cause an issue with itineraries to Australia.\n\nIf you can find availability from the US to Abu Dhabi to Sydney, it would indeed be possible to book that entire trip in Etihad First Class apartments for 110K miles each way. That’s pretty spectacular.\n\nThe trouble is two-fold: First, finding Etihad first class award space leaving the US can be challenging. Second, the online Aeroplan booking tool won’t price a one-way from US cities to Australia via Abu Dhabi. Air Canada and the several Asian Star Alliance carriers offer so much availability that I couldn’t find a date that would price a simple one-way from the US to Abu Dhabi to Sydney on Etihad (and I additionally didn’t find any first class space on Etihad from the US to Abu Dhabi — it may exist, I just gave up on it in order to cut to the chase and prove whether the pricing were possible).\n\nHowever, with the multi-city tool, one can indeed prove the pricing theory (110K each way in first class — or maybe less) holds up. More on that in a minute.\n\nBreaking away on a tangent for a moment, it’s worth noting that one of the sweetest spots on the Aeroplan chart is Europe 1 or 2 to the Middle East at 60K or 55K miles one-way in first class. Etihad offers A380 apartments first class between London or Paris and Abu Dhabi (at least in normal times — your guess is as good as mine as to what the schedule will look like when travel picks back up). That’s a great sweet spot on its own if you are visiting Europe and want to tack on a trip to the UAE (or other parts of that Middle East region).\n\nHowever, this also means that if you can find availability from the US to Paris or London, you can connect to A380 apartments first class from those cities to Abu Dhabi — and award space on flights from London or Paris to Abu Dhabi isn’t terribly difficult to find.\n\nThankfully, United award space to London or Paris isn’t terribly hard to find at the moment either. We reported that fact a couple of weeks ago and there is still quite a bit of availability toward the end of the schedule (spring 2021).\n\nAeroplan prices a mixed-cabin award at the price of the highest cabin included. Therefore, if we were to book Washington, DC to Paris in United business class and then Paris to Abu Dhabi in Etihad first class, that prices at 115K miles one-way (the price of a first-class award from North America to the Middle East / Northern Africa).\n\nHowever, if you add a 14 hour first class apartments flight to Sydney to that, it would price five thousand miles less at just 110K one-way.\n\nUnfortunately, as noted above, the online tool won’t price that. However, if you use the multi-city tool, you indeed can price it out as a complicated round trip. The screen shot is coming. I assume that you’ll also be able to get an agent to price it one-way (rather than the round trip that I will show in this post) if that’s what you want (YMMV).\n\nThe difficult thing about Aeroplan’s multi-city tool is that it will only let you input three city pairs:\n\nIf you click the “How to build multi-city trips” link within that tool, it basically uses graphics and more words than necessary to tell you that the multi-city tool can only be used to price a round trip with either 1 stopover or 1 open jaw. That means you can’t book a one-way ticket using the multi-city tool (sometimes an airline’s multi-city tool can be used to force the one-way routing you want; no dice with that here). Further, if you have a stopover, you have to return to the city of origin (you get either a stopover or an open jaw, not both).\n\nAgain, since Aeroplan (sort of) prices the itinerary at the price of the highest class of service included each way, I only needed one leg in first class each way to prove that a round tip to Australia prices at 220K in first class, even with Etihad included. Rather than spend all night trying to thread the needle with Etihad first class availability both ways (and because that would likely be impossible to do given I can only enter 3 city pairs), I entered my search as follows:\n\nWashington (IAD) to Paris (CDG)\n\nParis (CDG) to Sydney, Australia (SYD)\n\nSydney, Australia (SYD) to Washington, DC (IAD)\n\nNote that the dates on the trip below aren’t particularly realistic, but they are an example to show that with Aeroplan and for 220K miles, you could fly business class to Paris and stopover for a couple of days, then fly 20 hours in Etihad A380 first class apartments to Sydney (your destination for as long as you want), and then return by flying from Sydney to Tokyo in business class on ANA and then ANA first class from Tokyo to Washington DC (13 hours in what could be their new first class) for a total of 220K and about $261 USD.\n\nAlternatively, if you’re OK with all ANA business class on the way home, you could chop 60K miles off the top and still get 20 hours of Etihad first class. Personally, I’d pay the extra 60K to fly Tokyo to Washington in first class, but you do you. Truth be told, given that Aeroplan’s business class price is 160K miles round trip to Australia, building in 20K hours of Etihad first class at the business class price could certainly be viewed as a win. Again, that’s a net cost of 80K each way with 20 hours in first class that you see below.\n\nThe difficulties\n\nThe hardest thing at play here will be finding availability between the US and Abu Dhabi without having to connect in Europe. If you’re willing to connect in Europe, this shouldn’t be much of an issue.\n\nThe second toughest piece is that I had some challenge finding itineraries where Etihad was the only carrier. I found it much easier to find Etihad availability with the Aeroplan tool when I had at least one Star Alliance carrier in the mix. There were some routes where I’d expect availability but the system seemed to be blocking me without a Star Alliance leg (though note that I did find Paris to Sydney all in Etihad first class, so YMMV). I also saw comments elsewhere indicating that Aeroplan agents were unable to see some availability you might expect if you’re familiar with the tricks to find space on the New York-to-Abu-Dhabi flight — though I also saw a comment or two indicating that Aeroplan agents saw some additional unexpected availability in some instances, so YMMV.\n\nIs it worth it?\n\nSome are likely asking, “Is it worth 220K miles to fly round trip to Australia?”.\n\nMy first reaction is, “Heck yeah! Did you see that itinerary above?? Twenty hours of apartments, almost 10 hours of solid ANA business and almost 13 hours of ANA first class for that price? With a stopover in Paris on the way? Definitely.\n\nBut then I realized that it’s worth putting a bit more thought into it from two perspectives.\n\nFirst, Aeroplan is an Amex transfer partner (they also partner with Capital One and Marriott, but most readers would likely be transferring from Amex). If you’re transferring American Express Membership Rewards to Aeroplan, you have to also consider transferring them to ANA Mileage Club for a complicated trip like this. While I think that ANA is still unable to book Etihad awards, ANA has an incredible round-the-world award chart. The itinerary above to Sydney and back comes to 26,200 miles flown. ANA would charge 170K miles to fly that in business class or 260K miles in first class, with up to eight stopovers on the way. You’d be limited to flying Star Alliance carriers in that scenario, so maybe you’d actually cut out Abu Dhabi, maybe you’d be able to shorten it to the next band down – there are a lot of variables. The point is that ANA Mileage Club might be competitive. Still, with so few Star Alliance carriers offering first class, I’d probably only be considering the round-the-world chart for business class and then only if I wanted to make several stops on the way. ANA isn’t a clearly better value here – it’ll depend on your intents.\n\nThe second lens through which to look at it is the same one I pondered the other day when I asked, “Is it now irrational to hold Ultimate Rewards points?“. That post is about Chase points rather than Amex, but it nonetheless points out the cash value of points. Given that Schwab Platinum cardholders can cash out Membership Rewards points at a rate of 1.25c each, that 220K points is worth at least $2,750. So the question becomes: is this trip worth at least that much to you? In my case, it absolutely would be.\n\nIn fact, Greg and I also talked on Frequent Miler on the Air about how the Chase grocery redemption option will give opportunities to potentially cash out Chase points at about 1.5c each and then use the cash to buy other mileage currencies. Air Canada is now allowing customers to convert vouchers to Aeroplan miles. The announced rate was about 1.3c per mile, though we reported the other day that it is currently showing more like 1.54c per mile. Hopefully it gets resolved and is closer to 1.3c, but for easy math let’s say you can convert Air Canada travel vouchers to miles at a rate of 1.5c each. One could theoretically “cash out” Ultimate Rewards points via a grocery store and use the cash to buy Air Canada tickets in order to convert them to Aeroplan miles – effectively trading Chase points for Aeroplan miles at a rate of 1:1. In that case, you’d be forgoing a bit more cash in the pocket yet over the Amex example, but it could make it easier to amass the necessary Aeroplan miles. A trip like this with multiple stops and something like 50 hours of premium cabin travel is a bit more likely to be the type of juice that’s worth the squeeze in terms of using your points for travel rather than groceries.\n\nAll that said, 220K miles is a lot of miles/points, especially if you’re bringing anyone with you. This type of redemption clearly won’t be for everyone. For those with the points or miles to burn though, this could be quite attractive.\n\nBottom line\n\nI’m pretty excited about the new Aeroplan/Etihad partnership as it is always exciting to see new opportunities open up in this game. Further, while I’ve flown Etihad first class before, I have not flown the apartments and I would love to. Add on top of that the fact that Aeroplan has the most reasonable lap infant fees in the game ($100 or 10,000 miles in business class or $125 or 12,500 miles in first class whether one-way or round trip), next year could be the ideal time for me to try out those Etihad apartments if the travel landscape allows. At this point, tempted as I am by these opportunities, I think it is unlikely that I’ll book something yet. But that doesn’t mean I won’t give it a few searches and live vicariously through those who are able to take advantage of the sweet spots while they remain. We still don’t know what the new Aeroplan program will look like (scheduled to be unveiled this year), so it is certainly possible (and perhaps likely) that sweet spots like this will change. so if I were more confident in my 2021 travel outlook, I’d probably think sooner rather than later, though there’s a lot of speculation at play here in terms of which flights will operate, whether travel will be enjoyable/safe, etc. Still, I’m excited about the possibility of redeeming a currency that’s fairly easy to collect for a first class product I’d love to fly.\n\nThe post Aeroplan / Etihad first class sweet spot: US to Australia & how to do it appeared first on Frequent Miler.\n",
      "Folder": "Feedly",
      "Timestamp": "1591567992",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T04:26:59.294766Z"
}