{
  "id": "fea7515ac729454eac09a79090f84465",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.theringer.com/music/2020/11/23/21590642/kanye-west-my-beautiful-dark-twisted-fantasy-good-fridays-songs-ranked",
      "Title": "An Obsessive Ranking of Every ‘My Beautiful Dark Twisted Fantasy’–Era Kanye Song The Ringer - Features",
      "Selection": "Luca Romeo\n\nTo mark the 10th anniversary of Mr. West’s magnum opus, we’re headed back to Obama’s first term to figure out what was the best of Ye’s best\n\nJustin Sayles: Charles, we have a big album anniversary that we have to face today. It’s for My Beautiful Dark Twisted Fantasy, Kanye West’s magnum opus/mea culpa that came out on November 22, 2010. (Do not ask me how old I was on that date, or I will forward this Google doc straight to HR.) This anniversary is difficult to deal with—at the time of its release, so many people declared it a nearly perfect album. (In fact, Pitchfork stamped it as fully perfect, awarding it a 10.0, something it wouldn’t do for another album for a decade.) The hyperbole made sense back in those heady days of the first Obama administration. Kanye was at the peak of his craft and returning from a yearlong shame walk following his infamous 2009 VMAs incident. The music was ambitious, the Hawaiian recording sessions took on mythic status, and the features were pure critic bait (he introduced Bon Iver’s Justin Vernon to a hip-hop audience, even if their definitive collaboration wouldn’t come until “Hold My Liquor” three years later).\n\nBut all of these ideas seem quaint now, with a dramatically changed hip-hop landscape, a Kanye-Trump friendship and comical presidential bid, a borderline disastrous Wyoming detour and gospel album, and “Poopy-di scoop” all sitting between MBDTF and the present. But they’re still worth exploring. In fact, you’ve done so: In the first episode of your new podcast, The Ringer Music Show, you spoke to Kanye collaborators about the who, what, where, and why of that album. And let me say, I learned a lot, and I think even the biggest Kanye stans will.\n\nSo let’s not rehash that all here. Instead, I want to do something you suggested we do for this anniversary. I want to rank every Kanye song and feature from the MBDTF era, or as it’s known to diehards, the Rosewood era. Charles, do you want to begin by explaining what Rosewood is and why this matters in the Kanye story?\n\nCharles Holmes: The Rosewood Movement was part fashion movement, part respectability politics masked as rehabilitation. In short, Kanye forced all of his G.O.O.D. Music artists, entourage, and weed carriers to wear Dior Homme’s Black Classic Skinny Suit that retailed for $2,200 in 2010 at all times. “That’s the Rosewood mentality, like affluence, like not cursing loud in public, pulling out chairs for your lady, opening up doors,” West explained to DJ Clue. On a macro level, it’s also a nice distinction for this time period for MBDTF, G.O.O.D. Fridays, and the features he dropped before and after.\n\nJS: OK, so taking the songs from the album, the G.O.O.D. Friday free releases (which sadly aren’t available outside of shitty YouTube uploads and illegal Soundcloud links), and guest spots, we’ve got 30 or so tracks to work with. That means we’ve got a lot of words to write. So let’s begin, starting with the absolute worst Kanye-related track of that era …\n\n Kevin Mazur/WireImage\n\nKanye West performs at the 2010 BET Awards\n\nLevel 6: O.K. Music\n\n30. “Deuces (Remix)” (Chris Brown single)\n\nCH: In retrospect, it’s wild that “Deuces” was such a hit a decade ago that Chris Brown could unite Rick Ross, Drake, T.I., Kanye West, Fabolous, and André 3000 for a remix. The song has aged about as well as any 2010s song that was in heavy rotation on Hot 97 can, meaning it’s quite honestly terrible. Kanye’s verse is especially egregious, considering lines like “You should have a travel agent, ’cause you a trip / You should make your own toilet tissue since you the shit,” weren’t left on the cutting room floor.\n\nJS: It’s a little sad listening to André, who was in the middle of an iconic five-year run of features, relegated to mop-up duties, which he sleepwalks through here. His verse is also a tough listen after sitting through Ye, Fabolous, and Ross, in particular; when Dre says, “Get your minds out the gutter,” he may as well have been talking to them. This song proves only that Chris Brown brings the worst out of everyone around him.\n\n29. “The Joy” (G.O.O.D. Fridays)\n\nJS: Charles, I suspect ranking this song so low will get us yelled at on Twitter, but I’m not a huge fan of “The Joy,” and I’ve never been as proud to work with you as when I discovered you felt similarly. It’s somewhat of a waste of Curtis Mayfield and Pete Rock, my all-time favorite producer and one of the key people in elevating sampling into high art. But high art is not what happens here. The beat is fine—a relaxed, minimalist excursion that would’ve likely been an interlude on any of Pete’s LPs. But to me, the song is destroyed by some of the cringiest Kanye lyrics of the era. Like, look at this shit:\n\nShe in her birthday suit ‘cause of the damn cake\nNow there’s crumbs all over the damn place (Uh-huh)\nAnd she want me to cum all over her damn face\n\nAnd:\n\nSo next time you see me on your fallopian\nThough the jewelry’s Egyptian, know the hunger’s Ethiopian\n\nMaybe I’m a prude, but I never want to hear Ye say cum or fallopian. People love this song, though—so much so that it was tacked onto 2011’s Watch the Throne. What’s up, Charles? Are we right, or is it the kids who are wrong?\n\nCH: This is the perfect example of a song where everyone involved is so enamored of the sample that they collectively decide not to show up in any other regard. If someone had a gun to my head and told me to recite one lyric from this song, I’d just have to tell someone to feed my cat, Sushi, ’cause I’m not making it.\n\n28. “Chain Heavy” (G.O.O.D. Fridays)\n\nCH: I’m almost positive Kanye premiered this song standing on a table and rapping it a cappella to the Facebook office. Also, totally forgot this was the same year David Fincher’s The Social Network was released, which might explain our relationship to Mark Zuckerberg at the time of MBDTF. Zuck had yet to upend all of American democracy in 2010, so he was still in the midst of his myth-making years, which is similar to Rosewood-era Kanye. Nevertheless, “Chain Heavy” always sounded better as a snippet.\n\nJS: I have this song slightly higher in my personal rankings, mainly because I’m a sucker for Q-Tip production and Consequence features. But I think “Chain Heavy” got buried a little by virtue of being the last song in the G.O.O.D. Friday series before the release of MBDTF. By that point, Ye had to know he was dropping outtakes.\n\n27. “Runaway Love (Remix)” (G.O.O.D. Fridays)\n\nCH: Back in 2010, Kanye placing Raekwon on a baby-faced Justin Bieber single was an expert troll job disguised as some genius idea. Besides the novelty of putting Raekwon’s razor-like voice over the bubblegum hit, this G.O.O.D. Friday track was seen as filler even back then.\n\nJS: Charles, does the “Wu-Tang Clan Ain’t Nuthing ta F’ Wit” sample mean anything to you?\n\nCH: I have a long and complicated relationship with the Wu-Tang Clan. It mostly stems from the fact that I come from a small town in New Jersey where my seventh grade teacher was white, in his mid-20s, and didn’t see a problem with gloating to one of his only Black students that he didn’t know as much Shaolin as he did. White bros love them some Wu-Tang, but after some soul searching I realized I wouldn’t allow the Wu to be gentrified in my life. So that’s a long way of saying “Wu-Tang Clan Ain’t Nuthing ta F’ Wit” means a lot to me and Kanye should’ve just stayed away from it.\n\nJS: I wonder what other rappers “cool teachers” have ruined for kids. Like, there’s definitely some English teacher in Missouri that never misses the opportunity to talk to his students about MF Doom.\n\nMy next question: This is one of Bieber’s first “hip-hop” tracks. That means it may be indirectly responsible for “Maria I’m Drunk,” on which he arguably outrapped Travis Scott and Young Thug. (The latter sounds borderline blasphemous, but it’s true.) Does that make this remix a net positive?\n\nCH: Kanye put the battery in Biebervelli’s back, so yes. Honestly, I’d like to see the Chef and JB on a track together in 2020. I’m positive my Canadian brother would lyrically hold his own.\n\n26. “Don’t Look Down” (G.O.O.D. Fridays)\n\nCH: This is an honest question—why does Kanye let Mos Def sing badly on so many of his songs? I’m probably in the minority of people who think the only salvageable part of 2007’s “Drunk and Hot Girls” is the Mos Def part, but that’s not exactly some high compliment. “Don’t Look Down” aspires to be more than it is. Lupe Fiasco has an esoteric verse about a phoenix. Kanye bathes his voice in some distortion that sounds like a cheap imitation of what he’d use on “Runaway.” Surprisingly, Big Sean has the best verse by miles, which is a theme throughout most of these G.O.O.D. Friday tracks. At a time when Sean was relegated to the periphery of G.O.O.D. Music, he generally proved his worth by putting in more effort than the bulk of his compatriots.\n\nJS: I mean, Mos isn’t a technically great singer, but “Umi Says” is a classic, to say nothing of “Definition.” (I suspect you feel differently, Charles.) There are far greater problems with the song, including the overwrought production, which drags for nearly six minutes. But mostly, I’m confused about why you’re highlighting a verse that includes the lines “Trying to get high enough to cut the clouds / Of the Phoenix Sun and Nash it out / I mean ash it out so I could see you smile.” That’s a tough sell, even by the standards of Big Sean’s wordplay.\n\n25. “Take One for the Team” (G.O.O.D. Fridays)\n\nCH: An utterly forgettable song with a Kanye verse that is way too aggro, but I’d like to point out one thing. Toward the middle of Kanye’s verse, he raps, “Why every ghetto bitch gotta smell like Love Spell / Or that Goddamn cucumber Bath and Body Works?” First of all, my question to you, Justin, is simple. Do you like cucumber scents and/or Bath and Body Works?\n\nJS: I have to confess, Charles. I’m one of those guys who uses two-in-one shampoo/conditioners and buys whatever body wash is closest to me in the store when I remember I need it. If one of those things happens to be cucumber-scented, cool. But I don’t have strong opinions.\n\nCH: We need to boss your life up, JS. I’m talking about strolling over to the local mall and getting some Lush bath bombs. In this Ringer household, we only bathing in the finest scents. In 2021, we’re leaving cucumber- and sweet-pea-based soaps behind. It’s all about them subtle citrus and wood smells.\n\nJS: Subtle citrus and wood smells, the new Rosewood Movement. Got it.\n\n24. “Devil in a New Dress” (My Beautiful Dark Twisted Fantasy)\n\nJS: I once heard you declare this one of Kanye’s worst songs. This is not a widely held position, to put it mildly. Would you care to explain why you feel that way?\n\nCH: The flip of Smokey Robinson’s “Will You Love Me Tomorrow” always bugged me. Every human operates on a certain frequency and that high-pitched, recurring sample grates on my very existence. Kanye is the pied piper of nostalgia. People continuously rate his first three albums as unimpeachable projects he can never surmount, and a lot of that has to do with the soul samples mixed with the faux-conscious raps. Kanye’s two verses on this song are merely fine. Like, y’all are going to sit on Jeff Bezos’s internet and tell me that Kanye rapping, “The Lyor Cohen of Dior Homme? / That’s ‘Dior Homme,’ not ‘Dior, homie,’” really belongs on the Mount Olympus of hip-hop?\n\nThe only saving grace of this song is Rick Ross’s verse, which is immaculate, and even I’m not enough of an asshole to say otherwise.\n\nJS: It’s a good song, Charles. But not sure I’d feel so strongly if it existed only in its G.O.O.D. Friday version, which didn’t include Rozay—or more importantly, that breakdown. For all of the bloated track lengths and proggy ambitions on MBDTF, the middle third of “Devil in a New Dress” remains one of its highlights. The sample and drums drop out, and we’re left with piano, bass, strings, and a heavily-vocoded Kanye. It’s a stunning moment, and I get lost in it every time.\n\n23. “Blame Game” (My Beautiful Dark Twisted Fantasy)\n\nJS: I occasionally visit the r/BrandNewSentence subreddit, where people post “sentences never before written, found in the wild.” Recent examples include “Man accused of Ponzi scheme attempts to escape FBI with underwater scooter” and “Victorian baby yeet machine.” I submit that, had this subreddit existed back in 2010, “You call me motherfucker for long” would’ve been a worthy post because nobody before or since then has ever uttered those words in that order.\n\nBut to the track: Which song off MBDTF has aged the worst, and why is it “Blame Game?”\n\nCH: It’s the misogyny. On a technical level, I don’t mind the John Legend chorus, the somber production, or how it narratively closes out MBDTF, but Kanye’s lyrics and the Chris Rock coda are truly a misstep on an otherwise exceptional album. Kanye often dips into extreme incel territory, and it’s only gotten worse with age. “Blame Game” was a harbinger of what was to come years later on songs like “I Thought About Killing You” or the unreleased “New Body.” Is there any line that sums up late-stage Kanye and his terrible politics as well as, “You should be grateful a nigga like me ever noticed you?”\n\nThe saving grace of “Blame Game” arrives when Kanye finally sheds the toxicity. His voice launches into a falsetto and sounds amateurish next to Legend, but it’s the raw quality that sells the heartbreak at the center of MBDTF. As Kanye repeats the refrain “I can’t love you this much,” it feels like a rare moment when a megastar realizes how brutally celebrity has warped their perception of reality.\n\nJS: I loved this song at the time, and I still love the Aphex Twin sample, but I don’t need this song in my life anymore. Plus, as toxic Kanye breakup songs go, this is no “30 Hours.” “The only thing open is Waffle House / Girl, don’t start with me” >>>> “Now you noticeable and can’t nobody get control of you.”\n\n Andy Kropa/Getty Images\n\nKanye West and Gwen Stefani at a September 2010 fashion show in New York City\n\nLevel 5: F.I.N.E. Music\n\n22. “Don’t Stop” (G.O.O.D. Fridays)\n\nCH: I was never enamored of Child Rebel Soldier—the kind-of supergroup of Kanye, Pharrell, and Lupe Fiasco. Relistening to “Don’t Stop” 10 years later makes me realize that my teenage taste wasn’t that far off the mark. There was a moment in the 2000s when you could tell Pusha T was penning all of Pharrell’s raps, because out of nowhere the legendary producer would talk about his prowess at cooking and selling drugs. “Don’t Stop” is no different, especially considering it also includes the type of homophobic bars that were all too common in 2010.\n\nJS: Do you think Push wrote Pharrell’s “Move That Dope” verse? And if so, how long do you think it took to convince Skateboard P that “the Gandalf hat and the weird-ass clothes” was a fire bar?\n\nCH: Push most definitely wrote that verse. There’s no way Pharrell is waking up one day and thinking he should rap, “I know guerrillas with the triggers that’s on a banana clip / And packin’ with the biggest missiles.”\n\nJS: Just another reason Pusha T is one of our finest Americans. If Hillary had picked him over Tim Kaine, we wouldn’t be in this mess.\n\n21. “In for the Kill (Remix)” (La Roux [Gold Edition])\n\nCH: La Roux really needs her flowers. The run she went on in 2009 and 2010 was unmatched. “In for the Kill’ is the type of rarified pop excellence you just don’t see anymore. Kanye is way too horny for his own good on the remix, which makes sense considering this was during a time when he’d subject everyone to his porn-watching habits in the studio. But the fact that even a horny Kanye couldn’t ruin “In for the Kill” speaks to its excellence so many years later.\n\nJS: I’m a fan of Kanye’s random appearances on dance songs during this era. (See also: “American Boy”; Stromae’s “Alors on Danse.”) He doesn’t add a ton to these tracks, but it’s a nice time capsule—of where he was in his career and what popular music sounded like before the trap explosion. Sad we never got him on “Danza Kuduro.”\n\n20. “Looking for Trouble” (G.O.O.D. Fridays)\n\nCH: J. Cole and I have a contentious relationship, meaning I tend to dismiss most of his music, and he has no idea I exist. But this is the rare time when I give J. Cole his respect. There’s an old quote washed-up basketball players tell their delusional charges, “Luck is what happens when preparation meets opportunity,” but damn if Cole didn’t take full advantage of this star-making turn on “Looking for Trouble.” As the story goes, J. Cole received the beat for the song the night before Kanye was due to release it, while he was in Kalamazoo, Michigan.\n\n“I got a call from Kanye and he was like, ‘What’s up? It’s Kanye. Can you get that verse today? I’m tryna put the song out tonight.’ I honestly didn’t think I could do it in time so I told him that,” Cole told Complex in 2010. “He said, ‘I’ll wait. We got engineers up all night so you got a while to do it. But if you can, have it done by today.’ I said, ‘I’ll make it happen somehow.’ I wrote my verse on the hour-and-a-half ride to Detroit, did the radio promos, left that, went directly to the studio, laid the verse, and sent it to him by 5 o’clock.”\n\nUp to this point, Cole had spent the majority of his career modeling himself after West and you can hear that extreme competitive urge to impress on his closing verse. Cole has always been at his best when he has a clearly defined antagonist and his verse sounds as if he’s asking Ye, “Why in the hell did you sign Big Sean and Cudi over me?” Throughout his verse, Cole compares himself to Biblical figures and Hov, but it’s when the beat cuts out that he underlines how long he’s waited for this moment. “Ironic, you been sleeping on the one that you been dreaming ‘bout,” he brazenly says to the world. Cole had finally arrived.\n\nJS: My only problem with this: The sample flip immediately reminds me of Cam’ron’s “Bubble Music,” even if the production on “Looking for Trouble” is superior. (Equally distracting: CyHi’s verse, which includes the line “I’m Jake Gyllenhaal, I’m in the hood with the bubble.”) But J. Cole is phenomenal here, delivering bars so powerful that Kanye cleared out the beat for him. It can be easy to write Cole off—he can be tedious and condescending, and I will never forgive him for what he did to Jeremih’s “Planez”—but when he raps like this, it makes you wonder why he’s never been able to cement himself as an all-time great.\n\n19. “Erase Me” (Man on the Moon II)\n\nCH: The heathens really wasn’t rocking with “Erase Me” back in the day. In fairness, this was the era of the Knux and Chiddy Bang, meaning a bunch of kids reared on Pitchfork’s indie snobbery were making rock-inspired rap groups. Sonically, “Erase Me,” fit squarely into this era while aging better than any of its contemporaries. Kid Cudi’s singing is far more vibrant and lively than anything else on the dour Man on the Moon II. The main guitar melody and the explosive drums on the chorus never do too much. Even Kanye tries his best to deliver a rare charming verse about a potential lover before he ruins it with that sweet, sweet Rosewood-era misogyny.\n\nJS: I never fully got the Kid Cudi thing—being born in the early ’80s will do that to you—but I respect that kids from your generation ride so hard for him. Also, the first Man on the Moon basically plays like a circa-2008 Hype Machine chart, what with the MGMT and Ratatat features and Menahan Street Band samples and Crookers remix. That’s a lot of fun for me, a certified Old. (Though if you want to talk Rosewood-era misogyny, let’s not forget about “Make Her Say.”)\n\n18. “Lord Lord Lord” (G.O.O.D. Fridays)\n\nJS: A perfect freebie track. It’s a solid, low-stakes affair with good-not-great verses from Mos Def and Raekwon, and every Charlie Wilson hook should be treasured. (I’m confused about why we had to stretch this out to seven minutes to fit that Swizz verse, though that’s another discussion.) But what I’m most interested in here is the sample: It’s a straight loop of “Solstice,” an obscure 1978 jazz-funk song from Brian Bennett, a British composer best known for his work as a library musician. (That’s a big deal to record-collector nerds.) “Solstice” has improbably become something of a hip-hop staple. It’s been sampled hundreds of times—most notably by Nas, Rick Ross, and the High & the Mighty—and even made its way into songs from Kaytranada and the Mike Patton–Dan the Automator team-up, Lovage. “Lord Lord Lord” is one of the better songs to use it. Kanye let “Solstice” breathe, not adding any drums or altering the pitch. Somewhat paradoxically, by doing the least with the sample, “Lord Lord Lord” gets the most out of “Solstice.”\n\nCH: You just spilled a lot of ink on an extremely mid G.O.O.D. Friday song. All of the elements of “Lord Lord Lord” are fine. Charlie Wilson needs a field’s worth of flowers, so he’ll forever be safe from my ire. The beat isn’t offensive. The various artists arrive with a pulse, but between Kanye saying “I only hang with white boys that like black sluts” and Swizz Beatz dissing bloggers I’m good on this one.\n\n17. “Power (Remix)” (G.O.O.D. Fridays)\n\nJS: When I was a child, one of my favorite songs was Snap’s “The Power” (which, if you’re unfamiliar, has its own complicated backstory). So when I heard that Kanye was flipping a sample of it into a remix of his “Power” with the help of Swizz Beatz—who was on a streak of turning dance songs into club anthems—I was pretty amped. But the end result is a mixed bag. The Jay-Z verse is fine, as is the opening Kanye verse. (Ye got an assist from Kobe? OK, sure.) Musically, however, there’s a lot going on here. (It’s gettin’ kinda hectic, if you will.) The added synths are another distraction in an already busy beat. And eliminating the King Crimson sample in favor of some 30 Seconds to Mars–core singing isn’t doing it for me. The song comes alive in the second half when the Snap beat drops and Kanye lets loose, but I can’t see anyone picking this over the original.\n\nCH: I have a soft spot in my heart for “Power (Remix).” The song is fine, but I distinctly remember Funk Flex premiering the record on Hot 97 back in the waning years of rappers still bringing their records to the DJ. So for a solid day, I only heard “Power (Remix)” with a bunch of Flex bombs as he marketed the record like it was the most important thing in the world. It was not, young readers, but Flex truly did have that *cough cough* power back in the day. If you don’t believe me go listen to his premiere of “Otis.”\n\n16. “Hell of a Life” (My Beautiful Dark Twisted Fantasy)\n\nJS: Dirtbag Kanye has always been one of my favorite Kanyes. The song is a little icky given the Jesus Is King rapper’s admitted porn addiction and his love for his future wife’s, um, filmography, but I’ll take Ye rapping about drugs and weirdo sex over whatever is happening on his past few albums. It’s also a spiritual predecessor to “No Church in the Wild” or the more interesting parts of Yeezus, like “I Am a God” or “Hold My Liquor.” “Hell of a Life” sounds a little dated in 2020, but I still mess with it.\n\nCH: This song sounds like a sentient XVideos search bar. The propulsive crunch and dark chaos of “Hell of a Life” is so immaculately produced that even horny Kanye can’t ruin this track. In 2016, famous adult actress Lisa Ann claimed that Kanye sent her unsolicited photos of the explicit variety. Combined with the aforementioned porn addiction, “Hell of a Life” is a bizarre time capsule. So much of Kanye’s Rosewood era is about an excess of ego, celebrity, and sex that in the following years seemed to spin wildly out of control.\n\n Peter Kramer/NBCU Photo Bank/NBCUniversal\n\nKanye West appears on NBC’s Today show in November 2010\n\nLevel 4: G.O.O.D. Music\n\n15. “Start It Up” (The Hunger for More 2)\n\nCH: For a brief but blindingly transcendent moment in 2010, Lloyd Banks was the best rapper alive. It was as if the entire music industry descended upon G-Unit’s second-in-command, determined to turn him into a household name. The DJs at Hot 97 and Power 105 should be arrested for how much they played “Beamer, Benz, or Bentley.” At the dawn of a new decade, every rapper either wanted to be on a song with Lloyd Banks or remix one of his hits. “Start It Up” alone had Swizz Beatz, Kanye West, Ryan Leslie, and Fabolous on it.\n\nThe beautiful thing about “Start It Up” is how obvious it is that Kanye didn’t want to get outrapped by Banks. It’s as if Kanye told all of his ghostwriters to form like Voltron in pursuit of delivering a decent verse. To this day, the line, “The first album I vomited, the second I colonic’d it / Ain’t nobody fucking with me, I platonic’d it” is as dumb as it is great. JS, how do you feel about Lloyd Banks?\n\nJS: As someone who came of age during the G-Unit mixtape era, I’ve always loved him. He obviously wasn’t a star on the level of 50 Cent, but as rap henchmen go, there have been few better than Banks. (I’m shocked this line didn’t cause Fat Joe to drop dead right on the spot, because it nearly killed me when I heard it.) Also, don’t tell anyone, but I prefer his version of “Victory” to the original.\n\nBanks is one of the best punch-line rappers of his generation, whereas Kanye is just one of the punch-line-iest. Charles, do you have a least favorite Kanye punch line? I have a tough time deciding between “They be ballin’ in the D-League / I be speakin’ Swaghili” and “I’m a rap-lic priest / Gettin’ head by the nuns.”\n\nCH: 2013’s “I’m In It” is one of my favorite Kanye West songs of all time, but paradoxically contains the two worst Kanye lyrics of all time:\n\nChasin’ love, lots of bittersweet hours lost / Eatin’ Asian pussy, all I need was sweet and sour sauce\n\nUh, Black girl sippin’ white wine / Put my fist in her like a civil rights sign\n\nKanye rapping about race is bad. Kanye rapping about sex is worse. When you put those two together, you get the above.\n\nJS: We just cited four terrible lines from “I’m in It,” yet we both love the song. Fucking Kanye.\n\n14. “Christmas in Harlem” (G.O.O.D. Fridays)\n\nJS: I thought the perfect Harlem Holiday song already existed before this in “Ballin’ on Xmas,” which appeared on Jim Jones’s Dipset Christmas album. But the final version of this song—on which Pusha T turns Santa’s weight into a coke punch line—beats it by a mile. (Predictably, it also features Jim Jones.)\n\nCH: We absolutely needed “Christmas In Harlem” for Cam’ron’s verse alone. There will never be a funnier moment in a Christmas song than Cam closing his verse out with “shouts to the coldest on my barometer / Berkman, Shapiro, Kalina, Hanukkah,” and then ad-libbing “my lawyers” immediately after. You can’t buy that type of publicity.\n\n13. “See Me Now” (G.O.O.D. Fridays)\n\nCH: The people don’t deserve “See Me Now.” When Angie Martinez premiered the record on Hot 97 it was supposed to be such a moment. Kanye assembled Beyoncé and Charlie Wilson to collaborate over a cheery Lex Luger and No I.D. beat. Was it obvious that “See Me Now” was an easy, feel-good track meant to get him back in the peoples’ good graces? Yes. Does that mean it deserved to be yawned at? Hell no. The Charlie hook alone should’ve at least given this song a week at no. 1 on the Hot 100.\n\nJS: You ever think about how Lex Luger defined the sound of rap for two years at the beginning of the last decade and then basically disappeared? Yeah, there was “B.M.F.” and “MC Hammer,” but also “Who Da Neighbors” and all the Waka Flocka table-flippers. Starting around 2013—probably thanks largely to Drake and 40—rap got a little moodier, chillier, and less fantastical. “See Me Now” isn’t one of those ultra-maximal Lex Luger productions (sounds like No I.D. was in the driver’s seat here), but I wanted to give credit to the man who made “9000 Watts” possible.\n\n12. “So Appalled” (My Beautiful Dark Twisted Fantasy)\n\nCH: Why the fuck is “So Appalled” even this high? Get this shit out of here, JS.\n\nJS: I’m legit wondering whether you like this album, or Kanye, or music in general. “So Appalled” is great for so many reasons: the beat, the Pusha verse, CyHi’s “Trojan in the pocket / Matt Leinart” double entendre, the Swizz chorus, RZA’s pronunciation of “fuckin’ ridiculous.” What’s the matter, Otter? You got Bobby Brown jaw?\n\nCH: I don’t hate “So Appalled,” but it always felt like it should have stayed a G.O.O.D. Friday loosie. It’s not a terrible song, but it’s also a song that’s extremely fat around the edges. For those who have forgotten, “So Appalled” clocks in at almost seven minutes. It’s not even the best posse cut on the album, despite being longer than “All of the Lights,” “Monster,” and “Gorgeous.”\n\n11. Monster (My Beautiful Dark Twisted Fantasy)\n\nJS: Charles, I want to discuss something you broke down on The Ringer Music Show: the fact that Kanye almost left “Monster” off My Beautiful Dark Twisted Fantasy because Nicki outshined him. First, how incredibly on-brand. Second, do you think that decision was a Sliding Doors moment? What would we have missed out on had “Monster” been trapped in YouTube videos and MediaFire links?\n\nCH: For Nicki Minaj, “Monster” always felt like a Kobayashi Maru. The once-in-a-generation verse was the final spark that Minaj needed to go from a talented member of Lil Wayne’s nascent Young Money crew to the subject of full-fledged debates about whether she was a top-five rapper in the world (spoiler alert: she was). Unfortunately, “Monster” was an artistic peak for Nicki, one that she’s still chasing. She became a better lyricist and artist in later years, but “Monster” was the last time it felt like Minaj had to serve only one genre. When “Super Bass” hit, the trajectory of her career changed. Being a household name that appears on Ellen is wildly different from being the subject of debates raging in the 2Dopeboyz comment section. If “Monster” hadn’t made My Beautiful Dark Twisted Fantasy, it’d still be worshipped, but it also might have ensured Minaj’s career trajectory was a tad more gradual.\n\nJS: I think she reached her full potential in 2014, around the time of Pinkprint, when she was at her pop apex all while dropping truly great verses on “No Flex Zone,” “Lookin’ Ass,” and her version of “Danny Glover.” It’s been a steady decline for her since, partly because of self-sabotage and partly because rap treats its female stars like garbage once it finds someone to replace them.\n\nMy next question: Jay-Z’s overall résumé is unimpeachable, but he’s certainly lost some luster in the past 15 years. His verse on this song in particular gets clowned frequently. Charles, do you think his eh turn on “Monster” changed how we think about Hov? In other words: Love—does late-period Jay get enough of it, too much of it, or just the right amount of it?\n\nCH: It’s critical reevaluation time. Jay-Z’s “Monster” verse is comically bad, but also it’s charming that the Marcy rapper who bragged about losing 92 bricks would spend the beginning of the 2010s rapping about Sasquatch, Godzilla, King Kong, Loch Ness, Goblin, ghouls, and zombies who are devoid of a conscience. Later-stage Jay-Z albums (e.g., Magna Carta Holy Grail, 4:44) could have used more spooky bars.\n\n Kevin Mazur/WireImage\n\nAl Jardine Kanye West at the “We Are the World 25 Years for Haiti” recording session held on February 1, 2010, in Hollywood\n\nLevel 3: G.R.E.A.T. Music\n\n10. “Live Fast, Die Young” (Teflon Don)\n\nCH: This song wasn’t originally intended for Rick Ross’s 2010 classic, Teflon Don, but was made during the MBDTF sessions. The James Brown “Funky President” and Rick James “Mary Jane (Live)” samples that punctuate the beat are the same one’s Kanye would play with across his fifth studio album. The horns lifted from the Bar-Kay’s “If This World Were Mine” sound so grandiose you can tell Island Def Jam paid a hefty check to get everything cleared.\n\nBut “Live Fast, Die Young” always felt like it was of the Rosewood era without neatly fitting into the MBDTF narrative. Ross’s verses are too celebratory. Kanye is having the time of his life, despite trying to put on a repentant facade. Even the Chicago rapper’s verse spit directly in the face of his detractors. When Kanye raps, “I’m back by unpopular demand / Least he still poppin’ in Japan, shoppin’ in Milan / Hoppin’ out the van, screams from the fans / ‘Yeezy, always knew you’d be on top again,’” it’s not only hilarious, but a rare moment that reaffirmed Kanye’s one-of-a-kind ego was healing nicely.\n\nJS: There’s allegedly an unreleased Hype Williams–directed video for this song. It’s a damn-near crime that we never got Hype to shoot a video for Rozay while the big man was at the peak of his powers. If I ever get my hands on a time machine, I’m dropping 2010 Rick Ross in 1998 and telling Hype to turn on the fish-eyed lens and give us the $10 million video the Teflon Don deserved.\n\n9. “Power” (My Beautiful Dark Twisted Fantasy)\n\nJS: On The Ringer Music Show, you spoke to S1, a then-unknown producer who had given a beat CD to longtime Kanye confidant Rhymefest. On it was the skeleton for “Power”—it had the chanted sample and the Cold Grits drums, but not much else, right? Kanye hears it, gets S1 on the first plane to Hawaii, and they begin to figure out how to make this beat worthy of Ye’s comeback album. First comes the King Crimson sample, next comes the bass and guitars courtesy of Mike Dean, then the keyboards by Dean and Jeff Bhasker. Eventually, they’d add a goddamn cello. The end result is so full, so booming, and so triumphant that it lives on as an arena anthem and soundtrack to terrible movie trailers a decade later.\n\nThat is the genius of Kanye beginning with this era: In the early Roc-a-Fella and College Dropout days, he mainly crafted beats in isolation. During the Late Registration and Graduation days, he began adding orchestral flourishes and collaborating with outside producers, but it was still mostly whatever came out of his MPC. But by My Beautiful Dark Twisted Fantasy, he had an army of producers and musicians at his disposal. The individual pieces were great on their own—I’m sure I would’ve enjoyed the original S1 beat had it ended up on a Rhymefest album—but under Kanye’s direction, all the parts came together into something indelible. And that’s power.\n\nCH: “Power” is such an awkward song. There’s so much going on, from the chants to the King Crimson sample. The beat is so staccato at times that Kanye clearly struggles to fit all of his thoughts within its parameter. For a clear example, look no further than the couplet, “You short-minded niggas’ thoughts is Napoleon / My furs is Mongolian, my ice brought the goalies in.” But none of that ends up mattering. “Power” is more about setting a tone for an era than the pursuit of perfection. There’s a reason the song became movie trailer fodder over the next decade—2010’s The Social Network, 2011’s Limitless, 2017’s Power Rangers, 2017’s All the Money in the World. The power of “Power” is how well it denotes a sense of triumph before Kanye ever utters a word. It’s a feat of Kanye West as a producer more than a showcase for his talents as a rapper. Anyone can tell you they’re powerful. It’s another thing to make you feel it.\n\n8. “G.O.O.D. Friday” (G.O.O.D. Fridays)\n\nJS: This song, more than any other, makes me sad that we never got a G.O.O.D. Music compilation aside from Cruel Summer, which I remember now only for “New God Flow” and stray shots fired at Kris Humphries and George Tenet. (2012, baby!) But “G.O.O.D. Friday,” the eponymous track from the legendary free-release series that dominated the second half of 2010, is a perfect showcase for what Kanye and his cohorts do best. There’s the beat, with pounding drums and a familiar sample flipped in a way you’d never heard it before. Uncle Charlie breathes life into the hook. Cudi’s crooning is a wonderful accent. Pusha and Big Sean deliver; latter-day Common even acquits himself nicely. A good time all around and, sadly, a track that could never be made today.\n\nCH: So much of the music that was made during the “Rosewood” era seemed engineered as peak critical bait. The samples were either obscure or ridiculously expensive. Every song needed an extended outro. Legendary producers were called in as vibe connoisseurs. It made for a near perfect album, but often that meant there was little room for something that was simply fun. “G.O.O.D. Friday” never seeks to do too much. Kid Cudi is on hook duty and offers a couple well-placed hums. Pusha T raps about his one true love, selling cocaine. Big Sean drops some goofy punch lines. G.O.O.D. Music may not have been the most lucrative rapper imprint of the 2010s (that’s Young Money), but it was easily the most cohesive.\n\n Kevin Mazur/WireImage\n\nJay-Z and Kanye West perform at Yankee Stadium on September 13, 2010 in New York City\n\nLevel 2: C.L.A.S.S.I.C. Music\n\n7. “Run This Town” (Blueprint 3)\n\nJS: Blueprint 3 produced two of Jay-Z’s biggest commercial hits, including “Run This Town,” which is great. (The other, “Empire State of Mind” was his first no. 1 single; it’s terrible.) But by the time BP3 was released in September 2009, it had become clear that Ye, who had just dropped four straight classic albums, had surpassed Big Brother, who was in the middle of an uneven post-“retirement” stretch. The gap between the two only widened over the next few years, as Jay receded while the fire within Kanye grew—we hear it in Jay’s two MBDTF verses, while 2011’s Watch the Throne is mostly a Kanye showcase. “Run This Town” marked the second time Jay had ever put a Kanye verse on one of his albums, following The Blueprint 2’s “The Bounce.” But in 2002, Ye was an upstart still two years away from The College Dropout; he was a young producer trying to rap, not the megawatt multi-hyphenate we’ve come to alternately love and detest. Seven years after “The Bounce,” “Run This Town” presented Jay and Kanye as equals, which makes it something of an unofficial passing of the torch.\n\nKanye has had many understudies. Two have been successful—Cudi, who has a complicated history with his mentor, and Travis Scott, who let Drake threaten to hunt Ye down on “Sicko Mode.” Charles, why do you think Kanye never inspired a true successor like Jay inspired him?\n\nCH: Kanye’s ego has always stopped him from truly minting an heir apparent. There’s a reason Drake’s verse didn’t make “All of the Lights,” J.Cole was relegated to a G.O.O.D. Friday track, and Nicki Minaj’s scene-stealing moment on “Monster” almost caused Ye to take the song off MBDTF. Kanye is a supreme opportunist. He’ll collaborate with anyone that can help him sell more records or gain some type of cultural cachet, but the minute that artist shows a sign of surpassing him, tension arises. We’ve seen that Lil Wayne had no problem with his protégés (Drake, Nicki, and kind of Tyga) becoming more popular than him. In a similar way, Gucci Mane is responsible for putting on rappers like Migos and Young Thug. On the other hand, when Kanye sees rappers like Drake, Cole, Chance the Rapper, and Travis Scott updating his playbook, there’s something within him that won’t let him recede.\n\n6. “All of the Lights” / “All of the Lights (Interlude)”\n\nJS: You spend a lot of time breaking this song down on the podcast. I would recommend people go there to listen to the story of the making of “All of the Lights” and how Ye got the most left-field guest of the entire album and why Drake doesn’t appear on the final version. So instead of rehashing that, I want to ask an important question: Which of My Beautiful Dark Twisted Fantasy’s five covers was your favorite?\n\nCH: The George Condo painting of Kanye wearing a crown with his head impaled by a sword was a very on-the-nose metaphor, but it always seemed the most apt. There’s a reason it was Kanye’s Twitter avatar for the longest time. Kanye’s identity is molded by this idea of being the one. Over the years, Kanye’s transitioned from rapping about Jesus (2004’s “Jesus Walks”) to proclaiming he’s a God throughout 2013’s Yeezus. Back in 2010, Condo’s illustrated sword seemed like a symbol of public perception killing West. In retrospect, the deadly sword was always wielded by Kanye and he’d forever be doomed to fall upon it.\n\nJS: Ten years ago, I would have also picked that one. (That’s the version of the CD I bought back when we still bought CDs.) Today, however, I’m a fan of the naked sphinx straddling a beer-clutching Kanye. It was banned by Walmart and the iTunes Store at the time. Shockingly, it’s the version Spotify uses, even though it’s pixelated on our parent company’s platform. Condo was disgusted by the censorship: “The superimposition of people’s perceptions on a cartoon is shocking,” he said in 2010. “What’s happening in their minds should be banned. Not the painting.” Amen.\n\n5. “Lost in the World” / “Who Will Survive in America” (My Beautiful Dark Twisted Fantasy)\n\nJS: Why do you think Kanye brought Justin Vernon into his orbit over the hundred other popular indie musicians circa 2010? Why Bon Iver and not, say, Grizzly Bear?\n\nCH: Because Justin Vernon is interesting and sounds like an angel, while Grizzly Bear is boring outside of that one time Jay-Z and Beyoncé went to go see them live and Pitchfork had a field day blogging about it.\n\nJS: Do you have a favorite Bon Iver song? Personally, I break out “Blood Bank” whenever the weather dips below 40 degrees.\n\nCH: 2016’s “715 - CRΣΣKS,” is the peak of Justin Vernon’s powers. On the surface the 22, A Million song is so ugly. There’s no beat for Vernon to hide behind. All the audience can listen to is this android-like voice that’s so mangled and tortured you can’t help but want to save it.\n\nVernon is a once-in-a-lifetime talent who came of age as the internet and technology was beginning to reshape the way we connected with the sound of the human voice. Vernon, along with T-Pain and Future, was able to summon this paradoxical feeling of technology’s creeping coldness and endless ambition through the way he contorted his voice with Auto-Tune, reverb, and a flurry of other engineering techniques. Kanye was able to introduce Vernon to the wider world on songs like “Lost in the World,” but it was on “715 - CRΣΣKS” that years of experimentation was finally perfected.\n\nJS: Sadly, we’ll probably never get another JV-Kanye collab, because he, like most of us, can no longer kick it with Kanye.\n\n Kevin Winter/Getty Images\n\nKanye West performs at the 2010 MTV Video Music Awards\n\nLevel 1: P.E.R.F.E.C.T. Music\n\n4. “Christian Dior Denim Flow” (G.O.O.D. Fridays)\n\nCH: The greatest tragedy of modern pop music is that “Christian Dior Denim Flow” didn’t make My Beautiful Dark Twisted Fantasy. Several tracks could have been sacrificed to give it a spot—“So Appalled,” “Devil in a New Dress,” “Blame Game.” Kanye’s hormones get the best of him as he wastes a truly transcendent beat trying to slide into the DMs of every model that was working in 2010. Kid Cudi’s amateurish voice expertly melds with John Legend’s classically trained vocals as they lament being at the peak of their powers and still calling that same ex back. JS, why is “Christian Dior Denim Flow” the greatest song of all time?\n\nJS: It’s the most inspirational song I can think of named after luxury clothing. But it’s the melody, and the drums programming, and that chorus, and that switch-up in the back half. But I go a different direction than you—this song is better than three-fourths of MBDTF, but it just doesn’t fit the album’s vibe to me. It doesn’t fully capture the tortured-genius energy he wanted to project in this era. And it’s clear Kanye was in part trying to make a cohesive statement rather than just a collection of the best songs to come of the sessions. The tragedy here is that we never got to hear a fully mixed and mastered version of “Christian Dior Denim Flow.” (Again, this is why we needed another, better G.O.O.D. Music compilation. Can we at least get these G.O.O.D Friday tracks on streaming in 2021? How is “Lift Yourself” on Spotify but this song isn’t?!?!)\n\nAlso: Predictably, I love the Pusha verse. But there’s someone on the track who clearly outspits him.\n\nCH: “Christian Dior Denim Flow” is home to two of the best verses spit by best-rapper-alive candidates in 2010. When Kanye tweeted, “Yo man Lloyd Banks prolly the most underrated MC in the game...Man he deserve to be top 5 at least,” it wasn’t hyperbole. At the height of the rap-blog boom, Lloyd Banks had returned with a vengeance. G-Unit’s second-in-command was an unstoppable force with the entire music industry seemingly backing his ascent. The Hunger for More 2 would drop the same day as My Beautiful Dark Twisted Fantasy and provide a gritty foil to Kanye’s baroque sonic banquet. Nevertheless, hearing Banks deliver a truly perfect verse opener like “Ugh, handcraft material, champagne for cereal / Shorty stole my heart, criminal, my lucky charm” is still jaw dropping a decade later. The little puking ad-lib he delivers after he raps, “Ball like a SuperSonic, make the haters vomit (Ugh!)” belongs in the MoMA. Throughout Banks’s all-too-short verse, his voice sounds like it was run through that woodchipper in Fargo and that is the ultimate compliment.\n\nJS: I want nothing more than to listen to a Jadakiss–Lloyd Banks podcast. (Spotify, make it happen.) But who was the other best-rapper-alive candidate in 2010? You can make an argument for Kanye, but I suspect you’re thinking someone else …\n\nCH: Scott Mescudi was the only rapper coming close to matching Banks on “Christian Dior Denim Flow.” By late 2010, Cudi was months removed from everyone in hip-hop thinking he was ingesting liquid cocaine (not a real thing). So how does he approach the haters? Well, he summons the spirit of one of the greatest rappers of all time. “Hey ya, I’m on my André 3000,” he raps toward the conclusion of the song. “I’m all good now, a nigga don’t need no counseling.” Kid Cudi would eventually need counseling, but for a fleeting moment he made us all believe one could be healed through the power of immaculate rapping on Kanye West loosies.\n\n3. “Dark Fantasy” (My Beautiful Dark Twisted Fantasy)\n\nCH: The best Kanye albums generally begin with a thesis statement.\n\n“We weren’t supposed to make it past 25 / Joke’s on you we still alive” —The College Dropout\n\n“Oh, he’ll give us what we need / It may not be what we want” —Yeezus\n\n“Can we get much higher?” —My Beautiful Dark Twisted Fantasy\n\nAfter Nicki Minaj’s cute but unnecessary nursery rhyme, Teyana Taylor and Justin Vernon arrive like oracles to set the stage. It’s a rhetorical question, but it’s also a sign of West picking his shot. One could argue from a craft standpoint that Kanye never reached the heights of My Beautiful Dark Twisted Fantasy again, and it all begins with “Dark Fantasy.”\n\nJS: Back when I used to DJ (I’ve lived many lives, Charles), I’d often break this song out about 10 minutes before close, when everyone was good and drunk and ready to fuck, fight, or cry. I’d loop the instrumental break that comes between the intro and the verse and immediately start blending in one of my true closing songs (the “Killing Me Softly” drums sound pretty good under it). For a beautiful 20 seconds before I’d kick to the next track, the entire club would scream along to “Can we get much higher?” For a fleeting moment, the answer, for me, just like Kanye, was a resounding no.\n\n2. “Gorgeous” (My Beautiful Dark Twisted Fantasy)\n\nCH: In 2010, only Kid Cudi could make singing about celebrity anxiety sound like a Greek tragedy. Over an epic guitar riff, Cudi’s slightly distorted voice wails:\n\nNot for nothing, I’ve foreseen it, I dreamed it\nI can feel it slowly drifting away from me\nNo more chances, if you blow this, you bogus\nI will never ever let you live this down, down, down\n\nIn those four bars, Kanye and his G.O.O.D. Music associates sum up My Beautiful Dark Twisted Fantasy’s entire reason for being. Not only was Kanye’s fame slipping away in 2010, but there was an acute sense that perfecting his next album was the only way he could surmount the very people who would “never ever” let him live his interruption of Swift down. So when Kanye launches into the first verse it’s a clear sink-or-swim moment.\n\nJS: There’s so much to love about “Gorgeous,” from the hook to the beat to Raekwon. But what stands out 10 years later is the elegance of Kanye’s verses, which says a lot considering he fires a bar at Matt Stone and Trey Parker. It’s some of the best pure rapping he’s ever committed to wax, with intricate rhyme patterns and thought-provoking couplets masking his seething fury. Topically, it’s high-minded stuff. We make a lot of how My Beautiful Dark Twisted Fantasy was an attempt to get himself back in the public’s good graces following the Taylor Swift incident. But when you consider the racial component of the backlash he faced, using the second track on the album to explore race, class, and policing is fairly brave. A lot of credit is likely owed to Malik Yusef, Rhymefest, and the other writers that helped him through “Gorgeous,” but the verses are ultimately unmistakably Kanye. And they’re among the best of his career.\n\n1. “Runaway” (My Beautiful Dark Twisted Fantasy)\n\nCH: Without “Runaway,” there’s no My Beautiful Dark Twisted Fantasy. The song exists on multiple poles of existence—sparse and maximalist, tortured and pompous, noxious and rehabilitative. “Runaway” begins with now-iconic piano stabs that echo hauntingly in the ether before they’re confronted by the shamanic voices of Rick James and James Brown. The genesis of “Runaway” was a seemingly thrown-away idea by Emile Haynie. “I had a beat, and I played it, and it was the foundation of ‘Runaway,’” Haynie told Complex in 2011. “It was pretty different from the production now, but something about it, the chord progression or the way I put together the chords must’ve rung out to him.” Kanye was likely drawn to the chance to have an emotional canvas to purge himself of the VMA and Taylor Swift incident that had utterly destroyed his pop career.\n\nJS: Kanye was the asshole, the douchebag, the scumbag. But I remember watching the VMA performance live and rooting for him. It was so pretentious—with the ballerinas, a salmon-suited Pusha T, and Ye’s MPC at the center of it, like a pulpit—but you had to admire the ambition. Watching it today, I still get chills when the beat drops and the Rick James sample echoes. It’s also important that the lyrics—the chorus, in particular—acknowledged his standing at the time. Here he was, one year after the Taylor Swift incident, on the same stage, essentially saying, “Yeah, I know you hate me, but what I’m offering you is so great, I’m going to make you love me again.” You could feel public sentiment bending back toward him in real time.\n\nWe are, of course, at a similar place with Kanye as we were heading into those VMAs. The past four years have been fraught. The quality of his music has declined. He’s palled around with Trump. He publicly wrestled with his mental health. He’s made bone-headed comments about race. He launched a failed presidential bid. These days, the Kanye experience is exhausting. I don’t think there’s a “Runaway” moment that could change that, though I don’t think he’d be capable of providing one even if one could. Still, it’s hard not to put on this song today and recall the time when we were cheering for him to change how we felt about him. That he pulled it off may have been his most impressive feat in a career littered with many.\n\nCH: I totally agree. It’s something Kanye’s frequent collaborator Malik Yusef told us during The Ringer Music Show. “They love what he presents to the world. And I think he was very self-deprecating in saying, ‘I’m an asshole. I’m bad. I’m terrible.’ But people took it tongue-in-cheek because they don’t believe it, because the art says that you’re great,” Yusef said. “I think that when he did ‘Runaway from me baby. I’m trouble.’ And we know what that does. That makes people say, ‘Well let me solve you.’”\n\nThe vocoder outro of “Runaway” is one of the most heart-wrenching moments of the past decade in popular music. It sonically communicates this primal sense of fear—fear of oneself, fear of what your actions have wrought, fear that you’ll never be able to reclaim what you once had. In essence, that’s always been and will always be Kanye’s singular gift and the root of his continuous downfall.\n",
      "Folder": "Feedly",
      "Timestamp": "1606194393",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.277817Z"
}