{
  "id": "fef861b28fc540fea918b6083fa2c3d0",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/2018/9/4/16769988/elections-2018-gerrymandering-redistricting-midterms",
      "Title": "The next decade is on the ballot in 2018 Vox - All",
      "Selection": "It sounds absurd, but Democratic voters might actually be underestimating the significance of the midterm elections.    \n\nBy now, it’s well understood that the outcome will be enormously consequential for the future of Donald Trump’s presidency. But these coming elections are not just a battle to control Congress next year — they’re a battle to control it for the next decade. \n\nWhoever emerges victorious in key November races will have a huge amount of power over the next congressional redistricting — a crucial event in national politics that comes up only once every ten years. Last time around, Republicans dominated the process and walked away with such slanted district maps that they’ve held the House of Representatives easily ever since.\n\n“The next decade is essentially on the ballot in the fall of 2018,” David Daley, an author who wrote a book about the last redistricting, told me. “And if Democrats don’t win key elections this fall that allow them to have seats at the table in 2021, the party could face another decade in the wilderness.”\n\nThe specific reason this year’s contests matter so much is that hundreds of the politicians who will have a say in redistricting in key states — mostly governors and state senators in places like Ohio, Michigan, and Florida — will be elected and locked in to serve four-year terms. That is: they’ll be the people who will redraw the lines in 2021. So the more of these races Democrats win, the better positioned they’ll be to to wipe out the existing, heavily pro-Republican House and state legislature maps in all these states.\n\nFew of these races feature candidates who’ve gained viral fame, and most of them continue to fly under the radar nationally — but they’ll be incredibly consequential. “So many people don’t understand that around 800 legislators elected this year will draw the lines,” says Jessica Post of the Democratic Legislative Campaign Committee.\n\nWe’re currently living amidst the consequences of Democrats losing the redistricting game. Republicans dominated these key elections before the 2010 maps were drawn, and they took full advantage of their triumph. Their triumphs in governor’s races and state legislatures across the country allowed them to lock their newfound House of Representatives majority in place, and build in similar advantages in state legislative maps too. \n\nThese maps have made it extremely difficult for Democrats to win majorities ever since — in the House in 2012, even winning more votes nationwide left the party well in the minority. That could change this year, but only if Democrats win the popular vote not just narrowly but overwhelmingly.\n\nAnd Democrats’ woes are broader than just gerrymandered House maps. Institutional features of the Senate and presidential contests appear to disadvantage them too, posing the risk of an anti-majoritarian political crisis.\n\nReformers held out hope that the Supreme Court would restrict partisan gerrymandering, but justices have so far avoided the issue. So it’s now clear Democrats’ only path toward reversing the GOP’s structural advantage in the House is to win back power in the states, through hundreds of specific races, a large share of which take place this year. \n\nThe good news, in Democrats’ eyes, is that this time around they have a plan — and, if a blue wave does materialize in November, it would go a long way toward helping them execute it.\n\nDemocrats got crushed in redistricting last time\n\nDemocratic operative Kelly Ward had an up-close view of the last redistricting disaster for her party while it was unfolding, back in early 2010, just two years into Barack Obama’s presidency. (Don’t confuse her with Kelli Ward, the Republican who just lost an Arizona Senate primary.) \n\nWard had just taken a job at the DCCC, the party’s committee for House of Representatives campaigns. She says she was brought in because the situation for the party — which then controlled the House — looked so dire that Democrats needed more help.\n\nThe economy was in grim shape, with unemployment near 10 percent, and President Obama and his new health care law were both unpopular. “You had a lot of incumbents getting very scary polling,” Ward recounts. “Some hadn’t been in trouble in 20 years.”\n\nThis terrible political climate came at the worst possible time — not only could Democrats lose big in 2010, but the specific contests up that year meant that loss could doom the party in 2011’s redistricting as well. The problem was that while Democrats were struggling to try and hold onto their majorities in Congress, many lower-profile state legislature races were also on the docket around the country — but getting far less attention and money.\n\n“By that point, everyone’s house was on fire,” recalls Carolyn Fiddler, who then worked at the DLCC, the party’s state seat campaign committee. “Soliciting resources for this long-term, esoteric thing was incredibly difficult. There was a general lack of awareness on the part of progressives about what these downballot races meant for the next 10 years of policies.” \n\nThe wave turned out to be a tsunami. Democrats lost a staggering 63 House seats, tipping control to Republicans. This dashed Obama’s hopes of passing any more sweeping liberal laws the remaining two years of his first term.\n\nIn state elections, though, the news was even worse. “I call the 2010 election the longest night of my life,” Fiddler, who now works for Daily Kos Elections, says. “Knowing what those results meant for the next decade of American politics was incredibly depressing.”\n\nDemocrats lost six governorships on net, and nearly 700 state legislature seats. But their true disaster was in where those losses were concentrated: in swing states like Michigan, Ohio, Pennsylvania, Wisconsin, and Florida, where the GOP gained total political control. These were the states that mattered most for redistricting — and Republicans could now redraw maps there while cutting Democrats out of the process entirely.\n\nThat’s exactly what they did — often through secretive and legally dubious methods, as Daley chronicled in his book, Ratf**ked. In Michigan, a GOP staffer enthusiastically emailed about cramming “ALL of the Dem garbage” into certain districts. In Ohio, Republicans spent months secretly map-drawing in a hotel room they called the “Bunker.” In Florida, the GOP set up a phony public redistricting process for show, and made the real decisions in a “shadow” operation behind the scenes.\n\nAll this paid off spectacularly — aided by gerrymandered maps (and, some analysts argue, the geography of where each party’s voters happen to live), the GOP has held the House easily ever since, even when they won fewer votes in House races nationwide, as in 2012. This killed any hope of more liberal legislation under President Obama, and allowed President Trump’s tax bill to become law. \n\nThe House even helped make President Trump: Aggressive investigations by the Republican majority helped unearth the email scandal that dogged and perhaps doomed Clinton’s presidential campaign. Since then, that same Republican majority has been mostly uninterested in seriously investigating the conflict-of-interest-ridden Trump presidency.\n\nAll in all, Republicans have now controlled the House of Representatives for 20 of the past 24 years. Analysts believe the built-in GOP advantage in the House maps means Democrats need a 6-or 7-point popular vote victory just to narrowly retake the chamber. Simply winning more votes nationwide, as the party did in 2012, doesn’t even get them close. Even beating Republicans by 5 percentage points nationwide could still mean Democrats fall short. \n\nHow to win the game of redistricting\n\n        Kelly Ward, of the National Democratic Redistricting Committee, reviews the state level races that helped Republicans dominate the last redistricting process.\n\n        Christina Animashaun/Vox\n\nLeading Democrats are well aware that the party leadership inexcusably dropped the ball on redistricting last time around. So in October 2016, a group of Democratic leaders — led by former Attorney General Eric Holder — decided to do something about it. \n\nThey announced the launch of a new group called the National Democratic Redistricting Committee — acronymed in Washington’s alphabet soup style as the NDRC.\n\nThe new group would be the frontline organization tasked with preparing, coordinating and strategizing for that next redistricting, giving them a five-year head start. “This unprecedented effort will ensure Democrats have a seat at the table to create fairer maps after 2020,” Holder said at the time.\n\nKelly Ward is now the NDRC’s executive director — making her, essentially, the person in charge of making sure of repeating last time’s devastating result for the party doesn’t happen again.\n\n“The 2018 map is a perfect storm in all the right places. The races are in the most important states,” Ward said. When we met several months ago, she laid out Democrats’ plan to avoid to repeating the mistakes of the past.\n\n“We came in knowing that we needed to develop a comprehensive plan,” she said.\n\nThere are four basic elements.\n\n1. Get the courts to rule that the maps are unfair\n\nThe first prong of the strategy, and one that could produce immediate results, is litigation — that is, suing over maps the party believed to be rigged against Democrats, to try and get them struck down by judges.\n\nProgressive or reformist groups like the NAACP and League of Women Voters have been filing such lawsuits for many years, often citing racial discrimination. Recently, though, suits have been filed challenging partisan gerrymandering too — and have resulted in some surprising successes.\n\nFor example, in Pennsylvania this year, the state Supreme Court threw out one of the most blatant partisan gerrymanders in the country on these grounds, and instituted a new map that hugely improved Democrats’ chances to pick up House seats there. And a court recently ruled North Carolina’s map is unconstitutional, too, though the maps may not be redrawn for this year’s elections.\n\nYet the prospects for national litigation darkened considerably in June, with the one-two punch of a Supreme Court punt on a major partisan gerrymandering case, followed by the retirement of the swing vote on the issue, Justice Anthony Kennedy. His replacement, Brett Kavanaugh, will likely join his conservative colleagues in refusing to limit partisan gerrymandering.\n\n2. Reform the process, state by state\n\nThe second plank of the NDRC’s strategy, then, is trying to rewrite the rules for redistricting itself in various states.\n\nIn places where the legislature itself seems too hopelessly gerrymandered for Democrats to have a prayer of taking control before 2021, the NDRC thinks a total overhaul of the process is the best way to improve the party’s odds.\n\nThe group’s preferred reform is to take redistricting out of the partisan legislature’s hands altogether and give the job to an independent commission. A handful of states, like California and Arizona, have already gone this route. \n\nNaturally, though, existing GOP state legislative majorities tend to want to hold on to their control of redistricting. So Democrats and nonpartisan reformers have often tried to go around them by asking for the voters to approve reform, through a statewide referendum. “You can’t get other types of reform through these legislators,” Ward said.\n\nThere are a few redistricting ballot initiatives up for a vote this November, but by far the most nationally important is Michigan. Both the US House map and state legislature maps there are badly gerrymandered in the GOP’s favor. Now, the proposal going before Michigan’s voters would set up an independent commission of 13 ordinary citizens (four Republicans, four Democrats, and five independents) chosen at random from applicants — a massive change from a process dominated by politicians.\n\nBut there’s a danger to the commission strategy. Back in 2015, four conservative Supreme Court justices voted to strike down Arizona’s independent redistricting body, saying the US Constitution guaranteed state legislatures must be involved in redistricting (rather than being cut out through a ballot initiative reform). The Court’s five-justice majority upheld the independent redistricting body, but only with the vote of Justice Kennedy, who has since retired. A more conservative majority could conceivably strike down redistricting commissions nationwide.\n\n3. Get the tools needed to do redistricting right\n\nThird in the NDRC’s strategy, Ward says, is the preparation for the nitty-gritty work of the redistricting itself.\n\nBasically, Democrats want their party to have the best mapping software, to do their best to make sure the Census doesn’t go off the rails, and to make sure advocates are informed and active enough to make their voices heard when the maps are being debated. These, Ward says, are the “building blocks” to succeeding in redistricting. This work has begun behind the scenes, but much of it still lies ahead, in hopes of a 2021 payoff.\n\n4. Win the key elections\n\nFinally the fourth part of the NDRC’s plan — and perhaps most consequential — is Democrats have to actually win. \n\n“We’re looking at the map through a redistricting lens and being very intentional about where we need to get Democrats elected in order to check Republican power,” Ward said. \n\nSpecifically, these key elections are for the members of the state house, state senate, and (usually) governors in the 37 states where politicians redraw the congressional maps.\n\nAll in all, about 1,500 state senators and 4,400 state House members get to vote on new maps. Thirty-five of these states also elect governors who can veto a map. Broadly speaking, it is these races that are the electoral battlegrounds for redistricting. \n\nBut not all states are created equal. Redistricting is most nationally consequential in states that have two features: they’re populous and they’re politically divided. More populous states are more important for the House balance of power, since they have more representatives. Meanwhile, swing states matter most because it’s possible, with a creative gerrymander, to turn a 50-50 state to one that sends a 75-25 delegation in Congress. \n\nLast year, the Brennan Center released a report assessing just where the GOP’s advantage in House maps was concentrated, and they found it derived mostly from seven states: Michigan, North Carolina, Pennsylvania (before the state supreme court struck down the map), Florida, Ohio, Texas, and Virginia. Some other analysts have added Wisconsin. \n\nJackpot, shutout, or something in between?\n\nStates like these are the crucial ones Democrats need to win — or at least not get shut out in. And depending on how the various races play out, there are several possible outcomes in each.\n\nThe jackpot: If one party ends up in control of the state House, the state Senate and the governorship at redistricting time, they’ve hit the jackpot. This is called the “trifecta,” and if a party gets it at the right time, they can draw maps without needing to give their rivals any say. (Another way to effectively hit the jackpot is by just winning a veto-proof majority in both state legislative chambers.)\n\nLast time around, Republicans won oh-so-many jackpots. They came out of the 2010 midterms with trifectas in nearly every big swing state — Florida, Ohio, Pennsylvania, Michigan, and (after 2011) Virginia. In North Carolina, the GOP effectively had a jackpot too, since they controlled the legislature, and that state is one of the few that gives its governor no role in redistricting.\n\nThe shutout: Conversely, the worst-case scenario for a party is to be on the opposite end of a trifecta — winning neither the governorship, state House, or state Senate. \n\nThis is what happened to Democrats in so many key states after the 2010 midterms, letting Republicans gerrymander them to their hearts’ content.\n\nSplit partisan control: Finally, there’s the potential for a partisan split among the three key bodies. The key thing to keep in mind here is that, in most of these states, the new map needs to pass both chambers of the legislature, and be signed by the governor, to become law. You need all three, or else there’s no deal, and the courts impose a map.\n\nSo if a party wins even one of those three — the governorship, state House, or state Senate — they’ll avoid the disaster of a shutout, and guarantee themselves a seat at the table (or at least effective veto power) for redistricting.  \n\nThis is particularly important in states where Republicans held the trifecta last time, and wound up aggressively gerrymandering. If Democrats can manage to win even one of the three key bodies in these states this time, they’d be able to force dramatic changes in the existing maps. \n\nThat’s why Virginia’s elections last year were more important than you might think. The state Assembly and state Senate remain in GOP hands, but Democrat Ralph Northam won the governorship. His four-year term means he’ll be in office through 2021, and likely to veto any congressional map that seems skewed against his party — including the current one, drawn by a Republican trifecta. “That was the first victory,” says Ward.\n\nWhy 2018 is so important for the 2021 redistricting\n\nThe electoral battle for redistricting dominance isn’t a one-off contest. It’s a multi-year slog of trench warfare that began in Virginia last year, and will spread to many other states this fall, and last for two more years after that.\n\nYet 2018 matters so much because, even though redistricting is still years off, many of the specific people elected this fall will actually draw the lines in the states that matter most.\n\nThese are governors and state senators, who mostly tend to serve four-year terms. Twenty-six governors and nearly 500 state senators with a role in redistricting will be on the ballot in 2018, elected to four-year terms, and “locked in” past 2021. (The rest — mostly state house members, and the rest of the state senators — will mostly be on the ballot in 2020.)\n\nThe most important of these lock-in 2018 races are:\n\nThe governorships of Florida, Pennsylvania, Ohio, Michigan, Wisconsin, Texas, and Georgia\n\nThe entire state Senate in Michigan\n\nHalf the state Senates in Florida, Pennsylvania, Ohio, Wisconsin, and Texas\n\nNeither party will get another bite at the apple for these races before redistricting. \n\nThe governors: Democrats’ best shot\n\nDemocrats’ realistic best-case scenario to get a seat at the table in any GOP-dominated state may be winning just one race: the governorship. “If Democrats win one statewide race in what looks like it could be a wave year, they can assure themselves at least of veto power” in 2021, Daley says. (After all, the governor’s race is a statewide contest, meaning Democrats don’t have to deal with gerrymandered borders.)\n\nIn Daley’s view, “The most important elections for Democrats this November would be the governorships of Pennsylvania, Ohio, Wisconsin, Michigan, and Florida.”\n\nThese are states that should be swing states, but in which Republicans have gerrymandered state legislature maps too, making it extraordinarily difficult for Democrats to win state House or state Senate majorities. \n\nCurrently, Democrats look competitive in all five of these contests. \n\nThey already hold Pennsylvania, where Gov. Tom Wolf is running for reelection. He’s currently holding a 15-point lead over his opponent, Scott Wagner, in polling averages.\n\nIn Florida’s open seat contest, Andrew Gillum, a progressive who hopes to be the state’s first black governor, is facing off against Trump-backed Ron DeSantis.  \n\nIn Ohio’s open seat contest, former consumer protection bureau director Richard Cordray is Democrats’ nominee. He appears to be in a tight race against former Ohio Attorney General Mike DeWine.\n\nFormer state Senate leader Gretchen Whitmer recently clinched the nomination in Michigan, and polls have shown her ahead of GOP nominee Bill Schuette.\n\nFinally, Democrats are at last seeing an opening against Gov. Scott Walker in Wisconsin, whose poll numbers are low as the state’s Superintendent of Public Instruction Tony Evers attempts to finally defeat him. \n\nWinning the governorship in any of these states would guarantee Democrats a seat at the table in redistricting. (You can also arguably add the Georgia and Texas governor’s races to this list, though they are redder states. Stacey Abrams has energized Democrats in Georgia, but in Texas, few give Democratic nominee Lupe Valdez good odds against incumbent Republican Greg Abbott.)\n\nThe next best thing: flipping key state senates\n\nNext in importance are those hundreds of lock-in state senators — many of whom will be elected in districts that are themselves gerrymandered. \n\nWith so much seeming anti-Trump energy, and many Democrats newly motivated to run for office, the party smells opportunity even in downballot races —  a rare opportunity to overcome a structural disadvantage with the help of a hoped-for blue wave.\n\nThe entire Michigan state senate is on the ballot for four-year terms — Republicans currently hold a 27-11 advantage there, but most of their caucus is prevented from running again due to term limits, so Democrats are optimistic about making a strong showing.\n\nThe GOP is up 18-15 in Wisconsin’s state senate, 23-16 in Florida’s, 34-16 in Pennsylvania’s, and 24-9 in Ohio’s. Half the seats in each chamber are up in 2018 (with the rest in 2020). Democrats’ chances for an outright takeover look best in Wisconsin and Florida. \n\nMoving to the redder states, Georgia’s entire state legislature has two year terms so there are no lock-in races. But half of the Republican-dominated Texas state senate is up in 2018.\n\nLast but not least: Make other gains in state legislatures \n\nFinally, there are hundreds of other state legislature races that will be on the ballot in 2018, but for two-year terms — meaning they’ll face election again before redistricting. These aren’t lock-in races, but Democrats are hoping to make as much progress as they can here, so their candidates can gain the benefits of incumbency and send longtime formidable Republican incumbents off into retirement. \n\nFor an example, take the Virginia House of Delegates. All its seats were on the ballot in 2017, and Democrats fell agonizingly short of a takeover, ending with 49 seats to Republicans’ 51 (with one tied race determined by drawing a name from a bowl). But all those seats will be up for election again in 2019. And the massive 15-seat gain Democrats already made means a takeover is much closer to their reach next time around, in part because since so many longtime GOP incumbents are already out of the way. \n\n“I’m the most pessimistic one in our office, because I’ve been burned so many times,” Ward says. “Who knows if some of these chambers are possible under the current environment? But we have a few years.”\n\n        Kelly Ward and José Morales Jr., community engagement and projects director at the National Democratic Redistricting Committee\n\n        Christina Animashaun/Vox\n\nA crisis of democracy?\n\nBack in 2010, the main Republican group focused on winning the redistricting game — “REDMAP” — was perfectly clear about what it wanted: partisan advantage. REDMAP’s website bragged that the party could “create 20-25 new Republican Congressional Districts through the redistricting process.” Their goal was to draw lines that would help their party win. \n\nIn one sense, the efforts of the NDRC and Democrats are a similar partisan project. But when you talk to people involved, they express more high-minded motivations. After years of struggling with what they feel are unfair rules, what they want, they say, is for things to be fair.\n\n“Our goal is fair maps that reflect the will of the people,” Ward says. “We don’t want the outcome in 2022 to be a bunch of gerrymandered Democratic maps that break democracy in our favor.” \n\nRepublicans, of course, could be forgiven for some skepticism on their sincerity. Democrats have often eagerly gerrymandered where they have happened to hold power, like in Maryland in 2010. And it’s not idealists who would truly be in charge of redrawing the lines should Democrats regain power in these states, but self-interested politicians. We will have to wait and see how that turns out.\n\nYet this issue of “fairness” in the United States electoral system now goes broader than just House district maps. \n\nDonald Trump lost the popular vote to Hillary Clinton by 2 percentage points — getting nearly 3 million votes fewer than she got — and is only president because of our bizarre Electoral College system. That’s not an aberration; this was was the second time in the past five presidential elections that the Republican candidate won despite getting fewer votes than the Democrat.\n\nSimilarly, the Senate systematically advantages smaller, whiter, more rural states — 60 senators represent states Trump won. If our politics become more racially polarized, or split more along a rural/urban divide, the Senate could soon become an institution systematically slanted in Republicans’ favor.\n\nThis bias in presidential and Senate contests can wind up creating an imbalance on the Supreme Court — an institution that one would think might offer checks on the other two. Trump, a president who was elected with fewer votes than his opponent, has already gotten to appoint two justices, confirmed by a narrow Republican Senate majority (which refused to even hold a vote on Barack Obama’s nominee Merrick Garland in 2016).\n\nAnd then there’s the House. It was designed to be the most majoritarian body in the federal government — in contrast to the stuffy Senate and the elector-chosen president, it was supposed to have “an immediate dependence on, and an intimate sympathy with, the people,” as Federalist Paper Number 52 reads. But now, deliberate gerrymandering has given Democrats a structural disadvantage there, too.\n\nTrends can be ephemeral, and political coalitions can change unpredictably. Yet if every electoral institution of the federal government of the United States of America has indeed developed to consistently disadvantage the Democratic Party from winning power even when it wins more votes, that’s an enormous problem — a problem that could one day become a crisis .\n\nThis next redistricting battle — starting in November, as Democrats try to win the races that will let them redraw the next decade’s maps — might provide a path toward staving off that crisis. To do that, though, the party has to win.\n",
      "Folder": "Feedly",
      "Timestamp": "1536126500",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.478003Z"
}