{
  "id": "fefbfadcf0ef4b24a9d047ae4631ef5f",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://food52.com/blog/18448-the-genius-fix-for-broken-gravy-and-bland-anything",
      "Title": "The Genius Fix for Broken Gravy and Bland Anything Food52",
      "Selection": "You never have to worry about broken gravy again. Or lumpy gravy or wan, watery gravy. Frankly, you don’t have to worry about serving any bland, textureless, or colorless meal ever again, either. Because at virtually all times, Cal Peternell’s 4-ingredient marvel sauce will be within reach.\n\nUnlike other herby sauces you’ve known—pestos and pistous and anchovy-leaning salsa verdes—this one trades in a few of its auxiliary ingredients for one clever, clarifying step.\n\nPeternell takes the rougher of winter herbs—prickly rosemary and furry-skinned sage, who aren’t usually at home in a raw sauce—and fries them crisp. As he explains, “Frying herb leaves before mixing them in allows them to be their whole spiky selves, adding a polite thorniness, giving sweet parsley a kind, crunchy kick.”\n\nHis manner of doing so has all sorts of advantages over what you might think when you’re told: “fry”—in his way, you’ll pour only a shallow pool of oil 3/4-inch deep, rather than a whole pot. You won’t need to rig a thermometer, and you can just use your regular olive oil if you like. And it will all happen fast, engaging all senses as the oil burbles and blooms, the leaves buckle, and your house starts to smell like you’ve just rotisseried a Christmas tree.\n\n“Frying herb leaves before mixing them in allows them to be their whole spiky selves, adding a polite thorniness, giving sweet parsley a kind, crunchy kick.”\n—Cal Peternell\n\nThis move is a great trick for adding crunch, intrigue, and a gentle woodsy perfume to fresh pastas and roast meats and you-name-its (and will make you look quite fancy in the process), but here you’ll crumble the leaves straight into a slurry of chopped parsley, garlic, and more olive oil.\n\nNot only do you likely already have all these ingredients laying around, but you probably needed to use that half-bunch of rosemary or wilting sage up quick. They’ll live a longer life this way, adding electric color and crunch beyond their prime to whatever you might want to spoon the sauce over.\n\nThe uses and variations are almost literally endless. Grilled steaks, pots of beans, bowls of ricotta, fistfuls of bread. “The day after Thanksgiving,\" Peternell wrote to me, \"I like to poach an egg, set it in a hot spoonful of leftover buttercup squash, and eat it with fried herb salsa. If last night's fog is still hanging dark, I might stir something spicy, crushed chilis or harissa, into the salsa to brighten things up.”\n\nAnd of course the turkey’s a good candidate, whether the gravy makes it to the table or not.\n\nCal Peternell’s Fried Herb Salsa\n\nGenius Recipes\n\nMakes 1 cup\n\nFried Herb Salsa\n\n1\n\ngarlic clove, pounded to a paste with a pinch of salt\n\n1//3\n\ncups finely chopped parsley\n\n1/3\n\ncup good olive oil\n\n1/3\n\ncup crumbled fried herbs (recipe follows)\n\nFried Herbs\n\nCooking oil, vegetable or olive\n\nLeaves from 1 bunch rosemary, sage, or savory (or a mixture), patted dry if necessary to avoid spits and splatters\n\nSalt\n\nPhotos by Bobbi Lin\n\nGot a genius recipe to share—from a classic cookbook, an online source, or anywhere, really? Please send it my way (and tell me what's so smart about it) at [email protected]—thank you to our Books Editor and Stylist Ali Slagle for this one.\n\nTags:\nsalsa verde, green sauce\n\n💬 View Comments () Share this Article Tweet this Article\n",
      "Folder": "Feedly",
      "Timestamp": "1479344085",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.753381Z"
}