{
  "id": "ffaf2285b70242569fdba1d685d256e0",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://www.vox.com/the-goods/2019/6/3/18647626/instagram-virtual-influencers-lil-miquela-ai-startups",
      "Title": "Lil Miquela and the virtual influencer hype, explained Vox - All",
      "Selection": "There’s no way that hot cartoons are actually the future of fashion advertising. Unless there’s already too much money involved to stop them.\n \nEvery story about a virtual influencer starts the same way: She is beautiful. She has a ton of followers. She is mysterious, yet her personality is fantastic. She loves Calvin Klein. Also — she’s not real! She was made by a computer to look as much like a hot and charming human being as possible without scaring people. Her body casts a shadow. She has flyaways and freckles. \n\nThe most famous example of the virtual influencer is Lil Miquela, who debuted on Instagram in April 2016, as if from nowhere. Of course, no arguably useless technological innovation actually comes from nowhere, and she was no exception. After months of speculation in Instagram comments and on news sites — with theories ranging from “Sims marketing stunt” to “horrifying social experiment” — the secret was revealed and was shockingly mundane: Yeah, it’s advertising. \n\nIn January, TechCrunch reported that Lil Miquela’s creators had closed a $125 million investment round led by Spark Capital. Suddenly, virtual influencers were the future of ads. The future of fashion. The future of commerce. \n\nAre these lithe, high-resolution bodies really coming for the jobs held by models and scene kids for the last several decades?\n\nBut are these lithe, high-resolution bodies really coming for the jobs held by models and scene kids for the last several decades? There is little evidence so far that this is the case, beyond a handful of successful Instagram accounts and a lot of conversation. The way funding is heaped onto every startup that gets 15 minutes of attention from the press typically makes the success of bizarro-world innovations feel inevitable and unavoidable — the most barbed response we can summon the energy for is to drag out that same tired Jurassic Park meme about the hubris of making shit for no reason. (And if this isn’t going to happen, why are people lining up to throw millions of dollars at it? We forget they are gambling.) \n\nThe virtual influencer could be a novelty technology, destined to flash in the pan like “hoverboards” or movie theaters equipped to spray people with “rain” in the middle of Batman movies. Like the blockchain! Or you know, it could take all of the hot people’s jobs. \n\nThere aren’t really that many virtual influencers — yet. \n\nFirst, the cast of characters. Lil Miquela, the effortlessly hip forever-19-year-old with 1.5 million followers, also has two friends: Blawko, a boy and self-described “young robot sex symbol” whose mouth is constantly covered with designer pollution masks and who has a paltry 135,000 followers; and Bermuda, his ex-girlfriend and Lil Miquela’s blonde, Trump-voting foil, whose bio boasts that she is a “Robot/Unbothered mogul with daddy’s PIN and a flawless highlight.” All three were created by the team at the mysterious Los Angeles startup Brud for vague reasons. \n\nLil Miquela, the effortlessly hip forever-19-year-old, has 1.5 million followers.\n\nJenna Sauers, writing for Cultured in April, paid special attention to the strange myth-building Brud has done around its creations and its founders, some of which has included outright lies. Brud calls itself “a technology startup specializing in artificial intelligence and robotics,” she points out, and news outlets from Architectural Digest to CNN are simply parroting this verbatim. But “Brud holds no patents in AI, robotics, or related fields,” and Lil Miquela is little more than a well-crafted image. The piece walks through other exaggerations: co-founder Sara DeCou’s one-time claim to be President Obama’s “special adviser on the ethics of AI development, and the other co-founder Terver McFedries’s claim to have written a bill of rights for AIs.”\n\nThe team has argued here and there that Lil Miquela’s support of Black Lives Matter, reproductive rights, and LGBTQ+ causes can inspire real change. Last year, The Cut’s Emilia Petrarca wrote about Brud’s statement that it hoped to be the modern Will & Grace, saying “As with all things Brud, it’s hard to tell if they’re trolling us with this reference or if they’ve been sipping too much of the Silicon Valley Kool-Aid.”\n\n View this post on Instagram\n\n If I don't have tacos at least once a week, I glitch. Had to dodge rain drops and B doing a Naruto run into a lamp post for these. What's your go-to? Veggie? Al pastor? Anyone a casual tortilla con mantequilla kinda kid?\n \nA post shared by  *~ MIQUELA ~* (@lilmiquela) on Mar 6, 2019 at 5:06pm PST\n\nLess vague, Balmain creative director Olivier Rousteing’s #BalmainArmy of virtual models. The first, Shudu, was designed by British photographer Cameron-James Wilson in early 2018. She racked up followers after the managers of the Instagram for Rihanna’s Fenty Beauty line apparently mistook her for a real customer and briefly reposted a photo of her “trying out” the brand’s matte lipstick. Shudu’s bio declares her “the world’s first digital supermodel,” and she is much taller and more classically beautiful than Lil Miquela. In 2018, Rousteing hired Wilson to make two more digital supermodels, exclusively for Balmain. He came up with Xhi — a gorgeous Chinese woman modeled after David Bowie — and Margot — a gorgeous French woman modeled after Rousteing’s childhood fantasies about French women. Neither Xhi nor Margot have their own Instagram accounts, and they exist solely for Balmain ads.\n\nMy personal favorite is Lu, the very strange virtual influencer who appears in ads for Brazil’s Bed Bath & Beyond-equivalent Magazine Luiza. She listens to Lana Del Rey while she jogs. When I first learned this about her, I was moved enough to write about it for Racked, asking “While she is deliberately dragging down her own morning jog vibe with music about the disposability of the female body, the danger of icons, and the inherent violence of American popular culture, is Lu also subtly ribbing Lil Miquela, all of her ilk, and me?” \n\nConversations about diversity and representation in the fashion industry were already at a fever pitch. An influx of avatars makes it even more complicated.\n\nThis brings us to the controversy of virtual influencers. They are physically perfect women made of pixels, standing in for women who have long been pressured to become physically perfect, without the advantage of that even being possible. Lil Miquela herself acknowledged this, sort of, when she asked YouTube conspiracy theorist Shane Dawson, in response to a question about the manipulation of her image, “Can you name one person on Instagram who doesn’t edit their photos?” The women of the fashion industry and particularly of Instagram are already pushed to Photoshop themselves, or to real-life-Photoshop themselves, which is to say “get cosmetic surgery.” \n\nIsn’t it interesting the way we can talk out both sides of our mouths, simultaneously espousing a new age of body positivity and self-acceptance, while also making it clear that supermodels are incapable of reaching beauty standards set by things that are not even alive? \n\n View this post on Instagram\n\n Shudu @thesavoylondon trying on beautiful #EEBAFTAs outfits, complete with @atelierswarovski earrings. 6 days to go till she shares #redcarpet looks with you all. . @ee @BAFTA . . #3D #3Dart #digitalsupermodel #worldsfirstdigitalsupermodel #virtualinfluencer #BTS\n \nA post shared by  Shudu (@shudu.gram) on Feb 4, 2019 at 11:07am PST\n\nTo add insult to injury, this collection of virtual influencers is far more diverse than the roster of brand ambassadors and runway models that major fashion brands have employed for most of their existence. This May, Calvin Klein rolled out its #MYTRUTH campaign, which featured actual famous people like Troye Sivan, Billie Eilish, and the brand’s favorite permalancer A$AP Rocky. It also involved a video in which supermodel Bella Hadid made out with Lil Miquela. In her Calvins! This was a disaster, with critics immediately pointing out the double whammy: In the first place, it was queer-baiting, presenting two women kissing as exotic and bizarre. But also, could they not even cast an actual gay person? There are limits to the usefulness of “representation,” seen here when a job that could have gone to an underrepresented group went instead to a collection of pixels with no personal political context at all. \n\nThere are limits to the usefulness of “representation” — e.g. when you replace real people with avatars.\n\nIn an email newsletter, the writer Rob Horning compared this to Time’s infamous 1993 cover for its “New Face of America” immigration issue, which showed a surreally smooth, smiling face — a computer-generated projection of what future “deracialized” generations of America might look like. Lil Miquela, he argues, is “a figure from an idealized future where human difference is resolved not through political struggle but through process of automated averaging and morphing. ... a visual expression of an algorithmic sublime.” \n\nSimilar criticism was levied at Shudu, a black woman avatar designed by a white man. Writing for the New Yorker, Lauren Michele Jackson says the character reminds her of black minstrelsy and dryly quotes the creator saying that his biggest influence was “a special-edition Princess of South Africa Barbie doll.” \n\nAlso ... these things are just plain scary? \n\nThe term “uncanny valley” was coined by the Japanese roboticist Masahiro Mori in 1970. It refers to the feeling of discomfort we experience when something is close enough to human-looking or seeming to trick our brains into approaching it that way — but we can’t be fooled fully. We always find what’s wrong. \n\nLil Miquela speaks as if she is a person with feelings. In a cover story for High Snobiety last April, she’s quoted at length. Discussing her critics, she tells a reporter via email, “I think people feel a little vulnerable in general right now. They have a lot of frustration and need something to target it at, usually it’s something that they don’t understand. So, I try not to let it get to me too much, because it’s a symptom of people trying to digest all of the change happening every day.” \n\nThis is not so different really than other types of first-person speech on the part of brands — Sunny-D threatening to kill itself, HBO texting its boss (?) — because despite what her copywriters would tell you, Lil Miquela is not actually a robot. None of this is artificial intelligence. It’s just computer motion graphics and captions written with, one can only guess, a meticulous company style guide. \n\nWow - ⁦@lilmiquela⁩ billboard in Times Square pic.twitter.com/QPaIRu8ApV\n— adam bain (@adambain) August 18, 2018\n\nAs Business of Fashion’s Christopher Morency pointed out in February 2018, virtual celebrities aren’t exactly new either. We are more than two decades out from the founding of virtual band Gorillaz, and 13 years past their first Grammy win. The Japanese virtual pop star Hatsune Miku has been on multiple arena tours and was dressed in 2013 by Marc Jacobs. Louis Vuitton hired a Final Fantasy character for a 2016 ad campaign. Lil Miquela is more technically complicated than these characters, but not by much. \n\nThe Verge’s Julia Alexander explained in January that, while Lil Miquela herself does not involve any AI or robotics, she might motivate the creation of a virtual influencer who could: \n\nHer success has inspired venture capitalists like Betaworks to invest heavily in virtual creators and work with startups to progress the technology forward. The future of influencers, according to the general director of Betaworks’ startup boot camp, Danika Laszuk, is digital beings who actually are powered by AI. Betaworks’ next startup camp will focus on what Laszuk calls “synthetic media” — a combination of computer-generated imagery and AI capabilities. The company plans to make a series of $200,000 investments in 10 startups that want to build technology that can create better digital influencers. \n\nAlexander goes on to paint a picture of a future in which virtual influencers need no human assistance at all once they’re published, and quotes Edward Saatchi, the co-founder of “virtual beings” company Fable Studio, who promises to make influencers who can move between platforms. They’d be, basically, sentient avatars dancing between YouTube, TikTok, Instagram, and so on, using machine learning to talk and evolve. \n\nWhether digital influencers catch on or not, the fashion industry is about to spend a ton of money on them\n\nThe biggest selling point of virtual influencers if you work in advertising or fashion isn’t the perfection of an avatar’s body or face but the predictability of its behavior. \n\n“You remove some of the PR risks from influencers who may do something that could impact [your] base of customers,” Andrew Dunst, a vice president at the marketing and software conglomerate Sage Group told WWD last July. “Everything this virtual influencer does is in a controlled setting by the people who are managing that account.” It’s a funny argument. The biggest public relations risks for brands have never been the paycheck-dependent influencers or rigorously trained celebrities who stand at the front of their ad campaigns — it’s always been the tone deafness or general idiocy of the people behind the campaigns, the immoral or poorly executed business decisions made the people in charge, or the simple undesirability of whatever they’re selling. \n\n View this post on Instagram\n\n Fell asleep reading lol Anyone else get sleepy when it’s warm out? Summer is finally here! 雑誌見ながら、寝落ちしてた… 暖かくなると、心地よくなって眠くならない？ 大好きな夏が到来!!! #TheElderStatesman #あいあむバーチャル\n \nA post shared by  Liam Nikuro (@liam_nikuro) on May 24, 2019 at 2:08am PDT\n\nNevertheless, in April, the “virtual human planning and production” company 1sec — one of the first of the post-Lil Miquela boom — unveiled its first virtual influencer, a Japanese-American boy born in Los Angeles. Named Liam Nikuro, he’s an “all-CG head made with the use of 3-D tools on a body filmed in live action,” and he will find work in music, fashion, and entertainment as a “multimedia producer,” according to his creators. This will involve “innovative creative content in combination with AI technology,” although what exactly that might mean goes unexplained. Liam loves 2Pac and Justin Bieber, he says; Juniper Research estimates that the global fashion industry will invest $3.6 billion in artificial intelligence technology this year.\n\n“The boundary between science fiction and social reality is an optical illusion,” Donna Haraway wrote in her famous 1985 essay “A Cyborg Manifesto.” She was talking about possible futures for feminism and ways to use technology to make bodies more livable — as well as society more ethically coherent while more emotionally and intellectually ambivalent — and she was not at all talking about the question of Lil Miquela. This was decades before commercial social media!\n\nStill, it’s striking how well her somewhat trollish predictions have held up. We are spending so much time riddling out whether we can trust robots to represent us or sell us underpants, whether these images are robots at all, whether the people behind them can be trusted, whether any of it matters. At this point, if it’s what we’re talking about, it’s kind of what we’re doing. \n\nSign up for The Goods newsletter. Twice a week, we’ll send you the best Goods stories exploring what we buy, why we buy it, and why it matters.",
      "Folder": "Feedly",
      "Timestamp": "1559603435",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.400106Z"
}