{
  "id": "ffcd8ae32b484f4dbda16ddc7cb4d94b",
  "type": "backlog",
  "source": "instapaper_csv",
  "payload": {
    "row": {
      "URL": "https://qz.com/998558/japanese-students-are-learning-how-to-write-characters-from-a-poop-shaped-teacher/",
      "Title": "Japanese students are learning how to write characters from a poop-shaped teacher Quartz",
      "Selection": "There’s a new way to make learning Chinese characters fun for Japanese kids—just add poop.\n\nThe series “Unko kanji drills”—”unko” meaning poop, and “kanji” the word for the Chinese characters used in Japanese writing—has sold almost two million copies since it hit the market in March. The six books in the series each feature a teacher with an emoji-like poop as a head, Unko-sensei, or Mr. Poop, who guides the children in how to write 1,000 characters through 3,018 poop-infused exercises.\n\nThe books (link in Japanese) were created by Shuji Yamamoto, a former Lehman Brothers employee who had already been dabbling in writing and publishing on the side while he was at the bank. He initially founded his own publishing house after he quit Lehman shortly before the bank went under, and mostly published self-help books, including best-sellers. He became interested (link in Japanese) in educational books, but felt that existing teaching materials were too boring—so he teamed up with Yasaku Furuya, a writer of poop-themed senryu, or haiku-like short poems usually about whimsical topics, for his project.\n\nJapanese students are expected to learn 1,000 kanji by the time they leave elementary school. Learning kanji is generally a rote-based drag, and in Japanese the process is complicated by the fact that one character can have multiple pronunciations. As kanji characters were brought over from China, each character has a pronunciation that comes from the original Chinese, known as onyomi, and a Japanese pronunciation, known as kunyomi. For example the character for eat, 食, is pronounced “shoku” in its onyomi form, and “tabe” in its kunyomi form.\n\nIn a drill where Mr. Poop teaches children how to write the character for “wind,” a small drawing shows blobs of poop blowing in the wind, alongside sentences that say, “I held poop and walked through the north wind” and, “A ghastly number of poop is being blown in by the typhoon.”\n\n【風】（小学2年生）1.うんこをがまんして北風の中を歩いた。2.風車を持ってうんこをしているおじいちゃん。3.台風でものすごい数のうんこがとんできた。#うんこ漢字 #うんこ漢字ドリル http://pic.twitter.com/jGTbSbfBF6\n\n— うんこ漢字ドリル (@unkokanji) June 4, 2017\n\nAll six books in the series are currently among the top 20 bestsellers (link in Japanese) on Amazon’s Japanese site. One reviewer wrote, “I gave this book as a gift to my best friend’s son, who dislikes kanji so much it makes him cry. He seems to be starting to do it… It’s great!”\n\nJapanese parents have been sharing photos of their children proudly holding their poop books on social media:\n\n 我が家にうんこ漢字ドリルがやってきた！ネットで購入です。くだらないけど、嫌いじゃない!(^^)!あさひ！結果を出してくれ！#うんこ漢字ドリル\n\nA post shared by yoshihiro Ito (@arigatou.6.2.y.i) on Jun 4, 2017 at 5:11am PDT\n\nIn an interview (link in Japanese) with the Nikkei newspaper, Furuya, the writer of poop poetry, said he believes the word “unko” is beloved by children, but saying it could get them in trouble with teachers and parents. These books give them liberal license to use the word as much as they want. “In other words, I want children to feel liberated when it comes to poop,” he said.",
      "Folder": "Feedly",
      "Timestamp": "1496732353",
      "Tags": "[]"
    },
    "source_path": "data/backlog/source_drops/Instapaper-Export-2025-03-26_20_23_56.csv"
  },
  "origin_manifest_id": "497cd2c549404409861b3a1098bd5186",
  "created_at": "2025-11-28T05:10:23.664998Z"
}